{
    "relation": [
        [
            "Property Type",
            "Apartments",
            "Apartments"
        ],
        [
            "Bedrooms",
            "2bhk",
            "3bhk"
        ],
        [
            "Area",
            "1136 sq.ft",
            "1420-2651 sq.ft"
        ],
        [
            "Price",
            "43.16L",
            "53.96L - 1Cr"
        ]
    ],
    "pageTitle": "Ongoing Residential Projects in Jaipur | Search Ongoing Properties/Apartments/Flats/Houses/Villas/Plots for Sale in Jaipur",
    "title": "",
    "url": "https://www.commonfloor.com/ongoing-projects-in-Jaipur",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909706879,
    "recordOffset": 909629391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78957=The story of Ashiana is a saga of unabated growth and path breaking steps. Since 1986, Ashiana has built and delivered over 80 Lac sq. ft. of residential and commercial space in Bihar, Jharkhand, Haryana, Uttar Pradesh, Rajasthan and Delhi NCR. More importantly, we have moved 2500 families to our facilities and have established ourselves as a company that provides quality of construction, safety of investment and integrity of commitment., 336606=Expected completion is around Jun 2017, 284324=Dhanuka Group was established in the month of December 2002 through its first and flagship company Dhanuka Coloniser & Builders Pvt. Ltd. and through the years the company has remained the flag bearer of the group. Maiden project of the company was \"Sunshine Residency\", a complete residential project at the posh location of Bani Park Extension, Jaipur. The project heralded the strength of team Dhanuka and showed what the future has in its fold for the group. Since then the real estate company has grown steadily and started residential projects one after other establishing itself as a leading realtor of Jaipur. Economic depression of 2008-9 has impacted the group in more positive ways by making it a wiser business organisation. In the last quarter of 2008, group entered in to the Modular Kitchen and Pharmaceuticals business to create a diversified portfolio thus making the organization less vulnerable to changing economic scenarios., 23120=Green Acres It is a 50 bigha well developed jda approved township on ajmer road, It behind is pink pearl. It is situated before omaxe city, Vatika city and jda anand vihar. Township is situated on 60 feet wide road. Well designed entry gate, Damar roads, Plantation and demarcation of plots are some features of township. Plot size ranging from 138.89 sq yds to 300 sq yds., 297274=The Harbinger Group was formed in 1998, with diversified and growing interests in Real Estate, Construction and IT industry. The Real Estate business is presently being carried under its holding company Harbinger Creators and Developers (HCD) Pvt Ltd. Since its inception, Harbinger Group has a successful track record of completing projects on time. The organization believes in building never-ending relationships with customers by sharing professional and ethical values. Our belief lies in quality not quantity. We are extremely careful when we select location of our projects. We avoid locations near unplanned urban locality, near open drainage or nallah, & near high tension lines. We choose locations with at least two side roads. Some times we have to wait for a year or two and evaluate 100 odd sites, before we could select the location of the project. We always try and strive for creating it first and many firsts in our projects. Our constant endeavor is to focus on innovations and creativity. Our first project Harbinger Heights is testimony to multiple firsts., 4777=Siddha is a high class real estate developer and marketer, with full fledged offices and facilities in Kolkata and Jaipur. Founded in 1986, Siddha has conceived, designed and built residential and commercial units and townships, at premium locations in Kolkata and Jaipur. Raj Aangan, the jewel in our crown, is a 141-acre NRI Township in Jaipur co-created with the Rajasthan Housing Board. Led from the front by Chandra Prakash Jain, Group Chairman, Sanjay Jain, Managing Director and Siddharth Sethia, Joint Managing Director, our mission is to help fill a fundamental void in Indian society~Quality Housing for Homes & Offices. Our prime goal, therefore, is to deliver high-design material and construction excellence within committed timeframes at competitive prices., 132783=Ashadeep Group is coming up with a Group Housing Project named \"Nilayam\" @ Jagatpura, Jaipur. Project will have 2 BHK / 3 BHK flats with approximate SBUA of 950 /1200. Sq.ft. The project will have all basic facilities., 351856=Established in 2010 SHIV SHAKTI GROUP (SSG) has become the very definition of success. Defining and changing life style of thousands of people. SSG as trusted builder based in Jaipur, Rajasthan, India is among the leading Realty and Infrastructure Developers. A highly reputed professionally managed organization gained national recognition through its remarkable work in the fields of residential and commercial construction and became a renowned name in the construction industry in last few years. Group has track record of sustained growth, customer satisfaction, innovation and recognized for its knowledge, quality, passion, transparency, flexibility, integrity & commitment for our valuable Investor, shareholders and customer. Dedicated team experts escort us towards achieving greater heights and success all throughout our journey with aim to bring quality residential and commercial destinations of international standards, equivalent to the best in the world well within your reach. For the benefit of our customers, by improving and setting new standards and to deliver value for money, as well as provide sound investment opportunities, thereby giving a well defined focus to customer relationship & satisfaction., 210469=Our Group is established in mid-2007, is one of the leading, most successful and fastest growing real estate company in Rajasthan. Gurupragya Infra Pvt. Ltd. and its concern has been credited for development ofprestigious and life style enhancing residential properties in Rajasthan. The Company carefully plans, controls and implements every aspect of its property development from concept to the completion and also offers high level maintenance to all its properties. Creative and experienced professional of their field work with a hard commitment to the Gurupragyas philosophy of innovation and quality are the part of group., 33939=South Ex Project : A complete township project with independent apartments, customized villas in jaipur, multistory 2 - 3 BHK Flats for sale in jaipur, shopping plaza, club, separate apartments with world class amenities. About South Ex Jaipur This project is approved by almost every Nationalized & Private Banks such as SBBJ, SBI, PNB, HDFC, ICICI, UCO, AXIS etc. (Our team will help in getting finance also).Jaipur's IT HUB is starting 3-4 kms away from this location with lot of institutions and Multinational IT companies. This will enhance the real estate value many folds for \" South Ex \" investors.Sitapur Industrial Area is 4-5 kms. which accommodates Gem and Jewelry Export units, IT companies like HCL, ITG Software, Meticube Software, Infosys etc.  Presence of automobile companies like Volkswagen, Chevrolet. Medical Institution like, Mahatma Gandhi Hospital, Heart center Narayana Hrudayalaya,  School of architecture.Over and above SEZ Jaipur. This development has already increased demand for rented accommodation in the area, resulting into value addition to this upcoming property.  Approved project of Jaipur Metro is declared to be operational by 2015 on the Tonk Road. The metro station is bang opposite the main gate of \" South Ex \" By that time the project will be completed. The real estate value of \" South Ex \" will further improve because of Metro connection with CBD of Jaipur., 90908=Ashadeep Group was established in 2002. It is headquartered at Jaipur. The group has interests in township development, Group housing and infrastructure sector like highways, bridges and urban infrastructure. It is a professionally managed group involved in real estate development in Rajasthan. The group has completed many township and group housing project in Jaipur city. Group is presently actively involved in real estate development in Jaipur and Neemrana. Group is building group housing for Central government employees (CGEWHO) in Jaipur city. Group is also upcoming with Affordable Housing Project in Jaipur city under Public private partnership model in association with Government of Rajasthan., 17107=Established in 1995 with a vision to focus on comprehensive and reliable property services to all global public community. Wish Empire today is one of the leading provider of real estate solution. With our unique service model, we have enabled our clientele located all across India to be informed about property buying and investment decisions without stepping out from their home. We provide in-depth information on buying, selling and renting out properties in India. The portal provides an ideal medium for independent owners, real estate agents and builders to advertise their listings on the Internet and for potential buyers to search for properties in a private, hassle free environment.}",
    "textBeforeTable": "Unit Types SIDDHA AANGAN Siddha Aangan Heights is one of the popular residential developments in Ajmer Road, neighborhood of Jaipur. It is among the ongoing projects of Siddha Group. It has lavish yet thoughtfully designed residences in 3 Blocks . Overview More Details Enquire Now _gaq.push(['_trackEvent','Enquiry form-lf','Enquire','CAP']);\"> Sale: 67     Listings Available : From May 2015 Possession : 4BHK, 2BHK, 3BHK Unit Type: Apartments, Villas Property Type: Siddha Group Builder: 825Sq ft - 2580Sq ft Rs. 17.73L - 85L ongoing Siddha Aangan  in Ajmer",
    "textAfterTable": "Villas 4bhk 2178-2580 sq.ft 66L - 85L Approvals Project Approving Authorities Project is known to be approved by Jaipur Development Authority Home Loans providers include IDBI Bank, ALL MOST ALL BANKS AND FINANCIAL INSTITUTES, Leading Housing Finance Map Amenities Garden Swimming Pool Play Area Health Facilities Recreation Facilities 24Hr Backup Maintenance Staff Security Intercom Club House Rain Water Harvesting Broadband Internet Library Badminton Court Gymnasium Indoor Games Community Hall Other About Builder Siddha is a high class real estate developer and marketer, with full fledged offices and facilities in Kolkata and Jaipur. Founded in 1986, Siddha has conceived, designed and built residential and commercial units and townships, at premium locations in Kolkata and Jaipur. Raj Aangan, the jewel in our crown, is a 141-acre NRI Township in Jaipur co-created with the Rajasthan Housing",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}