{
    "relation": [
        [
            "Player",
            "Bjorn Borg",
            "Henri Cochet",
            "Rene Lacoste",
            "Mats Wilander",
            "Ivan Lendl",
            "Gustavo Kuerten"
        ],
        [
            "Titles won",
            "6",
            "4",
            "3",
            "3",
            "3",
            "3"
        ],
        [
            "Years",
            "1974-75, 1978-81",
            "1926, 1928, 1930, 1932",
            "1925, 1927, 1929",
            "1982, 1985, 1988",
            "1984, 1986, 1987",
            "1997, 2000-01"
        ]
    ],
    "pageTitle": "Bob Larson's Tennis News | <u>Paris</u>: Roland Garros Men's Tennis Preview - Federer vs. Davydenko and Nadal vs. Djokovic",
    "title": "",
    "url": "http://www.tennisnews.com/exclusive.php?pID=20598",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 764514927,
    "recordOffset": 764481382,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1897=·         2006 runner-up Roger Federer bids to reach a record eighth consecutive Grand Slam final, so breaking his tie with Jack Crawford. Federer\u0092s chances of getting one step closer to completing a career Grand Slam would appear to be boosted by his 8-0 record against today\u0092s opponent Nikolay Davydenko. Davydenko is hoping to advance to his first Grand Slam final; he would become just the second Russian to do so at Roland Garros in the Open Era., 4691=2007 ROLAND GARROS, 4406=Friday 8 June 2007, 622=Three of the four semifinalist are among the top eight performers on clay this season, through the completion of the quarterfinals. Davydenko is currently in 15th place, being 13-6 on clay in 2007., 2721=·         The third-youngest Roland Garros semifinal in the Open Era when 21-year-old Rafael Nadal plays Novak Djokovic, 20. Nadal is bidding to become the first man since Jim Courier in 1993 to reach three consecutive Roland Garros finals; Djokovic is attempting to become the first Serbian man in history to reach a Grand Slam singles final., 4806=2007 Roland Garros Paris, France  }",
    "TableContextTimeStampAfterTable": "{195604=1990, 259468=·         The defending champion has reached the final at Roland Garros 15 times in the Open Era, going on to win the title ten times. (The defending champion has not returned on three occasions in the Open Era.) The defending champion has lost at the semifinal stage twice (1994 champ Sergi Bruguera in 1995 and 2002 winner Albert Costa in 2003). [See page 7 of the Preview for more information.], 176475=1989, 139000=2000 Australian Open, 39339=                           9:33                               Total Time on Court^                           11:53, 249688=·         Nadal has reached the quarterfinals or better at all four majors. Away from Roland Garros, Nadal\u0092s best result was reaching the 2006 Wimbledon final (l. Roger Federer 60 76 67 63). He also reached the quarterfinals at the 2006 US Open and the 2007 Australian Open., 38477=                            8-3                                2007 Tiebreak Record                            11-8, 79378=·         Federer is appearing in his 12th straight Grand Slam semifinal. He set a new all-time record at the 2007 Australian Open, when , by reaching his 11th successive semifinal, he surpassed Rod Laver\u0092s run of 10 straight Grand Slam semifinal appearances from 1960 Wimbledon through 1962 Roland Garros, and Ivan Lendl\u0092s streak of ten major semifinals from the 1985 US Open through the 1988 Australian Open., 157327=·         Against Swiss opponents, Davydenko has a 1-9 career record. Most of this is accounted for by his 0-8 head-to-head against Federer. Davydenko\u0092s lone victory over a Swiss player was defeating Marc Rosset 75 61 in the second round at 2001 Basle; he also lost to Michel Kratochvil 64 62 64 in the first round at 2002 Wimbledon., 152787=2006 US Open, 238152=2:45, 190842=2006, 151117=2005 Roland Garros, 132213=1995 Roland Garros, 235912=4:04, 66094=2007 Roland Garros, R16, 274969=1997, 2000-01, 85618=1933 Australia - 1933 France - 1933 Wimbledon - 1933 US - 1934 Australia - 1934 France - 1934 Wimbledon, 76775=1974 Australian Open through 1975 Australian Open SF, 94711=·         Federer has a 32-6 win-loss record against Russians, four of those losses (all to Yevgeny Kafelnikov) coming in his first six meetings with players from the nation. Since his last defeat by Kafelnikov (2001 Marseille), he stands at 30-2; his two losses since have both been to Marat Safin, at 2002 Moscow and the 2005 Australian Open., 109250=·         Federer is bidding to become the first man in 15 years to win the Australian Open and Roland Garros in the same year. Rod Laver, in 1969, Mats Wilander, in 1988, and Jim Courier, in 1992, are the only men to win the two events back-to-back within a calendar year in the Open Era. In the history of the sport, only eight men have won the Australian Open-Roland Garros double, with Laver and Roy Emerson having done so twice.[For more details, see Page 4 of Preview.], 95383=·         Federer has a 5-2 win-loss record against Russian opponents at Grand Slams. This is just Federer\u0092s second meeting with a Russian at Roland Garros, his first being his round of 16 victory this year against Mikhail Youzhny. It is also just the second time that Federer has faced two Russian opponents in the same tournament. He defeated Denis Golovanov in the first round at 2002 Moscow before losing to Marat Safin in the quarterfinals there., 60711=1984 Wimbledon,R128, fourth set, 292849=·         Nadal leads the tour for total titles collected in 2007, having won four altogether including his hard court victory at Indian Wells in March. He also leads the tour for total match wins this season, being 41-6 through the quarterfinals here., 303420=2007 Roland Garros, 294212=·         Apart from Verdasco, whom he defeated in the round of 16, all of Djokovic\u0092s opponents at 2007 Roland Garros until now have been ranked outside the Top 120., 74094=2005 Wimbledon through 2006 Roland Garros SF, 61193=1984 US Open, SF, first set, 98352=·         For the third successive year, Federer is bidding at Roland Garros to become only the sixth man in history to win all four Grand Slam titles. The five men to have achieved the \u0091career Grand Slam\u0092 are Andre Agassi, Don Budge, Roy Emerson, Rod Laver and Fred Perry. Budge and Laver, of course, won the much-coveted Grand Slam, Budge winning all four major tournaments in a single calendar year in 1938, before Laver did so in 1962 and 1969., 200431=1985, 186078=2005, 168476=1974, 118359=·         Prior to reaching the semis here in 2005, Davydenko had never advanced beyond the Roland Garros second round, losing at that stage on his first three appearances., 154733=2007 Roland Garros, 19223=* through 2007 Roland Garros quarterfinals, 284736=2006 Buenos Aires, 300597=1985 Australian Open, 297678=·         Djokovic is just the second Serbian man to reach a Grand Slam semifinal after Slobodan Zivojinovic, and is bidding to become the first Serbian man in history to reach a Grand Slam singles final. Last year here, Djokovic became the first Serbian man to reach the quarterfinals at Roland Garros in the Open Era. (Note: Serbian men played under the Yugoslav flag until the start of 2004.), 272192=1982, 1985, 1988, 178893=1982, 275246=*since the event became international in 1925, 310205=·         The last No. 6 seed to reach the Roland Garros final was Yevgeny Kafelnikov, on his way to the title in 1996., 158723=·         Immediately before 2007 Roland Garros, Davydenko played at Portschach, having won the title in Austria for the past two years. This time however, as No. 1 seed, he lost in the quarterfinals to eventual champion Juan Monaco 62 67 64., 54921=·         Federer dropped his first set at this year\u0092s Roland Garros against Tommy Robredo in the quarterfinals, ending his streak of 36 consecutive sets won in Grand Slams in the Open Era. By winning the first set against Robredo, Federer did however establish a new outright record for consecutive sets won in Grand Slams in the Open Era, having won 36 in a row stretching back to the third set of the 2006 US Open final. This broke his tie with John McEnroe, who won 35 in a row in 1984., 248397=·         Courier won the title in 1991 (d. Andre Agassi) and 1992 (d. Petr Korda) and finished runner-up in 1993 (l. Sergi Bruguera)., 288146=2005 Umag, 296279=·         Djokovic advanced to the 2006 Roland Garros quarterfinals unseeded, before retiring at that stage with a lower back injury when trailing today\u0092s opponent Nadal 64 64., 235057=2:21, 127162=1973 Wimbledon, 81887=·         Federer is today bidding to reach his eighth consecutive Grand Slam final. If he defeats Nadal and advances to 2007 Roland Garros final, he will set a new all-time record for successive appearances in major finals, breaking his tie with Jack Crawford., 59402=2007 Roland Garros, QF, first set, 313326=·         Djokovic played the junior event at 2003 Roland Garros, losing in the round of 16 to Daniel Gimeno-Traver 62 26 63., 225095=                            6-4                                2007 Tiebreak Record                            11-5, 78138=1993 Wimbledon through 1994 Roland Garros R16, 169773=1989, 256050=2002 (lost), 2003 (won), 245733=1978 (won), 1979 (won), 1980 (won), 1981 (won), 67376=1984 Wimbledon, R64, 276228=·         Nadal accumulated his 81-match clay court winning streak after losing to Igor Andreev in the Valencia quarterfinals on 7 April 2005, surpassing Guillermo Vilas\u0092s previous mark of 53 straight clay court match wins with his first round victory at Roland Garros last year. Federer\u0092s defeat of Nadal in Hamburg was his first clay court victory against the Spaniard in six clay meetings on the surface, but Nadal still leads their overall head-to-head 7-4. Nadal and Federer will meet in the final if they both advance today., 225957=                          10:56                              Total Time on Court^                             13:27, 305356=·         Djokovic has not advanced beyond the round of 16 at any other major, reaching that stage at 2006 Wimbledon and the 2007 Australian Open. He has fallen in the third round on both of his appearances to date at the US Open., 226781=* turned 21 on 3 June, 160994=·         Five of Davydenko\u0092s ten career titles have been won on clay. He has won a title on clay every year 2003-06, starting at 2003 Estoril. Last year he won two titles on clay \u0096 Portschach and Sopot \u0096 for the first time, and won five titles overall, tying him for second place with James Blake and Rafael Nadal for most titles won in 2006 behind Roger Federer., 289848=2003 Roland Garros, 283034=2007 AMS Rome, 80282=·         Federer has an 11-2 record in Grand Slam semifinals. His two losses at the semifinal stage were at the 2005 Australian Open (l. Marat Safin 57 64 57 76 97), and at 2005 Roland Garros, which marked the last time he failed to reach the final at a major (l. Rafael Nadal 63 46 64 63). Both Safin and Nadal defeated Federer on their birthdays \u0096 it is not Davydenko\u0092s birthday today, though the Russian did celebrate his 26th birthday last Saturday., 211869=Nadal and Djokovic are in first and second place respectively for the most match wins this season: Nadal has a 41-6 record in 2007, Djokovic stands at 40-8., 247880=1991 (won), 1992 (won), 1993 (lost), 125455=1972 Roland Garros, 117595=·         Davydenko has matched his best Roland Garros result, having reached his first Grand Slam semifinal here in 2005, losing to eventual runner-up Mariano Puerta 63 57 26 64 64. He also advanced to the last four at the 2006 US Open, losing to today\u0092s opponent Federer 61 75 64., 123781=1972 Australian Open, 67819=1984 US Open, QF, 161840=·         Davydenko was born in Severodonezk, now part of the Ukraine but formerly in the USSR, and moved to Salmtal, Germany, at the age of 15 to live with his brother Eduard and his sister-in-law. His brother, who is 11 years older than him, is his coach. Davydenko received Russian citizenship when he was 18 and moved back to Russia in early 2004., 30750=        2004, 2006-07 Australian Open                                                                  2006 US Open, 277239=·         Nadal is one of just two men, along with Buenos Aires and Portschach winner Juan Monaco, to collect multiple clay court titles so far in 2007. For the second year running, Nadal claimed all three of his clay court titles on European clay, winning at AMS Monte Carlo (d. Roger Federer 64 64 in the final), Barcelona (d. Guillermo Canas 63 64), and AMS Rome (d. Fernando Gonzalez 62 62)., 68777=·         Through his defeat of Robredo here, Federer has now won 26 successive Grand Slam matches going back to Wimbledon last year. He is today bidding to equal his longest streak of wins in Grand Slams, which he set from 2005 Wimbledon through the 2006 Roland Garros semifinals. Overall, that streak of 27 straight matches put Federer in second place for the longest Grand Slam winning streak in the Open Era, behind Rod Laver. Federer would equal Laver\u0092s record run of 29 consecutive victories in majors if he wins the title here and goes on to win his first round match at Wimbledon., 116370=·         Davydenko celebrated his 26th birthday last Saturday and is the oldest semifinalist at 2007 Roland Garros., 149433=2005 Australian Open, 61578=·         In dropping the second set to Tommy Robredo in their quarterfinal on Tuesday, Federer\u0092s streak of straight-sets victories in Grand Slam matches in the Open Era ended at 11. He equalled the record of John McEnroe, who also won 11 Grand Slam matches in straight sets from the second round at 1984 Wimbledon through the 1984 US Open quarterfinals., 96234=·         Federer has been at No. 1 in the rankings for 175 weeks, having been at the top every week since 2 February 2004. This is a record for consecutive weeks at No. 1 \u0096 he overtook Jimmy Connors\u0092 mark of 160 straight weeks on 26th February. Federer is in fourth place for the most total weeks at No. 1, behind Pete Sampras (286 weeks), Ivan Lendl (270 weeks) and Connors (268)., 100836=·         Federer has collected his ten Grand Slam titles in his last 15 Grand Slam tournaments. If he is able to go on and win his 11th major title at 2007 Roland Garros, he would move into even more exclusive company on the Grand Slam title leaderboard. Four men have 11 or more Grand Slam titles to their names. [See table overleaf.], 312574=·         Djokovic won his first two singles titles in 2006, at Amersfoort on clay in July, and at Metz on indoor hard in October. He also reached the final at Umag but retired with respiratory problems in the first set tiebreak of the final against Stanislas Wawrinka., 291577=2005 Kitzbuhel, 114125=·         Gustavo Kuerten was the last No. 1 seed to win Roland Garros, in 2001. The top seed has reached the final here 14 times in the 39 previous Roland Garros championships in the Open Era, going on to win the title 11 times . [For more details, see Preview page 11.], 49634=1:53, 65646=2007 Australian Open, R128, 302010=1986 Wimbledon, 273578=1984, 1986, 1987, 87159=2005 Wimbledon - 2005 US Open \u0096 2006 Australian Open \u0096 2006 Roland Garros \u0096 2006 Wimbledon \u0096 2006 US Open \u0096 2007 Australian Open, 146045=2002 Roland Garros, 304584=·         Djokovic joined female compatriots Jelena Jankovic and Ana Ivanovic in the 2007 Roland Garros semifinals. This is the most successful Grand Slam event in the Open Era for Serbia, which had never previously had more than one player through to the quarterfinals in the same major., 147749=2004 Australian Open, 144363=2002 Australian Open, 58930=2006 US Open, FR, third set, 171075=2007, 133918=1996 Roland Garros, 309282=·         As No. 6 seed here, Djokovic has received the highest Grand Slam seeding of his career. He entered the Top 10 for the first time on 19 March this year and rose to a career-high ranking of No. 5 on 30 April. (He is also ranked No. 6 here.) By reaching the Roland Garros semifinals, Djokovic is projected to reach a new career-high ranking of either No. 3 or No. 4, dependent on the progress of fellow semifinalist Nikolay Davydenko., 205262=1994, 21298=2004     Athens Olympics           Hard (O)            R64      Federer             63 57 61, 29983=                2003-06 Wimbledon                                                                   2005, 07 Roland Garros,, 53257=2:02, 51862=3:24, 254035=1993 (won), 1994 (won), 1997 (lost), 142354=2001 US Open, 44335=1:44, 257018=2005 (won), 2006 (won), 231454=2:11, 112570=·         Federer comes into the semifinals on a ten-match winning streak. Victory for Federer today would see him win 11 consecutive matches on clay for the third time in his career. He won 11 straight matches when winning AMS Hamburg and reaching the semifinals here in 2005. (Unlike this year, Federer did not receive a first-round bye at 2005 Hamburg.) Federer\u0092s longest clay court winning streak is 12, set between September 2002 and May 2003 when he won two Davis Cup rubbers for Switzerland against Morocco (2002 World Group play-off), then won at Munich and reached the final at AMS Rome in spring 2003., 260346=·         Nadal is bidding to become the first man since Bjorn Borg in 1980 to collect a third successive Roland Garros title, and just the second man for 93 years to do so. Borg, who won a total of six Roland Garros titles in the periods 1974-75 and 1978-81, is the only man to have won three in a row here in the Open Era (going on to win four in a row), and the only player to have done so since the event went international in 1925. Three more men achieved the feat pre-1925., 217610=              2005-06 Roland Garros                                                                    2007 Roland Garros, 241215=·         Nadal is the only player to advance to the semifinals without losing a set. This is the first time that Nadal has reached the Roland Garros semifinals without losing a set; the furthest he had previously advanced at this event in straight sets was the round of 16, in 2005., 230599=2:19, 156526=·         Davydenko has a 0-10 record against the world No. 1. As well as having eight losses to Federer (see head-to-head above), Davydenko also lost to No. 1-ranked Lleyton Hewitt at 2003 Roland Garros, 63 46 63 76 in the second round, and to No. 1-ranked Andre Agassi at 2003 AMS Montreal, 76 62 in the second round., 114724=·         Roland Garros was the only junior Grand Slam event at which Federer did not reach the semifinals or better. On his only appearance in the boys\u0092 singles here in 1998, he lost to Jaroslay Levinsky 64 57 97., 31463=                 2004-06 US Open, 100036=·         In the 38 years since Laver completed his second Grand Slam in 1969, Agassi is the only man to have been able to capture the elusive fourth different major. In that time, 11 other men have collected three of the four major titles. In every case, the players failed to win either Roland Garros or Wimbledon to complete their set. [For more detail see Preview page 3.], 140686=2000 US Open, 255088=1998 (lost), 2001 (lost), 128839=1989 Roland Garros, 310806=·         Djokovic is having the best season of his short career, having won three titles so far \u0096 he and Roger Federer, who has also won three, share second place behind today\u0092s opponent Nadal (four) for most tournament wins in 2007. Djokovic won the title on hard court at Adelaide, defeating Chris Guccione 63 67 64 in the final, and collected his first Masters Series title at Miami, defeating Guillermo Canas 63 62 64, having a week earlier reached the AMS Indian Wells final (l. Nadal 62 75). He also won the clay court event at Estoril, defeating Richard Gasquet 76 06 61 in the final., 183723=1983, 233683=2:15, 242059=·         Nadal has improved his Roland Garros record to 19-0 through the first five rounds. In 2005 he became the first man to win the event on his debut since Mats Wilander in 1982, and the fourth-youngest Roland Garros champion in the Open Era, defeating Mariano Puerta 67 63 61 75 in the final. Nadal defeated Roger Federer 16 61 64 76 in the 2006 final., 35142=                           15-2                                 2007 Record - Clay                              13-6, 240405=2:12, 257522=·         Nadal is the only lefthander to reach the semifinals here this year. In 2005, he became the first lefthander to win at Roland Garros since Thomas Muster in 1995., 130545=1993 US Open, 270803=1925, 1927, 1929, 51005=2:25, 242899=·         Nadal is bidding to become the first man since Jim Courier in 1993 to reach three consecutive Roland Garros finals, and the fourth man in the Open Era to do so., 158141=·         The last No. 4 seed to reach the final here was Rafael Nadal en route to the title in 2005., 39970=                                                                    * turned 26 on 2 June, 293583=·         Nadal is in his 98th straight week as world No. 2, having held the ranking since 25 July 2005. (Roger Federer is in his 175th week at No. 1, since 2 February 2004)., 296938=·         Djokovic has retired at Roland Garros both previous times he has played here. He advanced to the second round on his debut here as a qualifier in 2005, retiring there with breathing difficulties and cramping when trailing Guillermo Coria 46 62 32., 249013=·         Nadal missed the event in 2003 after sustaining an elbow injury the week before in practice. In 2004 a stress fracture of his left ankle caused him to miss the event for a second year., 269409=1926, 1928, 1930, 1932, 47415=2:05, 46560=1:51, 306735=·         Djokovic has a 14-5 career record against left-handed opponents through his defeat of Verdasco in the round of 16 here. This is not the first time that Djokovic has faced two lefthanders in the same tournament. He played, and defeated, three lefthanders in successive rounds at 2007 AMS Miami en route to winning his biggest career title, having wins over Michael Llodra in the third round, Feliciano Lopez in the round of 16, and today\u0092s opponent Nadal in the quarterfinals (see also below)., 181306=1974, 202840=1991, 264150=·         The last man to win three or more Roland Garros titles, consecutive or non-consecutive, was Gustavo Kuerten in 2001. (Kuerten also won in 1997 and 2000.) Kuerten is one of six men to have won three or more Roland Garros titles, consecutive or non-consecutive, since the event went international in 1925., 220801=                           41-6                                      2007 Record                                   40-8, 198019=1997, 45190=1:31, 110747=·         Although Federer has won three titles so far in 2007, by his standards this season has been disappointing. Before the start of Roland Garros, his win-loss record for the season was only seventh-best, at 24-4. Federer\u0092s victory at AMS Hamburg broke a run of four straight tournament losses, his longest streak without winning a title since taking over the No. 1 ranking in February 2004. After winning the Australian Open and Dubai, Federer lost in the second round at AMS Indian Wells to Guillermo Canas 75 62 (after a first round bye), and again to Canas, 76 26 76, in the round of 16 at AMS Miami. Federer reached the final at AMS Monte Carlo before losing to Rafael Nadal, and was then upset by wild card Filippo Volandri 62 64 in the round of 16 at AMS Rome., 78518=·         Federer has reached the Roland Garros semifinals for the third consecutive year, and is bidding to reach the final here for the second year in a row, having defeated David Nalbandian 36 64 52 ret. (abdominal strain) in the 2006 semifinal before losing to Rafael Nadal 16 61 64 76 in the final. He lost in the 2005 Roland Garros semifinals, falling to Nadal 63 46 64 63., 54128=3:00, 246809=1984 (won), 1985 (lost), 1986 (won), 1987 (won), 81228=·         The last time Federer lost before the semifinals at a major was at 2004 Roland Garros, where he fell in the third round to three-time champion Gustavo Kuerten 64 64 64., 261853=                                                            Paul Ayme \u0096 1897-1900, 268021=1974-75, 1978-81, 96955=·         Federer is making his ninth appearance at Roland Garros, having played every year since making his Grand Slam debut as a wild card in 1999., 221728=                           24-1                                 2007 Record - Clay                              16-3, 262330=                                                            Max Decugis \u0096 1907-09; 1912-14, 115272=·         The only other Swiss player to reach a Grand Slam semifinal in the Open Era is Marc Rosset, who lost at 1996 Roland Garros to Michael Stich 63 64 62., 34220=                           29-4                                      2007 Record                                  28-14, 72735=1969 Australian Open through 1970 Wimbledon R32, 262815=                                                            Bjorn Borg \u0096 1978-81, 261373=                                                            Andre Vacherot \u0096 1894-96, 137327=1999 US Open, 286440=2004 Costa Do Sauipe, 75465=2006 Wimbledon through 2007 Roland Garros QF, 263422=·         Roger Federer was, of course, the last man to win a hat trick of titles at any Grand Slam event, winning his third successive Wimbledon title in 2005, and his third successive US Open title in 2006. [See Preview page 2 for more details.], 97502=·         Federer reached the Roland Garros final for the first time last year, becoming the seventh man in the Open Era to reach the final at all four Grand Slam events (the others are Andre Agassi, Rod Laver, Ken Rosewall, Ivan Lendl, Stefan Edberg and Jim Courier). Federer\u0092s loss in the final to defending champion Rafael Nadal 16 61 64 76 was one of just five losses for Federer in 2006, four of which were to Nadal (the fifth was to Andy Murray)., 188432=1975}",
    "textBeforeTable": "10.0pt\">Hat tricks at Roland Garros                                                             Andre Vacherot \u0096 1894-96                                                             Paul Ayme \u0096 1897-1900                                                             Max Decugis \u0096 1907-09; 1912-14                                                             Bjorn Borg \u0096 1978-81   ·         Roger Federer was, of course, the last man to win a hat trick of titles at any Grand Slam event, winning his third successive Wimbledon title in 2005, and his third successive US Open title in 2006. [See Preview page 2 for more details.]   ·         The last man to win three or more Roland Garros titles, consecutive or non-consecutive, was Gustavo Kuerten in 2001. (Kuerten also won in 1997 and 2000.) Kuerten is one of six men to have won three or more Roland Garros titles, consecutive or non-consecutive, since the event went international in 1925.   Most Roland Garros titles (all time*)",
    "textAfterTable": "*since the event became international in 1925 ·         Nadal arrived at Roland Garros having just suffered his first clay court loss for more than two years. He had his record-breaking 81-match clay court winning streak broken by Roger Federer at AMS Hamburg, falling 26 62 60 in the final.   ·         Nadal accumulated his 81-match clay court winning streak after losing to Igor Andreev in the Valencia quarterfinals on 7 April 2005, surpassing Guillermo Vilas\u0092s previous mark of 53 straight clay court match wins with his first round victory at Roland Garros last year. Federer\u0092s defeat of Nadal in Hamburg was his first clay court victory against the Spaniard in six clay meetings on the surface, but Nadal still leads their overall head-to-head 7-4. Nadal and Federer will meet in the final if they both advance today.   ·         Nadal is one of just two men, along with Buenos Aires and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}