{
    "relation": [
        [
            "Poster",
            "myhotwheels22981",
            "Home away from home Joined: 2002/3/22 From: Posts: 247",
            ""
        ],
        [
            "Thread",
            "Posted: 2009/4/9 2:16 Updated: 2009/4/9 2:16",
            "Re: Photos: 2011 Grand Cherokee Debut The SUV craze went way, way, way too far...This is as big as any SUV should have ever gotten. And Hopefully, this is as big as one will ever get again. The Backlash from super duper sized SUV's gave the Greenies ammo and targets to push their senseless agenda forward, and affect our American way of life. This New Cherokee is great...11 % better mileage, and a diesel, hybrid, and possibly a diesel hybrid version on the way. A 7 passenger Cherokee is more efficient at 28 mpg hwy than 2 Priuses carrying 5 and 2 passengers even at 45 mpg highway(22.5 mpg each). The fact is, not everyone wants a Prius, an Insight, a Camry Hybrid, etc... Our supreme Chia-Pet- in-Chief should DROP C.A.F.E. and do the following instead.. 1. Mandate Direct Injection on all IC engines. 2. Mandate auto stop-start on all IC engines 3. Mandate Cylinder de-activation on all gas engines with 6 or more cylinders. 4. Mandate multi-fuel compatability an all gas engines. 5. Mandate a 2-mode Hybrid option or PiHV option on every model mid-size or larger, sold in the U.S. 6. Mandate Hydraulic Kinetic Energy Recovery on all trucks and truck-based SUV's",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=3119",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 519923663,
    "recordOffset": 519908485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3845=The all-new 2011 Jeep Grand Cherokee made its world debut today at the New York International Auto Show. Jeep's all-new premium SUV features an athletic design, an all-new world-class interior, an all-new engine and legendary Jeep capability. Nearly 18 years ago, Jeep invented the premium SUV segment with the introduction of the Jeep Grand Cherokee. More than 4 million sales later, Jeep improves the formula and hits the sweet spot of real-world capability and on-road refinement with the all-new 2011 Jeep Grand Cherokee. The all-new Jeep Grand Cherokee delivers premium on-road performance while maintaining the Jeep brand\u0092s legendary four-wheel-drive, torque-on-demand two-speed transfer case and unsurpassed towing capability. It also offers improved fuel economy (up to 11 percent) and a world-class interior cabin. See previous article for more details. More pics after the jump}",
    "textBeforeTable": "You must login or register to post a comment. We aren't responsible for their content. The comments are owned by the poster. FlatThreadedNested Oldest FirstNewest First margin:3px;\"> //--> google_color_text = \"000000\"; google_color_url = \"006633\"; google_color_link = \"006699\"; google_color_bg = \"FFFFFF\"; google_color_border = \"006699\"; google_ad_channel =\"\"; google_ad_format = \"468x15_0ads_al\"; google_ad_height = 15; google_ad_width = 468; google_ad_client = \"pub-0495763959545387\"; Reader Reactions",
    "textAfterTable": "Posted: 2009/4/13 14:20   Updated: 2009/4/13 14:20 Just can't stay away Joined: 2005/8/11 From: Atlanta, GA Posts: 80  Re: Photos: 2011 Grand Cherokee Debut I don't know what vehicle you guys are looking at, but I don't like it. I was hoping they'd go with styling that was more like the Liberty but this is more akin to the Compass if anything. Very disappointing to look at. Looks like any generic Lexus or Benz or BMW suv. Unfortunately Jeep lacks the knee-jerk luxury reaction. Nobody thinks that when they think of a Jeep. Poster Thread JayBird Posted: 2009/4/15 12:57   Updated: 2009/4/15 12:57 Quite a regular Joined: 2005/9/12 From: Posts: 41",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}