{
    "relation": [
        [
            "Dilutive common shares equivalent table",
            "Convertible debt:",
            "Warrants (in the money)",
            "Stock options (in the money)",
            "Total dilutive common shares"
        ],
        [
            "Shares",
            "",
            "350,000",
            "584,568",
            ""
        ],
        [
            "USD",
            "$36,000",
            "",
            "",
            ""
        ],
        [
            "Dilutive shares",
            "15,013",
            "120,781",
            "271,567",
            "407,361"
        ]
    ],
    "pageTitle": "f10q0310_celsius.htm",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Celsius_Holdings_(CSUH)/Filing/10-Q/2010/F84885162",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 842406875,
    "recordOffset": 842350784,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  Earnings per Share — Basic earnings per share are calculated by dividing income available to stockholders by the weighted-average number of common shares outstanding during each period. Diluted earnings per share are computed using the weighted average number of common and dilutive common share equivalents outstanding during the period. Dilutive common share equivalents consist of shares issuable upon conversion of preferred shares, exercise of stock options and warrants (calculated using the reverse treasury stock method). As of March 31, 2010 there were options and options outstanding to purchase 2.8 million shares, which exercise price averaged $4.56. The dilutive common shares equivalents, including convertible notes, preferred stock and warrants, of 407,361 shares were not included in the computation of diluted earnings per share, because the inclusion would be anti-dilutive.   The unaudited condensed consolidated financial statements included herein have been prepared by us, without audit, pursuant to the rules and regulations of the Securities and Exchange Commission, (the “SEC”). Certain information and footnote disclosures normally included in annual financial statements prepared in accordance with generally accepted accounting principles in the United States (“GAAP”) have been condensed or omitted pursuant to such rules and regulations. In the opinion of management, the interim consolidated",
    "textAfterTable": "                                                                                                                                                                If all dilutive instruments were exercised using the reverse treasury stock method, then the total number of shares outstanding would be 18.8 million shares.   Recent Accounting Pronouncements>   All new accounting pronouncements issued but not yet effective have been deemed to not be applicable; hence the adoption of these new standards is not expected to have a material impact on our results of operations, cash flows or financial position.   3.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}