{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is thriving with activities So there is alot to do.",
            "I dont have a meal plan but. The meals cafe's and restraunts are good.",
            "I dont stay in the dorms but the freshmen dorms could be alot better.",
            "It is a good academic school",
            "Keep learning first!",
            "Henderson is a great school. It has a learning enviorment. It is a all around good school."
        ]
    ],
    "pageTitle": "Henderson State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Henderson-State-University/reviews?_escaped_fragment_=/show/56084",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896711291,
    "recordOffset": 896665501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171541=The Battle of the Ravine This is the biggest week of the year. Our annual football game with â??the school across the streetâ?? serves not only as a serious source of pride, but itâ??s a weekâ??s worth of fun and the occasional hijinks that result in memories that last a lifetime. The â??Showband of Arkansasâ?? Any time Henderson Stateâ??s famed Showband takes action, youâ??ll be doing yourself a favor to sit back and listen up. After all, they arenâ??t called the â??Showband of Arkansasâ?? for nothing. Recognized as one of the best marching bands in the nation, this group of accomplished musicians represent one of our best traditions. The Miss HSU Pageant Who doesnâ??t like a little glitz now and then? We do. Hendersonâ??s Miss HSU Pageant has been a proud annual event since 1960, showcasing some of the brightest, smartest, and most motivated students Henderson has to offer. The pageant qualifies as an official preliminary to the Miss Arkansas pageant. Homecoming Homecoming at Henderson is a weekâ??s worth of fun that would be hard for anyone to match. Weâ??re talking barbecues, football, volleyball, tailgating, bonfires, brunches, golf, concerts, reunion events, and, of course, the presentation of the homecoming court and the crowning of the queen. Friday Night Movies On Friday nights when the weather is beautiful, throw down a blanket, kick back with friends, and enjoy a movie night, Henderson style. Recently released movies are shown on our campus quad, using a 20x40 foot inflatable screen and state-of-the-art sound system. When itâ??s cold or stormy, movies are shown in a comfortable lecture hall with an 18-foot screen and equally impressive sound system. Bubba Olympics Forget the long jump and decathlon, the Bubba Olympics at Henderson takes fun and gut-busting laughter to the extreme. Events include the hubcap toss, root beer chugging, horseshoes, hot dog eating, wheel barrel racing, and the infamous belly flop contest. Reddie to Serve Faculty, staff and students are Reddie to Serve the community by helping citizens clean up and improve their properties. The School with a Heart Each year freshmen meet for a traditional photograph in the shape of a heart. Bench 13 Many stone benches, which classes, organizations and other entities have donated throughout the institutionâ??s history, sit on Hendersonâ??s historic South Lawn. Perhaps the most famous is Bench 13. The bench is in memorial to the former sponsor of the Heart and Key organization. It is told that when a girl is asked to marry someone while she is sitting on the bench she won't say no. That Old Reddie Spirit The official fight song of Henderson State University, That Ole Reddie Spirit, was introduced in 1923 by cheerleader Anna Lee Chidister and is affectionately known as The Reddie Hymn. This song is sung to the tune of â??That Old Time Religion.â?? Originally the song was used because of a lack of school spirit being shown at football games. At the time, cheerleaders were positioned throughout the bleachers to lead the fans in the song. In the lyrics displayed below, the word me is often replaced with random names of Reddie football players during the games. You can use the console below to play That Old Reddie Spirit. Turn up your volume and sing along. Note that it is a large file and could take some time to load., 120096=The caddo, which is our cafeteria is okay. However, they are in the process of getting a new caddo built and it should be ready in fall 2013. We also have a quiznos. They are planning to replace quiznos with Subway., 39217=I would have to say nearly all freshmen stay in Newberry or Smith their first year at HSU. However, if you're one of the lucky ones and turn in your housing application early (before November, in my opinion) then you will be placed in the newer dorms, which are East and West Halls. I stayed in Newberry my first year and it wasn't that bad. I met tons of friends while there and if I wouldn't have stayed in Newberry, I wouldn't have met my best friend. It all depends on your preferences. Several of my friends stay in Whispering Oaks, the on-campus apartments. If you have a lot in refund, I would definitely recommend them., 200589=© 2015, Cappex.com, LLC, 80356=HSU is known for the Caddo which is its dining hall. The food there is not perfect but it is good if you are willing to try different things. Currently a new dining hall is being built and should be finished by Fall 2013. Once this hall is finished the food is sure to improve greatly.}",
    "textBeforeTable": "08/15/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 47 Brittany from Malvern, AR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "HSUStudent from AR 07/21/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 47 Categories Comments What to do for fun Arkadelphia is a small town so there is not much to do. Most students go to DeGray lake in town to hang out. There are beaches at the lake that are open to the public and multiple camp sites. Students usually travel about thirty minutes away to go to Hot Springs to watch movies, play put-put, eat out, shop, or go to the horse races. The best way to have fun in town is to get involved in clubs and organizations on campus. The heart of Henderson is the people. Food and Dining The cafeteria at HSU in known as Caddo. Caddo's food is not my favorite place to eat. The food is alright most of the time. There are quite a few options to choose from, but they could provide more healthy options. They always have pizza, a salad bar, cereal, burgers/hot dogs/ chicken sandwiches, a sandwich bar, a comfort line, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}