{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Internal Agency Docket No.",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-05739",
            "",
            "FEMA-B-1311",
            "ID FEMA-2014-0002"
        ]
    ],
    "pageTitle": "44 CFR 67.8 - Appeal procedure. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/44/67.8?quicktabs_7=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912356447,
    "recordOffset": 912332766,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{982=Title 44 published on 2013-10-01.}",
    "TableContextTimeStampAfterTable": "{172890=On February 16, 2011, the Federal Emergency Management Agency (FEMA) published in the Federal Register a proposed rule that contained an erroneous table. This document provides corrections to that table, to be used in lieu of the information published on February 16, 2011. The table provided here represents the flooding sources, location of referenced elevations, effective and modified elevations, and communities affected for Montgomery County, Pennsylvania (All Jurisdictions)., 211829=On October 7, 2010, the Federal Emergency Management Agency (FEMA) published in the Federal Register a proposed rule that included modified Base (1% annual-chance) Flood Elevations (BFEs) for the locations along Cypress Creek Ditch and Victory Lake in Clay County, Arkansas. FEMA is no longer proposing these flood elevation determination changes along Cypress Creek Ditch and Victory Lake as identified in the above-referenced rulemaking publication., 250611=On January 16, 2008, the Federal Emergency Management Agency (FEMA) published in the Federal Register a proposed rule that included modified Base (1% annual-chance) Flood Elevations (BFEs) for the locations at the intersection with IH 440 and at the confluence with Palarm Creek along the Arkansas River in Pulaski County, Arkansas. FEMA is no longer proposing these flood elevation determination changes along the Arkansas River as identified in the above-referenced rulemaking publication., 124087=On October 7, 2010, and June 13, 2014, FEMA published in the Federal Register a proposed rule and a proposed rule correction, respectively, that contained erroneous information. This notice provides corrections to the table as amended by the proposed rule correction, to be used in lieu of the information published at 75 FR 62062-62063 and 79 FR 33878-33879. The table provided here represents the flooding sources, location of referenced elevations, effective and modified elevations, and communities affected for Clay County, Arkansas, and Incorporated Areas. Specifically, it addresses the following flooding sources: Cypress Creek Ditch and Sugar Creek and Tributary 2., 203175=On May 25, 2010, the Federal Emergency Management Agency (FEMA) published in the Federal Register a proposed rule that included modified Base (1% annual-chance) Flood Elevations (BFEs) for the locations along Black Bayou Lake, Canal L-11, East Branch Oliver Road Canal, Oliver Road Canal, and West Prong Youngs Bayou in Ouachita Parish, Louisiana. FEMA is no longer proposing these flood elevation determination changes along Black Bayou Lake, Canal L-11, East Branch Oliver Road Canal, Oliver Road Canal, and West Prong Youngs Bayou as identified in the above-referenced rulemaking publication., 110675=Reorganization ... 1978 Plan No. 3, 110629=Executive Order ... 12127, 110961=Title 44 published on 2013-10-01}",
    "lastModified": "Sat, 04 Jul 2015 08:36:37 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 36928 - Final Flood Elevation Determinations 2015-06-29; vol. 80 # 124 - Monday, June 29, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 44. Title 44 published on 2013-10-01. [41 FR 46989, Oct. 26, 1976. Redesignated at 44 FR 31177, May 31, 1979, as amended at 48 FR 44553, Sept. 29, 1983; 49 FR 4751, Feb. 8, 1984] The Federal Insurance Administrator shall make available for public inspection the reports and other information used in making the final determination. This material shall be admissible in a court of law in the event the community seeks judicial review in accordance with § 67.12. (e) Nothing in this section shall be considered to compromise an appellant's rights granted under",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Federal Emergency Management Agency Final rule. The date of issuance of the Flood Insurance Rate Map (FIRM) showing BFEs and modified BFEs for each community. This date may be obtained by contacting the office where the maps are available for inspection as indicated in the table below. 44 CFR Part 67 Summary Base (1-percent-annual-chance) Flood Elevations (BFEs) and modified BFEs are made final for the communities listed below. The BFEs and modified BFEs are the basis for the floodplain management measures that each community is required either to adopt or to show evidence of being already in effect in order to qualify or remain qualified for participation in the National Flood Insurance Program (NFIP). 2015-05-14; vol. 80 # 93 - Thursday, May 14, 2015 80 FR 27567 - Final Flood Elevation Determinations GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}