{
    "relation": [
        [
            "View",
            "DBA_DB_LINKS",
            "ALL_DB_LINKS",
            "USER_DB_LINKS"
        ],
        [
            "Purpose",
            "Lists all database links in the database.",
            "Lists all database links accessible to the connected user.",
            "Lists all database links owned by the connected user."
        ]
    ],
    "pageTitle": "30 Managing a Distributed Database",
    "title": "",
    "url": "http://docs.oracle.com/cd/B14117_01/server.101/b10739/ds_admin.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74761431,
    "recordOffset": 74734680,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 27 Jul 2004 15:33:00 GMT",
    "textBeforeTable": "The following views show the database links that have been defined at the local database and stored in the data dictionary: Determining Which Links Are in the Database Determining Which Link Connections Are Open Determining Which Links Are in the Database The data dictionary of each database stores the definitions of all the database links in the database. You can use data dictionary tables and views to gain information about the links. This section contains the following topics: Viewing Information About Database Links See Also: Oracle Database Reference for more information about the OPEN_LINKS initialization parameter The default value for OPEN_LINKS is 4. If OPEN_LINKS is set to 0, then no distributed transactions are allowed. Increase the value if several distributed databases are accessed over time. Thus, if you regularly access three databases, set OPEN_LINKS to 3 or greater.",
    "textAfterTable": "These data dictionary views contain the same basic information about database links, with some exceptions: Column Which Views? Description OWNER All except USER_* The user who created the database link. If the link is public, then the user is listed as PUBLIC. DB_LINK All The name of the database link. USERNAME All If the link definition includes a fixed user, then this column displays the username of the fixed user. If there is no fixed user, the column is NULL. PASSWORD Only USER_* The password for logging into the remote database. HOST All The net service name used to connect to the remote database. CREATED All Creation time of the database link. Any user",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}