{
    "relation": [
        [
            "Postage and packaging",
            "Free P&P",
            "US $1.59"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping from outside US",
            "ePacket delivery from Hong Kong"
        ],
        [
            "Delivery*",
            "Estimated between Wed. 19 Aug. and Wed. 23 Sep.",
            "Estimated between Wed. 12 Aug. and Wed. 26 Aug."
        ]
    ],
    "pageTitle": "Lot 6P Big Hole Charm European Bead Fit Bracelet Round | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Lot-6P-Big-Hole-Charm-European-Bead-Fit-Bracelet-Round-/220789078260?pt=LH_DefaultDomain_0&hash=item33680df8f4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424223343,
    "recordOffset": 424172582,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 45 items available. Please enter a number less than or equal to 45. -Select- Afghanistan Albania American Samoa Andorra Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Brazil British Virgin Islands Brunei Darussalam Bulgaria Cambodia Canada Cayman Islands Chile Colombia Cook Islands Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominica Dominican Republic Ecuador Egypt El Salvador Estonia Falkland Islands (Islas Malvinas) Fiji Finland France French Guiana French",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within 1 working day of receiving cleared payment - opens in a new window or tab. Returns policy After receiving the item, cancel the purchase within Refund will be given as 14 days Money back The buyer is responsible for return postage costs. Return policy details Any questions,contact first.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}