{
    "relation": [
        [
            "Turnover",
            "in \u0080 Mn, excluding VAT",
            "Shopping centres (1)",
            "Offices",
            "Convention Exhibition and Hotels",
            "Rental income",
            "Services",
            "Other",
            "Total"
        ],
        [
            "",
            "2012-Q1 Year to date",
            "279.3",
            "44.9",
            "94.3",
            "59.0",
            "35.3",
            "12.5",
            "431.0"
        ],
        [
            "",
            "2011-Q1 Year to date",
            "273.5",
            "54.2",
            "86.9",
            "56.1",
            "30.8",
            "13.3",
            "427.9"
        ]
    ],
    "pageTitle": "UNIBAIL-RODAMCO : Financial information as of March 31, 2012 | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/UNIBAIL-RODAMCO-4720/news/UNIBAIL-RODAMCO--Financial-information-as-of-March-31-2012-14298745/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 280564011,
    "recordOffset": 280534390,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{83034=Note: (1) Tenants' sales performance in Unibail-Rodamco's shopping centres (excluding the Netherlands) as of March 31, 2012 (year-on-year evolution). Tenants' sales on portfolio of shopping centres in operation including extensions of existing assets and excluding deliveries of new brownfield projects, and assets under heavy refurbishment. Apple sales estimated on the basis of available public information of Apple Inc. (2011 10-K published October 26, 2011, pages 20 and 30; 10-Q published January 25, 2012, pages 25 and 27)., 83816=Gross Rental Income (GRI) of the shopping centre division amounted to \u0080279.3 Mn for the first three months of 2012, increasing by 2.1% vs. 2011. Despite the number of disposals completed in the last 12 months, the GRI notably increased thanks to the Group's letting activity and the acquisitions of Splau (Spain) and of the remaining 50% of both Galeria Mokotow (Poland) and Aupark (Slovakia), all completed in the second half of 2011., 90916=Created in 1968, Unibail-Rodamco SE is Europe's leading listed commercial property company, with a presence in 12 EU countries, and a portfolio of assets valued at \u008025.9 billion on December 31, 2011. As an integrated investor, developer and operator, the Group aims to cover the whole of the real estate value creation chain. With the support of its 1,500 professionals, Unibail-Rodamco applies those skills to highly specialised market segments such as the large shopping centres of major European capital cities, and large offices and convention & exhibition centres in the Paris region., 69554=The turnover of Unibail-Rodamco for the first 3 months of 2012 amounted to \u0080431.0 Mn (+0.7% compared to the same period in 2011):, 88228=On 15 March 2012, the Group successfully issued a 7-year bond maturing 22 March 2019 for a total amount of \u0080750 Mn. The bond offers a coupon of 3.00%, the lowest ever offered by the Group on one of its bonds. The issuance was close to 5 times oversubscribed, the order book reaching over \u00803.5 Bn., 74575=2.       Gross rental income as of March 31, 2012 breaks down into:, 87421=Lyon Confluence shopping centre was successfully opened on 4 April 2012 by CEO Guillaume Poitrinal, the Mayor of Lyon Gerard Collomb and Architect Jean-Paul Viguier. Located in the newly developed Confluence area, the mall offers approx. 53,000 m² GLA of leisure and shopping, including 102 shops and a UGC 14-screen cinema. Opened 7 days a week, its main tenants include Apple, Hollister, Monoprix, Muji, Aldo, Kiko, Fossil, Starbucks, Swarowski, A Loja de Gato Preto and Blanco. In the first three weeks of operation, this new generation shopping centre attracted approx. 730,000 visits, generating significant media coverage and visitors' interest. The mall is 4-Star labelled and benefits from a \"BREEAM Very Good\" certification., 83622=b.      Gross Rental Income as of March 31, 2012, 86183=GRI of the Convention-Exhibition sector increased by 5.1% vs. the same period in 2011, to \u008059.0 Mn., 82835=Tenants' sales in Unibail-Rodamco's shopping centres grew by +3.3%(1) in the first three months of 2012 compared to the same period in 2011., 86513=On 27 March 2012, the Group unveiled its new 4-Star policy to the media and retailers. The 4-Star label is a new initiative to increase the customer comfort and ensure consistency of quality and services in the Group's shopping centres. Based on a 571-point referential, each Shopping Centre Manager will be responsible for implementing quality controls introduced by the 4-Star label. In order to standardise the initiative and guarantee its credibility, the Group has selected SGS, a world leader in certification, in order to audit the malls and validate the 4-Star label for each mall. Carré Sénart, a 105,000 m² GLA shopping centre located in the Paris region, was granted the first 4-Star label of the Group on 27 March. Unibail-Rodamco has the ambition to label 20 shopping centres in 2012 and its entire portfolio by 2014., 68828=Paris, Amsterdam, April 26, 2012, 82204=Note: (1) Property management fees invoiced in 2012 to tenants in France are now classified under Gross Rental Income, without impacting Net Rental Income. 2011-Q1 figures were restated accordingly., 85663=In the office sector the GRI decreased by -17.2% to \u008044.9 Mn due to divestments and assets under renovation. Assets disposed in the period include the 3-5 Malesherbes office in France and assets in the Netherlands and Sweden. The 34-36 Louvre office building is being renovated since the beginning of 2012. The parts of the 70-80 Wilson and Issy-Guynemer office buildings, which were the subject of renovations, were delivered in the first three months of 2012., 69139=Financial information as of March 31, 2012}",
    "textBeforeTable": "   The turnover of Unibail-Rodamco for the first 3 months of 2012 amounted to \u0080431.0 Mn (+0.7% compared to the same period in 2011): 1.       Consolidated turnover    Financial information as of March 31, 2012    Press Release    Paris, Amsterdam, April 26, 2012 *Required fields Message : (You can enter multiple email addresses separated by commas) To* : From* : Name : Last Name : Send by mail: 04/26/2012 | 12:15pm US/Eastern",
    "textAfterTable": "2.       Gross rental income as of March 31, 2012 breaks down into:     Gross Rental Income     in \u0080 Mn 2012-Q1 Year to date 2011-Q1 Year to date Shopping centres                279.3                273.5 France (1)                142.8                137.0 Spain                  36.2                  33.8 Central Europe                  27.8                  25.1 Nordics                  27.1                  33.1 Austria                  26.5                  22.1 Netherlands                  19.0                  22.4 Offices                  44.9                  54.2 France                  36.9                  43.7 Other regions                    8.0                  10.5 Convention Exhibition (France)",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}