{
    "relation": [
        [
            "First Name",
            "Gail",
            "Joann",
            "Carla"
        ],
        [
            "Last Name",
            "Bysiewicz",
            "Lombardo",
            "Curran"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=89186120-3FC3-4914-AD28-83BAC22C8D8C&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226601940,
    "recordOffset": 226593738,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 30656=NOAA oceanic and atmospheric research; and Department of Justice, NSF and NASA issues; H.R. 5326/S.2323, Commerce, Justice, Science, and Related Agencies Appropriations Act, FY2013. Public Law 112-55, Consolidated and Further Continuing Appropriations Act, FY2012., 40956=Issues related to FDA salaries and expenses; and extramural research; S.2375/H.R.5973, Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, FY2013. Public Law 112-55, Consolidated and Further Continuing Appropriations Act, FY2012., 23750=University Transportation Center Program (Reauthorization) S.1953, Research and Innovative Technology Administration Reauthorization Act of 2011. H.R.4348/S.1813, Moving Ahead for Progress in the 21st Century (MAP-21). H.R.7, American Energy and Infrastructure Jobs Act of 2012., 34129=Issues related to CSREES research and education; and Agricultural Research Service-Research activities and buildings and facilities; H.R.5973/S.2375, Agriculture, Rural Development, Food and Drug Administration,and Related Agencies Appropriations Act,FY2013 Public Law 112-55, Consolidated and Further Continuing Appropriations Act, FY2012. S.3240, Agriculture Reform, Food and Jobs Act of 2012., 16851=Issues related to Army RDT&E: H.R.5856, Department of Defense Appropriations, FY2013. H.R.4310/S.3254, National Defense Authorization Act for Fiscal Year 2013. Public Law 112-74, Consolidated Appropriations Act, FY2012., 12236=H.R. 5856, Department of Defense Appropriations, FY2013, Army RDT&E. H.R. 4310/S.3254, National Defense Authorization Act for Fiscal Year 2013, Army RDT&E. S.2375/H.R.5973, Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, FY2013, CSREES research and education; FDA salaries and expenses; and extramural research related issues. S.3295, Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, FY2013, Health research funding and education funding. H.R.5855/S.3216, Department of Homeland Security Appropriations Act, FY2013 Science and technology research funding. Public Law No. 111-148, Patient Protection & Affordable Care Act, Health Care Reform; Hospital Capital issues; Medicare/Medicaid Reimbursement issues. Public Law 112-74, Consolidated Appropriations Act, FY2012, Army RDT&E; Health research funding and education funding; SBA funding issues and Technology incubator funding; DOE research funding; and Science and technology research funding. Public Law 112-55, Consolidated and Further Continuing Appropriations Act, FY2012, Army RDT&E; CSREES research and education; FDA salaries and expenses; extramural research related issues; NOAA oceanic and atmospheric research; and Department of Justice and NASA issues., 20289=S.3295, Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, FY2013, Health research funding and education funding. Public Law 112-74, Consolidated Appropriations Act, FY2012, Academic Health Center funding., 44452=Issues related to University Centers; and Science and technology research funding: H.R.5855/S.3216, Department of Homeland Security Appropriations Act, FY2013. Public Law 112-74, Consolidated Appropriations Act, FY2012.}",
    "textBeforeTable": "",
    "textAfterTable": "State CT Zip Code 06269 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  GAIL BYSIEWICZ  8604865519  gail.garber@uconn.edu 5. Senate ID#  39382-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}