{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "The security is good, there're are security guards in every building. They even have systems in which you have to show your ID to get in the building.",
            "There are a lot of clubs and activities you just have to find them.",
            "People who want to pursue an art career even if you don't know art, this is a good college. It helps you push beyond what you can do. They make you think why you are doing art and teach you things to make you think what you could do for your community.",
            "You could do volunteer work, play in some sport. You can even sign up to go rock climbing,etc. or even go to baseball games when they offer tickets.",
            "They do have food for both the people living in dorms and for those who doesn't. The school even gives you coupons for outside stores for food. In some food stores you could get discounts for just showing your school ID.",
            "They have high hopes for you. The professors help you whenever you need help, you can even send them an email and ask them questions.",
            "If you need more help in financial aid sign up to the HEOP program.even though its hard work they do help you a lot. Always start looking for colleges in an early start. Visit your colleges if you can and ask questions about the school and how it could help you."
        ]
    ],
    "pageTitle": "Parsons The New School for Design Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Parsons-The-New-School-for-Design/reviews?_escaped_fragment_=/show/60186",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906363855,
    "recordOffset": 906326131,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{142233=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/31/2011 Reviewer is A past student here. 13 out of 13 people found this review useful. 1 of 32 Brittany from Boca Raton, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Parsons The New School for Design Reviews Parsons The New School for Design › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Campus Safety The security gaurds are always on campus and I feel extremely safe. There are always signs up warning students of upcoming events that may interfere with our schooling, for example a hurricane was to hit NYC and they emailed us of some safety precautions to be aware of and/or if school were to be cancelled. The communication and awareness at Parsons is always up-to-date and that makes me feel like I can feel safe at school and not have to worry. Greek Life Other than different groups and/or activities there is no real Greek Life but this in one positive aspect offers all of us to come together and to work hard and make the most of our school expierence by involving ourselves with school and a professional career at a New York state of mind. Clubs and Activities Parsons offers many clubs and activities you will never feel alone or bored! They even welcome students to create new groups which inspires new ideas and events. Great for these types of students The fashion dept. is mainly in the NYC fashion district so you are always around that kind of environment. It's central to all of the fabric company's so",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}