{
    "relation": [
        [
            "Defensive Lineman",
            "Clark, Frank",
            "Henry, Willie",
            "Black, Jibreel",
            "Ojemudia, Mario",
            "Wormley, Chris",
            "Washington, Quinton",
            "Heitzman, Keith",
            "Pipkins, Ondre",
            "Godin, Matt",
            "Strobel, Tom",
            "Charlton, Taco",
            "Glasgow, Ryan",
            "Ash, Richard",
            "Totals"
        ],
        [
            "Total Tackles",
            "43",
            "31",
            "27",
            "20",
            "18",
            "14",
            "8",
            "7",
            "3",
            "2",
            "2",
            "1",
            "1",
            "177"
        ],
        [
            "Tackles for Loss",
            "12.5",
            "2.5",
            "7.5",
            "1.5",
            "4.5",
            "0",
            "0.5",
            "0.5",
            "0",
            "0",
            "0.5",
            "0",
            "0",
            "30"
        ],
        [
            "Sacks",
            "5",
            "0",
            "2.5",
            "1.5",
            "2.5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11.5"
        ],
        [
            "Forced Fumbles",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ],
        [
            "Fumble Recoveries",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2"
        ],
        [
            "Interceptions",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Pass Deflections/Blocked Kicks",
            "1",
            "1",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5"
        ],
        [
            "Role/Status",
            "DE Starter",
            "DT Backup",
            "DT Starter",
            "DE Backup",
            "DE Backup",
            "NT Starter",
            "DE Starter",
            "NT Backup",
            "DE Backup",
            "DT Backup",
            "DE Backup",
            "DT Backup",
            "NT Backup",
            "Totals"
        ]
    ],
    "pageTitle": "Michigan Wolverine Football Depth Chart 2013",
    "title": "",
    "url": "http://mwolverine.com/Michigan_Football_Depth_Chart_2013.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 173356655,
    "recordOffset": 173319886,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{265244=Greg Mattison Press Conference on August 16 Al Borges, 15901=Michigan Football Scholarship Summary for 2013, 270746=Brady Hoke on April 2, 169580=Defensive Backfield: Ramon Taylor was the leading tackler on defense with 86, and has the most pass defenses with 13, 4 interceptions and 9 pass break ups. Blake Countess was steady at Nickel; he has the most interceptions of any Wolverine defensive back since 1989 with 6. Thomas Gordon is weak on pass coverage, and our opponents have been successful exploiting this weakness; however, he came away with 3 interceptions, and forced a fumble against Ohio State. Courtney Avery started at Free Safety the last 5 games after Jarrod Wilson started the first 8 games; the two have combined for 79.5 tackles, 2.5 for loss, 2 interceptions, but no pass break ups which is also indicative of weak safety play. Delonte Hollowell, Channing Stribling, and Jourdan Lewis all contributed. Overall, one has to be pleased with the defensive backfield, they had 18 turnovers in 13 games, and 35% of the tackles on defense. We graduate Thomas Gordon and Courtney Avery. We redshirted Ross Douglass and Reon Dawson. In 2014, we return Ramon Taylor and Blake Countess at the corners, but our real problem is at safety; Josh Furman, Jarrod Wilson, Delano Hill, Dymonte Thomas, Jeremy Clark and possibly pledge Jibreel Peppers will compete for playing time there along with backup cornerbacks Jourdan Lewis, Channing Stribling, Delonte Hollowell, and Terry Richardson. We have the pledge of Brandon Watson, and he'll enroll in January to seek early playing time. Unless we get better safety play, even though we have strong cornerbacks, we'll continue to flounder on defense in 2014., 69666=Comments: Jeremy Gallon set Big Ten and Michigan records against Indiana; he had 89 catches for 1373 yards and 9 TDs. Joe Reynolds had 4 catches for 69 yards. At slot, Drew Dileo had 16 catches for 174 yards and a TD. Dennis Norfleet has 5 catches for 37 yards plus 4 runs for 53 yards., 270358=April 6 Practice, 256=2013 Michigan Football Media Guide (Bowl Guide), 7676=Michigan Football Cumulative Statistics for 2013, 112996=Comments: Willie Henry had 31 tackles, 2.5 for loss, and a blocked extra point after moving to start the last 6 games. Senior Quinton Washington lost his starting position after poor performances; he had 15 tackles in 13 games, no tackles for loss or sacks. Iron Man Quinton Washington. Ondre \"Pee Wee\" Pipkins suffered a torn ACL in the Minnesota game and had surgery; he had 7 tackles, 0.5 for loss. Richard Ash was 3rd string, and has contributed with 3 tackles. Bryan Mone will be competing in 2014. Pipkins Losing Weight, 271026=Brady Hoke on March 28, 271269=Michigan Drill on March 21, 16558=Michigan Football Recruits for 2014, 271120=Greg Mattison Al Borges on March 27, 130731=Defensive Line: Overall, this group is weaker than in 2012 with little pass rush, and penetration at the line of scrimmage. It is the weakest defensive group of the three. Hoke and Mattison had their strongest defensive line in 2011; it was weaker in 2012, and even weaker in 2013. We are so weak, we've replaced our Strong Side Defensive End with an additional linebacker, Brennan Beyer, so we are really a 3-4 defense now. We do a poor job of sealing both edges with our defensive ends and outside linebackers, and our opponents exploit that weakness. We also do a poor job of stopping short runs in the middle with our undersized linemen. Frosh Hurst and Poggi redshirted, but they apparently impressed during Bowl practices. We graduate Jibreel Black and Quinton Washington. In 2014, our starters will most likely be Frank Clark, Willie Henry, Ondre Pipkins with Taco Charlton, Mario Ojemudia and Brennan Beyer battling for the defensive end position. We had pledged Lawrence Marshall, Bryan Mone, and Brady Pallante. Mone will compete at Nose Tackle, and could start or backup Pipkins depending on his ACL recovery. Marshall will be hard-pressed to unseat the incumbents Clark, Ojemudia, and Charlton at defensive end so look for him to redshirt. This is our weak link on defense without much prospect for great improvement in 2014., 146968=James Ross was the leading tackler for the linebackers with 85 tackles in 12 games, but he didn't play against Ohio and didn't start the Bowl game. Desmond Morgan, Jake Ryan, Cam Gordon and Ben Gedeon all contributed in a 3-4 defense. Unfortunately, neither Ryan nor Beyer could \"hold the edge\" against most of our opponents as outside linebacker/defensive ends. This group also missed many tackles inside; if one is honest, this group must be assessed as \"mediocre\" for the 2013 season. This group forced 7 turnovers which was significantly less than the defensive backs who forced 18 turnovers. McCray redshirted. We lose Cam Gordon, and have pledge 4 new linebackers with Michael Ferns, Noah Furbush, Jared Wangler, and Chase Winovich. Ferns enrolls in January so he'll practice in the Spring. Look for this group to be better in 2014 with Morgan, Ross and Ryan starting, and Bolden, Gedeon, Gant, and McCray backing them up unless Ferns impresses in Spring drills., 247784=Depth Chart 2012, 12489=Freshman who played in 2013 (14) include: Kyle Bosch, Jake Butt, Taco Charlton, Ben Gedeon, Derrick Green, Delano Hill, DeMario Jones, Jourdan Lewis, Shane Morris, Ross Douglas, DeVeon Smith, Channing Stribling, Dymonte Thomas, and C'sonte York, 92745=Comments: Taylor Lewan started 13 games at Left Tackle; he was moved to Right Tackle and Tight End in different blocking schemes. Schofield moved over when Lewan was hurt against Penn State. Ben Braden is listed on the depth chart as the backup, and is now backing up both tackle positions with Magnuson starting at left guard. Magnuson may be the starter in 2014 at Left Tackle., 117274=Comments: Senior Jibreel Black had 27 tackles, 7.5 for loss, 2.5 sacks, 2 tipped passes, and a forced fumble; he had 3 quarterback hits. Again, little penetration at this position, but Black's big sack against Northwestern in the 3rd overtime helped to seal the win. Walk-on Ryan Glasgow won the backup position and has contributed 2 tackles. Chris Wormley moved in to help with Willie Henry moving to Nose Tackle; Wormley contributed 18 tackles, 4.5 for loss with 2.5 sacks. Tom Strobel didn't make the final travel team to Iowa although he made the other travel teams. Both Henry Poggi and Maurice Hurst redshirted, and will compete in 2014., 265534=Sunday, Aug. 11 (2-3:30 p.m.)Youth Day Video (Michigan Stadium) Ann Arbor.com Detroit News Media Day, 264780=Brady Hoke Press Conference on August 20, 35949=Comments: Devin Gardner took Tom Harmon's Jersey #98. He set a school record in passing yards and total offense. He was 208 of 345 for 2960 yards, 21 TDs and 11 Interceptions (2 for TDs). He ran for 483 yards on 165 carries for 11 TDs, a 2 point conversion, and 4 fumble giveaways. Gardner ranked 32nd in the nation in passing efficiency, #3 in the Big Ten. Although he is our top offensive player; he was guilty of 17 turnovers, that also led the Big Ten. His efficiency rating was 146.07. His medical redshirt was granted so he will be eligible in 2014. Gardner Interview Morris Interview Shane Morris earned the backup position, and was 5 of 9 with one interception. Morris may start the Kansas State game due to Gardner's Turf Toe Injury. Wilton Speight enrolls in January to compete which will give Michigan four quarterbacks in the Spring: Gardner, Morris, Bellomy and Speight for 2014., 15350=Developing Michigan Football Depth Chart for 2014, 238996=Michigan Football Schedule-2013, 265428=Brady Hoke Press Conference on August 14, 271367=Hoke Press Conference on March 19, 266087=Greg Mattison Press Conference on August 7 Al Borges, 245866=Wisconsin and Purdue have new head coaches. One may conclude that Michigan and Northwestern have been disappointments in the Legends Division with Michigan State, Iowa, and Minnesota as the most improved teams with the coaching of Dantonio, Ferentz, and Kill. Michigan wants to run the football like Wisconsin, and play defense like Michigan State; hopefully, they will improve for the 2014 season., 265953=Brady Hoke Press Conference on August 8, 154766=Comments: Ramon Taylor was the leading tackler on defense with 86 tackles, 1.5 for loss, 0.5 sack, 9 pass break ups, and 4 interceptions. Taylor thinks he's good enough to go \"Pro\" so he is exploring his options for the May draft. Delonte Hollowell played well in the Notre Dame game with 2 tackles., 267138=Brady Hoke Press Conference on July 24, 264474=Greg Mattison Press Conference on August 21 Al Borges, 247926=Depth Chart 2011, 249976=Depth Chart 2001, 32075=Players who contributed in 2013, 247347=Michigan Football Recruits for 2014, 101=MICHIGAN FOOTBALL DEVELOPING DEPTH CHART 2013, 266241=Brady Hoke Press Conference on August 5, 269767=Greg Mattison Press Conference on April 15 Al Borges, 269094=Hagerup off Roster for 2013, but may compete in 2014, 268859=Michigan Football Fantasy Camp Raised $140,000 for Prostrate Cancer Research on June 6-7, 220672=Comments: Matt Wile had 61 punts for a 40.6 yard average, 12 fair catches, 2 touchbacks, and 16 downed inside the 20. Kenny Allen had one punt for 51 yards. Our net punting ranked 53rd nationally, and 7th in the Big Ten. Hagerup is off the team in 2013, but may compete in 2014., 64963=Comments: Devin Funchess moved to wide receiver; he had 47 catches for 727 yards and 6 TDs. Jehu Chesson had 15 catches for 221 yards and a TD. Jeremy Jackson had 5 catches for 53 yards. C'sonte York saw action against CMU, but redshirted along with Jaron Dukes. Amara Darboh was out for the season with foot surgery, and redshirted with 3 years of eligibility remaining, 2014-2016., 248149=Depth Chart 2010, 270446=Greg Mattison Al Borges and Spring Practice on April 4, 1441=Michigan Football Travel Team for 2013, 14186=Inside Michigan to Premier on August 26 Episode 1 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 9 Episode 10 & 11 Episode 12 Episode 13 Episode 14 Episode 15, 269933=Spring Scrimmage Highlights The Entire Spring Scrimmage on April 13, 51310=Our offense was potent, but inconsistent in 2013. We lose our best receiver in Darboh, and our team MVP was Gallon for 2014. We return Gardner, Green, Kerridge, Funchess, Chesson, and Butt along with Redshirts Amara Darboh, Csonte York, Jaron Dukes, and Khalid Hill. Freddy Canteen and Drake Harris are enrolling in January, and both should contribute as true Frosh in 2014. Ian Bunting has pledged at Tight End, and Maurice Ways at Wide Receiver. We've got to be a better offense in 2014, more consistent with fewer negative plays and a better rushing offense if we are to be successful., 266392=Saturday, Aug. 3: Freshmen report, Sunday, Aug. 4 Veterans report, Monday, Aug. 5 First day of practice, Friday, Aug. 9 First practice in pads, 264629=Darboh to miss 2013 season with foot surgery, 605=Gallon, Schofield to play in East-West Shrine Game on January 18, 93677=Offensive line is amongst the poorest in Wolverine history. We ranked 123rd nationally, and 12th of 12 teams in the Big Ten in tackles for loss allowed. We ranked 99th in the nation, and 11th in the Big Ten in rushing offense. Five Freshman redshirted. We lose Lewan and Schofield, and expect Magnuson to replace Lewan at Left Tackle, and Ben Braden to replace Schofield at Right Tackle with Bosch starting at Left Guard. Chris Bryant and Blake Bars could also be factors. Redshirts David Dawson, Christopher Fox, Patrick Kugler, Dan Samuelson, and Logan Tulley-Tillman will all be competing in 2014. Mason Cole is enrolling in January to compete for playing time along with Juwan Bushell-Beatty in June.}",
    "lastModified": "Sat, 16 Aug 2014 18:32:57 GMT",
    "textBeforeTable": "Michigan Football Cumulative Statistics for 2013 Big Ten Football Statistics NCAA Football Statistics for Michigan n/a n/a Time of Possession 6th 35th 10th 93rd Red Zone 6th 42nd 8th 53rd 3rd Down Conversions 10th 72nd 7th 48th First Downs 7th 61st 9th 91st Tackles for Loss 12th 121st n/a n/a Sacks Allowed 10th 105th 7th 67th Sacks n/a n/a 2nd 22nd Turnover Margin/Turnovers Gained 3rd 35th 6th 52nd Pass Efficiency 4th 38th 8th 66th Scoring 5th 46th 6th 42nd Total 10th 86th 8th 63rd Passing 4th 50th 5th 31st Rushing 11th 102nd Big Ten",
    "textAfterTable": "RG Kalis Bars C G.Glasgow Miller   LG Magnuson Bosch Bryant Cole LT Lewan Schofield Braden Bushell-Beatty Game-2013 Rushing Passing Total First Downs 3rd/4th Down Red Zone Red Zone Points Total Points Plays Possession Turnovers Sacks Allowed Punts Blocked Punts Central Michigan 242 221 463 22 12 of 17 7 45 59 68 34:16:00 3 1 1 0 Notre Dame 166 194 460 25 6 of 12 4 28 41 72 34:04:00 1 1 3 0 Akron 177 248 425 19 3 of 10 3 7 28 62",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}