{
    "relation": [
        [
            "Release",
            "15.5(1)T",
            "Cisco IOS XE Release 3.14S"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS XE Release 3.14S."
        ]
    ],
    "pageTitle": "Cisco IOS IP Routing: LISP Command Reference - LISP Clear Commands [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_lisp/command/ip-lisp-cr-book/lisp-clear-cmds.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370578291,
    "recordOffset": 370556265,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27575=The following example shows how to display all LISP map-cache entries and then clear the LISP map cache for the IPv4 EID prefix 172.16.10.0/24.}",
    "textBeforeTable": "Syntax Description [ EID-prefix/prefix-length ] map-cache lisp ip clear To clear the Locator/ID Separation Protocol (LISP) map cache, use the clear ip lisp map-cache command in privilege EXEC mode. clear ip lisp map-cache clear lisp vrf clear lisp site clear lisp ddt clear ipv6 lisp route-import clear ipv6 lisp statistics clear ipv6 lisp map-cache clear ip lisp statistics clear ip lisp route-import clear ip lisp map-cache LISP Clear Commands clear lisp vrf clear lisp site clear lisp ddt clear ipv6 lisp route-import clear ipv6 lisp statistics clear ipv6 lisp map-cache clear ip lisp statistics clear ip lisp route-import clear ip lisp map-cache LISP Clear Commands Contents LISP Clear Commands",
    "textAfterTable": "Command History Release Modification 15.1(1)XB This command was introduced. Cisco IOS XE Release XA This command was integrated into Cisco IOS XE Release 2.5.1XA. Cisco IOS XE Release 3.3.0S This command was integrated into Cisco IOS XE Release 3.3.0S. 15.1(4)M This command was integrated into Cisco IOS Release15.1(4)M. Usage Guidelines The clear ip lisp map-cache command removes all IPv4 dynamic LISP map-cache entries stored by the router. When an optional IPv4 EID prefix is added to the command, only that IPv4 EID prefix is cleared from the LISP map-cache. Examples The following example shows how to display all LISP map-cache entries and then clear the LISP map cache for the IPv4 EID prefix 172.16.10.0/24.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}