{
    "relation": [
        [
            "Workload",
            "Hearings Pending",
            "Hearings Requests Received",
            "Hearings Requests Consolidated After Initial Processing[13]",
            "Total Workload",
            "Hearings Resolved",
            "Hearings Carried into next fiscal year"
        ],
        [
            "FY 2005 (Actual)",
            "6,153",
            "10,266",
            "(302)",
            "16,117",
            "10,221",
            "5,896"
        ],
        [
            "FY 2006 (Estimate)",
            "5,896",
            "10,266",
            "(302)",
            "15,860",
            "10,640",
            "5,220"
        ],
        [
            "FY 2007 (Estimate)",
            "5,220",
            "10,266",
            "(302)",
            "15,184",
            "10,321",
            "4,863"
        ]
    ],
    "pageTitle": "2007 Budget",
    "title": "Table 7: Hearings Workload Projections",
    "url": "http://www.eeoc.gov/eeoc/plan/archives/budgets/2007budget/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432411411,
    "recordOffset": 432351551,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20545=In fiscal year 2007, we will continue efforts to reposition the EEOC to better meet the demands and challenges of this century. As part of those efforts, we will complete the evaluation of the NCC two-year pilot. We will continue to: streamline functions and processes; strategically align and redeploy staff; and build upon efforts to meet the standards of the PMA., 3016=2. FY 2007 Pay Raise, 3282=Provides for annualization of the FY 2006 pay raise of an estimated 3.1% that is effective January 2006., 23132=In fiscal year 2007, we will sustain several key outreach initiatives, as part of our proactive prevention efforts. Our outreach initiatives include the Race and Color Initiative, Small and Mid-sized Employer Initiative, Youth@Work Initiative, the Education, Technical Assistance and Training Revolving Fund, and the President's New Freedom Initiative. In addition, in fiscal year 2005, we inaugurated the agency’s first-ever Freedom to Compete Award program to recognize best practices in the private sector, public sector, associations and other organizations. We have engaged in outreach efforts with the award-winners to introduce these practices to other businesses, government entities, or other groups, and adapt them to improve their own workplace practices., 3360=1. Annualization of FY 2006 Compensation and Benefits, 16299=FY 2006 Estimate, 26989=This fiscal year 2007 performance budget request integrates with our Strategic Plan and continues our long-held standard of providing quality service to the public through enforcement and prevention. Our enforcement efforts are captured under Strategic Objective 1, Justice and Opportunity. Prevention activities are discussed in Strategic Objective 2, Inclusive Workplace. Our third Strategic Objective, Organizational Excellence, articulates efforts to improve the agency’s capacity and infrastructure to achieve greater enforcement and prevention results., 30622=Table 2: FY 2007 Budget Request Summary for Justice and Opportunity, 18877=The structure of the performance budget for fiscal year 2007 is based on our Strategic Plan for Fiscal Years 2004-2009, which was implemented on October 1, 2003. This performance budget integrates our strategic objectives, the EEOC's operational Five-Point Plan, the President's Management Agenda, and our program operations. In fiscal year 2006, we will undertake the required three year review of our Strategic Plan and update it as appropriate. It will be effective on October 1, 2006, for fiscal year 2007., 10411=Table 1 below displays the EEOC’s total agency staffing and funding profile by Strategic Objective and programs for fiscal years 2005 through 2007., 21385=Consistent with the President’s Management Agenda (PMA), we have undertaken efforts to examine our operations and pursue strategies that make for a more customer-centered and results-driven agency. To this end, the agency undertook a comprehensive review of its operations and structure, and devised a three-phase approach to repositioning the Commission. The first phase was establishing a National Contact Center (NCC) pilot. The second phase is repositioning the agency’s field structure for improved customer service and efficiency. The third phase is streamlining EEOC’s headquarters. We have established a NCC pilot; began implementing the approved plan to reposition the field structure January 1, 2006; and examined the headquarters' structure and operations to streamline functions and clarify roles and responsibilities., 2971=Provides 2.2% pay raise, including locality pay and general pay raise, effective January 2007 for three-quarters of the fiscal year plus benefits consistent with Administration policy., 16374=FY 2005 Actual, 23832=Also, our Management Directive (MD)-715 provides for the Commission to be a proactive partner with federal agencies by assisting in identifying barriers in the workplace; providing agencies with guidance and information on best practices and recommendations for eliminating barriers; and creating a culture that promotes an inclusive workforce. On January 31, 2005, Federal agencies started submitting the first MD-715 progress reports and action plans, which we are now reviewing and discussing with those agencies., 16222=FY 2007 Request, 17622=Our overall strategic framework also guides our results-based performance measures from fiscal year 2004 through fiscal year 2009. These inter-relationships are illustrated in the three tables on the following pages. Specific performance measures, and the annual targets to achieve results during fiscal year 2007, are discussed under the appropriate Strategic Objective for each program area., 27297=The U.S. Equal Employment Opportunity Commission (EEOC) is requesting a budget of $322,807,000 for fiscal year 2007. This request represents a decrease of $4.2 million from the fiscal year 2006 level. The fiscal year 2007 request will allow EEOC to maintain its enforcement and outreach activities., 19520=The lease for EEOC’s headquarters located at 1801 L Street, NW, Washington, DC, expires in July 2008, and it will be necessary to fund either relocation or significant remodeling of the current space in fiscal year 2007. The future space requirements are approximately 20% less than current requirements. Costs will include planning, project management, design, construction, furniture, and telecommunications., 31882=FEBRUARY 2006, 1272=For necessary expenses of the Equal Employment Opportunity Commission as authorized by title VII of the Civil Rights Act of the 1964 (29 U.S.C. 206(d) and 621-634), the Americans with Disabilities Act of 1990, and the Civil Rights Act of 1991, including services as authorized by 5 U.S.C. 3109; hire of passenger motor vehicles as authorized by 31 U.S.C. 1343(b); non-monetary awards to private citizens; and not to exceed $28,000,000 for payments to the State and local enforcement agencies for services to the Commission pursuant to title VII of the Civil Rights Act of 1964, sections 6 and 14 of the Age Discrimination in Employment Act, the Americans with Disabilities Act of 1990, and the Civil Rights Act of 1991, $322,807,000: Provided, That the Commission is authorized to make available for official reception and representation expenses not to exceed $2,500 from available funds: Provided further, That the Chair is authorized to accept and use any gift or donation to carry out the work of the Commission. (Science, State, Justice, Commerce, and Related Agencies Appropriations Act, 2006, Reported in House, (H.R. 2862)), 11602=FY 2007 includes $13,500,000 for Information Technology, which is highlighted under this Objective.}",
    "TableContextTimeStampAfterTable": "{18992=Starting in fiscal year 2006, however, we will revise the current methodology for calculating the achievement of our targets and final goal for this measure. The formula will mirror the way we measure the timeliness of our private sector charge resolutions, calculating all appellate cases regardless of the fiscal year they were filed, rather than just cases filed and closed within the fiscal year being measured., 45644=As part of our efforts during fiscal year 2006 to update the agency’s Strategic Plan, we will also revisit the targets for this measure., 163617=In fiscal year 2004, a cross-organizational group of agency employees designed a cost accounting approach to better intergrate budget and performance and to improve financial management through the collection, allocation and reporting of program costs. The cost accounting framework outlines major program elements to which employees allocate their time, allowing the agency to assess the cost of its programs for effective management of resources and operations. In fiscal year 2005, we conducted a mid-year review to assess how the system is working. We made a few adjustments, based on this review., 159248=EEOC has engaged in several key steps toward having the human capital initiative fully implemented. A human capital strategic plan was drafted in fiscal year 2004 and used by Human Resources to guide its efforts. A cross-functional team began making that draft an agency-wide strategic plan that would ultimately involve all of the agency’s major offices in fiscal year 2005. The performance management system was revised to strengthen the link to the agency’s mission and goals first for executives, and then for managers. In fiscal year 2005 a performance management system was under development for non-supervisors as well. Development and continuity of leadership was being addressed by the agency’s Management Development Institute, an umbrella program addressing managerial needs from new supervisors to executives. A workforce planning report examined historical staffing trends and agency output, and set the stage for better projection and management of staffing for future. Accountability was strengthened through adoption of benchmarking and monitoring for Human Resource procedural systems, and plans were made both to involve line managers in determining human capital management needs, as well as educating them in the use of human capital systems in the management of the workforce. Processes themselves have been undergoing audit and revision. The agency participated in the 2004 Federal Human Capital Survey, with a 67% response rate. Plans had been developed for results feedback and action planning once the results became available., 13147=This measure builds on our steady success in recent years in reducing the average time to process private sector charges. Although the fiscal year 2009 goal is to resolve 75% of the private sector charges within 180 days or fewer, we did not meet our fiscal year 2005 target of 70%. The agency resolved 65.9% of the private sector charges within 180 days or fewer, 51,060 charges out of 77,441 total resolutions., 22228=Using this methodology, the agency established a baseline value for this measure of 88.5% to indicate the quality of our charge processing. For fiscal year 2006, we will approximate this rate to improve the collection of the data. In subsequent years, we will increase the target values by one percentage point each year towards the achievement of our final goal of 90% by fiscal year 2009., 149537=We are maintaining our interim target for fiscal year 2006 to convert 3% of our files, because our earlier efforts to implement the DMS will enable us accomplish this target. Agency resource priorities for fiscal year 2007 require current adjustments to our targets in fiscal years 2007 and 2008, as well as our final goal for fiscal year 2009. We hope to have future opportunities to initiate those activities that will be necessary to fully implement the DMS system and convert our agency files to electronic format; however, we also will reassess this measure when we review and update our Strategic Plan during fiscal year 2006., 49041=During fiscal years 2006 and 2007, we will continue to improve the quality of the data we collect for measuring the effects of our designated high impact litigation cases (and other cases we identify), and to develop approaches for improving our efforts to achieve greater results. We will begin to analyze the information and determine the extent of impact in specific workplaces, geographical areas, or industries, and assess whether these cases, along with our targeted outreach and publicity efforts, resulted in any positive changes in the workplace. The identified cases and the collection and analysis of data will assist us with the Program Evaluation of our litigation program in fiscal year 2008., 127962=Our Strategic Plan for fiscal years 2004-2009 links our broad Strategic objectives to the agency’s Five-Point Plan. Strategic Objective 3, Organizational Excellence, relates to one element of our Five-Point Plan – EEOC as a Model Workplace. It also identifies our long-term goals to achieve results in this area., 191042=The RESOLVE Program is EEOC’s internal ADR program launched in fiscal year 2003. The program is another component of our efforts to become a model workplace. We decided that one aspect of its success would be the willingness of employees to participate in the program again. We established a goal for our first full year at 30%, with our intention to reach a final goal of 80% by fiscal year 2009. We are altering the targets and goals for this measure because of the unprecedented success we have achieved. The text change increases the targets and final goal expected for this measure. We consider the change to be a minor alteration to our Strategic Plan because it does not substantively revise the intention of the measure., 36333=1.2.4 By FY 2009, increase the percentage of federal employees who participate in ADR during the pre-complaint stage of the EEO process to 50% or higher., 195636=[11] Includes $788,322 of the $927,438 fiscal year 2006 rescission (PL-109-108) and $2,807,555 of the $3,303,006 fiscal year 2006 rescission (PL-109-148), 29824=Again, since most mediation agreements focus on individual relief that is mutually agreed to by both the charging party and the respondent, the percentage of agreements that involve broader improvements to the workplace will always be relatively small. Given this limitation, we have established meaningful targets and a final goal for fiscal years 2006 through 2009 for obtaining mediation agreements that include the types of workplace changes reflected by this measure. Even moderate percentage changes in target values can indicate increases in the number of mediation agreements obtained or the number of individuals benefited from year to year. Since the agency only began collecting this type of data in fiscal year 2005, we anticipate that the overall percentage of these types of resolutions will not increase during fiscal year 2006. For fiscal years 2007 through 2009, we will increase the target by one-half a percentage point each year to reach a projected final goal in fiscal year 2009 of 4.6%. As an illustration, if the total number of mediation agreements remains the same at 5,772, the final goal represents approximately 266 mediation agreements containing provisions that result in improvements in an organization’s policies, practices or procedures. This represents 95 mediation agreements more than the 171 in fiscal year 2005 and could reflect an impact on over 297,000 additional employees in these affected organizations., 39852=1.3.1 Of all of the private sector charge resolutions where EEOC is a party, except for ADR/mediation resolutions, by FY 2009, 19.0% of them will result in improvements to an organization’s employment policies, practices or procedures., 107328=In fiscal year 2005, the Commission expanded its partnership to include twelve federal agencies in a Relationship Management project to explore new ways for our federal sector staff to interact with agencies to ensure that we can assist agencies in creating more effective EEO programs. Applying the strategies and tools developed from the experiences of the relationship management project, we will be in a position to better establish a customer-oriented organization which can deliver relevant information and solutions to federal agencies’ leadership., 15091=1.1.2 By FY 2009, ensure that at least 50% of federal sector hearings will be resolved in 180 days or fewer., 27939=In fiscal year 2005, EEOC resolved 5,572 charges of discrimination using mediation. Mediation agreements generally involve relief only for the individual who made the allegations of discrimination. Relief can include an individual receiving a position previously denied, back pay awarded to a person to correct for lost wages, or various other forms of monetary or non-monetary compensation., 138731=In fiscal year 2005, the agency received an unqualified opinion on its financial statements., 83196=During fiscal year 2005, we continued to provide training and technical assistance to agencies in the implementation of MD-715. During the year, we have also expanded our partnership with selected federal agencies in the Relationship Management project to explore new ways for our federal sector staff to interact with agencies to ensure that we can assist agencies in creating more effective EEO programs. Applying the strategies and tools developed from the experiences of the relationship management project, we will be in a position to better establish a customer-oriented organization which can deliver relevant information and solutions to federal agencies’ leadership., 25280=As we revise our Strategic Plan during fiscal year 2006, we will simultaneously continue to review the survey information and possible targets for fiscal years 2006 through 2009. A critical component of our review will be determining a survey methodology to use in subsequent years to identify yearly targets and a final goal for this measure., 76745=Table 7 - below shows the overall hearing inventory for fiscal years 2005 through 2007., 161424=In fiscal year 2005 EEOC received an unqualified opinion on its financial statements. During fiscal year 2005, EEOC began using an off-the-shelf software product to prepare the financial statements. This software imports data directly from the financial management system eliminating the need for data entry by the EEOC staff. This method of preparing financial statements helped us to correct a fiscal year 2004 reportable condition related to the financial reporting process. For fiscal year 2007, the biggest challenge is to replace our obsolete financial system and implement the e-travel service requirement., 110668=The one- and two-day Technical Assistance Program Seminars provided by the Training Institute are responsive to employer requests for information and training and allow EEOC to educate substantially more employers and employees about how to identify, prevent and eliminate workplace discrimination. During fiscal year 2004, 49 TAPS were conducted throughout the U.S. with more than 6,300 paid participants. In fiscal year 2005, 41 TAPS were conducted reaching more than 5,200 attendees. For fiscal year 2006, the number of TAPS may vary depending on adoption of recommendations from the field directors' advisory group., 96337=FY 2009, 178403=On July 26, 1990, the Americans with Disabilities Act (ADA) became law. The ADA became effective on July 26, 1992, for employers with 25 or more employees and on July 26, 1994, for employers with 15 or more employees. This legislation provides a clear and comprehensive national mandate the elimination of discrimination against individuals with disabilities. EEOC is responsible for ensuring compliance with Title I of this statute (the law's provisions prohibiting employment discrimination) by receiving and investigating charges of disability discrimination. At the conclusion of EEOC’s investigation, the agency issues a determination of reasonable cause or dismisses the charge (no cause). If EEOC has found cause and is unable to achieve compliance through conciliation, EEOC may file a lawsuit. If the case involves a state or local government, the Commission will refer it to the Attorney General who may file suit in federal court., 153297=On July 8, 2005, the Commission voted 3-1 to approve a plan to reposition the EEOC’s field structure to enhance the agency’s presence, improve customer service and public access, and increase efficiency. The plan reduces the number of managers and administrators, and increases front-line staff doing investigations, mediations and litigation-delivering a more streamlined and efficient structure for greater customer service. Also, under the plan, every current employee will have a job, no offices will be closed, and two new offices will open. The realigned structure is designed to enhance service levels by placing more employees on the front line to perform mission critical functions. We began the implementation of the field repositioning plan on January 1, 2006, so that we can begin to reap the results sought., 189421=The Strategic Plan indicates for Measure 1.2.1. that the agency would conduct a Program Evaluation in fiscal year 2005 to assess the private sector mediation/ADR program. Because of the changed program evaluation schedule (item E above), the agency decided to assess this program using an alternative method with data it began to collect in fiscal year 2005 from its investigative charge files and coded into the agency-wide charge database. Using this data, it established target levels for fiscal year 2005 through 2008 and a final goal for fiscal year 2009 for this measure. The language of the measure was revised to express the results expected with this alternative approach using language similar to the format used for many of our other measures. Even though we changed the text of this measure, we consider these changes as minor alterations to our Strategic Plan because this alternative approach is consistent with our original intention to evaluate the private sector mediation/ADR program., 183640=Revised performance measure: By fiscal year 2009, ensure that at least 70% of will federal sector appeals be resolved in 180 days or fewer., 109514=The Revolving Fund, operating as the “the EEOC Training Institute” beginning in fiscal year 2004, has transitioned into a competitive EEO educational services provider offering diverse, high quality, reasonably-priced EEO expertise and training products. In fiscal year 2005, it offered five product/service lines: Technical Assistance Program Seminars (TAPS), EXCEL – a national federal sector conference, Customer Specific Training (CST), national courses, and direct sale of training products such as books, CD-ROMs and curricula modules. During fiscal year 2005, the Training Institute began a review of its long-term Business Plan and an advisory group of field directors was invited to examine the current product/service line offerings and make recommendations on changing the overall product mix or adding new products. Fiscal year 2006 will be a transition year where the Training Institute will examine these recommendations and its overall product/service offerings. Therefore, the number of some products, like the Technical Assistance Program Seminars, could be reduced and others, like Customer Specific Training, may be expanded., 174824=Initiate FY 2008, 48380=In early fiscal year 2005, we developed an approach to obtain more detailed information to help us measure the effects of our high impact litigation and to measure “changes in workforce status” occurring as a result of our litigation program. The methodology is cost-effective in that it utilizes data collected from the agency’s charge/case database, the Integrated Mission System (IMS). Now, instead of using the database to capture only monetary and non-monetary benefits achieved on behalf of specific individuals, we modified the system to track a broader form of relief on the kind of workforce-wide impact, if any, a resolved lawsuit will have., 47523=This measure will assess our high impact litigation, and the subsequent publicity that results from that litigation, and how those cases affect workplaces through a program evaluation in fiscal year 2008. In fiscal year 2004, we defined the case types that constitute our “high impact litigation” and how we will measure any “change in workforce status.” Based on our criteria, we identified three High Impact Litigation cases resolved in fiscal year 2004: EEOC v. Morgan Stanley, EEOC v. Heartway (which is now on appeal to the 10th Circuit), and EEOC v. Milgard Manufacturing. We identified an additional five High Impact Litigation cases resolved in fiscal year 2005: EEOC v. Abercrombie & Fitch Stores, Inc., EEOC v. Northwest Airlines, Inc., EEOC v. Ford Motor Co. and U.A.W., EEOC v. Dial Corp., and EEOC v. EchoStar Communications Corp., 26340=1.2.1. Of all of the private sector mediation/ADR resolutions, by FY 2009 4.6% of them will result in improvements to an organization’s employment policies, practices or procedures., 76188=We intend to achieve our goals for hearings by using coordinated initiatives we began in fiscal year 2004 to provide substantive and operational support and oversight towards the resolution of hearings cases to help prepare decisions more expeditiously. Federal sector appellate legal tools will be made available to assist administrative judges in processing hearings efficiently by making available fully researched and computerized legal language for inclusion in findings and decisions and fully-searchable past decisions on our Intranet site., 143062=For a number of reasons, the results for this measure can vary widely at any time. The percentage of cases for each type of closure may vary from year to year. In fiscal year 2004, 47% of all closures were withdrawals or settlements; that number decreased to only 38% in fiscal year 2005. Generally, the average processing time for withdrawals and settlements is lower than for cases in which a Final Decision is issued on the merits. Likewise, cases that proceed to the hearings stage are likely to have longer processing times than those that do not. The percentage of closures in 2004 that resulted from a complaint that proceeded to the hearing stage was 22% but increased to 30% during fiscal year 2005., 98628=2.1.3. By FY 2009, increase the percent of individuals demonstrating an awareness of their equal employment opportunity rights and responsibilities by [TBD*]%., 32577=The targets and final goal for this measure are percentage increases above the fiscal year 2003 baseline level of 13,177 charges in which employers agreed to participate in the EEOC mediation program. The fiscal year 2005 target was to increase the number of such charges in which an employer agrees to mediate by 8.5%, or to 14,297. The fiscal year 2005 result was 12,527 employers who agreed to mediate, which falls below our target. For fiscal year 2006, we have a final goal to increase the acceptance rate over the baseline by 20%. Although we will continue our efforts to try to increase the acceptance level, including some of the activities we engaged in during fiscal year 2005, it will be a challenge to achieve the goal by the end of fiscal year 2006., 138938=3.1.5 BY 2006, successfully implement the federal sector Model EEO program., 55413=Chart 1: Private Sector Charges Pending Inventory for Fiscal Years 2004 through 2007, 157734=Our roadmap to achieving our principles and standards under Strategic Objective 3, Organizational Excellence, includes implementing the President’s Management Agenda (PMA). The PMA identifies five areas that require improvement throughout the federal government. The five-part agenda is an integrated set of management reforms designed to create a government that is more results-oriented, customer-focused and market-based. Since fiscal year 2003 the agency’s Inspector General has rated the agency in all areas. The ultimate goal for EEOC is to achieve a green rating on the scorecard in all categories. EEOC’s efforts to date to achieve green in each PMA area are discussed below., 106141=The Commission has championed an approach toward creating a barrier-free, level playing field throughout the federal government. This approach is captured in Management Directive (MD) 715. MD-715 is the roadmap for agencies to identify and remove barriers to equality of employment opportunity so that the American people can have a model Federal work force which fully reflects everyone’s contributions. With the resources requested for fiscal year 2007, our Federal sector program will be able to effectively monitor the more than 200 agency plans required to be submitted annually to the Commission by federal agencies as part of their efforts to identify and eliminate barriers to equal employment opportunity., 17142=1.1.3 By FY 2009, ensure that at least 70% of federal sector appeals will be resolved in 180 days or fewer., 23389=Set target values for FY 2005-2009, 142226=This measure captures the average processing time for all internal EEO complaints from the filing date to the closure date. This includes complaints that were settled during the formal stage, withdrawn from the process, closed by a Final Decision without an Administrative Judge, and closed by a Final Action, after an Administrative Judge issues a decision. The benchmark for this measure was set at 510 days based on the average processing time for closures in fiscal year 2003., 37461=This measure supports the proposition that resolving complaints at Federal agencies at the earliest possible stage in the EEO (equal employment opportunity) process improves the workforce environment and curtails actions that could take substantially longer to resolve and would use valuable Federal agency and EEOC resources. EEOC did not receive data from Federal agencies for fiscal year 2004 until the second quarter of fiscal year 2005. Consequently, we now can report that we exceeded the fiscal year 2004 target by a substantial amount. Due to lag time in reporting, the fiscal year 2005 result for this measure will be reported in fiscal year 2006., 195096=[7] Includes fiscal year 2005 rescission of $4,424,147 (PL-108-447), 31281=As part of our efforts during fiscal year 2006 to update the agency’s Strategic Plan we will also revisit the targets for this measure., 169264=An EEOC contractor initiated the program evaluation of our private sector charge process at the end of fiscal year 2004. Early on, the contractor engaged in an extensive activity to identify several key areas on which to focus the evaluation. The charge process covers a wide range of activities including inquiries from the public, preparing charges of discrimination, mediating charges, investigating charges, making findings about the merits of charges, and attempting to settle charges. Focusing on a few key areas for the agency would enable the contractor to conduct the evaluation within the fiscal year and the resources available. The contractor discussed the charge process in a focus group format with over 100 EEOC employees, including staff and senior leadership., 129579=3.1.1. By FY 2009, customers rate their confidence in EEOC’s services at [TBD*]% or higher., 49862=1.3.3 The success rate of EEOC’s lawsuits is 90% or higher for the period ending in FY 2009., 194621=[4] Includes fiscal year 2006 rescission of $927,438 (PL-109-108) and $3,303,006 (PL-109-148), 175014=The Equal Employment Opportunity Commission was established by Title VII of the Civil Rights Act of 1964 (78 Stat. 253, 42 U.S.C. 2000e et seq.) as amended, (Title VII) and became operational on July 2, 1965. The Commission has five members, no more than three of whom shall be of the same political party. The members are appointed by the President, by and with the consent of the Senate for rotating five-year terms. The President designates one member to serve as Chairman and one member to serve as Vice Chairman. The General Counsel is appointed by the President by and with the advice and consent of the Senate for a term of four years., 42567=Some types of relief we obtain in these agreements, however, extend beyond providing relief to the identified victims of alleged acts of discrimination. As with Measure 1.2.1., we wanted to begin to measure the impact this broader relief had on the workplace. We started to collect this information so that we could assess the contributions our private sector enforcement activities, excluding the mediation program, were making to improve workplaces through settlement and conciliation agreements that provide for changes in policies, practices or procedures. These types of changes have the potential to impact a much larger number of individuals at the worksite. Even though this type of relief is obtained in a limited portion of our charge resolutions, this type of effect on workplaces is a critical measure of our work, along with the measure for our mediation program. For example, in fiscal year 2005, from our initial collection of the information about our settlement and conciliation agreements reached in the charge process, other than mediation/ADR resolutions, we found that 18.1% of the 3,863 resolutions reached, or 701 settlements/conciliations, included broader improvements in workplace policies, practices or procedures. Although this represents about one-fifth of the total number of agreements, the workplace improvements brought about by these resolutions benefited approximately 384,500 individuals in addition to the specific individuals that received relief under the settlement or conciliation agreement., 196418=[15] Includes $788,322 of the $927,438 fiscal year 2006 rescission (PL-109-108) and $2,807,555 of the $3,303,006 fiscal year 2006 rescission (PL-1099-148), 72702=We contracted with 94 FEPAs in fiscal year 2005 to resolve dual-filed charges as a means of preventing duplication of effort and streamlining the charge resolution process. While the FEPAs continue to produce at acceptable levels, we have reached a point where greater benefits can be achieved for the FEPAs’ contributions by increasing the per charge rate, rather than expecting a significant increase in charge resolutions from the FEPAs., 168312=In the past two fiscal years we have modified the initial approach to our program evaluations in several ways. We expected to establish general procedures for conducting all of the evaluations before initiating the first one in fiscal year 2005. We decided that it was more effective to establish our approach to program evaluations as we gained practical experience conducting our first evaluation under the Strategic Plan. We also revised the schedule of program evaluations by deciding to review our private sector charge process first, in fiscal year 2005, instead of reviewing the mediation program as previously scheduled. This interim adjustment to our Strategic Plan was not a substantive revision and was described in our fiscal year 2006 Performance Budget. (All of the cumulative interim adjustments to our Strategic Plan are described in Section IX., Addendum: Interim Adjustments To Strategic Plan, starting on page 75.), 31531=1.2.2 By FY 2006, increase by 20% the number of private sector charges in which employers agree to participate in mediation from the fiscal year 2003 baseline., 7320=Table 2 outlines our budget information for the agency’s enforcement programs under Strategic Objective 1 - Justice and Opportunity, for fiscal years 2005 through 2007. Our performance measures, the agency’s programs, and the requested budget are described in more detail in subsequent sections., 18331=We made significant gains in processing our Federal sector appellate inventory during fiscal year 2004, exceeding our goal for resolving appeals in 180 days or fewer, even with an 11% increase in new appeals. Building on this achievement, our target for fiscal year 2005 was to resolve 50% of the appellate cases received during the fiscal year in 180 days or fewer. We surpassed this goal, resolving 52% of the appeals within 180 days or fewer (3,899 out of 7,490 appeals received). We surpassed our target through the effective management of the appellate inventory and by using strategic inventory management projects and technological innovations., 182594=Original performance measure: By fiscal year 2009, ensure that at least 75% of private sector charges will be resolved within 180 days., 55623=Table 3 below shows our workload projections for our Private Sector Enforcement program and our mediation efforts for fiscal years 2005–2007. Table 4 on page 30 provides workload estimates by statute for fiscal years 2005–2007., 33349=In fiscal year 2005, in an effort to increase the number of employers agreeing to participate in our private sector mediation program, we produced and distributed two DVDs highlighting the benefits of mediation to employers, developed a universal automated presentation addressing employer concerns about mediation for EEOC staff to use during outreach events, and developed and distributed a bookmark for employers highlighting the “Top Ten Reasons to Mediate.” These efforts were considerable, but have not yet translated into an improved respondent acceptance rate of participation in our mediation program. We will continue outreach efforts in fiscal year 2006 to allow more time for the effects of these efforts to become apparent. We will revisit the target for this measure as part of our efforts during fiscal year 2006 to update the agency’s Strategic Plan., 94594=Based on responses on training evaluation forms from participants attending our free and fee-based outreach and training, who had previously attended EEOC training or other presentations, 91.2% of the participants in fiscal year 2005 indicated that their organization had made an improvement in their employment policies, practices, or procedures as a result of their participation in previous programs. We believe, however, that this figure may include participants’ responses about cumulative or repeated workplace changes resulting from attendance at several previous years of EEOC training activities. Our survey methodology in subsequent years will adjust the time frame for participants to link our training activity to resulting workplace improvements in order to avoid double-counting responses in later years for the same workplace changes. We project that this adjustment will lower the claimed rate of improvements over the next 4 years. We have set realistic, yet challenging targets to take this revised approach into account: 85% in fiscal year 2006, 75% in fiscal year 2008, and a final goal of 70% by fiscal year 2009., 196938=[18] Includes $164,207 of the $4,424,147 fiscal year 2005 rescission (PL-108-447), 41262=Measure 1.3.1 is a companion to Measure 1.2.1. This measure encompasses all resolutions of charges of discrimination obtained by settlement or conciliation agreement where EEOC is a party, except for those charges in our mediation/ADR program, which are included in Measure 1.2.1. Charges resolved by settlement or conciliation agreement can provide relief before or after the agency makes a finding on the allegations in the charge. Settlement agreements are made prior to a finding and EEOC is a party to these agreements and will enforce the provisions of the agreement, if necessary. Once the agency makes a finding of discrimination on the allegations of the charge, an agreement resolving the charge is called a conciliation agreement. Both types of agreements are considered under this measure. In fiscal year 2005, EEOC resolved 9,435 charges of discrimination with a settlement or conciliation agreement, of which 5,572 were resolved as a result of mediation. The number of settlement or conciliation agreements reached in fiscal year 2005, where EEOC was a party, was 3,863., 185043=Revised performance measure: By fiscal year 2006, increase by 20% the number of private sector charges in which employers agree to participate in mediation over the fiscal year 2003 baseline., 51075=This measure ensures that we maintain a high success rate for resolving our lawsuits. Based on an earlier 5-year study, we established the baseline value of 90% for this measure and our litigation program. To aid our efforts to deter and remedy discrimination in the workplace, we expect to maintain at least this 90% level using a 6-year rolling average of successful lawsuits. In fiscal year 2005, we successfully resolved 93.1% of our lawsuits, bringing our 6-year rolling average to 92.8%. We will revisit the target for this measure as part of efforts during fiscal year 2006 to update the agency’s Strategic Plan., 130685=Our Strategic Plan identified this performance measure as an indicator of service to our customers. We are currently piloting our National Contact Center, which includes customer service measures for this portion of our work. We intend to use a broader survey methodology to address other aspects of our work to measure customer service. As noted for Measure 2.1.3, agency resource priorities have necessitated that we postpone this broader activity at this time. We anticipate future opportunities to initiate the activities necessary to implement the survey approach for this measure. We will also reassess measures, including this one, when we review our Strategic Plan during fiscal year 2006., 91642=Our Strategic Plan for fiscal years 2004-2009 links our broad Strategic objectives to the agency’s Five Point Plan. Strategic Objective 2, Inclusive Workplace, relates to one element of our Five-Point Plan– Proactive Prevention. It also identifies our long-term goals to achieve results in this area., 104252=Each year, millions of teens work part-time or during the summer. During the height of the summer of 2004, more than 7.1 million young adults age 16-19 were employed. Between 33%-44% of teens age 16-19 have worked during the school year in the past five years. The EEOC has seen, through charges filed and anecdotal evidence, that discrimination is a problem for many in this group. We will continue to educate students and young workers about their workplace rights and responsibilities, including specific discussions on sexual harassment and how to complain if such harassment occurs on the job. We will reach out to schools and educators to share training materials, and as resources allow, develop and present training to teenagers about workplace rights and responsibilities and assist these young workers as they enter and navigate through the workplace. Furthermore, we will continue our efforts to provide training and information to businesses that employ young workers to encourage them to proactively address discrimination issues confronting young workers., 173932=Initiate FY 2006, 194498=[3] Includes fiscal year 2005 rescission of $4,424,147 (PL-108-447), 141158=3.1.6 By FY 2009, reduce the average time to process internal EEO complaints by at least 40%., 38127=Because this was a relatively new approach when we first developed the measure, we estimated for fiscal year 2004 that only 25% of the Federal employees would engage in an ADR attempt during the pre-complaint stage. In fact, in fiscal year 2004 parties elected to participate in ADR in 18,381 out of 42,412 instances of pre-complaint EEO counseling across the Federal government, or 43.3% of the time. Since this result was substantially above the target value we had estimated, we adjusted our future target values. For fiscal year 2005, we raised our target value considerably, from 30% to 40%, expecting more parties to participate in ADR in the pre-complaint stage because of the initial success in fiscal year 2004 and, during fiscal year 2005, our continued technical assistance efforts with agencies to encourage the development of effective ADR programs and the promotion of ADR training among government managers and staff. For fiscal years 2006 through 2008, we have increased the target value by 2% each year in order to make steady progress toward our 50% goal by the end of fiscal year 2009., 68957=Chart 2 below depicts the estimated litigation inventory including the number of lawsuits filed, pending lawsuits and resolutions for the fiscal years 2005 through 2007., 28340=Although relief obtained for individuals is a vital part of our work, some types of relief obtained in mediation agreements extend beyond the specific individual who was identified from the original allegations in the charge. We wanted to begin to measure the impact of this broader relief. We had not been capturing this information prior to the creation of this measure. Measure 1.2.1. is designed to assess the contributions our mediation program makes to improving workplaces through provisions in mediation agreements that provide for changes in policies, practices or procedures. These types of changes have the potential to impact a much larger number of individuals at the worksite. Even though this type of relief is obtained in a small portion of our ADR resolutions, this type of effect on workplaces is a critical measure of our work. For example, in fiscal year 2005, we began to collect the appropriate data for all mediation agreements reached through our mediation/ADR program. We determined that in fiscal year 2005, 3.1% (or 171 charges) of the total 5,772 charges resolved through mediation agreements included provisions for improvements in workplace policies, practices or procedures. Although this is a small percentage of the total number of mediation agreements, the workplace improvements brought about by these resolutions benefited approximately 191,000 individuals in addition to the specific individuals who received relief under the settlement., 98197=Since Federal agencies report their EEO information only once each year, several months after the fiscal year ends, we will also establish preliminary target values for fiscal years 2006 through 2008 and reassess them once we collect the information and determine the current status of agencies meeting the criteria., 16134=Like our private sector charges, this measure identifies our efforts to process a significant portion of our Federal sector hearings workload in 180 days or fewer. By focusing our resources on reducing our older cases in fiscal year 2004, we better positioned ourselves to address newer hearings cases in fiscal year 2005. This strategy enabled us to resolve 51.3% of our hearings cases within 180 days or fewer (5,241 complaints out of 10,221 total resolutions), exceeding our target of 38.0% by a substantial margin. We believe that our approach lets us increase future targets for this measure to 50% of the hearings resolved in 180 days or fewer for fiscal years 2006 through 2009, maintaining this significant achievement to reach our final goal. We will revisit the target for this measure during fiscal year 2006, as part of our efforts to update the Strategic Plan by fiscal year 2007., 190713=Revised performance measure: Of all of the private sector mediation/ADR resolutions, by fiscal year 2009 4.6% of them will result in improvements to an organization’s employment policies, practices or procedures., 179773=Section 717 of Title VII, Section 15 of the Age Discrimination in Employment Act, and Section 501 of the Rehabilitation Act of 1973, bar discrimination by federal agencies on the basis of race, color, religion, sex, national origin, age, and disability. These sections provide the basis for Commission oversight responsibility for the procedures used by federal departments and agencies in processing internal complaints of discrimination. In addition, the Commission has appellate jurisdiction to review final decisions of departments or agencies on discrimination complaints upon the request of the complainant. It is also responsible for ensuring that federal departments and agencies maintain programs of equal employment opportunity., 173971=Complete FY 2007, 196277=[14] Includes $4,259,940 of the $4,424,147 fiscal year 2005 rescission (PL-108-447), 92924=2.1.1 By FY 2009, 70% private and federal sector employer representatives, who participate in a major outreach initiative or training and technical assistance programs, indicate an improvement in an employment policy, practice or procedure as a result of their participation., 111297=The Training Institute offers a yearly multi-day conference for federal employees. The Examining Conflicts in Employment Laws (EXCEL) conference has become a widely anticipated and highly acclaimed event that federal EEO managers, attorneys, union officials, EEO professionals and EEO staff rely on to receive guidance and information on timely EEO topics, recent developments in employment laws and changes in agency procedures. In previous years, attendance has averaged around 500 participants. The recognition of the quality of the EXCEL conference is evident by a dramatic increase in enrollment to 800 participants for the fiscal year 2004 conference, which was exceeded in fiscal year 2005 with more than 950 participants. We project comparably high enrollment levels in fiscal year 2006., 131497=3.1.2 By FY 2009, EEOC will meet or exceed the Office of Personnel Management’s standards demonstrating success in managing and developing human capital., 172755=Initiated FY 2004, 21628=This measure builds on one of the three key factors of charge processing—quality. Along with timeliness (captured in Measure 1.1.1) and inventory, these factors are interdependent and impact our charge processing efforts. In fiscal year 2005, we established our baseline for this measure and the targets for fiscal years 2006–2009. We used a sampling methodology to select investigative files processed by our field offices, then evaluated the files on two critical quality criteria: (1) appropriate charge categorization and file documentation to support actions and (2) charge resolution., 180521=Further, under Executive Order 12067, the Commission provides leadership and coordination to all federal department and agencies’ programs enforcing federal statutes, executive orders, regulations, and policies which require equal employment opportunity without regard to race, color, religion, sex, national origin, age, or disability. Coordination is provided to eliminate conflict, competition, duplication, and inconsistency in these programs and to improve their effectiveness. All federal departments and agencies are required to cooperate with and assist the Commission in performing these functions and are required to furnish the Commission with such reports and information as it may require., 139999=This measure reinforces our commitment that EEOC will be a model workplace, particularly in the area of equal employment opportunity for our own employees. We intend to adopt the Model EEO Program described in MD- 715 and referenced in Measure 2.1.2. That measure expects 50% of all Federal agencies to successfully implement the model program by the end of fiscal year 2009. As a Federal agency, we intend to achieve that goal, but to do so even earlier—by the end of fiscal year 2006—to serve as a model for all Federal agencies. As noted in Measure 2.1.2, the EEO Performance Compliance Assessment (EPCA) tool—a measurement index for assessing the performance of Federal agencies’ EEO programs—is in the final stages of completion. Once it is complete, we will assess our actions in the equal employment opportunity area against the elements of the tool. In the meantime, we have been implementing those same elements, which are described in MD-715. We have successfully implemented 79% of the items identified in the MD-715 self-assessment., 81431=Chart 4: Federal Sector Appeals Received, Resolved, and Pending Inventory for Fiscal Years 2005 through 2007, 68396=The agency estimates filing 350 new lawsuits in fiscal year 2007. Our projected workload of 870 cases is slightly lower workload in past years. In addition to their litigation work field legal staffs perform a wide range of other functions. They provide advice and counsel to enforcement staff in all phases of the administrative process of private sector charges. They process over 15,000 Freedom of Information Act (FOIA) requests received from the public each year. Finally, they participate in agency outreach programs under Strategic Objective 2., 53542=Building on the success of the first year of the Relationship Management pilot, in fiscal year 2005 we expanded the pilot to include an additional 6 Federal agencies for a total of 12 agencies. The Relationship Management Project is designed to improve customer service and relationships among EEOC and Federal agencies; help agencies achieve a Model EEO Program under MD-715; address specific agency needs; and change the way we provide services to our stakeholders. Applying the strategies and tools developed from the experiences of this Relationship Management Project better positions the agency to become a more customer oriented organization that can deliver relevant information and solutions to Federal agencies. The effects of these activities on the Federal sector EEO community will be assessed with a Program Evaluation study in fiscal year 2009. During fiscal years 2005 through 2008, we will continue to assess, refine, and expand our outreach, training, technical assistance, and oversight efforts with agencies in preparation for the 2009 Program Evaluation study to determine program achievements., 173239=Initiated FY 2005, 134514=3.1.3 By FY 2009, EEOC employees will rate their satisfaction in the area of human capital management at or above the overall average rating of all federal employees collected by the Office of Personnel Management in its Government-wide survey., 174415=Complete FY 2008, 167541=Our Strategic Plan for fiscal years 2004 – 2009 provided a schedule of program evaluations the agency expected to conduct over a 5-year period. Program evaluations are designed to be a thorough examination of a program area by ensuring an independent review, using a rigorous methodology, and applying appropriate statistical and analytical tools. It uses expertise within and outside the program under review to enhance the analytical perspectives and add credence to the evaluation and recommendations. Program evaluations with this degree of rigor and independence are important because they enable an agency to determine whether or not its programs are operating as they are intended to, are operating effectively and efficiently, and are achieving results., 183205=Revised performance measure: By fiscal year 2009, ensure that at least 50% of federal sector hearings will be resolved in 180 days or fewer., 136703=We have established our baseline for this measure. To ensure that our final goal is met, we have begun to initiate feedback and action planning in our Headquarters and District Offices. With the cooperation of OPM, we provided office-specific survey results for each office to review and begin to develop action plans for implementation during fiscal years 2006 through 2008 to meet our goal., 181321=The agency has previously made, or is making additional, interim adjustments to the EEOC Strategic Plan for Fiscal Years 2004 through 2009. There are limited changes to the text of six performance measures (identified in items A–D) to ensure that the original meaning intended by each measure is clearly understood. The agency is also altering its schedule of Performance Evaluations (Item E). Because of this schedule change, the agency will be using an alternative method to evaluate one measure (Item F). In addition, the agency has increased a final goal for one measure (Item G) and inserted a final goal pending for a measure (Item H). For the convenience of the reader, we have highlighted in bold several words in each measure to make it easier to identify the key changes made., 188484=The agency elected to change the order of the Program Evaluations outlined in the agency’s Strategic Plan twice. Neither change in the schedule is a substantive change to the Strategic Plan. In fiscal year 2004, the Program Evaluation schedule was adjusted to indicate that the agency would conduct an evaluation of the Private Sector Charge Process starting at the end of fiscal year 2004. The previously scheduled evaluation of the Private Sector Mediation Program was postponed until fiscal year 2006. In fiscal year 2005, the Program Evaluation schedule was adjusted to indicate that the agency would conduct an evaluation of the Federal Sector Mediation Programs, which started at the end of fiscal year 2005. The previously scheduled evaluation of the Private Sector Mediation Program was further postponed until fiscal year 2007., 196758=[17] “Small Business Economic Indicators for 2003” August 2004, Small Business Administration, Office of Advocacy, page 6., 10844=Our Strategic Plan for fiscal years 2004-2009 links our broad Strategic Objectives to the agency’s Five Point Plan. Strategic Objective 1, Justice and Opportunity, relates to three of the elements of our Five-Point Plan – Proficient Resolution, Promote and Expand Mediation/ADR and Strategic Enforcement and Litigation. It also identifies our long-term goals to achieve results in each of these areas., 100663=Although we intend to use a survey methodology and establish our targets and final goal to measure our results, agency resource priorities have necessitated that we postpone this activity at this time. We anticipate future opportunities to initiate the activities necessary to implement the survey approach; however, we also will reassess measures, including this one, when we review our Strategic Plan during fiscal year 2006., 188111=Revised performance measure: By fiscal year 2009, EEOC will convert the key documents contained in TBD% of its private sector charge, Federal sector complaint, and litigation case files to electronic format., 197295=This page was last modified on February 13, 2006., 193825=Revised performance measure: Of all of the private sector charge resolutions, where EEOC is a party, except for ADR/mediation resolutions, by fiscal year 2009, 19.0% of them will result in improvements to an organization’s employment policies, practices or procedures., 164228=We will continue the use of the cost accounting system in fiscal year 2006 through our time and attendance process. The system will enable us to routinely collect and better account for, safeguard, and strategically manage resources to meet agency goals. It will also result in better alignment of agency resources with program goals/results as we continue to integrate budget and performance data. Finally, the cost data will have a transparent audit trail from the financial system through the financial and budget reporting cycle., 71705=The EEOC’s partnership with both the Fair Employment Practices Agencies (FEPAs) and the Tribal Employment Right Organizations (TEROs) continues to flourish. During fiscal year 2005, the agency-designated State and Local Re-engineering Workgroup presented recommendations that address enhancing this relationship and other process improvements. We plan to begin implementing some of these recommendations during fiscal year2006. It is important to note that this workgroup was comprised of both EEOC and FEPA representatives working together for the common goal of improving our process for enforcing civil rights employment laws and educating both employee and employer communities about their rights and responsibilities. EEOC has also designed a comprehensive training package for delivery to all contract FEPAs' staff during fiscal year 2006. This training was developed in response to the FEPAs desire for more directed training and will serve as a model for future training efforts., 172795=Complete FY 2006, 137531=3.1.4 EEOC will receive an “unqualified” financial audit opinion each year from FY 2004 - 2009., 79335=In Table 8 and Chart 4, we project that while new appeals will increase in fiscal years 2006 and 2007, we will be able to resolve a sufficient number of appeals to maintain the appellate inventory at acceptable levels in those years. In anticipation of projected EEOC attrition rates and increases in appellate receipts, the Commission is taking proactive steps to leverage technology to effectively manage the appellate inventory. For example, EEOC is implementing a Document Management System (DMS), which will convert incoming documents from paper to digital format. In fiscal year 2005 the Commission put into production Phase I of the DMS, whereby active complaint files were digitally converted for use by appellate attorneys., 107980=The Revolving Fund Act enables EEOC to support a comprehensive public educational program, which includes both free outreach activities conducted by agency staff and fee-based, specialized services sponsored by the Revolving Fund. Congress established the EEOC Education, Technical Assistance and Training Revolving Fund (“Revolving Fund”) in 1992 to empower the EEOC to use receipts of certain outreach events to maintain an active outreach program. The law creating the Fund authorizes EEOC to charge fees to offset the costs of developing and providing training, education and technical assistance through the Fund. Section 705 of the Civil Rights Act of 1964 was amended by adding the following authorizing language:, 174376=Initiate FY 2007, 35450=We obtained the result for this measure by surveying participants in EEOC’s mediation program during the year and tabulating their responses about their confidence in using the program. The fiscal year 2005 survey result of 96.3% exceeds our target by a substantial margin and continues to demonstrate the success of our private sector mediation program once both parties elect to participate in it. We will continue to survey participants and maintain the high confidence level expected for our program, because it helps with our efforts to convince participants, particularly company representatives, of the value of the mediation approach. We will revisit the target for this measure as part of efforts during fiscal year 2006 to update the agency’s Strategic Plan., 174863=Complete FY 2009, 160847=The Agency has consistently identified commercial and inherently governmental inventories throughout the Commission. In fiscal year 2005, we conducted an A-76 streamlined competition study for our federal operations case file administration. The most efficient organization won. In our five-year competitive sourcing plan, we have included planned competitions for information technology desktop support, telecommunications, server operations training, human resource record processing, and management and staff training., 97510=We are working to complete the EEO Performance Compliance Assessment (EPCA) tool, the measurement index for assessing the performance of Federal agencies’ EEO programs. The tool will be shared with appropriate agencies before it is finalized. With this tool we will measure Federal agencies’ progress toward meeting our goal of 50% of the identified agencies successfully implementing the Model EEO Program elements described in EEOC’s Management Directive (MD)-715 by the end of fiscal year 2009. We will focus our resources and efforts on 83 identified agencies with 100 or more employees, a sample that comprises over 99% of the civilian employees in the Federal Government., 147069=3.1.8 By FY 2009, EEOC will convert the key documents contained in TBD% of its private sector charge, federal sector complaint, and litigation case files to electronic format., 195495=[10] Includes $4,259,940 of the $4,424,147 fiscal year 2005 rescission (PL-108-447), 14297=All of these factors adversely affected our ability to achieve this measure. We believe that our long-term approach to balance the age of our inventory and manage the workload will assist us in meeting this goal in future years. We will maintain the 70% target level for fiscal year 2006, because it balances prompt service in our private sector processes with the need to devote resources to charges that take longer to process because meritorious or complex claims are involved. In fiscal years 2007 and 2008 we will increase our targets to 72% and 73%, respectively, in order to achieve our final fiscal year 2009 goal that 75% of the charges be resolved in 180 days or fewer., 69159=Chart 2: Litigation Inventory for Fiscal Years 2005 through 2007, 58989=May not add due to rounding, 112102=The Customer Specific Training program is another important vehicle for training employees, managers, supervisors and human resource professionals in large, and mid-size or small employers about their EEO responsibilities and how to prevent and correct workplace discrimination. All of the standardized courses are available for on-site training and we design customized courses that we deliver at the employer’s worksite. We anticipate both the number of training events and persons trained to increase for fiscal years 2006 and 2007 as demand for this type of training increases., 144589=We will continue efforts to reduce the average processing time for the complaints in our inventory. However, we are reevaluating the effectiveness of this measure for assessing this program component and exploring methods to capture a more appropriate measure of the efficiency of our complaint processing procedures. As we review our Strategic Plan during fiscal year 2006, we will determine the future efficacy of this measure., 6510=The budget request for fiscal year 2007 for Justice and Opportunity is $274,386,000. We will continue efforts to decrease the number of hearings cases and address a workload of appeals cases in the Federal sector. We will also continue efforts to promote mediation/ADR at all levels of the Federal sector EEO complaint process in order to resolve workplace disputes early, thereby saving resources and enabling agencies to focus on their core missions. In addition, these resources will enable us to maintain a nationwide litigation program that includes high impact, resource-intensive cases., 101661=With the enactment of the Civil Rights Act of 1964, Congress sought to eliminate the problems of segregation and discrimination in the United States. Today, the national policy of nondiscrimination is firmly rooted in the law and is widely supported. It generally is agreed that equal employment opportunity has increased dramatically in the United States. African-Americans and other people of color now work in virtually every field, and opportunities are increasing at every level., 135911=EEOC participated in OPM’s Government-wide Federal Human Capital Survey (FHCS), starting at the end of fiscal year 2004. OPM released the FHCS results during the summer of 2005. At this point, OPM is not expected to construct an index for assessing the overall results. To address the approach designed for this measure, we constructed a methodology for evaluating agency results compared with Government-wide results: a simple percentage based on the number of questions receiving a positive response (the two most positive options available for each question). Using this methodology, in fiscal year 2004 employees throughout the Government answered 57% of the 78 survey questions with a positive response and EEOC employees answered 54% of the questions with a positive response., 182770=Revised performance measure: By fiscal year 2009, ensure that at least 75% of private sector charges will be resolved in 180 days or fewer., 142716=In fiscal year 2004, we were able to reduce this average time to process by 17.5%, to 421 days on average, exceeding our target substantially. However, during fiscal year 2005 our average processing time rose from 421 days to 470 days. This is only 8% below the 2003 baseline; therefore, we did not meet the target for this fiscal year., 155943=March 2005 marked the launch of the National Contact Center (NCC), which was approved by the Commission in September 2004 on a two-year pilot basis. This was the first major component of the Chair’s repositioning effort to be established, following the issuance of the National Academy of Public Administration (NAPA) report. With the opening of the NCC, the Commission became dramatically more accessible to the public, through the handling of telephone calls between 8 a.m. and 8 p.m., Monday through Friday, and 24-hour access via an Interactive Voice Response (IVR) telephone menu, e-mail, web text and written correspondence. Constituents can communicate with the agency in more than 150 languages and obtain accurate information quickly. Through the NCC, callers can speak with knowledgeable, EEOC-trained Customer Service Representatives (CSRs) usually within 30 seconds after asking to speak to a CSR. Additionally, through Frequently Asked Questions posted on the Center’s web page and the IVR telephone system, more than 10,000 customers a month have been getting their questions answered through the use of the Center’s technology option alone. Overall, the NCC has handled more than 35,000 calls per month with an 82% first call resolution rate, thereby saving considerable work for our field offices and ensuring timely customer assistance. The agency Inspector General has contracted for an independent evaluation of the effectiveness of the pilot. This evaluation, along with contractor-provided customer satisfaction studies, will provide information that will be used to determine whether NCC operations will continue by the agency exercising its first option year on the contract., 89748=Our budget request for fiscal year 2007 for this Strategic Objective is $48,421,000, not including the Revolving Fund. The proposed request will allow us to increase our outreach efforts, getting our message out to employers and employees, students and educators in diverse communities throughout the country, achieving increased awareness of, and compliance with, EEO laws and reducing discrimination in the workplace., 24833=Results from a 2004 survey conducted by a reputable private organization were available during fiscal year 2005, including responses to a question that the agency used to identify a fiscal year 2005 baseline value for this measure. The results demonstrated that 49% of all of the individuals responding to the question who identified a specific confidence level have confidence in EEOC’s ability to enforce Federal equal employment laws., 126708=At the heart of our efforts to become a model workplace and achieve organizational excellence are our employees. In fiscal year 2006, we continue to implement strategies, programs and practices to strategically manage our employees and enable them to perform their jobs better—achieving the results to which we aspire and the public deserves., 177604=EEOC also enforces the Age Discrimination in Employment Act (ADEA) of 1967, and the Equal Pay Act (EPA). The ADEA protects workers age 40 and older from discrimination in hiring, discharge, pay, promotions, fringe benefits, and other aspects of employment by employers having 20 or more employees, employment agencies, and labor organizations with 25 or more members. The Equal Pay Act prohibits gender-based discrimination in the payment of wages to men and women performing substantially equal work in the same establishment. The Commission receives and investigates charges of discrimination in these areas and makes findings of “violation” or “no violation” and may file suit in Federal District Court if it is unable to achieve voluntary resolution of violations through conciliation., 44109=Again, since the primary focus of these agreements is on individual relief, the percentage of settlement/conciliation agreements, excluding mediated agreements, that involve this broader type of relief will be small. Given this limitation, we have established meaningful targets and a final goal for fiscal years 2006 through 2009 for obtaining settlement and conciliation agreements that include the types of workplace changes reflected by this measure. Even moderate percentage changes in target values can indicate increases in the number of agreements obtained or the number of individuals benefited from year to year. Since the agency only began collecting this type of data in fiscal year 2005, we anticipate that the overall percentage of these types of agreements will not increase during fiscal year 2006. Our target will increase to 18.5% for fiscal year 2007, remain at that level in fiscal year 2008, and increase to our final goal of 19.0% in fiscal year 2009. As an illustration, if the total number of settlement and conciliation agreements in our charge program, excluding mediation resolutions, remains approximately the same at 3,863, the final goal represents approximately 734 agreements containing provisions that result in improvements in an organization’s policies, practices or procedures. This represents 33 settlement and conciliation agreements more than the 701 obtained in fiscal year 2005 and could reflect an impact on approximately 403,000 additional employees in these affected organizations., 133500=We achieved our 2-year target for fiscal year 2004 and fiscal year 2005 to develop our comprehensive human capital strategy and begin to implement approaches toward achieving this goal. By the end of fiscal year 2005, we were using our draft strategic human capital plan to chart further efforts to support our Strategic Plan. Several cross-organizational working groups have been established to design a working plan and address several other human capital issues. In addition, a performance management system was developed and implemented for managers to align efforts and rewards with the agency’s strategic direction. Managerial development expanded to encompass all levels from first-level supervisors to senior executives, and a performance system will be introduced in fiscal year 2006 for non-supervisory staff. Managers also received general and tailored guidance on labor relations issues., 112693=The Training Institute currently offers six national courses geared toward federal employees. The course topics include EEO Training for New Counselors, EEO Training for New Investigators, EEO Training for Managers and Supervisors, Writing Final Agency Actions, EEO Refresher Training for Counselors, and Drafting Letters of Acceptance and Dismissals Decisions. These courses were offered in Washington, D.C., and in other major federal regions throughout the country. For fiscal year 2006, we plan on expanding our course offerings to include mediation training for federal employees and new courses aimed at California employers, who are now required to provide 2 hours of training annually on harassment for their managers. Plans are to offer future adaptations of this course to other states having a similar training requirement., 170050=From this broad, inclusive effort the contractor identified the initial stages of the charge process—the inquiry and intake process leading to the filing of a charge—on which to focus for the program evaluation of the private sector charge process. The contractor also identified the year-end resolution of charges for review and comparison with resolutions at other times in a fiscal year. The contractor has collected data from field office managers, using a survey instrument, and from the agency’s charge data system—the Integrated Mission System (IMS). This information is currently being analyzed. A program evaluation report with recommendations is expected during the second quarter of fiscal year 2006. We will use the information in the report and the recommendations provided by the contractor to review the intake process and implement appropriate changes., 12105=1.1.1 By FY 2009, ensure that at least 75% of private sector charges will be resolved in 180 days or fewer., 78525=Chart 3: Hearings Workload Received, Resolved, and Pending for Fiscal Years 2004 through 2007, 195219=[8] Includes fiscal year 2006 rescission of $927,438 (PL-109-108) and $3,303,006 (PL-109-148), 94228=In fiscal year 2004, we postponed establishing a baseline and target values through fiscal year 2009 because earlier survey results were from only a limited year-end sample of our fee-based outreach participants. Our fiscal year 2005 results reflect a broader sampling of the employer representatives attending our free and fee-based outreach and training., 137105=OPM is expected to conduct the Government-wide survey every 2 years, with the next survey scheduled for late spring of 2006. In the intervening years, starting with fiscal year 2007, we will conduct our own employee survey, obtain and analyze the results, and chart our progress toward achieving our final goal., 155284=The lease for EEOC’s headquarters location at 1801 L Street, N.W., Washington, D.C, expires in July 2008, and it will be necessary to fund either relocation or significant remodeling of the current space in fiscal year 2007. The future space requirements are approximately 20% less than current requirements. Costs will include planning, project management, design, construction, furniture, telecommunications and possibly moving. In addition, EEOC will continue typical space activities, with a goal of reducing the amount of occupied space as leases expire and offices relocate or are reconfigured., 20360=1.1.4 By FY 2009, reviews of investigative files indicate that the percentage of files meeting established criteria for quality is at a maintenance level of 90% or higher ., 146185=The RESOLVE Program began in July 1, 2003. We anticipated that it would take several years for employee confidence to build and achieve established targets based on limited information at the time. We increased our targets and final goal for this measure substantially based on the overwhelming success of the program during fiscal year 2004. Our new targets and long-term goal at 90% or greater seems to be appropriate given our results for 2 years. For fiscal year 2005, 92% of our employees using the program, who responded in a survey, were willing to use the program again. We intend to sustain this high level of employee confidence in our RESOLVE program; however, we will review this measure during fiscal year 2006 as we consider and revise our Strategic Plan., 187351=Also, funding priorities in fiscal year 2007 and beyond have necessitated adjustments to our targets and the final goal for this performance measure for fiscal year 2009. At this time, we will need to reassess this measure and the final goal as we review our Strategic Plan during fiscal year 2006 for issuance in fiscal year 2007. We have indicated the goal will be determined at that time., 55076=In fiscal year 2005, we ended the fiscal year with a pending inventory of 33,562, which is approximately 12% higher than the inventory at the end of fiscal year 2004. As reflected in Chart 1 and Table 3, we project that our workload will grow in fiscal years 2006 and 2007 as a result of staff attrition., 22733=1.1.5. By FY 2009, the general public rates their confidence in EEOC’s enforcement of federal equal employment laws at [TBD*]% or higher., 194369=[2] Fiscal year 2006 Budget requested an amount not to exceed $33,000,000, 19417=Besides this new approach to the calculation of success for this measure, we will also increase our targets by 5% each year from fiscal year 2006 through fiscal year 2009. These target levels will enable us to meet our final goal of resolving 70% of all Federal sector appeals cases, regardless of the year filed, in 180 days or fewer. The revised methodology will uniformly address our timeliness standards for both the private and Federal sectors, and the increased target values will help us continue to make steady gains toward our long-range goal as many of the streamlining efforts and other federal sector reforms take hold. As Federal sector enforcement staff successfully resolves the older appellate inventory, resources will be deployed to resolve an increasing percentage of newly filed appeals in 180 days or fewer., 197077=[19] Includes $139,116 of the $927,438 fiscal year 2006 rescission (PL-109-108) and $495,451 of the $3,303,006 fiscal year 2006 rescission (PL-109-148), 193282=Revised performance measure: By fiscal year 2009, reviews of investigative files indicate that the percentage of files meeting established criteria for quality is at a maintenance level of 90% or higher., 102155=Nonetheless, significant work remains to be done. Race remains the most frequently alleged basis of employment discrimination under federal law – charges alleging race discrimination in employment accounted for over thirty-five percent of the Commission's 2004 charge receipts., 143780=In addition, our success at reducing our overall year-end inventory by 57% (from 56 complaints at the end of fiscal year 2003 to 24 complaints at the end of fiscal year 2005) affects the validity of this measure. As the total number of cases processed decreases, the average processing time is more susceptible to being skewed by a small number of cases that exceed the expected timeframes. The number of formal complaints filed has also decreased over the past 2 years, from the 38 formal complaints filed in fiscal year 2003 to 31 in fiscal year 2004 and 26 in fiscal year 2005. Much of this reduction is attributable to the success of our ADR Program, RESOLVE, which was implemented in the last quarter of fiscal year 2003. More complaints are being resolved at the informal stage of the process., 148498=Our 2-year target for fiscal years 2004 and 2005 focused on building a technical infrastructure required to prepare for the phased-in, multi-year implementation of the Document Management System (DMS). During these two fiscal years, EEOC installed the first phase of the production DMS infrastructure. Additionally, in fiscal year 2005 we completed the conversion of the Federal appellate case files into a structured, electronic format within the DMS. Although we postponed the field pilot, the conversion of our Federal appellate files provided the necessary framework and experience to prepare for the conversion of our Field Office files. In addition, by the end of fiscal year 2005, four areas of our DMS project were in place (Correspondence Tracking System, Commission Notation Voting System, Office of Federal Operations’ Federal Appellate Case Files, and Office of Communication and Legislative Affairs’ News Clips System). Each area has provided us with more experience that will assist us with our future applications., 95843=2.1.2 By FY 2009, increase to 50% the percentage of federal agencies that successfully implement the model EEO program attributes described in EEOC guidance.}",
    "lastModified": "Mon, 19 Oct 2009 14:47:58 GMT",
    "textBeforeTable": "Table 1 below displays the EEOC’s total agency staffing and funding profile by Strategic Objective and programs for fiscal years 2005 through 2007. A. Staffing and Funding Profile Performance Results for the eight measures for this Strategic Objective begin in Section V.B. on page 54. Performance Measure Highlights: There are eight performance measures under Strategic Objective 3. A measure assesses the confidence our customers have in our services. Two measures address our initiatives to manage our human capital and obtain input from our employees. Another measure assures that, when our financial systems are audited, we receive unqualified opinions from our auditors. Three measures assure that we successfully implement internally the federal sector Model EEO attributes, process our internal complaints of discrimination in a timely manner, and utilize ADR to resolve workplace disputes more quickly, cost effectively and amicably. Our final measure ensures that we transition to electronic media to retain our files and cases to improve agency efficiency and maintain security. Strategic Objective #3 Costs Are All Allocated Between Objectives #1 and #2. FY 2007 includes $13,500,000 for Information Technology, which is highlighted under this Objective. Cost The outcome expected will include: (1) Improved Organizational Performance and Efficiency and (2) Instill a Climate of Respect, Service and Responsiveness. We will establish an organizational infrastructure and professionalism to obtain the highest quality standards for equal opportunity, customer service, internal efficiency and fiscal responsibility. Costs are",
    "textAfterTable": "Strategic Objective 2: Inclusive Workplace 3. Outreach–Education-Technical Assistance $14,715 $49,050 $48,421 (629) Total Strategic Objective 2 $14,715 $49,050 $48,421 (629) Agency Total (includes Strategic Objective 3 Resources)[5] $326,848[3] $326,998[4] $322,807 (4,191) Total Full Time Equivalents[6] 2,381 2,400 2,381 (19) Strategic Objective 3: Organizational Excellence [Costs for Highlighted Area are allocated between Objectives 1 & 2] Highlighted Resource Areas [Information Technology] $15,545 $15,541 $13,500 (2,041) *may not add due to rounding B. Analysis of Change Fiscal Year 2006 (Dollars in thousands*) FTE Amount Fiscal Year 2006 - Includes 20 Reimbursable FTE from Revolving Fund 2,400 326,998 Increases: Compensation and Benefits 1. Annualization of FY 2006 Pay Raises (3.1%) 1,447 2. FY 2007 Pay Raise (2.2%) 2,963",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}