{
    "relation": [
        [
            "Job Title",
            "Sr. App Integration & Enterprise Architect Mobile Healthcare",
            "Librarian (Posting)",
            "Research Specialist 1",
            "Executive Assistant to the President and Liaison to the Board of Trustees",
            "Technical Specialist of Network Support"
        ],
        [
            "Location",
            "Los Angeles, CA",
            "Chicago, IL",
            "Chicago, IL",
            "Chicago, IL",
            "New York, NY"
        ]
    ],
    "pageTitle": "Information Technology - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/information-technology/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 630899311,
    "recordOffset": 630775764,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{259785=J. Crew - J. Crew is a New York, NY based apparel retailer that started with a catalog in 1983 and is known for its preppiness, but that may be changing., 295986=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "web development user experience software development SEO SEM product management online marketing media marketing interactive media information technology Illinois design data analytics analyst all employers See the complete Emerge Media profile Emerge Media - Emerge Media is a Chicago, IL based company that is “taking on the essential roots of everyday tasks and breathing real life into the technology behind them.” Companies with Entry Level Jobs and Internships in Information Technology To get started, obtain some training in information technology. You can earn a degree in a field such as information technology or computer science, or you can hit the books and earn certifications in whatever you’re interested in. You should also be able to keep up with new technologies by picking them up quickly and regularly. Server Administrator Information Systems Associate Database Analyst Technical Support Security Specialist System Administrator A sampling of jobs you might consider include: Information technology studies computer hardware and software, including databases, networks, information systems, and the physical hardware. Because of",
    "textAfterTable": "See all 139 job postings Lifesize - Lifesize is an Austin, TX based company that has “set out to make video conferencing truly universal.” See the complete Lifesize profile administrative all employers engineering information technology sales software development telecommunications Texas video web development Job Title Location Senior Lync/OCS Consultant United States Sr Business Analyst Austin, TX Infrastructure Analyst Houston, TX Jr UX Designer Austin, TX Receptionist Dallas, TX See all 137 job postings Backcountry.com - Backcountry is a Park City, UT based",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}