{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "6462.10",
            "6448.44",
            "6595.85",
            "6340.08"
        ],
        [
            "NSE",
            "6464.75",
            "6451.27",
            "6601.43",
            "6343.48"
        ]
    ],
    "pageTitle": "Procter and Gamble Hygiene and Health Care Stock Price, Share Price, Live BSE/NSE, Procter and Gamble Hygiene and Health Care Bids Offers. Buy/Sell Procter and Gamble Hygiene and Health Care news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/personal-care/proctergamblehygienehealthcare/PGH",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 605413999,
    "recordOffset": 605364715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134479=28 July 2015, 215127=Astec LifeSciences Recommended on Mar 31st 2015, 216430=P and G is in the Personal Care sector. The current market capitalisation stands at Rs 20,206.81 crore. The company management includes R A Shah - Chairman, B S Mehta - Director, A K Gupta - Director, Sonali Dhawan - Director, Shailyamanyu Singh - Director, Karthik Natarajan - Non Executive Director, Pramod Agarwal - Addnl. & Non Exe.Director. It is listed on the BSE with a BSE Code of 500459 and the NSE with an NSE Code of PGHH. Its Registered office is at P&G Plaza, Cardinal Gracias Road,,Chakala, Andheri (East) Mumbai,Maharashtra - 400099. Their Registrars are Link Intime India Pvt. Ltd., 134990=UnitedBrewerie Jul Fut, 135697=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}