{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus police are amazing. If anything happens, all that needs to be done is call the campus police and they will be there in a jiffy.",
            "There are various clubs.",
            "This college is a good idea if you are just wanting to obtain an Associates degree and move on to a four year or university.",
            "There isn't too much to do at Gaston, but joining a club may solve that problem. Gaston College does have a good bit of clubs, and most of them are pretty easy to get in to.",
            "The cafeteria at Gaston College is delicious. If by some chance someone does not like the food there at the college, there are food places that are nearby the school.",
            "There are no dorms at Gaston College. But I suspect this to be the type of institution it is, and the people that go here either have their own place or live with their parents.",
            "You are challenged at Gaston depending on the teacher that you get. I like the workload that I have had so far at Gaston. Some classes can be very frustrating, like Philosophy 240. Overall, I love how the school is all about you and your academics( instead of viewing you as a paying consumer).",
            "If you have classes especially when the semester begins always get there almost an our early. If you don't you will not be able to find much if any parking near where you need to be at for your class. Some of the counselors are not very good at their job, but there are some that are amazing. Also, I would like to beware that if you get some scholarships, for instance the NC Educational Lottery, you may not get all of the money that was originally promised to you. Be aware that if you use financial aid to not use all of it at Gaston even if you change your major. I would highly recommend that if you are just wanting to transfer to another college to get a Associates in the Arts or Sciences.",
            "A good school that has really great teachers. The content of the courses are on point. Would recommend to anyone wanting to get a two year degree."
        ]
    ],
    "pageTitle": "Gaston College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Gaston-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896549415,
    "recordOffset": 896519389,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{90688=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/07/2011 Reviewer is A current student here. 3 out of 4 people found this review useful. 1 of 25 Rachel from Mount Holly, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "What to do for fun There isn't much to do on campus as far as for fun but that is because this isn't a stay on campus type place. Most if not all the students who attend here live elsewhere as in their parents house, their own house, etc. It is still a great place to be though. Dorm Life I'm not exactly sure if we even have dorms since its a low key community college. In three sentences They have amazing instructors. They have friendly staff members. They always go above and beyond what is expected to help any student that needs help with any certain thing. Login to rate or flag the reviews Robert from Lincolnton, NC 12/08/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 25 Categories Comments Great for these types of students All people who want to get a higher education in the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}