{
    "relation": [
        [
            "Date",
            "Jan 6, 2006",
            "Jan 9, 2006",
            "Jun 21, 2010",
            "Jun 19, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ARIBA, INC., (A DELAWARE CORPORATION), CALIFORNIA Free format text: MERGER;ASSIGNOR:FREEMARKETS, INC., (A DELAWARE CORPORATION);REEL/FRAME:017438/0342 Effective date: 20040702",
            "Owner name: FREEMARKETS, INC. (A DELAWARE CORPORATION), PENNSY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FREEMARKETS ONLINE, INC. (A DELAWARE CORPORATION);REEL/FRAME:017438/0352 Effective date: 19990901",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7152043 - Method and system for dynamically controlling overtime in electronic auctions - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7152043?dq=No.+6,411,949&ei=AUR7T-LGJqSr0AHy2aSiBg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485357535,
    "recordOffset": 485305187,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6643=Information regarding the Auction that can be displayed by the client application is illustrated in FIGS. 6A–6D at selected times during the conduct of an Auction. FIG. 6A illustrates lot information provided at the start of an Auction. The lot closing times are shown for each of the lots (01–08) as 10:30:00 AM, etc. The lots are identified by name (e.g. “PP-Gas assist” which stands for “Gas Assist Polypropylene Parts” for lot 01). The indicated status for each lot is “OPEN.” The “Market Bid” column indicates the current lowest or best bid for the lot. The current time (10:00:11 AM) is shown in the upper right corner of the display.}",
    "TableContextTimeStampAfterTable": "{128775=Bidding continues on Lot 1 until 10:55 before the final bid is placed and the lot shifts to Pending status (i.e. 15 minutes of Overtime). Assuming a minimum interval of 10 minutes between lot closing times, this will push Lot 2 into Extended status moving the scheduled closing time back to 11:05 AM. The auction now appears as shown in Table 6., 48657=Although Bid E is received within one minute of the scheduled closing time of 10:32, it is not a new low bid (i.e. is greater than 371,373) and therefore no additional time is added. Lot 01 therefore closes at 10:32., 48390=When bid D is received at 10:30:45, there is no effect on the status of the scheduled closing time, because although the bid is a new low bid ($371,373) it is not received within one minute of the then-scheduled closing time of 10:32., 47002=This Auction employs a decision rule to trigger overtime that can be stated: “when a low bid is submitted during a first time interval t before the scheduled close, reschedule the close to occur later by one time interval t.” Thus, for a time interval t of one minute, a scheduled closing time of 10:30 is extended to 10:31 if overtime is triggered., 47637=When bid B is received, the status of lot 01 immediately changes to Overtime, because bid B is a low bid and is received at 10:29:06, within one minute of 10:30. The scheduled closing time is therefore delayed until 10:31, which is one increment t (one minute) after the original closing time of 10:30. This additional increment is available for bidders to consider whether to submit a bid in response to bid B., 120801=Bidding begins on all of the lots at 9:45 AM. Then a second technical disruption occurs at 10:10 AM. This interruption is estimated to take at least 10 minutes to resolve, which will not be fast enough to prevent Lot 1 shifting to Pending status at 10:15 AM and Closed status at 10:20 am (assuming a 5 minute Pending interval). In addition, since all lots are currently open, bids have already been placed on Lots 2 and 3. As the duration of the interruption is unknown, the auction coordinator decides to once again place all lots in Pause status until the technical difficulty is resolved. Bidders are prevented from entering bids during this time or bids may be placed into a queue to await the lifting of the Pause status, but all existing bids are preserved. The auction now appears as shown in Table 4., 186794=As an example of these two features, Suppliers B, C, D, & E are engaged in a competitive interaction on Lot 1 of a multi-lot auction between 1:25 PM and 1:27:30 PM at a price between $1.5 to $1.6 million. The lot is scheduled to close at 1:40 PM, as shown in Table 13., 136561=By 11:17, all of the bidders have received the correct information for Lot 2 and re-calculated their bids. At this point, the Lot Pause can be lifted from Lot 2. Although bidders are now engaged in the activity leading up to the close of Lot 3, the lot extension buffer will ensure that bidders have adequate time to return to Lot 2 once Lot 3 bidding ends. The auction now appears as shown in Table 8., 109478=For example, as shown below in Table 1, an online auction is scheduled to open at 9:00 am at which time all lots will open. Current time is 8:45 AM so all lots are currently in Available status., 47384=In this example, Bid A is received at 10:26:49. This bid has no effect on the status or on the scheduled closing time of lot 01, because it does not arrive within one minute of the scheduled closing time of 10:30., 132426=Now it is discovered that some, but not all, of the bidders on Lot 2 have made an incorrect assumption in preparing their quotes. The auction coordinator needs time to communicate with all bidders and correct the error, and estimates that this will require 10–15 minutes. Therefore it will take too long to give all bidders an equal chance of understanding the situation before Lot 2 closes. However, there is no disruption to Lot 3, which can continue as scheduled. The auction coordinator places Lot 2 in the Pause status, and changes the scheduled closing time for Lot 2 to 11:40 AM. No change is made to Lot 3. Bidding continues on Lot 3, but no bids can be placed on Lot 2 at this point. Lot 2 is now scheduled to close after Lot 3. The auction now appears as in Table 7., 112971=Suppose there is a technical disruption at 8:50 AM and the auction coordinator is not sure how long it will take to resolve the issue. Instead of canceling the auction, the auction coordinator places the entire auction in Pause status. The auction now appears as shown in Table 2., 124918=The technical disruption is resolved at 10:30 AM. The auction coordinator alters the closing times (but not the opening times) of the lots to give the bidders an additional 10 minutes to bid on Lot 1, and to space out the closing times of Lots 2 and 3 at 20 minute intervals. The auction coordinator does not change the opening times of the lots, and therefore preserves bids that have already been made. All lots return to Open status when the Auction Pause is lifted and may commence bidding immediately. The auction now appears as shown in Table 5., 48088=When bid C is received, the status of the lot remains overtime, but because it was a new low bid and was received at 10:30:03, within one increment t of the then-scheduled closing time of 10:31, the scheduled closing time is further delayed by one increment t to 10:32., 116538=The technical disruption is resolved at 9:32 AM. At this point, if the auction coordinator lifted the Pause status, Lot 1 would immediately go to Pending and then to Close three minutes later. (In this example, the pending interval has been set to a total of 5 minutes after scheduled close by the auction coordinator.) Bidders would therefore not have an opportunity to place bids for Lot 1. To avoid this outcome, the auction coordinator decides to alter the opening times for all lots to 9:45 AM and shift the closing times to 30-minutes intervals thereafter. Once the Pause is lifted, this has the effect of returning all lots to Available status, and bidders can commence bidding when the lots open at 9:45 AM. The auction now appears as shown in Table 3. Note that the auction coordinator could also have shifted the closing times only. In that case, all lots would have gone to Open status and bidders could have commenced bidding immediately.}",
    "textBeforeTable": "Patent Citations While the invention has been described in detail and with reference to specific embodiments thereof, it will be apparent to one skilled in the art that various changes and modifications can be made therein without departing from the spirit and scope thereof. In particular, it should be noted that while the auction functions described above have been described in the context of downward pricing auctions the auction functions can be equally applied to upward pricing auctions. Thus, it is intended that the present invention cover the modifications and variations of this invention provided they come within the scope of the appended claims and their equivalents. . If the bidder reconfirms the bid, then is entered into the auction at step 860. If the bid passed the reconfirmation failsafe criteria at step 850, then no reconfirmation is needed, and the bid is entered into the auction at step 860. The entire process 800 is repeated for every bid that is submitted in the auction. FIG. 15C , is displayed to the bidder in step 845, and the bidder must reenter the bid at step 810. If the bid passes the first failsafe criteria, then a second check is performed at step 850. For this second level of predefined criteria, if the bid fails to pass, then the bidder may still enter the bid if he confirms it again at step 855. An example of",
    "textAfterTable": "US4992940 Mar 13, 1989 Feb 12, 1991 H-Renee, Incorporated System and method for automated selection of equipment for purchase through input of user desired specifications US5136501 May 26, 1989 Aug 4, 1992 Reuters Limited Anonymous matching system US5193056 Mar 11, 1991 Mar 9, 1993 Signature Financial Group Inc. Data processing system for hub and spoke financial services configuration US5243515 Oct 30, 1990 Sep 7, 1993 Lee Wayne M Secure teleprocessing bidding system US5297032 Feb 1, 1991 Mar 22, 1994 Merrill Lynch, Pierce, Fenner & Smith Incorporated Securities trading workstation US5375055 Feb 3, 1992 Dec 20, 1994 Foreign Exchange Transaction Services, Inc. Credit management for electronic brokerage system US5394324 Dec 8, 1993 Feb 28, 1995 Xerox Corporation Auction-based control system for energy resource management in a building US5402336 Jan 15, 1993 Mar 28, 1995 Ss&D Corporation System and method for allocating resources of a retailer among multiple wholesalers",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}