{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2"
        ],
        [
            "Command or Action",
            "admin Example: RP/0/0/CPU0:router# admin",
            "upgrade cpuctrlbits {all | location node-id} Example: RP/0/0/CPU0:router(admin)# upgrade cpuctrlbits all"
        ],
        [
            "Purpose",
            "Enters administration EXEC mode.",
            "Upgrades the CPU controller bits on all nodes in the router. Use the location node-id keyword and argument to upgrade the CPU controller bits on a specific node."
        ]
    ],
    "pageTitle": "Cisco IOS XR System Management Configuration Guide for the Cisco XR 12000 Series Router, Release 4.0 - Managing the Router Hardware [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-0/system_management/configuration/guide/b_yc40xr12k/yc40xr12k_chapter5.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375452519,
    "recordOffset": 375410473,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{227841=Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router, 208490=A second PRP card can be added to a Cisco XR 12000 Series Router for redundancy. To add a standby PRP, boot the card from ROMMON mode with the minimum boot image (MBI) software package. This will bring up the PRP so it can be recognized by the DSC. The new standby PRP will download the appropriate software and configurations from the DSC, and reboot., 226185=Hardware Redundancy and Node Administration Commands on the Cisco IOS XR Software module of Cisco IOS XR System Management Command Reference for the Cisco XR 12000 Series Router, 168675=For more information, see Cisco IOS XR System Management Command Reference for the Cisco XR 12000 Series Router., 121210=Causes the active RP to reload the Cisco IOS XR software according to the configuration register setting (for example, 0x0 to enter ROMMON bootstrap mode and 0x2102 to reload the RP to EXEC mode). The reload command can be entered in EXEC or administration EXEC modes, and you can see additional options by entering the reload ? command. See the Reloading the Active RP for more information., 179730=On Cisco XR 12404 routers, which use consolidated switch fabric cards (CSFCs), you must power off the router before changing a CSFC card., 96068=For more information regarding the show upgrade command, refer to the Hardware Redundancy and Node Administration Commands on the Cisco IOS XR Software module in Cisco IOS XR System Management Command Reference for the Cisco XR 12000 Series Router., 127166=4.    (Optional) config-register 0x2102, 136259=For more information on the use of these commands, see Cisco IOS XR System Management Command Reference for the Cisco XR 12000 Series Router., 215567=See Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router for more information., 26531=For complete descriptions of the commands listed in this module, see Additional References. To locate documentation for other commands that might appear in the course of performing a configuration task, search online in Cisco IOS XR Commands Master List for the Cisco XR 12000 Series Router., 228742=Configuring AAA Services on the Cisco IOS XR Software module of Cisco IOS XR System Security Configuration Guide for the Cisco XR 12000 Series Router, 60962=Cisco XR 12000 Series line cards, 178679=On Cisco XR 12000 Series Routers that use clock and scheduler cards (CSCs) and switch fabric cards (SFCs), the CSCs and SFCs work together to provide the switch fabric for the router. Although some router cards can be removed without software preparation, it is best to shut down and remove the power from a CSC or an SFC slot before removing a card. When the new card is inserted, you can restore the power to the slot and bring up the replacement card. This section describes how to properly remove and replace CSCs and SFCs for repairs., 125111=This section contains instructions to reload the Cisco IOS XR software and return to EXEC mode. For instructions to use the reload command for entering ROM Monitor bootstrap mode, see Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router., 132513=Sets the configuration register to 0x2102. This step is necessary only if the register is not set to 0x2102 in the running configuration., 61529=Cisco XR 12000 Series SPA Interface Processor (SIP)-600, 131668=For instructions on how to enter ROM Monitor bootstrap mode, see Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router., 227419=Cisco IOS XR Getting Started Guide for the Cisco XR 12000 Series Router, 228290=Cisco IOS XR Commands Master List for the Cisco XR 12000 Series Router, 62640=0-1 (SPA module number on the Cisco XR 12000 and 12000 Series SIP-600), 163563=For information on the use of these commands, see Cisco IOS XR Interface and Hardware Component Command Reference for the Cisco XR 12000 Series Router.}",
    "textBeforeTable": "DETAILED STEPS 6.    reload 5.    admin 4.    (Optional) config-register 0x2102 3.    show variables boot 2.    admin 1.    show redundancy SUMMARY STEPS Because the reload command causes the active RP to go off line and either reload the Cisco IOS XR software or enter ROM Monitor mode, the router experiences a loss of service unless a redundant standby RP is installed and in “ready” state. To display the status of the standby RP, use the show redundancy command in EXEC mode. Caution This section contains instructions to reload the Cisco IOS XR software and return to EXEC mode. For instructions to use the reload command for entering ROM Monitor bootstrap mode, see Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router. The reload command causes the active RP to reload the Cisco IOS XR software according to the configuration register setting. This setting determines how the active RP acts when reloaded.",
    "textAfterTable": "admin Example:  RP/0/0/CPU0:router# admin   Enters administration EXEC mode.   Step 3 show variables boot Example:  RP/0/0/CPU0:router(admin)# show variables boot   Displays the configuration register setting. Enter this command in administration EXEC mode. For normal operations, the configuration register setting is 0x2102, which causes the active RP to reload the Cisco IOS XR software. Verify that the configuration register setting is 0x2102. If it is not, complete 4 to reset the configuration register to 0x2102. Note    For instructions on how to enter ROM Monitor bootstrap mode, see Cisco IOS XR ROM Monitor Guide for the Cisco XR 12000 Series Router.   Step 4 config-register 0x2102 Example:  RP/0/0/CPU0:router(admin)# config-register 0x2102   (Optional) Sets the configuration register to 0x2102. This step is necessary only if the register is not set to 0x2102 in the running configuration.   Step 5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}