{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "The Age - Business, World & Breaking News | Melbourne, Australia",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.theage.com.au/am/2012/11/01/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 738292331,
    "recordOffset": 738220203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{67571=Where it costs you $1150 for a domestic flight., 76372=Angry Melbourne footballers confronted senior club officials in bid to overturn tanking policy of 2009., 106937=No easy draw for the top sides in 2013. }",
    "TableContextTimeStampAfterTable": "{254253=LondonCalling, Nov 1, 2012, 1:27AM, 124317=Now - November 3 WA's diverse LBGTI community to showcase their history in arts, politics and culture., 100938=The 2013 Winter Masterpiece exhibition will be Monet's Garden., 123482=Until November 3: Some of the most memorable moments in opera can be seen in this performance., 125243=October 27 - 31 We've done the hard work for you and scoured through the endless all-hallows-eve options., 186821=George Lucas sick of being yelled at as Disney confirms Star Wars: Episode 7 will kick off new trilogy in 2015., 122559=Now - November 2 Sunday Piazza Live returns to Northbridge., 102419=Entries now open! Event on Sunday, November 11., 267186=October 31 2012, 99629=Show saved from axeman's block to air with new judges in 2013., 126112=October 28 - November 11 Freo con be in party-mode, 255188=Urbie, Oct 31, 2012, 11:34PM}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Polished, funny and enjoyably cathartic, this comedy series ends the year on a high for the ABC. A Moody Christmas What's on TV Tonight Click here to find out how to win one of three 32GB iPhone 5’s. Win an iPhone 5 Stay Connected Stars of TV, film, anime, fantasy, comic books, gaming in Brisbane. Win Supanova tickets Competitions Advertising students show off their skills in design competition. Click for more photos Coffee shop fashionistas Summer solutions 1 Guide to celebrating",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane The Project 5 am - 6 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30 am - 9 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}