{
    "relation": [
        [
            "Release",
            "12.0(5)S",
            "12.1(3)T",
            "12.0(10)ST",
            "12.2(28)SB",
            "12.2(33)SRA",
            "12.2SX",
            "Cisco IOS XE Release 2.3"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.1(3)T.",
            "This command was integrated into Cisco IOS Release 12.0(10)ST.",
            "This command was integrated into Cisco IOS Release 12.2(28)SB.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware.",
            "This command was integrated into Cisco IOS XE Release 2.3."
        ]
    ],
    "pageTitle": "Cisco IOS Multiprotocol Label Switching Command Reference - match cos through mpls ldp atm control-mode [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/mpls/command/mp-cr-book/mp-m1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368117359,
    "recordOffset": 368042075,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{76307=The following example shows how to use the reinstall keyword to control the maximum number of VRF routes allowed. In this example, the router issues a warning when the number of routes exceeds 800 (80% of 1000 routes), but it still accept routes. When the number of new routes reaches 1000 (the limit), the router rejects them and does not accept more until the number of routes drops below 900 (90% of 1000) installed routes., 77022=The following example shows how to set the maximum number of VRF routes allowed to 1000 and set the warning threshold at 80 percent of the maximum. When the number of routes for the VRF reaches 800, the router issues a warning message. When the number of routes for the VRF reaches 1000, the router issues a syslog error message and rejects any new routes., 77605=The following example shows how to set a limit threshold of VRF routes to 1000. When the number of routes for the VRF reaches 1000, the router issues a syslog error message, but continues to accept new VRF routes., 1586=This command was implemented on Cisco ASR 1000 Series Aggregation Services Routers.}",
    "TableContextTimeStampAfterTable": "{354442=The following example show how to configure a dynamic local label space with a minimum static value set to 1000 and the maximum static value set to 1048575 and a static label space with a minimum static value set to 16 and a maximum static value set to 999:, 390228=In the following example, the router is configured to advertise the label for network 10.165.200.0 only to LSR 10.200.110.55, the label for network 10.35.35.55 only to LSR 10.150.25.25, and the labels for all other prefixes to all LSRs:, 234893=This is a per-interface command. The command establishes an explicit NULL LSP at the customer edge (CE) router. If MPLS is configured on a router and you enter this command, an error message occurs. This command is also supported on the Cisco 2600 series and Cisco 3600 series platforms., 135371=This command is available on both extended MPLS ATM (XTagATM) interfaces and on LC-ATM subinterfaces of router ATM interfaces. The command is not available on the LS1010, where all subinterfaces are automatically VP tunnels., 6867=This command was introduced on Cisco ASR 1000 series routers., 179924=The minutesargument specifies the number of minutes between one export of the entire MPLS PAL table and the next export of the entire table. We recommend that you select a time interval from 360 minutes (6 hours) to 1440 minutes (24 hours) depending on the size of your network. If you want to trigger an immediate export of the PAL table, disable the functionality (no mpls export interval command) and reconfigure the command with the minutes argument greater than zero., 351222=If you configure the dynamic label space from 16 to 1048575, the static label space can be in a range that is outside the chosen dynamic label space. The upper and lower minimum static label values are displayed in the help line. For example, if you configure the dynamic label with a minimum value of 100 and a maximum value of 1000, the help lines display as follows:, 352069=In this example, you can configure a static range from one of the following ranges: 16 to 99 or 1001 to 1048575.}",
    "textBeforeTable": "Syntax Description [cos-value] ] ] [ cos-value [ cos-value cos-value cos match no [cos-value] ] ] [ cos-value [ cos-value cos-value cos match To match a packet on the basis of a Layer 2 class of service (CoS)/Inter-Switch Link (ISL) marking, use the matchcos command in class-map configuration or policy inline configuration mode. To remove a specific Layer 2 CoS/ISL marking as a match criterion, use the no form of this command. match cos mpls ldp atm control-mode mpls ldp advertise-labels old-style mpls ldp advertise-labels mpls ldp address-message mpls label range mpls label protocol (interface configuration) mpls label protocol (global configuration) mpls label mode (6VPE) mpls label mode mpls label mpls l2transport route mpls ipv6 source-interface mpls ip ttl-expiration pop mpls ip propagate-ttl mpls ip encapsulate explicit-null mpls ip default-route mpls ip (interface configuration) mpls ip (global configuration) mpls forwarding bgp mpls export vpnv4 prefixes",
    "textAfterTable": "Command History Release Modification 12.1(5)T This command was introduced. 12.0(25)S This command was integrated into Cisco IOS Release 12.0(25)S. 12.2(28)SB This command was integrated into Cisco IOS Release 12.2(28)SB. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2(31)SB This command was integrated into Cisco IOS Release 12.2(31)SB and implemented on the Cisco 10000 series routers. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware. 12.2(33)SRC This command was",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}