{
    "relation": [
        [
            "First Name",
            "Andy",
            "Thomas"
        ],
        [
            "Last Name",
            "Lewin",
            "McCrocklin"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=E751B8FD-1892-4C2F-8404-99D60CB62366&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222745516,
    "recordOffset": 222729122,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44627=Insurance Industry Competition Act of 2007 (HR 1081/S 618) To further competition in the insurance industry., 22471=Holocaust Insurance Accountability Act (HR 1746) - requires disclosure of Holocaust-era policies by insurers and establish a federal cause of action for claims arising out of a covered policy; Overseas Private Investment Corporation Reauthorization Act of 2007 (HR 2798) - general support in reauthorizing the programs of the Overseas Private Investment Corporation; Closing the Foreign Lobbying Loophole Act (S. 3123) - To require lobbyists who represent foreign politicians or political parties and foreign entities to register under the Foreign Agents Registration Act of 1938;, 41088=Data Security Act of 2007 (HR 1685/S 1260/S 1178) A bill to protect infromation relating to consumers, to require notice of security breaches, and for other purposes. Identity Theft and Prevention Act (S 1178) A bill to strengthen data protection and safeguards, require data breach notification, and further prevent identity theft., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18281=Stop Tax Haven Abuse Act (S 681/HR 2136) - legislation naming Switzerland (among other countries) as a secrecy jurisdiction for tax purposes for certain transactions; Proposals to alter tax treatment of legitimate business transactions undertaken by U.S. subsidiaries of foreign parent corporations. MADE in the USA Tax Act (S. 3162) - (Title II, Subtitle C, Section 225) sense of the Senate regarding certain reinsurance transactions with foreign related persons; Oversight of the Performance and Effectiveness of National Contracting Act of 2008 (S. 3139) - (Title I, Section 102) prohibition on awarding of government contracts or grants to companies purposefully organized in an offshore secrecy jurisdiction to avoid federal tax obligation; HR 6969 - To amend the Internal Revenue Code of 1986 to disallow the deduction for excess non-taxed reinsurance premiums with respect to United States risks paid to affiliates., 33906=Climate Stewardship and Innovation Act of 2007 (S 280) A bill to provide for a program to accelerate the reduction of greenhouse gas emissions in the United States by establishing a market-driven system of greenhouse gas tradeable allowances, to support the deployment of new climate change-related technologies, and to ensure benefits to consumers from the trading in such allowances, and for other purposes. America's Climate Security Act of 2007 (S 2191) A bill to direct the Administrator of the Environmental Protection Agency to establish a program to decrease emissions of greenhouse gases, and for other purposes. (cap-and-trade), 26260=Farm, Nutrition, and Bioenergy Act of 2007 (HR 2419/S 2301) - (Title XI, subtitle A) provisions specific to the funding and operation of the federal crop insurance program, 12206=Implementation of the Terrorism Risk Insurance Program Reathorizaton Act (HR 2761) - extends the current terrorism insurance program at the Dept. of Treasury; National Insurance Act (HR 3200, S 40) - a bill to establish an Office of National Insurance within the Dept. of Treasury (create an optional federal insurance charter); Flood Insurance Choice Act of 2007 (S 1890) - allows individuals the opporturnity to opt out of flood insurance coverage contingent on certain certifications; Flood Insurance Reform and Modernization Act (HR 3121, S 2284) - Amends the Flood Insurance Act of 1968 to restore its financial solvency; Multiple Peril Insurance Act of 2007 (HR 920) - Amends the National Flood Insurance Act of 1968 to provide for the national flood insurance program to make available multiperil coverage for damage resulting from windstorms or floods; Commission on Catastrophic Disaster Risk and Insurance Act of 2007 (S 292/HR 537) - Establishes the bipartisan Commission on Catastrophic Disaster Risk and Insurance to assess post-event insurance markets and exposures; Policyholder Disaster Protection Act of 2007 (HR 164 / S 926) - amends the Internal Revenue Code of 1986 to provide for the creation of disaster protection funds by property and casualty insurance companies for the payment of policyholders' claims arising from future catastrophic events; Homeowners Insurance Protection Act of 2007 (HR 91/ S 1061) - establishes a program to provide reinsurance for State natural catastrophe insurance programs; encourages and promotes mitigation and prevention for, and recovery and rebuilding from such catastrophes, and assists in the financial recovery from catastrophes; Homeowners' Insurance Availability Act of 2007 (HR 330) - establishes a Federal program to provide reinsurance to improve the availability of homeowners' insurance; Homeowners' Defense Act of 2007 (HR 3355) - provides federal support for state-sponsored insurance programs by facilitating a National Catastrophe Risk Consortium and creating a National Homeowners' Insurance Stabilization Program; Catastrophe Savings Accounts Act of 2007 (HR 927) - amends the Internal Revenue Code of 1986 to create tax-exempt Catastrophe Savings Accounts; Nonadmitted and Reinsurance Reform Act of 2007 (S 929/ HR 1065) - streamlines the regulation of nonadmitted insurance and reinsurance markets; Proposals to expand the Liabilty Risk Retention Act to include property coverage (no specific legislation introduced); Passanger Vehicle Loss Disclosure Act (S 545/ HR 2811) - requires insurers and self-insurers of passenger motor vehicles to disclose to the public passenger vehicle loss data;, 29635=Commonsense Food Comsumption Act of 2007 (HR 2183/S 1323) To prevent legislative and regulatory functions from being usurped by civil liability actions brought or continued against food manufacturers, marketers, distributors, advertisers, sellers, and trade associations for claims or injury relating to a person's weight gain, obesity, or any health condition associated with weight gain or obesity. General tracking of asbestos-related discussions. Arbitration Fairness Act of 2007 (H.R. 3010, S.1782) Invalidates and denies inforceability of most predispute arbitration agreements; Fairness in Nursing Home Arbitration Act of 2008 (H.R. 6126, S. 2838) Pre-dispute arbitration agreements between a long-term care facilities and a resident shall not be valid or specifically enforceable; Automobile Arbitration Fairness Act of 2008 (H.R. 5312) Amends federal arbitration law to require that a controversies in motor vehicle consumer sales or lease contracts may not be settled by arbitration unless agreed to in writing by parties;}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City  Schaumburg State  IL Zip Code  61906 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  Martin Feuer  9175344536  martin.feuer@zurichna.com 5. Senate ID#  42193-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}