{
    "relation": [
        [
            "Citing Patent",
            "US7273015",
            "US7914280 *",
            "US8234986",
            "US8826835 *",
            "US8960107"
        ],
        [
            "Filing date",
            "Mar 31, 2006",
            "May 19, 2005",
            "Jun 16, 2006",
            "Jan 18, 2012",
            "Jun 15, 2006"
        ],
        [
            "Publication date",
            "Sep 25, 2007",
            "Mar 29, 2011",
            "Aug 7, 2012",
            "Sep 9, 2014",
            "Feb 24, 2015"
        ],
        [
            "Applicant",
            "Consolidated Engineering Company, Inc.",
            "Innovative Energy, Inc.",
            "The Sefa Group, Inc.",
            "General Kinematics Corporation",
            "The SEFA Group Inc."
        ],
        [
            "Title",
            "Method and apparatus for combustion of residual carbon in fly ash",
            "Combustion method and apparatus",
            "Method and apparatus for turbulent combustion of fly ash",
            "Controlling carbon content in conveyed heated material",
            "Apparatus for turbulent combustion of fly ash"
        ]
    ],
    "pageTitle": "Patent US7047894 - Method and apparatus for combustion of residual carbon in fly ash - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7047894?dq=KOI-18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482923471,
    "recordOffset": 482887719,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6366=FIG. 1 illustrates schematically a combustor system 10 of the present invention that can be incorporated into the system 100 and in which particles of fly ash F containing residual carbon are subjected to heat and oxygen for sufficient time to ignite and cause combustion of the residual carbon in the fly ash for substantially removing the carbon from the fly ash. As illustrated in FIG. 1, the combustor system 10 of the present invention is generally a recirculating system in which the ash is processed through one or more passes through the system as desired for ensuring removal of residual carbon from the fly ash to sufficiently desired levels. The system and method of the present invention accordingly is designed to optimally expose the fly ash to oxygen and temperatures at a sufficient level and with sufficient exposure or residence time to cause the combustion of the residual carbon within the fly ash. The resultant processed, cleaned fly ash generally will include substantially reduced levels of residual carbon therein to provide a suitable fly ash product for use in building material applications, such as a cement additive for the manufacture of concrete. U.S. patent application Ser. No. 10/254,747, filed Sep. 25, 2002; U.S. patent application Ser. No. 09/705,019, filed Nov. 2, 2000; U.S. Provisional Patent Application Ser. No. 60/162,938, filed Nov. 2, 1999; and U.S. Provisional Patent Application Ser. No. 60/418,659, filed Oct. 15, 2002, are all incorporated by reference, in their entirety, into the present application as if fully set forth herein.}",
    "TableContextTimeStampAfterTable": "{16204=This application is a continuation-in-part of U.S. patent application Ser. No. 10/254,747, filed Sep. 25, 2002, now abandoned which is a continuation of U.S. patent application Ser. No. 09/705,019, filed Nov. 2, 2000 (now U.S. Pat. No. 6,457,425), which application claimed the benefit of U.S. Provisional Patent Application No. 60/162,938, filed Nov. 2, 1999., 17852=Most fly ash produced by coal combustion, however, generally contains a significant percentage of fine, unburned carbon particles, sometimes called “char”, that reduces the ash's usefulness as a byproduct. Before the fly ash produced by the combustion of coal and/or other solid fuels can be used in most building products applications, it must be processed or treated to reduce residual carbon levels therein. Typically, it is necessary for the ash to be cleaned to as low as 1–2 percent by weight carbon content before it can be used as a cement additive and in other building products applications. If the carbon levels of the fly ash are too high, the ash cannot be used in many of the aforementioned applications. For example, although fly ash production in the United States for 1998 was in excess of 55 million tons, less than 20 million tons of fly ash were used in building product materials and other applications. Consequently, carbon content of the ash is a key factor retarding its wider use in current markets and the expansion of its use to other markets., 16597=This application also claims the benefit of U.S. Provisional Patent Application No. 60/418,659, filed Oct. 15, 2002.}",
    "textBeforeTable": "Patent Citations It will be understood by those skilled in the art that while the present invention has been discussed above with reference to certain embodiments, various modifications, additions and changes can be made to the invention without departing from the spirit and scope of the invention as set forth in the following claims. The combustor system of the present invention thus enables the processing of fly ash in one or more passes, typically between 2–10 passes through the system for the efficient burnout of carbon within the fly ash to desired levels of as low as about 2% or less. In general, depending upon the general characteristics of the ash, such as particle size, composition, carbon reactivity, number of passes through the system, and the control temperatures used, the total particle residence time within the system generally will range between about 20 to approximately 100 seconds total particle residence time. This residence time further can be varied, as can be the number of passes or recirculation of the fly ash particles through the system, as desired to achieve the desired level of carbon burnout. Re-circulation of solids within the process unit, as mentioned before, permits control of various sub-processes, including overall heat management, intra-reactor solids circulation, and processing rates. Re-circulation of ash within each unit may be achieved by several means, which employ a minimally aerated regulating accumulator. Solids captured in the exhaust system",
    "textAfterTable": "US4291635 Aug 20, 1979 Sep 29, 1981 The Quaker Oats Company Apparatus for feeding fluidized bed incinerator, and method of autogenic operation of same US4312702 May 6, 1980 Jan 26, 1982 Domtar Inc. Fluidized bed start up and operation US4374652 Aug 20, 1981 Feb 22, 1983 Efb Inc. Filter apparatus and method for collecting fly ash and fine dust US4435158 * Jun 25, 1981 Mar 6, 1984 The Energy Equipment Company Limited Heated chamber walls US4465021 Jul 16, 1982 Aug 14, 1984 Deutsche Babcock Aktiengesellschaft Steam generator with a main boiler and a fluidized bed furnace US4470254 May 14, 1982 Sep 11, 1984 Mobil Oil Corporation Process and apparatus for coal combustion US4476790 Jun 1, 1982 Oct 16, 1984 Combustion Engineering, Inc. Method of feeding particulate material to a fluidized bed US4481892 Aug 3, 1983 Nov 13, 1984 Mah Clifford S Atmospheric fluidized bed",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}