{
    "relation": [
        [
            "Cited Patent",
            "US5564018 *",
            "US5893091 *",
            "US5926624 *",
            "US6029175 *",
            "US6119167 *",
            "US6154764 *",
            "US6209032 *",
            "US6219696 *",
            "US6233608 *",
            "US6243705 *",
            "US6278449 *",
            "US6321257 *",
            "US6336137 *",
            "US6341133 *",
            "US6345303 *",
            "US6453361 *",
            "US6513061 *",
            "US6594349 *",
            "US6609150 *",
            "US6610105 *",
            "US6654786 *",
            "US6665711 *",
            "US6742043 *",
            "US6748375 *",
            "US6782419 *",
            "US6810405 *",
            "US20020087651 *"
        ],
        [
            "Filing date",
            "Nov 15, 1993",
            "Apr 11, 1997",
            "Sep 12, 1996",
            "Jun 7, 1996",
            "Jul 11, 1997",
            "Jul 9, 1997",
            "Oct 19, 1998",
            "Aug 1, 1997",
            "Jun 7, 1999",
            "Aug 12, 1998",
            "Sep 3, 1998",
            "Sep 15, 1997",
            "Mar 31, 2000",
            "Oct 9, 1996",
            "Oct 6, 1997",
            "Oct 27, 2000",
            "Oct 6, 1998",
            "Feb 23, 2001",
            "Dec 21, 2001",
            "May 22, 2000",
            "Aug 30, 2000",
            "Sep 12, 2000",
            "Jan 14, 2000",
            "Sep 7, 2000",
            "Jan 30, 2001",
            "Oct 4, 2000",
            "Dec 28, 2000"
        ],
        [
            "Publication date",
            "Oct 8, 1996",
            "Apr 6, 1999",
            "Jul 20, 1999",
            "Feb 22, 2000",
            "Sep 12, 2000",
            "Nov 28, 2000",
            "Mar 27, 2001",
            "Apr 17, 2001",
            "May 15, 2001",
            "Jun 5, 2001",
            "Aug 21, 2001",
            "Nov 20, 2001",
            "Jan 1, 2002",
            "Jan 22, 2002",
            "Feb 5, 2002",
            "Sep 17, 2002",
            "Jan 28, 2003",
            "Jul 15, 2003",
            "Aug 19, 2003",
            "Aug 26, 2003",
            "Nov 25, 2003",
            "Dec 16, 2003",
            "May 25, 2004",
            "Jun 8, 2004",
            "Aug 24, 2004",
            "Oct 26, 2004",
            "Jul 4, 2002"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Immediata Corporation",
            "Audible, Inc.",
            "Teknowledge Corporation",
            "Phone.Com, Inc.",
            "Fujitsu Limited",
            "International Business Machines Corporation",
            "Siemens Corporate Research, Inc.",
            "Openwave Systems Inc.",
            "Palm, Inc.",
            "Sony Corporation",
            "Nokia Telecommunications Oy",
            "Siebel Systems, Inc.",
            "Sony Corporation",
            "Intel Corporation",
            "Ipac Acquisition Subsidiary I, Llc",
            "Hitachi, Ltd.",
            "Nortel Networks Limited",
            "Siebel Systems, Inc.",
            "Openwave Systems Inc.",
            "Openwave Systems Inc.",
            "Openwave Systems Inc.",
            "Webtv Networks, Inc.",
            "Microsoft Corporation",
            "Bandai Co., Ltd.",
            "Starfish Software, Inc.",
            "International Business Machines Corporation"
        ],
        [
            "Title",
            "System for automatically distributing selected mail item to selected user associated with office location within physical office floor plan in data processing system",
            "Multicasting with key words",
            "Digital information library and delivery system with logic for generating files targeted to the playback device",
            "Automatic retrieval of changed files by a network software agent",
            "Pushing and pulling data in networks",
            "On-line forum-type electronic conference system maintaining consistency of messages",
            "Enabling target servers to control determination of full user synchronization",
            "System for providing targeted internet information to mobile agents",
            "Method and system for securely interacting with managed data from multiple devices",
            "Method and apparatus for synchronizing information on two different computer systems",
            "Apparatus and method for designating information to be retrieved over a computer network",
            "Method and apparatus for accessing internet service in a mobile communication network",
            "Web client-server system and method for incompatible page markup and presentation languages",
            "Information providing apparatus and portable communication terminal",
            "Network proxy capable of dynamically selecting a destination device for servicing a client request",
            "Meta-application architecture for integrating photo-service websites",
            "Proxy server selecting server and proxy server",
            "System and method for automatically delivering messages to a telecommunications device",
            "Web client-server system and method for incompatible page markup and presentation languages",
            "Method and system for providing resource access in a mobile environment",
            "Method and apparatus for informing wireless clients about updated information",
            "Method and apparatus for integrating narrowband and wideband data transports",
            "Reformatting with modular proxy server",
            "System and method for content retrieval",
            "System and method for distributing images to mobile phones",
            "System and methods for synchronizing data between multiple datasets",
            "Method and apparatus for transferring correspondence information"
        ]
    ],
    "pageTitle": "Patent US20020078180 - Information collection server, information collection method, and recording ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20020078180?dq=6480844",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480413879,
    "recordOffset": 480387101,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64740=[0078] Furthermore, if access to a home page is charged (e.g., as-used based on the time), it is possible to reduce the cost of receiving information by accessing intermittently. Further cost reduction is possible by limiting the access time interval. For example, if the user desires to know the latest baseball news, access is limited to the interval from 6 to 10 o'clock during which baseball is played, and if stock price information is desired, access is limited to the interval during which the stock market is opened.}",
    "textBeforeTable": "Patent Citations [0112] Furthermore, means as referred to herein do not always mean physical means but include cases where the functions of each leans are realized through software. Furthermore, the functions of one means may be realized through two or more physical means, or the functions of two or more means may be realized through one physical means. [0111] The present invention is not limited to the embodiments above and includes various alterations within the scope defined in the claims, which are included in the scope of the present invention. [0110] According to Embodiment 4 of the present invention, synchronization is performed between the web server and the information collection server, so any change in the web server contents can be immediately reflected in the information collection server. [0109]FIG. 8 is a flowchart of Embodiment 4 of the present invention, showing the synchronization procedures between the information collection server and the web server (S41 to S44, S46 to S49). A detailed explanation will be omitted, as the procedures are similar to that in FIGS. 3 and 4. Furthermore, these synchronization procedures can also be applied to the information transmission (S51, S52) and message communication (S53 to S56) procedures between the information collection server and the mobile terminal. [0108] In Embodiment 1, contents/messages were synchronized between the information collection server and the mobile terminal. However,",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7478170 * Mar 5, 2002 Jan 13, 2009 Sun Microsystems, Inc. Generic infrastructure for converting documents between formats with merge capabilities US7664738 * Dec 7, 2005 Feb 16, 2010 Canon Kabushiki Kaisha Search system, information processing apparatus, control method therefor, and program US7756898 * Mar 31, 2006 Jul 13, 2010 Isilon Systems, Inc. Systems and methods for notifying listeners of events US8250180 Jul 1, 2008 Aug 21, 2012 Hitachi, Ltd. Content delivery apparatus and content delivery method using the same US8990338 Sep 9, 2010 Mar 24, 2015 Google Technology Holdings LLC Method of exchanging photos with interface content provider website US9026581 * Sep 9, 2010 May 5, 2015 Google Technology Holdings LLC Mobile device and",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}