{
    "relation": [
        [
            "Cited Patent",
            "US2334503 *",
            "US2388567 *",
            "US2396121 *",
            "US2673295 *",
            "US2872677 *",
            "US3268897 *",
            "US3587104 *",
            "US3739387 *"
        ],
        [
            "Filing date",
            "Oct 2, 1940",
            "Jan 28, 1943",
            "Feb 7, 1945",
            "Sep 11, 1950",
            "Dec 27, 1956",
            "Sep 16, 1964",
            "Jan 8, 1969",
            "Jul 13, 1971"
        ],
        [
            "Publication date",
            "Nov 16, 1943",
            "Nov 6, 1945",
            "Mar 5, 1946",
            "Mar 23, 1954",
            "Feb 3, 1959",
            "Aug 23, 1966",
            "Jun 22, 1971",
            "Jun 12, 1973"
        ],
        [
            "Applicant",
            "Packard Motor Car Co",
            "Philco Radio & Television Corp",
            "Croname Inc",
            "Wentworth Gerald G",
            "Philco Corp",
            "Link Ralph R",
            "Braund Mfg Co",
            "Barker Mfg Co Inc"
        ],
        [
            "Title",
            "Motor vehicle antenna",
            "Portable radio receiver",
            "Portable radio receiver",
            "Foldable television antenna",
            "Broadcast receivers",
            "Citizen's band radio antenna",
            "Foldable antenna",
            "Dual purpose antenna control"
        ]
    ],
    "pageTitle": "Patent US4253099 - Automobile antenna - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4253099?ie=ISO-8859-1&dq=7,134,016",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476719723,
    "recordOffset": 476695916,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention has been described with respect to preferred embodiments, it is not to be so limited as changes and modifications may be made therein which are within the full intended scope as defined by the appended claims. In the description suction cups 4, 4' and 4\" are illustrated for mounting the antenna body on the roof of the vehicle, however, magnets or other mechanical attaching means may be used for this purpose. In the above described embodiments, the rod antennas are automatically moved out into the V-shaped operating position from the antenna receiving grooves by the action of springs. However, the antenna elements may also be manually moved to the operating position without the use of springs. In the embodiments described, the spring 21 and the stopper member 19 are used as the holding mechanism for holding the rod antennas in the extended V-shaped. However, it is to be realized that any locking means for locking the base portions of the rod antennas may be used in the holding mechanism instead of the spring 21 and the stopper 19. In the above described embodiments, the ornamental knobs 25 and 25' are used in the locking mechanism for locking the rod antennas in the stored position. However, instead of ornamental knobs, the base portions of the rod antennas formed as pipe portions may be used as a portion of the locking mechanism. In the embodiments",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4788551 * Jul 31, 1986 Nov 29, 1988 Nissan Motor Co., Ltd. Apparatus for storing an antenna for vehicle US5177493 * Mar 1, 1991 Jan 5, 1993 Pioneer Electronic Corporation Antenna device for movable body US6496152 * Mar 9, 2001 Dec 17, 2002 Jack Nilsson Dual polarized antenna US7030831 Feb 25, 2004 Apr 18, 2006 Wifi-Plus, Inc. Multi-polarized feeds for dish antennas US7138956 Feb 25, 2004 Nov 21, 2006 Wifi-Plus, Inc. Apparatus and method for a multi-polarized ground plane beam antenna US7348933 Feb 25, 2004 Mar 25, 2008 Wifi Plus, Inc. Compact multi-polarized antenna for portable devices US7358909 * Sep 27, 2005 Apr 15, 2008",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}