{
    "relation": [
        [
            "Date",
            "Jun 11, 1996",
            "Aug 12, 1998",
            "Nov 16, 1998",
            "Nov 16, 1998",
            "Jan 4, 2001"
        ],
        [
            "Code",
            "RF",
            "REMI",
            "FPAY",
            "SULP",
            "AS"
        ],
        [
            "Event",
            "Reissue application filed",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment"
        ],
        [
            "Description",
            "Effective date: 19960418",
            "",
            "Year of fee payment: 4",
            "",
            ""
        ]
    ],
    "pageTitle": "Patent US5371551 - Time delayed digital video system using concurrent recording and playback - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5371551?dq=6,360,693",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481736671,
    "recordOffset": 481689379,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30815=The compressor 18 and decompressor 25 are preferably implemented by one of the available video encoder/decoder (codec) chip sets, such as Integrated Technology's (ITI) video processor, which supports both the H.261 video communications standard and multimedia standards MPEG and JPEG. Other video codec chip sets include the AT&T three-chip AVP-1000, GEC Plessey Semiconductors' VP2611 and a multi-standard chip set from Intel.}",
    "textBeforeTable": "Patent Citations It is to be understood that the specific arrangement which has been described is merely illustrative of one application of the principles of the invention. Numerous modifications may be made by those skilled in the art without departing from the true spirit and scope of the invention. REVERSE. In the reverse mode the direction of the read point is reversed so that flames already transmitted to the display are retransmitted in a reverse order. The length of time the reverse mode may be invoked is limited by the number of flames separating the read point and the write point. SLOW/FAST MOTION. Upon command from the control unit 42 or the computer 49, the microcontroller 22 may advance the read point at an increased or decreased rate commensurate with playback speed selected by the user. RESOLUTION. In addition to varying the read and write points the microcontroller 22 may also vary the compression ratio of the compressor 18 to increase the effective capacity of the buffer memory by reducing the resolution, color quality image size of the stored images, to vary the effective programming buffer capacity. CHANNEL SELECTION. The user may select a channel in the usual way (using numerical channel selection buttons), or may select the channel to be viewed (and recorded in the buffer) by commanding the tuner 10 to supply a sequence of frames from the available channel signals which are assembled, in compressed",
    "textAfterTable": "Apr 7, 1992 Motorola, Inc. Asynchronous voice reconstruction for a digital communication system US5130792 * Feb 1, 1990 Jul 14, 1992 Usa Video Inc. Store and forward video system US5132992 * Jan 7, 1991 Jul 21, 1992 Paul Yurt Audio and video transmission and receiving system US5181114 * Mar 7, 1991 Jan 19, 1993 Sony Corporation Including break slots in broadcast video signals US5191431 * Aug 13, 1990 Mar 2, 1993 Canon Kabushiki Kaisha Recording apparatus having plural operating modes involving diverse signal compression rates and different apportioning of pilot signal recording area US5283639 * Sep 10, 1991 Feb 1, 1994 Esch Arthur G Multiple media delivery network method and apparatus * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}