{
    "relation": [
        [
            "Citing Patent",
            "US6381289 *",
            "US6734790",
            "US7127068 *",
            "US7545258 *",
            "US7548622",
            "US7797001 *",
            "US7810152",
            "US8045716",
            "US8800059",
            "US20010055393 *",
            "US20020004858 *",
            "US20040177034 *",
            "US20050030156 *",
            "EP1175035A2 *"
        ],
        [
            "Filing date",
            "Sep 1, 1998",
            "May 1, 2002",
            "May 23, 2001",
            "Apr 11, 2006",
            "Jul 6, 2001",
            "Apr 1, 2004",
            "May 8, 2002",
            "Jun 16, 2009",
            "Aug 27, 2012",
            "May 23, 2001",
            "Jul 6, 2001",
            "Mar 19, 2004",
            "Jul 23, 2004",
            "Jul 6, 2001"
        ],
        [
            "Publication date",
            "Apr 30, 2002",
            "May 11, 2004",
            "Oct 24, 2006",
            "Jun 9, 2009",
            "Jun 16, 2009",
            "Sep 14, 2010",
            "Oct 5, 2010",
            "Oct 25, 2011",
            "Aug 5, 2014",
            "Dec 27, 2001",
            "Jan 10, 2002",
            "Sep 9, 2004",
            "Feb 10, 2005",
            "Jan 23, 2002"
        ],
        [
            "Applicant",
            "Ericsson Inc.",
            "Scotty Hodger",
            "Info Space, Inc.",
            "Toyota Jidosha Kabushiki Kaisha",
            "Broadcom Corporation",
            "Avaya Inc.",
            "Broadcom Corporation",
            "Broadcom Corporation",
            "Broadcom Corporation",
            "Vale Sundaravel",
            "Carr Jeffrey D.",
            "Payment Protection Systems, Inc.",
            "Ronel Alfonso",
            "Broadcom Corporation"
        ],
        [
            "Title",
            "Demodulation method in high speed asynchronous time division multiplexed packet data transmission",
            "Security alarm wrist watch",
            "Geographical comparison system and method",
            "Vehicle theft prevention system",
            "System and method for the concealment of device input parameters",
            "Location-based command execution for mobile telecommunications terminals",
            "System and method for securely controlling access to device functions",
            "System and method for the concealment of device input parameters",
            "System and method for processing and protecting content",
            "Geographical comparison system and method",
            "System and method for the concealment of device input parameters",
            "Loan repay enforcement system",
            "Long-range wireless vehicle command system",
            "System and method for the concealment of device input parameters"
        ]
    ],
    "pageTitle": "Patent US5903653 - Vehicle security system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5903653?dq=5579430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474920055,
    "recordOffset": 474891970,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21713=Additional systems have been proposed for eliminating vehicle theft which operate by disabling the vehicle. The earliest systems of this type, of course, were those that disabled the vehicle in response to a breaking and entering of the vehicle. However, these again can be thwarted. Further, they can also fail. This has lead to user disabled systems which utilize some type of paging system that can send commands to the vehicle to alter the operation thereof and effectively stop the vehicle. These commands can be of the type that slow the vehicle down, they can be the type that turn off the ignition switch, or any type of command that is operable to affect the parameters of the vehicle. One system is that disclosed in U.S. Pat. No. 5,490,200, issued to Snyder et al. on Feb. 6, 1996.}",
    "textBeforeTable": "Patent Citations Although the preferred embodiment has been described in detail, it should be understood that various changes, substitutions and alterations can be made therein without departing from the spirit and scope of the invention as defined by the appended claims. In summary, there has been provided an anti-theft system that utilizes a pager for receiving a disabling signal. In order to ensure the liability of the received signal and to ensure that it does not \"false trigger\", a relatively elaborate encryption/ decryption algorithm is employed. This utilizes at least three levels of encryption. The first level utilizes a randomly generated table for each pager that is stored at both the central office and at the vehicle. By utilizing a Modulo-2 addition encryption algorithm with that key table, the received data need only be compared with a key table at the receiving location with the Modulo-2 addition to decrypt the data. Also, a command embedded within the message is further encrypted with the use of command tables at each of the central office and the receiving location at the vehicle to be disabled. These command tables allow information other than the actual command itself to be transmitted, this being a random number that has no correlation to the actual command. A third level is provided by placing an error checking byte value at the end of the message which, after being decrypted, is compared to the decrypted words",
    "textAfterTable": "US5652564 * Jul 26, 1995 Jul 29, 1997 Winbush; Solomon Lanair Bold thief security system US5742227 * May 3, 1996 Apr 21, 1998 Escareno; Joe System and method for vehicle theft prevention and recovery US5815087 * Apr 2, 1996 Sep 29, 1998 Ford Motor Company Anti-theft sysem for a removable accessory of an automotve vehicle * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6381289 * Sep 1, 1998 Apr 30, 2002 Ericsson Inc. Demodulation method in high speed asynchronous time division multiplexed packet data transmission US6734790 May 1, 2002 May 11, 2004 Scotty Hodger Security alarm wrist watch US7127068 * May 23, 2001 Oct 24, 2006 Info Space, Inc. Geographical comparison system and method",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}