{
    "relation": [
        [
            "Date",
            "Jan 27, 1997",
            "Jun 30, 2000",
            "Apr 17, 2001",
            "Jul 7, 2004",
            "Jul 14, 2008",
            "Aug 20, 2008",
            "Jan 7, 2009",
            "Feb 23, 2009",
            "Feb 24, 2009",
            "Feb 25, 2009",
            "Feb 25, 2009"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "CC",
            "FPAY",
            "REMI",
            "AS",
            "REIN",
            "PRDP",
            "FP",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Reinstatement after maintenance fee payment confirmed",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Expired due to failure to pay maintenance fee",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ELM TECHNOLOGY CORPORATION, WYOMING Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LEEDY, GLENN J.;REEL/FRAME:008328/0327 Effective date: 19970120",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "",
            "Owner name: TAIWAN SEMICONDUCTOR MANUFACTURING CO., LTD.,TAIWA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ELM TECHNOLOGY CORPORATION;REEL/FRAME:021411/0158 Effective date: 20080422",
            "",
            "Effective date: 20090225",
            "Effective date: 20090107",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5592018 - Membrane dielectric isolation IC fabrication - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5592018?dq=6,232,546",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483733103,
    "recordOffset": 483667412,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{65243=1. Heavily boron doped (typically greater than 1018 atoms/cm2) etch stop layer (formed by diffusion, implant or epitaxy) with optional epitaxial SiGe (less than 20% Ge) anti-autodoping overlayer layer and optional epitaxial layer., 49122=This is a continuation of Ser. No. 08/315,905, filed on Sep. 30, 1994, which is a divisional of application Ser. No. 07/865,412, filed Apr. 8, 1992, U.S. Pat. No. 5,354,695., 49661=Mechanically and thermally durable free standing dielectric and semiconductor membranes have been disclosed with thicknesses of less than 2 μm. (See commonly invented U.S. Pat. No. 4,924,589, and U.S. patent application Ser. No. 07/482,135, filed Feb. 16, 1990, now U.S. Pat. No. 5,103,557, both incorporated herein by reference). This disclosure combines the novel use of these technologies and other integrated circuit (IC) processing techniques to form ICs as membranes typically less than 8 μm thick. This approach to IC fabrication falls under the generic industry-established title known as Dielectric Isolation (DI), and is inclusive of subject areas such as Silicon-on-Insulator (SOI) and Silicon-on-Sapphire (SOS). ICs formed from dielectric and semiconductor membranes can reduce significantly the number and complexity of processing steps presently used to provide complete IC device isolation; dielectric isolation techniques that provide dielectric isolation on all surfaces of the individual circuit devices comprising the complete IC are not as yet widely used in volume IC fabrication. Integrated Circuits are defined as commonly understood today when referring to SSI, MSI, LSI, VLSI, ULSI, etc. levels of circuit complexity., 84525=The interconnect circuit membrane can also be formed on a glass or quartz substrate 23 (typically less than 50 mils thick). In this case a tensile film 25 of polysilicon (as taught by L. E. Trimble and G. E. Celler in \"Evaluation of polycrystalline silicon membranes on fused silica\" J. Vac. Sci. Technology B7(6), Nov/Dec 1989) is deposited on both sides of the substrate 23, as shown in FIG. 1h. A MDI interconnect circuit membrane 27 is then formed on the polysilicon membrane 25, as shown in FIG. 1i. An opening 29 in the polysilicon 25 on the backside of the substrate 23 is made and the back of the substrate 23 is selectively etched leaving a free standing tensile polysilicon membrane 27 held in the frame 23b of the remaining substrate, as shown in FIG. 1j. The polysilicon 25 directly beneath the circuit membrane 27 can optionally be removed as also shown in FIG. 1j. A metal film (not shown) or other protective layer is deposited over the circuit membrane prior to etching the backside of the substrate to protect the circuit membrane from the substrate etchant. Considerations for using a non-semiconductor substrate in the fabrication of MDI interconnect circuit membrane are substrate material cost or application requirements. Examples of applications for this approach to membrane fabrication are masks for high resolution conformal contact lithographic printing and MCM (Multi-Chip Module) interconnect circuits., 123592=Selective growth of high quality epitaxial films in a confined volume was reported in a paper (\"Confined Lateral Selective Epitaxial Growth of Silicon for Device Fabrication,\" Peter J. Schubert, Gerold W. Neudeck, IEEE. Electron Device Letters, Vol. 11, No. 5, May 1990, page 181-183). This \"CLSEG\" (Confined Lateral Selective Epitaxial Growth) method was developed to achieve dielectric isolation of crystalline silicon., 81667=Method #2 fabricates a thin low stress semiconductor substrate membrane 20, such as the one shown in FIG. 2, prior to deposition of the low stress dielectric membrane and fabrication of semiconductor devices. This substrate membrane as shown in FIG. 2 can be formed through established selective electro-chemical etching techniques or by combination of wafer bonding, grinding and selective substrate etching techniques. The membrane preferably has a tensile stress of approximately 108 dynes/cm2. (This can be achieved in one manner by forming a layer with n-type dopant concentrations of 1016 to 1019 atoms/cm2 and applying electrochemical etch techniques.) After the semiconductor substrate membrane 20 is fabricated (see FIG. 3a), semiconductor devices 24, 26, 28, . . . , 30 are fabricated and interconnected on the substrate 20 with the use of low stress dielectric material. The low stress dielectric membrane formed on the semiconductor substrate (along with interconnect metallization) becomes the only structural circuit membrane component after the semiconductor substrate portion of the membrane is etched or trenched into independent semiconductor devices. An additional layer (not shown) of low stress dielectric over the interconnect metallization may be applied for passivation and to increase the thickness of the resulting membrane 20 to achieve a specific desired level of durability.}",
    "textBeforeTable": "Patent Citations This disclosure is illustrative and not limiting; further modifications will be apparent to one skilled in the art in light of this disclosure and the appended claims. The benefits of such die assembly practice are dramatically increased circuit device densities and low thermal mass for efficient cooling. The handling equipment for making such a circuit assembly is presently available. FIG. 32d shows a 3D circuit structure of membrane dice 764-a, 764-b, 764-c bonded by anodic or fusion (thermal) techniques to a substrate 770. The handling of the individual die 764-a, 764-b, 764-c can be done in a manner similar to that described above, and the bonding and interconnect completion methods are also as described above for bonding the circuit membranes together. FIG. 32c shows a 3D circuit structure of membrane dice (ICs) 764-a, 764-b, 764-c bonded by compression technique to a rigid substrate 770. This is accomplished by aligning metal pads 772-1, 1,772-2, . . . , 772-k, . . . , 772-x on the rigid substrate 770 and metal pads 776-1, 776-2, ..., 776-w on the membrane die 764-a, . . . , 764-c and then applying temperature and pressure (as explained previously). Also shown are bonding-out pads 778-1, 778-2. The surfaces are bonded together by the metal pads which also serve as circuit interconnect and thermal relief paths. Once the circuit membrane substrate or wafer is cut into dice in the manner which is",
    "textAfterTable": "Robert Bruce Davies Die attachment and method US6838896 Sep 6, 2001 Jan 4, 2005 Elm Technology Corporation Method and system for probing, testing, burn-in, repairing and programming of integrated circuits in a closed environment using a single apparatus US6845664 Oct 3, 2002 Jan 25, 2005 The United States Of America As Represented By The Administrator Of National Aeronautics And Space Administration MEMS direct chip attach packaging methodologies and apparatuses for harsh environments US6869866 Sep 22, 2003 Mar 22, 2005 International Business Machines Corporation Silicide proximity structures for CMOS device performance improvements US6872641 Sep 23, 2003 Mar 29, 2005 International Business Machines Corporation Strained silicon on relaxed sige film with uniform misfit dislocation density US6887751 Sep 12, 2003 May 3, 2005 International Business Machines Corporation MOSFET performance improvement using deformation in SOI structure US6887798 May 30, 2003 May 3, 2005 International Business Machines Corporation STI stress modification by nitrogen plasma treatment for improving performance in small width devices US6890808 Sep 10, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}