{
    "relation": [
        [
            "Citing Patent",
            "US4984644 *",
            "US8493219",
            "US8576065",
            "US8629776",
            "US8657744"
        ],
        [
            "Filing date",
            "Jun 28, 1989",
            "Oct 29, 2009",
            "Nov 2, 2010",
            "Nov 23, 2010",
            "Mar 2, 2010"
        ],
        [
            "Publication date",
            "Jan 15, 1991",
            "Jul 23, 2013",
            "Nov 5, 2013",
            "Jan 14, 2014",
            "Feb 25, 2014"
        ],
        [
            "Applicant",
            "Mid-America Scale, Inc.",
            "Bi Incorporated",
            "Bi Incorporated",
            "Bi Incorporated",
            "Bi Incorporated"
        ],
        [
            "Title",
            "Overhead lever torque suspension weighing scale",
            "Systems and methods for adaptive monitoring and tracking of a target having a learning period",
            "Systems and methods for variable collision avoidance",
            "Systems and methods for disrupting criminal activity",
            "Systems and methods for transdermal secretion detection"
        ]
    ],
    "pageTitle": "Patent US4821823 - Torque suspension weighing scale - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4821823?ie=ISO-8859-1&dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473870971,
    "recordOffset": 473851032,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The invention being thus described, it will be obvious that the same may be varied in many ways. Such variations are not to be regarded as a departure from the spirit and scope of the invention, and all such modifications as would be obvious to one skilled in the art are intended to be included within the scope of the following claims. It should be understood that the torque suspension weighing scale of the present invention provides unique retention assemblies which substantially increase the sensitivity and practicality of livestock weighing scales or other heavy duty scales requiring a high amount of precision in their measurements. As more clearly shown in FIG. 9, the cylindrical torque member 30 is positioned along the width of each end of the livestock scale, and requires two cable and seat retention assembly devices fitted within corresponding keyhole slots 48 for each torque tube 30. Element 34 shows the location of the center vertical secondary retention assembly described in connection with FIG. 3. With the ball and seat retention assembly 42 of the present invention in which a ball 50 and ball seat 52 combination is fitted into a separate flanged seat on each end of a weigh cable, greater stability and anchoring properties are provided. The ball seat 52, as previously indicated is mated with a corresponding key hole slot 48 along the periphery of a suspended weighing platform 14 as",
    "textAfterTable": "US4427083 * Oct 22, 1980 Jan 24, 1984 Poldenvale Ltd. Livestock weighing apparatus US4533008 * Mar 6, 1984 Aug 6, 1985 Ostermann Jerry L Livestock scale US4569408 * May 25, 1984 Feb 11, 1986 Nordic Forge, Inc. Portable animal scale US4601356 * Feb 1, 1985 Jul 22, 1986 Muccillo Jr Vincent J Suspended platform scale structure * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4984644 * Jun 28, 1989 Jan 15, 1991 Mid-America Scale, Inc. Overhead lever torque suspension weighing scale US8493219 Oct 29, 2009 Jul 23, 2013 Bi Incorporated Systems and methods for adaptive monitoring and tracking of a target having a learning period US8576065 Nov 2, 2010 Nov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}