{
    "relation": [
        [
            "Citing Patent",
            "US4904984 *",
            "US4944170 *",
            "US5021776 *",
            "US5113675 *",
            "US5307656 *",
            "US5387903 *",
            "US5422632 *",
            "US5540068 *",
            "US5541581 *",
            "US5594430 *",
            "US5778711 *",
            "US6032499 *",
            "US6295849 *",
            "US6434984 *",
            "US8375752 *",
            "US20120042703 *",
            "US20130256256 *",
            "WO1993022880A1 *"
        ],
        [
            "Filing date",
            "Jun 10, 1988",
            "Aug 19, 1987",
            "Aug 9, 1989",
            "Jan 7, 1991",
            "Dec 17, 1990",
            "Apr 24, 1992",
            "Oct 28, 1992",
            "May 2, 1994",
            "Jul 26, 1994",
            "Aug 23, 1994",
            "Jun 26, 1996",
            "May 28, 1998",
            "Jul 13, 1998",
            "May 29, 1998",
            "Aug 22, 2011",
            "Aug 22, 2011",
            "Mar 30, 2013",
            "Apr 20, 1993"
        ],
        [
            "Publication date",
            "Feb 27, 1990",
            "Jul 31, 1990",
            "Jun 4, 1991",
            "May 19, 1992",
            "May 3, 1994",
            "Feb 7, 1995",
            "Jun 6, 1995",
            "Jul 30, 1996",
            "Jul 30, 1996",
            "Jan 14, 1997",
            "Jul 14, 1998",
            "Mar 7, 2000",
            "Oct 2, 2001",
            "Aug 20, 2002",
            "Feb 19, 2013",
            "Feb 23, 2012",
            "Oct 3, 2013",
            "Nov 11, 1993"
        ],
        [
            "Applicant",
            "Gartner Klaus W",
            "Relhor S.A.",
            "Yale Security Inc.",
            "Uyeda Alan K",
            "La Gard, Inc.",
            "Ciposa Microtechniques Sa",
            "Intellitouch 2000, Inc.",
            "La Gard, Inc.",
            "Medeco Security Locks, Inc.",
            "La Gard",
            "Masco Corporation",
            "Ilco-Unican S.A.",
            "Masco Corporation",
            "Ilco-Unican S.A./Relhor Division",
            "Shyh Ru Metallic Industrial Corp.",
            "Shyh Ru Metallic Industrial Corp.",
            "Warehouse Innovations, Inc",
            "Gard Inc"
        ],
        [
            "Title",
            "Combination lock with an additional security lock",
            "Device for lifting a time ban on the actuation of a mechanism in a conditional-opening locking system in the event of a breakdown",
            "Electronic combination of lock with changeable entry codes, lock-out and programming code",
            "Intermediate door locking mechanism",
            "High security electronic dial combination lock",
            "Programmable electronic time lock",
            "Electronic security system",
            "High security electronic dial combination lock",
            "Electronic combination lock security system",
            "Programmable electronic time lock",
            "High security electronic dial combination lock",
            "Device for lifting a ban on the opening of a conditional locking system",
            "High security electronic dial combination lock",
            "Drive device for locking and unlocking a lock with conditional opening",
            "Key box",
            "Key box",
            "Time lockable container and system",
            "Programmable electronic time lock"
        ]
    ],
    "pageTitle": "Patent US4774512 - Arrangement for removing a conditional ban on the operation of a lock - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4774512?dq=5,581,513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466744807,
    "recordOffset": 466713020,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40726=However, this removal of the ban may be subject to certain further conditions which may be imposed either by the authorized person, or by the daily user and which are illustrated by traces b and c of FIG. 5. Examining initially trace b, it will be seen that the weekly base program of trace a may be inhibited for a duration extending from several hours to several weeks. In contrast to the base program, this inhibition is not cyclic, but must be programmed by the authorized person step by step and be automatically cancelled following its execution. The inhibition referred to as imposed (since the daily user may not cancel it) may be useful for instance to prevent opening during a vacation period, a leave of absence because of a holiday, etc. In the example as described, the inhibition may be given in \"relative\" weeks (which go from 0 to 3 in number), in days (from 1 to 7), in hours and in minutes between the moment of the beginning and the moment of the end of the inhibition. In the example of FIG. 5, it is supposed that the inhibition period as imposed begins on Tuesday at 8:30 and ends Friday at 6:00., 39941=FIG. 5 shows a timing diagram illustrating an operating example which may be executed by the arrangement in accordance with the invention. Trace a of this diagram shows a weekly base program which is cyclic and which thus is repeated in principle every week. In the case shown, each day presents two time slots respectively between 10 and 12 o'clock and between two and six o'clock of the afternoon. This program is pre-established by an authorized person having available the secret access code which the daily user is unable to modify. It is to be noted that in the example which is to be described hereinafter, one may program each day up to four opening time slots. Thus, the program determines in advance the periods for removal of the ban on opening the lock., 41874=Trace c represents the chosen inhibition, i.e. selectable by the daily user who does not have available the secret access code. This inhibition may be useful when the user must be absent in the course of the day during one or several periods, which is the case in the example shown for Monday. Effectively, the ban on opening is established between 10:00 and 11:30 o'clock and from 16:30 to 18:00., 26088=This is a continuation of application Ser. No. 838,867, filed Mar. 12, 1986, now abandoned.}",
    "textBeforeTable": "Patent Citations If this test comes out negative, test 161 checks if the variable TEMP1 is equal to zero. In the negative case, this value is decremented by one (operation 162) following which there is again checked during test 163 whether this variable is equal to zero. In the positive case, motor 20 is operated in the closing sense (operation 164) and the program loops back to operation 156. In the negative a further test at 165 is effected on variable TEMP1 to check if it is equal to 3. In the negative case the program loops back to operation 156. In the positive case, motor 20 is operated in the opening sense (operation 166). Finally, if test 161 is positive the program loops back to the main program. Following operation 149, which consists of establishing a 1 for the flag FR, it is determined if there has been an error at 157, followed by a check to determine if the variable TEMP0 is equal to zero. In the negative case, the variable is decreased by one at 159, following which this variable is again compared with zero in test 160. Following operation 148, a test is carried out at 150 to determine if there has been an error. If the test is negative, at 151 there will be examined if there is a logical opening. In the positive case, a test is carried out to examine if",
    "textAfterTable": "US5021776 * Aug 9, 1989 Jun 4, 1991 Yale Security Inc. Electronic combination of lock with changeable entry codes, lock-out and programming code US5113675 * Jan 7, 1991 May 19, 1992 Uyeda Alan K Intermediate door locking mechanism US5307656 * Dec 17, 1990 May 3, 1994 La Gard, Inc. High security electronic dial combination lock US5387903 * Apr 24, 1992 Feb 7, 1995 Ciposa Microtechniques Sa Programmable electronic time lock US5422632 * Oct 28, 1992 Jun 6, 1995 Intellitouch 2000, Inc. Electronic security system US5540068 * May 2, 1994 Jul 30, 1996 La Gard, Inc. High security electronic dial combination lock US5541581 * Jul 26, 1994 Jul 30, 1996 Medeco Security Locks, Inc. Electronic combination lock security system US5594430 * Aug",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}