{
    "relation": [
        [
            "Cited Patent",
            "US2770534 *",
            "US3147377 *",
            "US3262386 *",
            "US3280735 *",
            "AU246832B *"
        ],
        [
            "Filing date",
            "May 10, 1953",
            "May 25, 1960",
            "Nov 23, 1959",
            "Apr 13, 1964",
            ""
        ],
        [
            "Publication date",
            "Nov 13, 1956",
            "Sep 1, 1964",
            "Jul 26, 1966",
            "Oct 25, 1966",
            ""
        ],
        [
            "Applicant",
            "Printing Arts Res Lab Inc",
            "Minnesota Mining & Mfg",
            "Little Inc A",
            "Minnesota Mining & Mfg",
            ""
        ],
        [
            "Title",
            "Method and material for making overlay masks",
            "Thermographic production of color-projecting transparencies and sheet materials usefutherein",
            "Duplicating method",
            "Heat-copying process",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US3502871 - Process for making a projection transparency by exposing a sublimeable ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3502871?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480166255,
    "recordOffset": 480142231,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13593=3,502,871 Patented Mar. 24, 1970 \"Ice SUMMARY OF THE INVENTION Briefly, the process of the present invention comprises a thermographic method for making projectionjtransparencies wherein the desired graphic images of the sub; ject are formed on a transparent or translucent sheet or film by sublimation of a compound characterized by having the property of subliming at a temperature substantially lower than its melting temperature, and wherein the sublimed compound becomes an integral part of the film or sheet., 50261=References Cited UNITED STATES PATENTS 2,770,534 11/1956 Marx 250-65.1 3,147,377 9/1964 Newman 250 65.l 3,262,386 7/1966 Gordon 250-65.1 X 3,280,735 10/1966 Clark et a1. 25065.1, 32302=EXAMPLE I This example describes the preparation of a projection transparency of the type adapted to project as black-onwhite, the original graphic subject comprising a sheet of bond paper containing a typewritten text. For the purpose of providing a coating of salicylic acid distributed over the entire surface of the typewritten side of the subject, a charging sheet of short-fiber paper about 0.001\" thick was provided with a surface coating of black-pigmented printers ink applied by a conventional printing process. On its opposite surface, the sheet of shortfiber paper was provided with a uniform and continuous coating of a solution comprising 10% of salicylic acid by weight in isopropyl alcohol, applied by brushing the solution on the surface, it being understood that conventional spray or other machine equipment can be used for this 1 pair of sheets was then passed through a Model 47 Thermo-Fax copying machine (manufactured by Minnesota Mining and Manufacturing Company of St. Paul, Minnesota), the machine utilizing a quartz infrared lamp having a rating of 1350 watts operated at 280-300 volts. In this machine, the black, infrared absorbing surface of the charging sheet was directly exposed to the infrared radiation, the heat produced by only very short-time irradiation being sufficient to sublime sufficient quantities of the salicylic acid from the charging sheet uniformly onto the subject surface, the operation being complete upon emergence of the superimposed sheets from the machine. The used charging sheet was discarded, and the treated original subject, then ready for further processing as described below, contained a substantially continuous and uniform crystallized stratum of salicylic acid which was practically invisible and Was adapted to the transmission of infrared radiation., 11639=This application is a continuation-in-part of our copending application Ser. No. 403,323, filed Oct. 12, 1964, now Patent No. 3,418,469, which is a continuation-in-part of Ser. No. 299,401, filed Aug. 1, 1963, now Patent No. 3,210,544., 10506=403,323, Oct. 12, 1964. This application May 23, 1967, Ser. No. 640,511, 50459=FOREIGN PATENTS 246,832 9/ 1963 Australia.}",
    "textBeforeTable": "Patent Citations ARCHIE R. BORCHELT, Primary Examiner A. L. BIRCH, Assistant Examiner US. Cl. X.R. ll7'36.2, 36.8 FOREIGN PATENTS 246,832 9/ 1963 Australia. References Cited UNITED STATES PATENTS 2,770,534 11/1956 Marx 250-65.1 3,147,377 9/1964 Newman 250 65.l 3,262,386 7/1966 Gordon 250-65.1 X 3,280,735 10/1966 Clark et a1. 25065.1 39. The unconverted transparency of claim 34 wherein said dye is a pH indicator dye. I 38. The unconverted transparency of claim 34 wherein the coating additionally contains boric acid. 37. The unconverted transparency of claim 34 wherein the resin binder is an aromatic polycarbonate. 36. The unconverted transparency of claim 34 wherein the resin binder is a chlorinated polyphenyl. 35. The unconverted transparency of claim 34 wherein the resin binder is an acryloid resin containing a major amount of polymethylmethacrylate and a small amount of polyethylacrylate. 140 F. :5\" E, and laterial spread of the dye for at least 72 hours at roomtemperature and relative humidity after-it has been acidified by the sublimeable material. t 31. The process of claim 23 wherein said sublimeable material is selected from the group consisting of salicylic acid, benzoic acid, orthochlorobenzoic acid, chloranil, 30. The method of claim 23 wherein said coating con-- tains boric acid. 29. The process of claim 23 wherein said resin binder is an aromatic polycarbonate. 28. The process",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3751286 * Jul 12, 1971 Aug 7, 1973 Columbia Ribbon Carbon Mfg Thermographic transfer sheet and process of copying therewith US3767394 * Feb 2, 1971 Oct 23, 1973 Minnesota Mining & Mfg Color copying and sheet material therefor US3847645 * Nov 24, 1972 Nov 12, 1974 Columbia Ribbon & Carbon Thermographic copy sheets and process US3907567 * Jan 17, 1974 Sep 23, 1975 Mita Industrial Co Ltd Waxy crayon or ink-like diazotype developer composition comprising heat transferrable azo coupler and transfer promotor US4456669 * Jun 15, 1982 Jun 26, 1984 Matsushita Electric Industrial Co., Ltd. Image forming process US4824822 * Mar 28, 1988 Apr 25, 1989 Sharp Kabushiki Kaisha",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}