{
    "relation": [
        [
            "YEAR",
            "91-92",
            "92-92",
            "93-94",
            "94-95",
            "TOTAL"
        ],
        [
            "G-GS",
            "21-0",
            "31-31",
            "35-35",
            "33-30",
            "120-96"
        ],
        [
            "FG-FGA",
            "10-26",
            "396-106",
            "86-227",
            "81-202",
            "216-561"
        ],
        [
            "FG%",
            ".385",
            ".368",
            ".379",
            ".401",
            ".390"
        ],
        [
            "FG-FGA",
            "3-9",
            "19-57",
            "61-160",
            "55-136",
            "138-296"
        ],
        [
            "FG%",
            ".333",
            ".333",
            ".381",
            ".404",
            ".470"
        ],
        [
            "FT-FTA",
            "6-17",
            "58-72",
            "26-43",
            "52-63",
            "142-195"
        ],
        [
            "FT%",
            ".353",
            ".806",
            ".605",
            ".825",
            ".730"
        ],
        [
            "REB",
            "21",
            "87",
            "129",
            "107",
            "344"
        ],
        [
            "RPG",
            "1.0",
            "2.8",
            "3.7",
            "3.2",
            "2.9"
        ],
        [
            "ASST",
            "17",
            "162",
            "146",
            "128",
            "453"
        ],
        [
            "STLS",
            "10",
            "33",
            "43",
            "48",
            "134"
        ],
        [
            "BLKS",
            "0",
            "2",
            "3",
            "3",
            "8"
        ],
        [
            "PTS",
            "29",
            "155",
            "259",
            "269",
            "712"
        ],
        [
            "PPG",
            "1.4",
            "5.0",
            "7.4",
            "8.2",
            "5.9"
        ]
    ],
    "pageTitle": "Derek Kellogg becomes 21st coach in Massachusetts men's basketball history",
    "title": "",
    "url": "http://umasshoops.com/news/2008-09/kellogg_hired20080423.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 244302447,
    "recordOffset": 244278593,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28844=Kellogg, 34 (born June 20, 1973), is a 1995 graduate of Massachusetts with a degree in Real Estate/Finance. In May of 2005, he married Nicole Flory, who graduated from UMass in 1997. The couple is expecting their first child in May 2008. Kellogg's parents George and Ruth Kellogg currently reside in Belchertown, Mass., 18994=Vance Walberg, who developed the dribble-drive motion offense Memphis employs, is a logical candidate to land on either Memphis' or UMass' staff in some capacity after resigning as Pepperdine's head coach in January., 22715=Kellogg recently finished his eighth year on the Memphis staff under Calipari where he brought his \"coach on the floor\" mentality at UMass to the sidelines, and it has paid huge dividends for the Tiger program. In Kellogg's eight seasons in Memphis, he has helped lead the Tigers to eight-straight 20-win seasons and eight-consecutive postseason berths (2003, 2004, 2006, 2007, 2008 NCAA; 2001, 2002, 2005 NIT). Prior to this recent run, the last time Memphis had eight-straight 20-win seasons was from 1982-89. This current stretch of eight-consecutive postseasons is a first for the Tiger basketball program, breaking the previous mark of six-straight postseason tournaments from 1988-93., 28221=Kellogg joined the Youngstown State staff after two seasons at George Mason University in Fairfax, Va., where he worked for Jim Larranaga. The Patriots posted a 19-11 record during the 1998-99 season, captured both the Colonial Athletic Association regular-season and tournament championships and earned an automatic bid to the 1999 NCAA Tournament., 28581=Kellogg began his coaching career at his alma mater. He was a graduate assistant and part-time radio broadcaster at UMass for the 1996-97 season. Kellogg also played a season with the Connecticut Skyhawks in the United States Basketball League in 1995., 24577=In 2006-07, Kellogg helped lead Memphis to another record-setting campaign. The Tigers won 33 games for a second-straight season (33-4 record) and captured their second-consecutive Conference USA regular season and tournament titles. The back-to-back outright regular season crowns were a first for the Memphis program, and the consecutive tournament championships were the Tigers first since they won two-straight Metro Conference Tournaments in 1984 and 1985. Memphis advanced to the NCAA Tournament Elite Eight for a second-straight year (2006, 2007), marking the first time in school history that happened., 21733=As a four-year letterwinner at Massachusetts from 1992-95, Kellogg played on four Atlantic 10 Conference regular season and tournament championship teams. The Minutemen were just the second team in NCAA history to win four-straight outright season and tournament championships. During his four-year career at UMass under Calipari, the Minutemen were 111-24, including 51-11 in the Atlantic 10, and advanced to the NCAA Tournament each year, including the Elite Eight in 1995. Kellogg was named the team's captain as both a junior and senior. He was named a 1995 Atlantic 10 All-Conference selection and was a three-time All-Atlantic 10 Academic honoree. On UMass' career lists, he is fifth in assists (453), seventh in all-time three-pointers (138), as well as seventh in three-point percentage (38.1). Kellogg played his high school basketball at Springfield Cathedral where he was a two-time Massachusetts All-State player and McDonald's honorable mention All-American., 23426=This past season, Kellogg was an integral part of another magical Tiger campaign, which continued through the 2008 NCAA Tournament championship game. The NCAA Final Four appearance was the Tigers' first since 1985, and the NCAA title contest was the program's first since 1973. Memphis set an NCAA single-season record for victories with 38 wins (38-2 mark) and held down the No. 1 spot in both national polls for five-straight weeks during the season. The Tigers finished 2007-08 ranked No. 2 in both national polls, the highest final ranking in school history. Memphis also won a school-record 26-straight games, and swept the Conference USA regular season and tournament titles for a third-consecutive season., 18521=The other assistant position will likely be filled by a veteran recruiter. One name that could emerge is Oregon assistant Kenny Payne. A native of Laurel, Miss., Payne played on Louisville's 1986 NCAA championship team with Milt Wagner and has another common friend with Calipari in basketball powerbroker William Wesley., 51831=To the delight of the fans, cheerleaders and pep band that nearly filled one side of the Curry Hicks Cage, the former UMass point guard from Springfield talked about returning to the NCAA Tournament and bringing back the challenging, powerhouse-laden nonconference schedule that he faced during his playing career from 1991 to 1995., 24149=The Tigers won 30 games for a third-straight year in 2007-08, becoming the second school in NCAA Division I history to accomplish the feat. Kentucky was the first to do so from 1947-49 and 1996-98. UCLA joined the elite group later in 2007-08. From 2005-06 to 2007-08, Memphis won 104 games (104-10 record) and tied the 1996-98 Kentucky squads for the most victories in a three-year period in NCAA Division I history., 4477=Flint was forced to resign following the 2000-01 season, and UMass hired back-to-back coaches with no Calipari connections in Steve Lappas and Ford., 54768=After one year as a graduate assistant at UMass, Kellogg was an assistant at George Mason for two years and at Youngstown State for one season before joining Calipari's staff at Memphis in 2000., 25198=The 2006-07 Tigers also pulled a first in Conference USA history. Memphis posted a perfect 16-0 regular season mark and captured the league's postseason tournament. The Tigers were the second squad in C-USA history to go 16-0 in the regular season as Cincinnati did so in 1999-2000. That Bearcat team, though, did not win the Conference USA Tournament title. The Tigers received a No. 2 seed in the NCAA Tournament and finished in the top 10 in both national polls (No. 5/AP; No. 7/ESPN-USA Today)., 7420=MHERST - At the University of Massachusetts men's basketball banquet April 10, University of Massachusetts athletic director John McCutcheon said the aggressive new contract the school had offered coach Travis Ford was a signal that UMass was \"going for it,\" making a serious commitment to be nationally relevant again., 16129=Kellogg played for Calipari from 1991-95, starting his last three seasons at point guard, and was twice elected captain. The Minutemen won A-10 titles and made the NCAA tournament each of his four seasons, reaching the East Regional final in 1995. He is seventh all-time in made 3-point field goals (138) and fourth in assists (453)., 39682=\"The hiring of Derek Kellogg was an outstanding choice. I'm glad UMass decided to bring a member of its family back home. I know he'll do an outstanding job and he'll make the people in the valley proud.\" -- Bruiser Flint, Current Head Coach at Drexel/Former UMass Head Coach (1996-2001), 60631=The words echoed those offered by John Calipari almost 20 years ago to the day. On April 25, 1988, the Minutemen introduced Calipari, a former Pittsburgh assistant, as head coach of a program that had been mired in 10 straight losing seasons. Rather preposterously, Calipari promised to \"create a love affair\" with the fan base., 13545=The Minutemen made a Final Four appearance in 1996, Calipari's final year. Although that season was tarnished by NCAA violations that led to an official vacating of the Minutemen's Final Four spot, the excitement at the Mullins Center lingered., 39996=\"I am very excited for UMass and Derek Kellogg. I think this is a great hire and a great fit. Derek will continue with the excitement and energy which picked up during the run to the NIT Finals. I know Derek will do a great job and take UMass to new heights. I wish nothing but the best to him and the UMass program.\" -- Travis Ford, Current Head Coach at Oklahoma State/Former UMass Head Coach (2005-08), 58927=Kellogg, who graduated in 1995, was the team captain as a junior and senior and earned all-conference and academic honors. He began his coaching career as a graduate assistant at UMass, then became a full-time assistant at George Mason for two seasons in 1997. He also was an assistant at Youngstown State for one year., 26291=From when Kellogg joined the Memphis staff in 2000-01, the Tigers won the 2002 National Invitation Tournament championship, claimed a share of the 2004 Conference USA regular season crown and took home the 2002 and 2003 C-USA National Division titles. The Tigers have posted 219 overall victories (27.3 wins per year) and 101 conference wins (12.6 league victories per year) in his eight seasons. The eight years prior to that span, the Tigers had 140 total wins and 66 conference victories., 5657=After graduating from UMass in 1995, Kellogg worked outside of basketball for a year before joining Flint's staff as a graduate assistant for the 1996-97 season., 4222=At least symbolically, the hiring represents a reconnection between the program and the Calipari era. After Calipari left following the 1995-96 season to become the head coach of the New Jersey Nets, UMass hired Bruiser Flint, his top assistant., 43688=Derek Kellogg opening statement: \"First of all, I am delighted and honored to be standing in front of you all today as the head coach of the University of Massachusetts Minutemen. I worked my whole coaching career to someday be standing here in front of you as the head coach of my alma mater. I remember the first day on campus, I believe it was 1991, walking and enjoying being around the other students and just seeing the vibrance of the place. I said to myself, if it doesn't work out in the NBA, I could see myself coming back and someday being the head coach here. This is my dream job. I would like to thank and acknowledge some people for giving me the opportunity of having the confidence in me to be standing here at this podium in front of you this evening. President Jack Wilson, Chancellor Thomas Cole, Athletic Director John McCutcheon, Associate Athletic Director Tim Kenney, and all the members of the advisory committee, I thank you. I would like to make a special acknowledgement to a dear friend and mentor who can't be here today, Coach Jack Leaman. I know his wife and daughter, Rita and Laurie, are in the crowd and I want to say thank you. To the students and fans, we're thanking them from the bottom of my heart, but this is your team. I'm just here as a support role, this is your team. We need your support. We need all the fans, students, and people in the area to come out and support this team. We've got a great group of young men. I met with them this afternoon and I would be proud to have them in my home as part of my family. But they want the Mullins Center to be rocking again. They don't want an empty seat in that house and we need the students and the fans to come out and support these guys. I've talked about it with these players and that the fans will come out and support and do what they need to do. That's worth two or three more wins per year and you know what that means, we'll be in the NCAA Tournament. I want to send a special thank you out to my wife Nicole, who has been with me thick and thin in the coaching profession. She's been by my side, but she can not be here today. She's in Memphis two weeks away from giving birth to our first son, Max. And in the sonogram they said it looked like he could he really shoot free throws and has a 40-inch vertical. I know you're watching and I love you. I want to say hello to my parents, George and Ruth who are here today. They've guided me through not only my coaching career, but my life. And all the family and friends who are in the crowd, I see a lot of familiar faces out there and we appreciate your support. I want to send a special thanks to Ellen Calipari and Erin. But I want to send a whole hearted thank you to not only my college coach, a friend, father figure, mentor, and now a colleague, John Calipari. I was fortunate enough to work with him for the last eight years and he groomed for this day, this position, and to take UMass basketball to the next level of where we can take it. It's been a great time in my life to leave him and to come out on my own is bittersweet and I whole heartedly want to thank him for what he's done for me and my family., 4635=During the coaching search in 2005, UMass interviewed Tony Barbee, a UMass alumnus and former player and assistant coach under Calipari, but instead hired Ford, citing Barbee's lack of head coaching experience., 20544=Former Minuteman point guard and Springfield native Derek Kellogg has been named the 21st head coach in University of Massachusetts men's basketball history, it was announced by Director of Athletics John McCutcheon on Wednesday evening. The 1995 UMass graduate returns to his alma mater for his first head coaching job after serving as an assistant coach for 12 years, the last eight at the University of Memphis under former UMass head coach John Calipari. The energetic and hard-working Kellogg is largely credited for recruiting many of the Tigers which helped Memphis reach the NCAA Championship game this past season and eight straight 20-win seasons and eight consecutive postseason berths., 40938=\"Derek Kellogg will be a fabulous head coach. His greatest assets are his enthusiasm and passion for the game of basketball and working with players. He is a tireless recruiter and someone who relates well to both young athletes and to parents and administrators. I loved working with him and know he will do a great job at UMass.\" -- Jim Larranaga, Current George Mason Coach/Hired Kellogg for his first full-time coaching job in 1997, 25707=Kellogg also played an integral role in the Tigers' 2005-06 remarkable season. Memphis posted a 33-4 record and won the Conference USA regular season and tournament titles. The conference regular season crown was the Tigers' second in three years. The 2005-06 Memphis squad earned the program's first-ever NCAA Tournament No. 1 seed and advanced to the Elite Eight for the first time since 1992. The Tigers finished the season ranked in the top 10 of both national polls (No. 4/AP; No. 6/ESPN-USA Today). Those final rankings were the highest in Memphis basketball history., 6000=Kellogg has been at Memphis since 2000-01., 17363=With Martin and Kellogg both gone, the Tigers' coaching staff will look much different in 2008-09. In addition to two assistants, Calipari will have to hire a new director of basketball operations, as Tyrone Weeks joined Martin's staff at Marist. It's also possible Kellogg \"may take some guys with him\" from the current Memphis staff, Calipari said, giving him even more positions to fill., 62813=UMass has not been back to the NCAA Tournament since 1998. Kellogg set a return engagement as an immediate goal. \"We're going to be the hardest-working, most fun, most passionate, most energetic team in the country,\" he pledged., 8628=Kellogg will represent a direct link to UMass' glory days under coach John Calipari. He was a freshman reserve on the 1991-92 team that advanced to the NCAA Tournament for the first time in 30 years. For the next three years he was the steady starter at point guard, including two seasons as captain., 17155=\"As excited as I am, those people are going nuts,\" said Calipari, who coached UMass from 1988 to 1996. \"You get a chance to coach at your alma mater, come on. I'm happy for him.\", 55581=Kellogg admitted that matching Calipari's accomplishments at UMass would be difficult. Calipari led the Minutemen to five NCAA Tournaments, including a trip to the 1996 Final Four., 1923=Kellogg played at UMass from 1991-95 and was an all-Atlantic 10 player under John Calipari, in the years the program was nationally ranked., 26793=In addition to the 2006, 2007 and 2008 final national rankings, the Tigers also finished the 2003 (No. 19) and 2004 (No. 24) seasons ranked in the final Associated Press poll. Prior to the 2002-03 and 2003-04 seasons, the last time Memphis was ranked in the final polls in consecutive years was the 1984-85 and 1985-86 campaigns., 27133=Kellogg was an off-campus recruiter for the Tigers, and also assisted in scouting opponents. His hard work -- especially on the recruiting trail -- gained him national recognition. In the summer of 2007, Rivals.com listed Kellogg (No. 7 spot) as one of the nation's 10 assistants \"ready to move up.\" A year earlier in 2006, the same web site named Kellogg as one of the nation's top 25 recruiters, and HoopScoop magazine tabbed him as one of the nation's top assistant coaches., 3311=Kellogg, 34, graduated in 1991 from Cathedral High School in Springfield and in 1995 from UMass., 59897=MHERST - When he first hit the floor at Curry Hicks Cage in 1991, Derek Kellogg was a little-regarded freshman from Springfield, playing for a University of Massachusetts team that hadn't been to the NCAA Tournament in three decades.}",
    "lastModified": "Mon, 01 Sep 2008 20:48:18 GMT",
    "textBeforeTable": "The Derek Kellogg File Kellogg, 34 (born June 20, 1973), is a 1995 graduate of Massachusetts with a degree in Real Estate/Finance. In May of 2005, he married Nicole Flory, who graduated from UMass in 1997. The couple is expecting their first child in May 2008. Kellogg's parents George and Ruth Kellogg currently reside in Belchertown, Mass. Kellogg began his coaching career at his alma mater. He was a graduate assistant and part-time radio broadcaster at UMass for the 1996-97 season. Kellogg also played a season with the Connecticut Skyhawks in the United States Basketball League in 1995. Kellogg joined the Youngstown State staff after two seasons at George Mason University in Fairfax, Va., where he worked for Jim Larranaga. The Patriots posted a 19-11 record during the 1998-99 season, captured both the Colonial Athletic Association regular-season and tournament championships and earned an automatic bid to the 1999 NCAA Tournament. Prior to joining Calipari's staff, Kellogg spent one season at Youngstown State. In his lone year at Youngstown State, Kellogg was a member of a coaching staff led by former UMass assistant John Robic that re-energized a community about Penguin basketball. Youngstown State finished fourth in the Mid-Continent Conference regular season standings, but were in first place in the league before losing their top scorer, Elmer Brown, with seven games left in the regular season. Youngstown State signed a freshman class which included three top-100 recruits during Kellogg's tenure.",
    "textAfterTable": "Year-By-Year Season School Position Overall Pct. Conf. Pct. Postseason 1991-92 Massachusetts Player 30-5 .857 13-3 .813 A-10 Champs (R/T); NCAA Sweet 16 1992-93 Massachusetts Player 24-7 .774 11-3 .786 A-10 Champs (R/T); NCAA Second Round 1993-94 Massachusetts Player 28-7 .800 14-2 .875 A-10 Champs (R/T); NCAA Second Round 1994-95 Massachusetts Player 29-5 .853 13-3 .813 A-10 Champs (R/T); NCAA Elite Eight 1996-97 Massachusetts Grad. Assistant 19-14 .576 11-5 .688 NCAA First Round 1997-98 George Mason Assistant Coach 9-18 .333 6-10 .375 1998-99 George Mason Assistant Coach 19-11 .633 13-3 .813 CAA Champs (R/T); NCAA First Round 1999-2000 Youngstown State Assistant Coach 12-16 .429 9-7 .563 2000-01 Memphis Assistant Coach 21-15 .583 10-6 .625 NIT Final Four 2001-02 Memphis Assistant Coach 27-9 .750 12-4 .750 C-USA Nat'l Div. Champ; NIT Championship 2002-03 Memphis Assistant Coach 23-7 .767 13-3 .813 C-USA Nat'l Div. Champ; NCAA First Round 2003-04 Memphis Assistant Coach 22-8 .733 12-4 .750 C-USA Champ (R); NCAA Second Round 2004-05 Memphis Assistant Coach 22-16 .579 9-7 .563 NIT Final Four 2005-06 Memphis Assistant Coach 33-4 .892 13-1 .929 C-USA Champ (R/T); NCAA Elite Eight 2006-07 Memphis Assistant Coach 33-4 .892 16-0 1.000 C-USA Champ (R/T); NCAA Elite",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}