{
    "relation": [
        [
            "Name of Group",
            "AFIRM (Apparel and Footwear International RSL Management Working Group)",
            "BizNGO (Business – Non Governmental Organization) Working Group",
            "BSR (Business for Social Responsibility)",
            "Ceres (Coalition for Environmentally Responsible Economies)",
            "ChemSec (International Chemical Secretariat)",
            "GAFTI (Global Apparel, Footwear and Textile Initiative)",
            "GCN (Green Chemistry Network)",
            "GPR (Green Products Roundtable)",
            "OIA (Outdoor Industry Association)",
            "RILA (Retail Industry Leaders Association)",
            "SAC (Sustainable Apparel Coalition)",
            "TSC (The Sustainability Consortium)"
        ],
        [
            "Purpose",
            "Manage restricted substances in the apparel and footwear industry globally",
            "Promote the creation and adoption of safer chemicals and sustainable materials",
            "Guide global companies toward creating a just and sustainable world through their CSR efforts",
            "Integrate sustainability into day-to-day business practices",
            "Strive for a toxic free environment by 2020 through promoting concepts of precaution, substitution, polluter pays and right to know",
            "Bring the apparel, footwear and textile industries together globally to improve efficiencies and set standards",
            "Facilitate education, training and practice of Green Chemistry in industry, commerce, government, academia and schools through a worldwide network",
            "Bring more clarity to the green products marketplace",
            "Ensure the growth and success of the outdoor industry throughout the supply chain",
            "Collaborate with a network of retailers on five core issues: supply chain, asset protection, finance, human resources, and enterprise issues",
            "Develop an industry-wide index for business to use to measure and evaluate apparel and footwear product sustainability performance",
            "Build the scientific base for understanding environmental and social impacts of products throughout their life cycles"
        ],
        [
            "Can Retailers Participate?",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Membership will be opened in 2012",
            "Yes"
        ],
        [
            "Who’s Involved?",
            "Manufacturers and retailers",
            "Businesses, government agencies, NGO's, retailers and universities",
            "Businesses, NGOs, retailers and universities",
            "Businesses, investors, NGOs and retailers",
            "Associations, businesses and retailers",
            "Associations, brands, manufacturers, mills, retailers, and testing and compliance firms",
            "Associations, manufacturers, NGOs, retailers and universities",
            "Certifiers, distributors, educators, manufacturers, researchers and retailers",
            "Distributors, manufacturers, retailers, sales representatives and suppliers",
            "Manufacturers, retailers and suppliers",
            "Brands, government agencies, manufacturers, NGOs, retailers and universities",
            "Government agencies, manufacturers, NGOs, retailers and suppliers"
        ],
        [
            "Industry Sector",
            "Apparel and footwear sectors",
            "All sectors downstream of chemical manufacturers",
            "All sectors",
            "All sectors",
            "All sectors",
            "Apparel, footwear and textile sectors",
            "All sectors",
            "All sectors",
            "Outdoor industry sector",
            "All sectors",
            "Apparel and footwear sectors",
            "All sectors"
        ],
        [
            "Projects that Address Toxics in Products",
            "RSL Toolkit based on the AAFA RSL and Implementation Guide",
            "Guiding Principles for Chemicals Policy and Implementation Guide Policy Initiatives for Advancing Safer Chemicals and Sustainable Materials Biospecs Project for Biobased Tableware",
            "Mills and Sundries Working Group",
            "Footwear and Apparel Initiatives",
            "ChemSec Business Group",
            "Product Safety Committee Sustainability Committee",
            "Green Chemistry and the Consumer Project",
            "Framework for Differentiating Green Products Organizational Practices Matrix",
            "Eco Working Group (Eco Index)",
            "RSI Sustainability Working Group",
            "The Sustainable Apparel Index",
            "The Measurement Sciences Working Group Sector Working Groups (some are addressing toxics in products)"
        ]
    ],
    "pageTitle": "Retail Initiatives on Safer Products — Green Chemistry and Commerce",
    "title": "",
    "url": "http://www.greenchemistryandcommerce.org/retailer-portal/retail-initiatives-on-safer-products?fontsize=5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478165515,
    "recordOffset": 478157313,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11927=2013, 12060=2015, 7911=Membership will be opened in 2012, 3610=Strive for a toxic free environment by 2020 through promoting concepts of precaution, substitution, polluter pays and right to know, 12747=1 University Avenue, Lowell, MA 01854, 13026=© 2015 Lowell Center for Sustainable Production / University of Massachusetts Lowell • Privacy • Webmaster, 11993=2014}",
    "textBeforeTable": "For GC3 members, the companion document is available in the GC3 Members Area. For non-GC3 members, please contact us. Below is a summary table of the twelve initiatives/organizations reviewed: Some sector-specific projects exist that are supporting retailers in advancing safer chemicals and products throughout supply chains. However, these tend to be projects that are part of organizations or initiatives that are more broadly addressing sustainability in retail or manufacturing industries. The GC3 “Engaging Retailers in the Adoption of Safer Products” Project Group (Retailer Group) has developed an inventory of initiatives and organizations relevant to retailers that are advancing sustainability with a focus on safer chemicals and products. The GC3 Retailer Group developed this inventory to understand the landscape of activities in this area. Retail Initiatives on Safer Products Retail Initiatives on Safer Products Retailer Chemicals Policy Efforts Retailer Portal Summary Document Retailer Portal Database: Tools to Evaluate Chemical Ingredients in Products Overview Retailer Portal",
    "textAfterTable": "About GC3 Introduction Structure Achievements In the News Green Chemistry and DfE About the Lowell Center Contact Us Projects Overview Retail Education Mainstreaming Innovation Preservatives Project Past Project: Business & Academic Partnerships Events GC3 Innovators Roundtable Webinars Past Events Related Events of Interest Retailer Portal Overview Retailer Portal Database: Tools to Evaluate Chemical Ingredients in Products Retailer Portal Summary Document Retailer Chemicals Policy Efforts Retail Initiatives on Safer Products Publications GC3 Publications Newsletters Membership Benefits & Guidelines Current Members Becoming a Member Info for New Members GC3 Members Area Newsletter Articles 2013 2014 2015   The Green Chemistry & Commerce Council is facilitated by: The Lowell Center for Sustainable Production, University of Massachusetts Lowell 1 University Avenue, Lowell, MA 01854 © 2015 Lowell Center for Sustainable Production / University of Massachusetts Lowell • Privacy • Webmaster ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}