{
    "relation": [
        [
            "",
            "Faculty/Staff A",
            "Faculty/Staff B",
            "Faculty/Staff C",
            "Faculty/Staff D",
            "Faculty/Staff E",
            "Faculty/Staff F"
        ],
        [
            "Oct",
            "$122",
            "$261",
            "$410",
            "$538",
            "$831",
            "$877"
        ],
        [
            "Nov",
            "$112",
            "$239",
            "$376",
            "$493",
            "$762",
            "$804"
        ],
        [
            "Dec",
            "$100",
            "$212",
            "$334",
            "$437",
            "$675",
            "$713"
        ],
        [
            "Jan",
            "$89",
            "$191",
            "$300",
            "$393",
            "$606",
            "$640"
        ],
        [
            "Feb",
            "$79",
            "$169",
            "$266",
            "$348",
            "$537",
            "$567"
        ],
        [
            "Mar",
            "$69",
            "$147",
            "$232",
            "$303",
            "$468",
            "$494"
        ],
        [
            "Apr",
            "$57",
            "$120",
            "$189",
            "$248",
            "$382",
            "$403"
        ],
        [
            "May",
            "$46",
            "$99",
            "$155",
            "$203",
            "$313",
            "$331"
        ],
        [
            "Jun",
            "$34",
            "$72",
            "$112",
            "$147",
            "$227",
            "$240"
        ],
        [
            "Jul",
            "$24",
            "$50",
            "$78",
            "$103",
            "$158",
            "$167"
        ],
        [
            "Aug",
            "$14",
            "$28",
            "$44",
            "$58",
            "$89",
            "$94"
        ]
    ],
    "pageTitle": "Permit Rates - Parking and Transportation Services - Towson University",
    "title": "",
    "url": "http://www.towson.edu/adminfinance/AuxServices/Parking/parking/facstaff/permitrates.asp",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 762386311,
    "recordOffset": 762377583,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12897=New for 2015-2016!  As part of the environmental initiatives associated with Towson University, Parking & Transportation Services will offer a discounted parking permit for drivers of Smartway Elite certified vehicles.   Eligible faculty, staff, and students will be able to obtain an annual parking permit at a discount.  Click here for more information.  Click here for Tigers Go Green Appliaction., 26547=Will be issued a \"University Vehicle\" Permit *** Effective August 17,2015, 38482=University Police 410-704-2134, 17843=AUGUST 11, 2014, 12523=** 2014/2015 Annual permits expire on August 31,2015, 12600=***2015/2016 Annual permits go on sale August 3, 2015 and will be effective August 17, 2015 and will expire August 31, 2016., 26230=AUGUST 17, 2015, 35866=Refunds are available for annual and term permits.  Short-term permits such as daily, monthly, or weekly permits are not eligible for refunds.   Faculty/Staff who no longer need a parking permit may be eligible for a pro-rated refund until the last business day of March. In order to be eligible for a refund, individuals must complete a cancellation card and submit it to the Auxiliary Service Business Office located in the University Union.  The refund amount will be determined by the date the cancellation is received.  Please contact the Auxiliary Services Business Office, 410-704-2284, for more details., 29796=Permits are prorated weekly beginning in September.  Figures below are estimates only.  The actual cost of a permit depends on the date the permit is purchased. No refunds will be processed for Annual permits after the last business day in March each year. Please contact the office for summer rates., 13769=Parking rates are based on the prior years income (July through June).  Changes (increases or decreases) in income throughout a year, may not affect the parking rate code for the coming year. , 7682=Faculty/Staff permit rates are based on annual salary, as of the last business day of June each year. If an individual is hired in the middle of the year, his or her expected annual income will be used. Beginning in September, permits will be prorated each week . Towson University controls the use of permits and they must be cancelled if an employee separates from the university. Please contact the Auxiliary Services Business Office regarding permit cost once prorating has begun.}",
    "textBeforeTable": " *Motorcycle virtual permits must be purchased in person at the Auxiliary Business Office. Motorcycles registered as a secondary vehicle will be linked to the customer's parking permit.     **Employees are limited to 2 monthly permits per academic year. *** C.O.D. may not be used for Monthly and Weekly permits. Pro-Rate Schedule (Cost) for Annual Faculty/Staff Permits are prorated weekly beginning in September.  Figures below are estimates only.  The actual cost of a permit depends on the date the permit is purchased. No refunds will be processed for Annual permits after the last business day in March each year. Please contact the office for summer rates. Prorated amounts for current permits are below:   AUGUST 31, 2016 AUGUST 17, 2015 $132 VENDOR SERVICE/SALESPERSON– ANNUAL Not on campus daily (Copier Companies, Cell Phone Suppliers, Ring Sales, Books etc.) SEE FACULTY/STAFF RATE STRUCTURE PARTNER COMPANY EMPLOYEES AUGUST 31, 2016 AUGUST 17, 2015 $132 TU VOLUNTEERS - ANNUAL 30 CALENDAR DAYS AT ALL TIMES $75 TU VOLUNTEERS - MONTHLY PERMIT",
    "textAfterTable": "  Refunds Refunds are available for annual and term permits.  Short-term permits such as daily, monthly, or weekly permits are not eligible for refunds.   Faculty/Staff who no longer need a parking permit may be eligible for a pro-rated refund until the last business day of March. In order to be eligible for a refund, individuals must complete a cancellation card and submit it to the Auxiliary Service Business Office located in the University Union.  The refund amount will be determined by the date the cancellation is received.  Please contact the Auxiliary Services Business Office, 410-704-2284, for more details. Parking and Transportation Services Union Garage Hours: Monday - Friday, 8 a.m. to 5 p.m. 410-704-PARK (7275) Parking, Events, Shuttle and Charter Bus Information 410-704-RIDE (7433) Para-Transit Services and Requests Fax: 410-704-3370 E-mail: upark@towson.edu Administration and Finance Questions   Campus Maps Directions & Parking Visiting Campus Tours Emergencies 410-704-4444 University Police 410-704-2134",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}