{
    "relation": [
        [
            "Year",
            "2011",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Month",
            "Apr",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Day",
            "19 Tue",
            "20 Wed",
            "21 Thu",
            "22 Fri",
            "23 Sat",
            "24 Sun",
            "25 Mon",
            "26 Tue",
            "27 Wed",
            "28 Thu"
        ],
        [
            "Position",
            "64",
            "31",
            "22",
            "33",
            "32",
            "35",
            "34",
            "62",
            "81",
            "96"
        ],
        [
            "Movement",
            "new",
            "up",
            "up",
            "down",
            "up",
            "down",
            "up",
            "down",
            "down",
            "down"
        ],
        [
            "Number 1",
            "ADELE 21",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "iTunesCharts.net: '50 Classics for Beginners' by Various Artists (American Albums iTunes Chart)",
    "title": "",
    "url": "http://www.itunescharts.net/us/artists/music/various-artists/albums/50-classics-for-beginners/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 519731823,
    "recordOffset": 519708438,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "US Albums chart performance history for 50 Classics for Beginners Detailed Chart Progress for \"50 Classics for Beginners\" (Various Artists) buy from iTunes $3.99 Download \"50 Classics for Beginners\" from the iTunes store. Download It! Get \"50 Classics for Beginners\" from iTunes Days on US Albums Chart: 10 Most recent chart position: #96 (28 Apr 2011) Highest Position: #22 (21 Apr 2011) Chart debut: #64 (19 Apr 2011) Release date: 19 Apr 2011 \"50 Classics for Beginners\": Chart Statistics Various Artists - '50 Classics for Beginners' American iTunes Chart Performance Submit \"> TV Podcasts Albums Songs Home iTunes Charts Toggle navigation",
    "textAfterTable": "Other Albums by Various Artists The Twilight Saga: New Moon (Deluxe Version) [Original Motion Picture Soundtrack] Twilight (Original Motion Picture Soundtrack) A Very Special Christmas 7 Pirate Radio (Motion Picture Soundtrack) [Deluxe Version] Now That's What I Call Christmas! The Hotel Café Presents Winter Songs Elf (Music from the Major Motion Picture) The 50 Most Essential Pieces of Classical Music Wicked (Original Broadway Cast Recording) The Essential NOW That's What I Call Christmas Number 1's: Christmas A Very Special Christmas, Vol. 1 The Very Best Christmas Selection - 50 All Time Seasonal Favourites Now That's What I Call a Country Christmas Gift Wrapped - 20 Songs That Keep On Giving! The Hotel Café Presents Winter Songs Alvin and The Chipmunks: The Squeakquel (Original Motion Picture Soundtrack) [Deluxe Edition] Just Dance 2 (Bonus Track Version) Sons of Anarchy - Shelter - EP Country for Christmas - EP Hear Something Country Christmas 2007 Invictus (Original Motion Picture Soundtrack) Wow Hits 2010 The Hangover (Original Motion Picture Soundtrack) Phineas and Ferb Christmas Vacation! (500) Days of Summer (Music from the Motion Picture) [Bonus Track Version] Alvin and The Chipmunks: The Squeakquel (Original Motion Picture Soundtrack) NOW That's What I Call Music, Vol. 32 Phineas and Ferb (Songs from the TV Series)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}