{
    "relation": [
        [
            "Weed",
            "Absinth wormwood pics: 1 | 2",
            "Bracken fern pic: 1",
            "Buttercup pics: 1 | 2 | 3",
            "Canada thistle pic: 1",
            "Common dandelion pics: 1 | 2",
            "Curly dock pics: 1 | 2",
            "Goldenrod pic: 1",
            "Hoary alyssum pics: 1 | 2",
            "Horsetail pics: 1 | 2",
            "Perennial sowthistle pics: 1 | 2",
            "Stinging nettle pics: 1 | 2",
            "White snakeroot pic: 1"
        ],
        [
            "Description",
            "Shrub-like. Leaves are hairy and silver in color.",
            "A true fern. Erect.",
            "Erect. Stems slightly hairy. Yellow flowers.",
            "Erect. Leaves have crinkled edges and spines",
            "Leaves contain milky juice. Yellow flowers",
            "Erect. Leaves with wavy or curled edges.",
            "Erect. Leaves and hairy, grayish. Yellow flowers.",
            "Erect. Plant gray-green and hairy. White flowers.",
            "Erect. Hollow, jointed stems.",
            "Erect. Milky juice. Yellow flowers.",
            "Erect. Leaves covered with stinging hairs.",
            "Erect. Leaves have toothed edges."
        ],
        [
            "Noxious",
            "No",
            "No",
            "No",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "No",
            "Yes",
            "No",
            "No"
        ],
        [
            "Poisonous",
            "No",
            "Yes",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "Yes",
            "Yes",
            "No",
            "No",
            "Yes"
        ],
        [
            "Chemical control",
            "Banvel, 2,4-D",
            "Ally",
            "Banvel, MCPA",
            "Stinger",
            "2,4-D",
            "Banvel, Roundup*",
            "Banvel, Roundup*",
            "Stinger, Roundup*",
            "Stinger, Roundup*",
            "Banvel, Roundup*",
            "Banvel, Roundup*",
            "Stinger, Roundup*"
        ],
        [
            "Mechanical control",
            "Frequent mowing",
            "Frequent mowing",
            "Hand pulling",
            "Frequent mowing",
            "Hand pulling",
            "Hand pulling",
            "Hand pulling",
            "Frequent mowing",
            "Frequent mowing",
            "Hand pulling",
            "Hoeing",
            "Hand pulling"
        ]
    ],
    "pageTitle": "Weed identification and control : Horse : University of Minnesota Extension",
    "title": "",
    "url": "http://www.extension.umn.edu/agriculture/horse/pasture/weed-identification-and-control/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450060623,
    "recordOffset": 450046419,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Table 1. Common annual broadleaf pasture weeds An annual germinates from seed, grows, matures, and dies in less than one year or when killed by frost. Chemical control of annuals works best when applied in the spring to actively growing, young weeds. Mechanical control, such as mowing, is very effective against annuals. Annual From a control standpoint, grouping weeds into categories based on life span is most practical. Annual, biennial and perennial are the main life spans of weeds. Controlling weeds is probably one of the most important decision to think about when managing grass pastures. Weeds are generally less palatable, less nutritious, lower yielding, and are less dependable as a forage supply to horses than the desirable grass pasture species they replace. Many pasture weeds are on the Minnesota noxious weed list and several other pasture weeds are poisonous to horses. According to the Minnesota noxious weed law, primary noxious weeds must be controlled on all private and public land in the state. Of the ten primary Minnesota noxious weeds, five are common pasture weeds: bull thistle, plumeless thistle, Canada thistle, musk thistle and perennial sowthistle. About thirteen poisonous plants can affect horses in Minnesota: redroot pigweed, nightshades, common lambsquarter, common cocklebur, hoary alyssum, buttercup, horsetail, poison hemlock, bracken fern and white snakeroot. Most poisonings occur in the early spring or during a drought when the pasture forage is in short supply. Steps to minimize weeds in grass pastures Herbicides Trees, shrubs, wild",
    "textAfterTable": "Plumeless thistle pic: 1 Erect. Leaves divided. Flowers globe shaped. Yes No Stinger, 2,4-D, Banvel Hand pulling Poison hemlock pics: 1 | 2 Erect. Lace-like leaves. Umbrella-like flowers. No Yes 2,4-D Hand pulling Spotted knapweed pics: 1 Erect. Narrow hairy leaves. Purple flowers. No No 2,4-D, MCPA Frequent mowing * Roundup is used as a spot treatment only. Perennials Perennials live more than two years, and grow back from the same roots year after year. Perennials move nutrients into their roots during fall to prepare for winter. Because of this, chemical control of perennials works best when applied in the fall to actively growing and well-developed foliage. As the nutrients move into the roots, the chemical will too. However, the herbicide applied in the fall must be able to move within the plant. The ability of a herbicide to move within a plant is called systemic. When choosing your chemical for perennial weed control, make sure it is systemic. Application of herbicides in spring, or frequent moving during the summer is also effective in controlling growth until fall. However, mowing alone may take a few growing seasons to effectively control the weeds. Hoary alyssum Hoary Alyssum is a concern for many horse owners. Some horses experience depression and stocking up or swelling of the lower legs twelve to twenty four hours following ingestion of Hoary Alyssum in hay or pasture. In more severe cases,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}