{
    "relation": [
        [
            "No.",
            "8 *Captain",
            "12 *Captain",
            "7 *Captain",
            "4",
            "6",
            "9",
            "10",
            "11",
            "15",
            "16",
            "20",
            "21",
            "24",
            "33",
            "34"
        ],
        [
            "Name",
            "Casey Ebeling",
            "Bethany Williamson",
            "Amber Coulthart",
            "Ashley Morey",
            "Sarah Helm",
            "Kristina Bement",
            "Corrine Carpenter",
            "Rose Dovi",
            "Niki Rieman",
            "Laura Cushing",
            "Candice Chilson",
            "Brienna Blanchard",
            "Brittney Wilson",
            "Amber Harmon",
            "Samantha Lafer"
        ],
        [
            "Pos.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Year",
            "Fr.",
            "So.",
            "So.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "So.",
            "Fr."
        ],
        [
            "Ht.",
            "5-8",
            "5-7",
            "5-4",
            "4-10",
            "5-5",
            "5-2",
            "4-10",
            "5-7",
            "5-9",
            "5-4",
            "5-2",
            "5-4",
            "5-6",
            "5-7",
            "5-5"
        ],
        [
            "Wt.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "High School/Hometown",
            "Pearl River/Pearl River",
            "South Lewis/Lyons Falls",
            "Oneida/Oneida",
            "Owego Free Academy/Owego",
            "Bishop Maginn/Scotia",
            "Elmira Free Academy/Elmira",
            "Owego Free Academy/Apalachin",
            "Cortland/Cortland",
            "Lake Shore/Derby",
            "Fabius-Pompey/Fabius",
            "Chenango Valley/Binghamton",
            "Cincinnatus/Cincinnatus",
            "Wayland-Cohocton/Wayland",
            "Whitney Point/Lisle",
            "Chenango Valley/Chenango Bridge"
        ]
    ],
    "pageTitle": "TC3 - Tompkins Cortland Community College: Panthers: Women's Softball",
    "title": "",
    "url": "http://www.tc3.edu/panthers/sport.asp?id=10&tm=64&yr=2007&pst=1&tab=roster",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 737958271,
    "recordOffset": 737934541,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15541=2014, 54645=Sunday, April 29, 2007, 16138=2010, 26832=34 Colleen Bannon (2009-10) 33 Casey Morey (2013-14) 32 Heather Weber (2005-06), 24652=17 Mackenzie Sherlock (2011-12) 15 Colleen Bannon (2009-10) 14 Taylor Policay (2013-14), 22827=118 Colleen Bannon (2009-10) 118 Brooke Wierzbicki (2009-10) 83 Rose Dovi (2007-08), 16514=2006, 46853=The TC3 softball team remained perfect in Mid-State Athletic Conference play with a doubleheader sweep at Jefferson Community College. The Panthers won the opener 11-3 before taking game two 10-1. TC3 is now 17-12 overall, 14-5 in Region III, and 6-0 in the Mid-State Athletic Conference while Jefferson is 5-12 overall and 2-9 in Region III and 2-4 in MSAC. TC3 can close out a perfect conference season Saturday at Onondaga Community College.   In Thursday's opener the Panthers used a four-run fifth inning to break open a close game. Pitcher Brittney Wilson (Wayland-Cohocton HS/Wayland) earned the win, striking out 12 over seven innings. Niki Rieman (Lake Shore HS/Derby) went 4-for-5 with a double and four RBI. Amber Coulthart (Oneida HS/Oneida) and Samantha Lafer (Chenango Valley HS/Chenango Bridge) each collected three hits and an RBI, with Coulthart adding a stolen base.   Rieman was the winning pitcher in the mercy-rule shortened game two, striking out seven in five innings. Lafer and Coulthart again had big games, with Lafer going 4-for-4 with two RBI and four RBI and Coulthart going 3-for-3 with three runs scored and a stolen base. Bethany Williamson (South Lewis HS/Lyons Falls) went 3-for-4 with a pair of doubles.   Rose Dovi (Cortland HS/Cortland) finished the day with four RBI, giving her 30 for the season. The 30 RBI sets a new TC3 season record, breaking the standard set in 2004 by Ashley Woodin.   TC3 plays a doubleheader at Onondaga Community College Saturday. The regular season comes to a close Sunday at home with a noon doubleheader against Genesee Community College.   Boxscore - Game 1 Boxscore - Game 2, 99535=The TC3 softball team opened the 2007 season in Florida Monday, taking on Division II Lakeland (Ohio) Community College in an early morning doubleheader at the Cocoa Expo. Despite being outside for the first time and playing against a scholarship team that had been in Florida several days, the Panthers played well at times while falling 9-4 and 8-5.   Game one saw the top of the order enjoy fine days. Sophomore Amber Coulthart (Oneida HS/Oneida) and freshman Ashley Morey (Owego Free Academy/Owego) accounted for half of TC3's hits and runs, reaching safely a combined four times while crossing the plate twice. Sophomore Amber Harmon (Whitney Point HS/Lisle) rapped out the team's lone extra base hit, a run-scoring double. Brittney Wilson (Wayland-Cohocton HS/Wayland) struck out six in five innings in her collegiate pitching debut.   Rose Dovi (Cortland HS/Cortland) provided the only extra base hit for TC3 in game two, stroking a RBI-triple in the top of the sixth. Niki Rieman (Lake Shore HS/Derby) pitched for TC3, striking out five in five innings.   TC3 returns to action Tuesday with three games. The Panthers are scheduled to play a total of ten games this week in Florida.   Boxscore - Game 1 Boxscore - Game 2, 33338=National Championships 2009, 80361=Saturday, April 14, 2007, 86931=Sunday, April 01, 2007, 67447=Sunday, April 22, 2007, 88610=Thursday, March 15, 2007, 28307=297 Alice Karpel (2004-05) 219 Niki Rieman (2007-08) 209 Emilie Rogers (2012), 27708=1.48 Niki Rieman (2007-08) 1.55 Alice Karpel (2004-05) 3.11 Laura Thomas (2002-03), 16421=2007, 15747=2013, 5049=The 2015 season came to a close on a high note for the Tompkins Cortland Community College softball team Sunday. The Panthers swept a doubleheader from SUNY Delhi, winning by scores of 9-1 and 12-4. The Panthers end the year with a record of 5-17., 71534=Saturday, April 21, 2007, 37136=Sunday, May 06, 2007, 22249=.741 Colleen Bannon (2009-10) .739 Brooke Wierzbicki (2009-10) .705 Mackenzie Sherlock (2011-12), 42518=Saturday, May 05, 2007, 29130=.984 Samijo Scheer (2011-12) .979 Chelsea Houtenbrink (2011-12) .968 Katie Birch (2002-03), 25307=79 Samijo Scheer (2011-12) 76 Mackenzie Sherlock (2011-12) 76 Brooke Wierzbicki (2009-10), 51143=Tuesday, May 01, 2007, 16045=2011, 87105=The TC3 softball team's spring break trip to Cocoa, Florida came to successful close Friday, with the Panthers beating the Whitby Eagles, a club team from Canada, 3-2. TC3 ends the trip 3-7 overall, but 2-0 against fellow Division III teams.   The final game of the trip opened with TC3 taking an early lead, scoring single runs in the first and third innings. In the top of the fourth, Whitby tied the game with a pair of runs, but TC3 responded in the bottom of the fifth with what proved to be the game-winner.   Niki Rieman (Lake Shore HS/Derby) earned her second win of the year, allowing no earned runs, striking out three, and helping her own cause by going 1-for-3 with a double and knocking in a run at the plate. Amber Coulthart (Oneida HS/Oneida) and Ashley Morey (Owego Free Academy/Owego) each went 1-for-2 with a run scored. Candice Chilson (Chenango Valley HS/Binghamton) went 1-for-2 with one RBI and Bethany Williamson (South Lewis HS/Lyons Falls) scored the team's other run.   TC3 returns north to a two-week layoff before the start of regional play. TC3 opens play in Region III April 1 at Niagara County Community College.   Boxscore, 86843=Thursday, April 05, 2007, 84745=The TC3 softball team finally opened regional play Friday, posting a big win over visiting SUNY Delhi. The Panthers, playing for the first time since returning to New York after the spring break trip in mid-March, used a huge second innings to cruise past Delhi 28-7. The second game was called due to poor conditions. TC3 improves to 4-7 overall and 1-0 in Region III play. It was the season opener for Delhi.   Despite playing in cold weather, it didn't take long for the TC3 bats to warm up as the Panthers set team records for runs, hits, and RBI and four different Panthers tied the individual record for runs scored in a game. Bethany Williamson (South Lewis HS/Lyons Falls) led the attack going 4-for-5 with four runs scored and two RBI. Brittney Wilson (Wayland-Cohocton HS/Wayland) also went 4-for-5 with four runs scored while driving in a single run. Rose Dovi (Cortland HS/Cortland) and Amber Coulthart (Oneida HS/Oneida) each put their name in the record book by scoring four runs. Both went 3-for-4 with Dovi driving in a team-high four runs. Ashley Morey (Owego Free Academy/Owego) matched Dovi with four RBI while going 3-for-4 and Casey Ebeling (Pearl River HS/Pearl River) added a 3-for-4, three runs scored, and three RBI performance. Candice Chilson (Chenango Valley HS/Binghamton) finished 3-for-3 with three RBI and Niki Rieman (Lake Shore HS/Derby) also had a multiple-hit day, going 2-for-5 with three runs scored and two RBI.   Wilson earned the win on the mound, striking out six over five innings.   Next on the schedule for TC3 is a Saturday doubleheader with Hudson Valley Community College starting at 1 p.m.   Boxscore, 99481=Monday, March 12, 2007, 90511=Wednesday, March 14, 2007, 16324=2008, 46799=Thursday, May 03, 2007, 63314=Thursday, April 26, 2007, 26218=55 Colleen Bannon (2009-10) 30 Heather Weber (2005-06) 23 Ashley Greenough (2009), 23851=9 Colleen Bannon (2009-10) 8 Rose Dovi (2007-08) 7 Brooke Wierzbicki (2009-10), 15952=2012, 21539=.474 Brooke Wierzbicki (2009-10) .437 Colleen Bannon (2009-10) .431 Tayler Fravel (2011-12), 34187=Coach Freeman enters her second year at the helm of the TC3 softball program. She has been a part of the program since playing on the national championship season in 2009. As a freshman on that team, Freeman hit .384 with seven doubles and 22 RBI. As a sophomore she hit .305 with three homers and 21 RBI, and was named to the Region III All-Tournament team. She joined the coaching staff in 2011, helping guide the Panthers to regional titles and third-place finishes at nationals in both 2011 and 2012. She was promoted to Associate Head Coach for the 2013 season and named the Head Coach in 2014., 33407=NJCAA Playoff Appearances 2002, 2004, 2005, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 93102=Tuesday, March 13, 2007, 4345=Forehand was TC3’s top pitcher and one of the team’s best hitters. She had five wins in the circle, including a one-hit shutout of Cayuga Community College on April 25. At the plate she hit .314 with a team-best three home runs. She drove in 21 runs, accounting for nearly 40% of the team’s RBI total, and her .529 slugging percentage was tops on the team., 16607=2005, 35159=Tuesday, May 08, 2007, 29450=151 Alice Karpel (2004-05) 122 Amber Wallace (2003-04) 114 Ashley Dellefave (2004-05), 67342=Wednesday, April 25, 2007, 23392=28 Brooke Wierzbicki (2009-10) 25 Tayler Fravel (2011-12) 24 Samijo Scheer (2011-12), 16231=2009, 29766=513 Tiffany Volkert (2005-06) 452 Danielle O'Rourke (2008-09) 308 Chelsea Houtenbrink (2011-12), 42572=The TC3 softball team clinched the Mid-State Athletic Conference title and took a step closer to an NJCAA Region III playoff bid Saturday with a doubleheader sweep at Onondaga Community College. The Panthers won the opener 12-10 in eight innings before winning game two 8-0 in a contest shortened to five innings by the mercy rule. TC3 finishes MSAC play with a perfect 8-0 record and its first outright conference championship. The Panthers shared conference honors in 2005. On the year, TC3 improves to 19-12 overall and 16-5 in Region III.   After relying on dominating pitching in most of the recent wins, it was the offense's turn to pull out the win Saturday. Led by a team record four home runs, TC3 rapped out six extra-base hits among the team's 13 hits. Bethany Williamson (South Lewis HS/Lyons Falls) and Rose Dovi (Cortland HS/Cortland) provided most of the power, each blasting two home runs. Williamson went 3-for-4 with four RBI and Dovi finished 2-for-5 with five RBI. Ashley Morey (Owego Free Academy/Owego) and Kristina Bement (Elmira Free Academy/Elmira) each doubled as part of multiple hit games.   Game two featured solid hitting and pitching. Niki Rieman (Lake Shore HS/Derby), who earned the win in relief in game one, struck out five over five innings of shutout ball in the nightcap. Dovi, Williamson, and Morey each doubled in game two, with Dovi turning the trick twice as part of a 3-for-3, two RBI afternoon. Morey and Laura Cushing (Fabius-Pompoey HS/Fabius) both had two hits in the game.   TC3 wraps up the regular season Sunday against Genesee Community College.   Boxscore - Game 1 Boxscore - Game 2, 27409=36 Alice Karpel (2004-05) 28 Niki Rieman (2007-08) 23 Mackenzie Sherlock (2011-12), 60191=Saturday, April 28, 2007, 87051=Friday, March 16, 2007, 75248=Thursday, April 19, 2007, 80256=Tuesday, April 17, 2007, 28638=12 Niki Rieman (2007-08) 9 Mackenzie Sherlock (2011-12) 6 Emilie Rogers (2012) 6 Alice Karpel (2004-05) 6 Ashley Snyder (2011), 37188=The TC3 softball team ended the regular season with a dramatic win Sunday, rallying to take the nightcap of a doubleheader with Genesee Community College 4-3. The visitors won the opener 6-3 to snap TC3's eight-game winning streak. TC3 ends the regular season with an overall record of 20-13 and 17-6 in Region III. Genesee is 17-16 overall and 16-8 in Region III. Both teams are expected to receive playoff bids when the NJCAA Region III tournament field is announced later Sunday.   In the opener, sloppy defense cost the Panthers, as Genesee scored three unearned runs in the third inning to take the lead and another three unearned runs in the fifth to put the game away. TC3 was held to just six hits, with Rose Dovi (Cortland HS/Cortland) the only Panther to record multiple hits. Ashley Morey (Owego Free Academy/Owego) doubled for TC3's only extra base hit.   In game two, Genesee scored a pair in the third to take the lead. TC3 responded with a single run in the fourth, but Genesee answered with a run in the top of the fifth to make it 3-1. In the bottom of the inning, TC3 scored twice, with Morey and Casey Ebeling (Pearl River HS/Pearl River) driving in the runs. Ebeling's two-out RBI tied the game at 3-3 heading into the sixth.   After holding Genesee off the board in the top of the inning, TC3's Amber Harmon (Whitney Point HS/Lisle) reached on her second bunt base hit of the game, and moved to second on a throwing error. After two outs, Bethany Williamson (South Lewis HS/Lyons Falls) came through with a clutch hit, scoring Harmon with what proved to be the game-winning run. Niki Rieman (Lake Shore HS/Derby) completed the win in the seventh, holding Genesee off the board to pick up the victory.   Rieman and Harmon were the only Panthers to record multiple hits in game two. Williamson collected two hits on the afternoon, giving her 48 for the season, tying the TC3 season record set by Amber Wallace in 2004. Williamson has 78 hits for her career, one behind Wallace's career record.   The NJCAA Region III playoffs will include eight teams with the first round of games Tuesday.   Boxscore - Game 1 Boxscore - Game 2, 3860=May 19. 2015, 25714=106 Colleen Bannon (2009-10) 72 Heather Weber (2005-06) 61 Ashley Morey (2007-08), 86755=Thursday, April 12, 2007, 21899=.516 Samijo Scheer (2011-12) .500 Colleen Bannon (2009-10) .492 Brooke Wierzbicki (2009-10), 84691=Friday, April 13, 2007}",
    "textBeforeTable": "Roster–2007 Women's Softball With the season over, the final season statistics show three Panthers finished the year with a batting average over .300. Andrews led the team in hitting at .338 followed by Rebecca Trexler (Altmar-Parish-Williamstown H.S./Parish) at .315 and Forehand at .314. Andrews led team with six of the team’s 15 doubles, and Forehand had three of the team’s four home runs. Forehand also was the team leader in runs batted in, finishing with 21 of the team’s 54 RBI. As a pitcher, Forehand earned all five of TC3’s wins, throwing 13 complete games among her 18 appearances. In the fifth, Delhi scored twice to and had two runners on base, but Forehand came up big, inducing an infield pop-up and then striking out the final batter of the inning to hold the score at 7-4. In the sixth, Kailyn Andrews (Ithaca H.S./Ithaca) laced a two-out double down the line and then scored on a single by Morse, making it 8-4. After Forehand turned in a 1-2-3 bottom of the inning, TC3 sealed the win with a four-run seventh inning, led by Seychelle DeChellis (Lansing H.S./Lansing) stroking a two-run double. A single Delhi run in the bottom of the seventh made the final 12-4. Suarez led the 11-hit attack by going 3-for-5. Andrews, DeChellis, and Morse each went 2-for-5, with Morse driving in four runs. Forehand earned the win in the circle, going all seven innings",
    "textAfterTable": "Statistics–Women's Softball 2015 Season Overall (5-17) Region III (5-17) Statistics Previous Seasons   2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 Records Team Records Individual Records – Hitting Individual Records – Pitching Individual Records – Fielding Team Playoff Records Individual Playoff Records Honors Team Records Most Wins (Season) 35 (2012) 35 (2009) 34 (2010) 34 (2011) Most Consecutive Wins (Season) 19 (2011) 18 (2012) 17 (2010) Best Winning Percentage (Season) .875 (2012) .810 (2011) .773 (2010) Most Runs Scored (Game) 28 (vs. SUNY Delhi, 4/13/07) 25 (at Morrisville State, 4/28/04) 25 (vs. Niagara County CC, 1993) Most Runs Scored (Season) 383 (2012) 289 (2011) 288 (2010) Best Runs-Per-Game Average 9.6 (2012) 9.1 (1993) 8.9 (1992) Fewest Runs Allowed Per Game Average (Season) 2.0 (2012) 3.2 (2011) 3.3 (2009) Biggest Margin of Victory (Game) 23",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}