{
    "relation": [
        [
            "Team",
            "13. Huddersfield",
            "14. Hull City",
            "15. Ipswich",
            "16. Leeds Utd",
            "17. Middlesbrough",
            "18. MK Dons",
            "19. Preston"
        ],
        [
            "P",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "W",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "D",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "GD",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Pts",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Leeds - LUFC Grayson - We will relish the big occasion",
    "title": "",
    "url": "http://www.leeds.vitalfootball.co.uk/article.asp?a=223036",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 559509467,
    "recordOffset": 559485780,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13712=LUFC Failed Leeds striker set to make League One move (Wednesday July 29 2015), 19336=Time: 9:25PM, 13902=LUFC On This Day - July 30th (Thursday July 30 2015), 14526=LUFC On This Day - July 31st (Friday July 31 2015), 12872=LUFC On This Day - July 29th (Wednesday July 29 2015), 26181=Leeds United boss Simon Grayson is once again looking forward to going head to head with one of the top clubs in England after Leeds were given a trip to Arsenal in the FA Cup third round. Grayson led his side to the fourth round last season, in a cup run that saw his side beat Manchester United in the third round at Old Trafford 1-0. They eventually lost out to Tottenham in the fourth road after firstly holding them to a 2-2 draw at White Hart Lane and is sure his players will once again be up for the challenge. Speaking on the official website after the draw was made, Grayson said, \"After knocking out Manchester United in the third round last season and taking Tottenham to a replay in the fourth round, the current crop at Leeds have shown they relish the big occasion.\" It will be the first time the two clubs have met in the competition since meeting at the same stage in 2004 at Elland Road when Arsenal won 4-1. The two sides both have a great tradition of great clashes in the cup, including Leeds only triumph in the competition when a solitary Allan Clarke goal was enough for Leeds to bring the trophy home to Yorkshire in 1972. It will be the first time the two sides will have met at The Emirates, the last time the two clubs met in the competition at Highbury Leeds won through to the fifth round thanks to a solitary Rod Wallace goal. They have previously met in the competition on six other occasions with Leeds winning two and Arsenal four. There have also been six replays, the most memorable being the epic ties in 1982/83 when it went to a third game and the clash in 1990/91 going to four games with Arsenal eventually winning through in both ties. Leeds fans will be looking forward to hearing ticket arrangements for the tie as its another chance to take a huge vociferous following away from home. Vital Leeds United is a fast growing Leeds United fan site, with the sole aim of becoming the #1 unofficial website for Leeds United fans everywhere. The site is regularly updated with news and views regarding all the current events at Elland Road, alongside a fully interactive message forum and regularly looks at the clubs past. Vital Leeds offers everything that a Leeds United supporter could wish for. If you can think of something and suggest it, we`ll put it on the website! With news and views, along with a forum, polls and article comments, everything you need in a fans site is right here! You can even win prizes, by posting articles comments, posting on the message forum and voting on the polls. Vital is also 100% interactive. Not only can you have your say on the articles and the forum but you can also suggest an article or a poll so you can air your views. So why not join Vital today?, 12680=Erwin and Ajose start in development squad defeat (Tuesday July 28 2015), 14337=LUFC Summer transfer target joins Championship rivals (Thursday July 30 2015), 14122=LUFC West Yorkshire derby chosen by Sky for live coverage (Thursday July 30 2015), 13495=LUFC Released keeper set to sign short-term deal (Wednesday July 29 2015), 13065=LUFC Cook named in Emerging XI (Wednesday July 29 2015), 19382=Date:Sunday November 28 2010, 13284=LUFC Work permit problems for released Leeds midfielder (Wednesday July 29 2015)}",
    "textBeforeTable": "League Table (view table) 6 1972Glory 10. 7 chuffinnora21 9. 9 Salazzar 8. 16 Spanky White 7. 31 King Billy 6. 37 Oyper 5. 37 deslondon 4. 67 erni 3. 67 Tiny T 2. 183 dazza71 1. Vital Members League (view all) //--> document.write(''); } window.adgroupid = Math.round(Math.random() * 1000); if (window.adgroupid == undefined) {",
    "textAfterTable": "Leeds Fixtures (view all) Everton (H) Aug 1 2015 3:00PM Friendly Burnley (H) Aug 8 2015 12:30PM Sky Bet Championship Doncaster Rovers (a) Aug 13 2015 7:45PM Capital One Cup Reading (a) Aug 16 2015 3:00PM Sky Bet Championship Bristol City (a) Aug 19 2015 7:45PM Sky Bet Championship Sheffield Wednesday (H) Aug 22 2015 12:30PM Sky Bet Championship See all fixtures Report fixture change ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}