{
    "relation": [
        [
            "",
            "1981 Six",
            "1982 Six",
            "1980 318",
            "1981-82 318",
            "1980 360"
        ],
        [
            "Compr.",
            "8.4:1",
            "8.4:1",
            "",
            "8.5:1",
            "8.0:1"
        ],
        [
            "Carburetor",
            "1 barrel",
            "1 barrel",
            "2 bbl",
            "2 bbl Fed 4 bbl CA",
            "4 bbl"
        ],
        [
            "Federal hp",
            "85 @ 3,600",
            "90 @ 3,600",
            "120 @ 3,600",
            "130 @ 4,000",
            "185 @ 4,000"
        ],
        [
            "Fed. torque",
            "165 @ 1,600",
            "160 @ 1,600",
            "245 @ 1,600",
            "230 @ 2,000",
            "275 @ 2,000"
        ],
        [
            "CA hp",
            "90 @ 3,600",
            "90 @ 3,600",
            "",
            "165 @ 4,000",
            ""
        ],
        [
            "CA torque",
            "165 @ 4,000",
            "165 @ 1,600",
            "",
            "240 @ 2,000",
            ""
        ]
    ],
    "pageTitle": "Dodge Mirada: neglected sporty coupe of the 1980s",
    "title": "",
    "url": "http://www.allpar.com/model/mirada.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 290955899,
    "recordOffset": 290941617,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17755=Jim’s father bought this Mirada new in 1981; the sticker was $10,927, but he paid just $8,500 cash. Built in October 1980, the 318-powered car got 25 mpg on the highway when new. It had 150,000 miles in 2012, and was mainly original. “I get lots of looks and the usual question, ‘What is that?’ It’s like being in a parade all the time, and requires me to look my best just to get gas,” said Jim., 2580=My Mirada is a 1983. I chose the Slant Six; while its acceleration is underwhelming, it makes up for it by being extremely smooth and durable. You cannot feel it idle. I must have tried to start the car dozens of times when it was already running. Ouch!, 10867=By 1982, options included a “luxury” two spoke steering wheel, electronic search/tune AM/FM stereo with CB or cassette (with Dolby), aluminum alloy road wheels, semi-automatic air conditioning, cruise, illuminated entry system, and electric rear window defroster. Standard on any model were high-backed bucket seats, covered in cloth, vinyl, cloth-and-vinyl, or leather-and-vinyl. T-bar roofs were available along with tilt steering, leather-wrapped two-spoke steering wheel, ten-spoke road wheels, power antenna and deck release, cornering lights, and a three-toned horn., 11802=For 1981, the Mirada gained the CMX and S packages; the S included cloth-trimmed bucket seats and a sporty steering wheel, exterior stripes, and dual remote-control mirrors. CMX package included a textured vinyl simulated convertible roof, nameplates, door handle inserts, special wheel covers, and P205/75R15 radials. The seat cushions and tilt steering were improved, and a new steering wheel was used. The \"simulated convertible\" Cabriolet package was made standard. Under the hood, the ancient slant six finally gained hydraulic lifters, ending the need for manual valve adjustments; while the 318 was given a three-way catalytic converter and electronic feedback carburetor. The rear bumper on all Miradas went from aluminum to high strength steel. The 360 was no longer optional., 9852=While Miradas ran at NASCAR, they did not have much success. The main Mirada driver was Buddy Arrington (number 67), who wound up carrying the flag for Chrysler in NASCAR after Petty Enterprises went to GM. Arrington mainly used the Mirada as a short-track car, while using a 1981-83 Imperial on superspeedways (the Darth Vader nose of the Imperial had better aerodynamics). At one point Arrington ran the Mirada with a 1980s Cordoba nose piece! J. D. Stacy, Phil Good and Maurice Randall drove Miradas in NASCAR as well., 750=Engines Reviews Chrysler 1904-2016 Upcoming Trucks Cars Home, 17190=At its launch, Mirada at $6,364; the V8 only added $230. Both came with the TorqueFlite three-speed automatic, and a 2.7:1 axle ratio (2.9:1 with air conditioning). Tires were P195/75R15 glass-belted radial whitewalls; brakes were front disc, rear drum. The car weighed 3,380 pounds., 8472=1980 Mirada - 27,165, 1980 Mirada \"S\" - 1,468, (5,384 Miradas in 1980 had the CMX package). 1981 - 11,899 (1,683 with CMX option). 1982 - 6,818 (1,474 with the CMX Package). 1983 - 5,597 (1,841 had the CMX package). Total Mirada production from 1980-1983 was 52,947 cars — fewer than the 1979 Cordoba run., 18953=In 1980, the two-door Mirada was launched. It shared its “J-body” platform with the 1980 Chrysler Cordoba; the two-door Diplomat and Gran Fury went to the 108.7 inch wheelbase used by the two-door Volare/Aspen to make room for the larger new Dodge. After just one year, it was joined by the 1981-83 Imperial., 16383=The illuminated entry system was a new feature in 1980; when the driver lifted the outside front door handle, the various interior lights went on for 30 seconds (or until the ignition was turned on), including a halo lens around each door key cylinder and a light for the ignition key (which had been fired by the door switches for years). The 1980 Mirada also had an optional electric sunroof, in gray or gold tint, with an integral sun shade.}",
    "TableContextTimeStampAfterTable": "{9258=We make no guarantees regarding validity, accuracy, or applicability of information, predictions, or advice. Please read the terms of use and privacy policy. Copyright © 1994-2000, David Zatz; copyright © 2001-2015, Allpar LLC (except as noted, and press/publicity materials); all rights reserved. Dodge, Jeep, Chrysler, Ram, and Mopar are trademarks of Fiat Chrysler Automobiles.}",
    "textBeforeTable": "Weight reduction came from a lighter battery and a/c compressor; internal changes to the 318 engine; a plastic body on the cruise servo; a lightened heater core and a/c evaporator housing; lighter rear seats; and even a lighter fuel filler tube. Numerous panels were adhesive-bonded instead of being welded. By the time the Dodge Mirada was launched, trying to appeal buyers had seemed to want personal luxury coupes with decent gas mileage and a smooth ride, rear wheel drive was out of fashion, and buyers who did want that kind of car were still turned off by Chrysler’s first-year Volare-Aspen quality debacle. Chrysler had tuned the suspension for a superior ride and, outside of California, did not make a four-barrel version of the engine available, so the Dodge Mirada generally had lackluster performance as sold. It was easily beaten in sales by the ailing, but established, Cordoba. An optional electric sunroof was available, tinted gray or gold, with an integrated sunshade and a switch on the instrument panel. Its motor was actually trunk mounted; it used a drive cable to open and close the sunroof. The Mirada was also one of Chrysler’s first cars to feature a scissor jack, a safer and easier design than used in the past. Windshield wipers had new, lightweight black blade carriers, somewhat sharper looking than the dull metal of past models; modern threaded gas caps with relief valves; new rear",
    "textAfterTable": "For 1981, the Mirada gained the CMX and S packages; the S included cloth-trimmed bucket seats and a sporty steering wheel, exterior stripes, and dual remote-control mirrors. CMX package included a textured vinyl simulated convertible roof, nameplates, door handle inserts, special wheel covers, and P205/75R15 radials. The seat cushions and tilt steering were improved, and a new steering wheel was used. The \"simulated convertible\" Cabriolet package was made standard. Under the hood, the ancient slant six finally gained hydraulic lifters, ending the need for manual valve adjustments; while the 318 was given a three-way catalytic converter and electronic feedback carburetor. The rear bumper on all Miradas went from aluminum to high strength steel. The 360 was no longer optional. By 1982, options included a “luxury” two spoke steering wheel, electronic search/tune AM/FM stereo with CB or cassette (with Dolby), aluminum alloy road wheels, semi-automatic air conditioning, cruise, illuminated entry system, and electric rear window defroster. Standard on any model were high-backed bucket seats, covered in cloth, vinyl, cloth-and-vinyl, or leather-and-vinyl. T-bar roofs were available along with tilt steering, leather-wrapped two-spoke steering wheel, ten-spoke road wheels, power antenna and deck release, cornering lights, and a three-toned horn. For extensive suspension information, including common issues and repairs, see our transverse torsion bar suspension page. NASCAR Miradas by David Lawrence While Miradas ran at NASCAR, they",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}