{
    "relation": [
        [
            "Start Date",
            "2002 Sep 25",
            "[ 1996 Jun 27 ]",
            "1949 Jan 5",
            "[ 1946 Oct 13 ]",
            "[ 1940 Apr ]",
            "[ 1918 Feb ]",
            "1914 May 29",
            "1904 Apr 22",
            "1889 Jun",
            "1874 Nov 15",
            "1871 Mar 2",
            "1870 Aug 27",
            "1856 Sep",
            "1840",
            "1836 Apr 22 (?)",
            "1808"
        ],
        [
            "Stop Date",
            "2002 Sep 29 (?)",
            "[ Unknown ]",
            "1949 Jan 19 (in or after)",
            "[ 1946 Oct 15 ]",
            "[ Unknown ]",
            "[ Unknown ]",
            "1915 Feb 28 ± 30 days",
            "1905 May 27",
            "Unknown",
            "Unknown",
            "1871 Mar 14",
            "1870 Aug 28",
            "Unknown",
            "Unknown",
            "1836 Apr 24 (?)",
            "Unknown"
        ],
        [
            "Eruption Certainty",
            "Confirmed",
            "Uncertain",
            "Confirmed",
            "Discredited",
            "Discredited",
            "Discredited",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed"
        ],
        [
            "VEI",
            "4",
            "",
            "2",
            "",
            "",
            "",
            "2",
            "3",
            "1",
            "2",
            "2",
            "3",
            "1",
            "2",
            "2",
            "2"
        ],
        [
            "Evidence",
            "Historical Observations",
            "",
            "Historical Observations",
            "",
            "",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations"
        ],
        [
            "Activity Area or Unit",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Global Volcanism Program | Ruang",
    "title": "",
    "url": "http://volcano.si.edu/volcano.cfm?vn=267010&tab=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250750943,
    "recordOffset": 250739029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10427=Pilots from Qantas Airlines reported an eruption around 1600 on 27 June. A plume moved W and reached an altitude of about 6,000 m. However, the eruption was not visible in GMS satellite imagery., 20754=Eruption on 25 September 2002 is the largest in Indonesia in many years, 13834=VSI reported that following the 25 September Ruang eruption there was no significant volcanic activity; only thin white clouds rose 100 m above the summit. On 30 September VSI decreased the Alert Level at Ruang from 4 to 3 (on a scale of 1-4)., 10501=Plume observed in late June, 8468=The first strong eruption commenced at 1140 on 25 September, producing thick black clouds that rose 3 km. Ten minutes later, a second eruption sent ash clouds rising 5 km. At 1210 the activity subsided enough to observe glowing material on E flank. The specific eruption site has not been firmly established. It has been presumed by VSI that it originated from \"Crater II\" or \"where the 1949 lava originated (E side of summit).\" The eruption column was reported from ground-based observations as rising to at least 5 km, and by Darwin VAAC advisories as rising to about 17 km. According to the Darwin VAAC, satellite imagery revealed that the ash cloud drifted westward to Borneo and Sumatra. Satellite images from NOAA showed the plume drifting SW with other components drifting W (figure 1). By 30 September the volcano was quiet with only a thin white plume rising about 100 m. The Alert Level was reduced from 4 to 3 on 30 September 2002., 21613=PVMBG reported that seismicity at Ruang decreased from 14 March through 2 June. Emissions were unobserved during periods of clear weather from 1 May through 2 June. The Alert Level was lowered to 1 (on a scale of 1-4) on 3 June. Residents and tourists were warned not to approach the active craters., 5913=Volcanic activity had decreased by 30 September 2002 after a strong eruption on the 25th. After the hazard status was lowered from Alert Level 4 to 3 on 30 September, it was dropped to Level 2 during the week of 7-13 October. However, activity continued to be higher than normal that week, with frequent strong emissions and \"thick white ash\" rising ~100 m above the summit. Emission earthquakes decreased (table 1). High-pressure plumes decreased in frequency from 14 October through 10 November, but \"thick white ash\" continued to rise from the summit. No ashfall was reported during October or November. Rainfall on 23 October caused a lahar. No volcanic or emission earthquakes were recorded during 4-10 November, and the Alert Level was reduced to level 1., 5105=Table 1. Seismicity at Ruang, 7 October-10 November 2002. Courtesy of VSI., 11620=10/2002 (BGVN 27:10) Eruption on 25 September 2002 sends ash to at least 5 km, 18701=The TOMS scientists published an image on their website (figure 3), described as follows: \"The TOMS overpass on September 25 was too early to capture the fresh eruption cloud, but ash and SO2 were evident on the following day. The aerosol signal over S Borneo is at least partly due to smoke from biomass burning; the ash cloud from Ruang can be seen over NE Borneo. A data gap may be obscuring any SO2 or ash immediately W of Ruang.\", 11422=08/2003 (BGVN 28:08) Rapid decrease in activity following September 2002 eruption, 9086=A drastic increase of seismic events - from 3 to 24 events/day - was observed on 24 September by the Volcanological Survey of Indonesia (VSI). The next day, people near the volcano reported hearing a noise, and ash eruptions began by 0100. By 0300 ash emissions were continuous, and ash began falling around Ruang island and the nearby island of Tagulandang. Observers reported that the sounds accompanying the eruption were weak. By 0400 more than 1,000 people living near the volcano were evacuated to a nearby island. Around 0800, the Alert Level advanced to the highest status (level 4)., 20636=The 25 September 2002 eruption of Ruang (BGVN 27:10 and 28:08) was, according to the Darwin Volcanic Ash Advisory Center (VAAC), the largest in Indonesia for many years and was well observed by satellite sensors. The eruption cloud reached a height of ~ 20 km, and a pyroclastic flow toward the SE damaged an area 1.6 km². Although no village was hit by the pyroclastic flow, two were heavily damaged by very thick ash material., 6020=Rapid decrease in activity following September 2002 eruption, 11789=08/1996 (BGVN 21:08) Plume observed in late June, 12985=VSI increased the Alert Level at Ruang to 4 (the highest level) when the volcano began to erupt on 25 September at 0100. During the 7-hour eruption an ash cloud rose 0.5-1 km above the summit. Ruang erupted again at 1140, producing an ash cloud that VSI reported rose to 5 km above the summit. According to the Darwin VAAC, satellite imagery revealed that an ash cloud reached ~16 km above the volcano. People living near the volcano at desa Pumpente and desa Laimpatehi were evacuated., 15404=PVMBG reported that emissions from Ruang were unobserved during periods of clear weather from 1 January through 12 March. Seismicity increased starting on 6 March prompting PVMBG to raise the Alert Level to 2 (on a scale of 1-4) on 12 March. Residents and tourists were warned not to approach the craters within a 1.5-km radius., 17564=Information Contacts: Darwin Volcanic Ash Advisory Center (VAAC), Commonwealth Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/, Email: darwin.vaac@bom.gov.au); Nia Haerani, Directorate of Volcanology and Geological Hazards (formerly VSI), Jalan Diponegoro No 57, Bandung 40122, Indonesia (URL: http://www.vsi.esdm.go.id/); Simon A. Carn and Arlin Krueger, Joint Center for Earth Systems Technology (NASA/UMBC), University of Maryland, Baltimore County, 1000 Hilltop Circle, Baltimore, MD 21250, USA (URL: http://skye.gsfc.nasa.gov/)., 9469=The last reported activity at Ruang occurred when Qantas Airlines pilots observed an eruption around 1600 on 27 June 1996 (BGVN 21:08). A resulting plume moved W and reached an altitude of ~6 km. However, the eruption was not visible in GMS satellite imagery. The last known confirmed eruption at Ruang occurred in 1949., 16652=2015: March | June 2002: September | October, 9572=Eruption on 25 September 2002 sends ash to at least 5 km, 14567=During 21-27 October, a thick low-level ash plume infrequently rose above Ruang. Rainfall on 23 October caused lahars to flow down the volcano's flanks during 1445-1545. Ruang remained at Alert Level 2 (on a scale of 1-4)., 876=Information Contacts: Darwin Volcanic Ash Advisory Center (VAAC), Commonwealth Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/, Email: darwin.vaac@bom.gov.au); Nia Haerani, Directorate of Volcanology and Geological Hazards (formerly VSI), Jalan Diponegoro No 57, Bandung 40122, Indonesia (URL: http://www.vsi.esdm.go.id/); Simon A. Carn and Arlin Krueger, Joint Center for Earth Systems Technology (NASA/UMBC), University of Maryland, Baltimore County, 1000 Hilltop Circle, Baltimore, MD 21250, USA (URL: http://skye.gsfc.nasa.gov/)., 11220=02/2004 (BGVN 29:02) Eruption on 25 September 2002 is the largest in Indonesia in many years}",
    "TableContextTimeStampAfterTable": "{8878=Morrice M G, Jezek P A, Gill J B, Whitford D J, Monoarfa M, 1983. An introduction to the Sangihe arc: volcanism accompanying arc-arc collision in the Molucca Sea, Indonesia. J Volc Geotherm Res, 19: 135-165., 1350=Ruang volcano, not to be confused with the better known Raung volcano on Java, is the southernmost volcano in the Sangihe Island arc, north of Sulawesi Island. The 4 x 5 km island volcano rises to 725 m across a narrow strait SW of the larger Tagulandang Island. The summit of Ruang volcano contains a crater partially filled by a lava dome initially emplaced in 1904. Explosive eruptions recorded since 1808 have often been accompanied by lava dome formation and pyroclastic flows that have damaged inhabited areas., 8767=Kusumadinata K, 1979. Data Dasar Gunungapi Indonesia. Bandung: Volc Surv Indonesia, 820 p., 9252=Neumann van Padang M, 1959. Changes in the top of Mount Ruang (Indonesia). Geol en Mijnbouw, 21: 113-118., 9106=Neumann van Padang M, 1951. Indonesia. Catalog of Active Volcanoes of the World and Solfatara Fields, Rome: IAVCEI, 1: 1-271.}",
    "textBeforeTable": "Summary of Holocene eruption dates and Volcanic Explosivity Indices (VEI). Eruptive History Ruang volcano, not to be confused with the better known Raung volcano on Java, is the southernmost volcano in the Sangihe Island arc, north of Sulawesi Island. The 4 x 5 km island volcano rises to 725 m across a narrow strait SW of the larger Tagulandang Island. The summit of Ruang volcano contains a crater partially filled by a lava dome initially emplaced in 1904. Explosive eruptions recorded since 1808 have often been accompanied by lava dome formation and pyroclastic flows that have damaged inhabited areas. Geological Summary 878 1,652 2,766 149,159 Within 5 km Within 10 km Within 30 km Within 100 km Population Major Andesite / Basaltic Andesite Basalt / Picro-Basalt Rock Types Subduction zone Oceanic crust (< 15 km) Tectonic Setting Stratovolcano Lava dome Volcano Types Information Contacts: Darwin Volcanic Ash Advisory Center (VAAC), Commonwealth Bureau of Meteorology,",
    "textAfterTable": "This compilation of synonyms and subsidiary features may not be comprehensive. Features are organized into four major categories: Cones, Craters, Domes, and Thermal Features. Synonyms of features appear indented below the primary name. In some cases additional feature type, elevation, or location details are provided. Synonyms Roeang | Roewang | Doeang | Doewang | Duwang | Duang Photo Gallery Ruang volcano, seen here from the nearby island of Tagulandang, forms a small 4 x 5 km island that is part of a chain of islands extending north from Sulawesi. Explosive eruptions, recorded in historical time since 1808, have been accompanied by pyroclastic flows and lava dome formation, and have frequently caused damage to populated areas. Photo by Suratman (Volcanological Survey of Indonesia).",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}