{
    "relation": [
        [
            "Cited Patent",
            "US4065814 *",
            "US4384369 *",
            "US4698847 *",
            "US4910802 *",
            "US4953856 *",
            "US5046194 *"
        ],
        [
            "Filing date",
            "24 Aug 1976",
            "11 May 1981",
            "21 Nov 1985",
            "7 Nov 1988",
            "17 Mar 1989",
            "19 Feb 1991"
        ],
        [
            "Publication date",
            "3 Jan 1978",
            "24 May 1983",
            "13 Oct 1987",
            "27 Mar 1990",
            "4 Sep 1990",
            "10 Sep 1991"
        ],
        [
            "Applicant",
            "Fox Edgar N",
            "Lyndonn Prince",
            "Hiroshi Yoshihara",
            "Malloy Eugene A",
            "Fox Iii Charles E",
            "Alaniz Irma P"
        ],
        [
            "Title",
            "One piece elastic body suit",
            "Exercise suit",
            "Apparel structure and process for making apparel",
            "Exercise suit",
            "Exercise garment",
            "Suit for weight lifters"
        ]
    ],
    "pageTitle": "Patent US5109546 - Exercise suit with resilient reinforcing - Google Patents",
    "title": "",
    "url": "http://www.google.co.uk/patents/US5109546",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473831759,
    "recordOffset": 473808922,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been described in complete detail and pictorially shown in the accompanying drawings, it is not to be limited to such details since many changes and modifications may be made in the invention without departing from the spirit and the scope thereof. Hence, it is described to cover any and all modifications and forms which may come within the language and scope of the appended claims. In use, the wearer pulls the pants 20 and top 44 on much like conventional exercise suits. The waist drawstring 28 is tied and the adjustment is made on the sides over the hips detaching and reattaching the hook and loop tape 40 creating the desired resistance to the reinforcing segment 38 and leg bands 42. The knee pads 32 are likewise adjusted and the person conducts the desired exercise readjusting when desired. The top 44 is made of the same material as the pants 20 and the leg and side bands 42 and 58 are made of latex rubber strips having a width from 4 inches (10.2 cm) to 6 inches (15.2 cm) wide. While any latex rubber strips may be used, it has been found that the material known by its tradename THERA-BAND has proven optimum in the application. The reinforcing segment and collar 38 and 54 preferably are made of heavy 75 percent elastic or so called SUPER-SPANDEX. A pair of elongatable resistive side",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5186701 * 6 Nov 1991 16 Feb 1993 Wilkinson William T Aerobic resistance exercise garment US5201074 * 30 Dec 1991 13 Apr 1993 Dicker Timothy P Exercise suit with resilient reinforcing US5267928 * 12 May 1992 7 Dec 1993 Brace International Rehabilitation device US5308305 * 19 Mar 1991 3 May 1994 Jan W. Romney Device to augment exercise US5336139 * 12 Oct 1993 9 Aug 1994 Miller Bruce W Isotonic cervical exercise device US5357637 * 3 Dec 1993 25 Oct 1994 Moore Derrick F Exercise pants and exercise band assembly US5367708 * 23 Aug 1993",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}