{
    "relation": [
        [
            "Name",
            "Bleat It",
            "Toe-to-Toe",
            "The Arena",
            "RAWR!",
            "Again! Again!",
            "MOAR!",
            "Terror Begins",
            "Terror Grows",
            "Terror's End",
            "The Dark Project",
            "The Metal Age",
            "Deadly Shadows",
            "Going Rogue",
            "Wrath of Midas",
            "The Orcish Mines",
            "Winter is Coming",
            "Creeplight Contract",
            "In Cold Blood",
            "The Deadites",
            "The Evil Zombie",
            "The Triad",
            "Meat Beat",
            "Way of the Open Fist",
            "Meat is Murder",
            "Path of Light",
            "Honour and Glory",
            "Holy Ground",
            "Magic, Woo!",
            "Malfunctionarium",
            "The Golem Factory",
            "Bloo Hoo",
            "Damp Darkness",
            "Deep Magic",
            "A Taste",
            "Bloodsoaked Blade",
            "Bloody Victory",
            "Finding a Way",
            "Taking Heart",
            "?",
            "New Prospects",
            "Forging Ahead",
            "?",
            "The Ratlings",
            "Rat-Faced",
            "?"
        ],
        [
            "Class",
            "Fighter",
            "Fighter",
            "Fighter",
            "Berserker",
            "Berserker",
            "Berserker",
            "Warlord",
            "Warlord",
            "Warlord",
            "Thief",
            "Thief",
            "Thief",
            "Rogue",
            "Rogue",
            "Rogue",
            "Assassin",
            "Assassin",
            "Assassin",
            "Priest",
            "Priest",
            "Priest",
            "Monk",
            "Monk",
            "Monk",
            "Paladin",
            "Paladin",
            "Paladin",
            "Wizard",
            "Wizard",
            "Wizard",
            "Sorcerer",
            "Sorcerer",
            "Sorcerer",
            "Bloodmage",
            "Bloodmage",
            "Bloodmage",
            "Transmuter",
            "Transmuter",
            "Transmuter",
            "Tinker",
            "Tinker",
            "Tinker",
            "Crusader",
            "Crusader",
            "Crusader"
        ],
        [
            "Level",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold",
            "Bronze",
            "Silver",
            "Gold"
        ],
        [
            "Flavor Text",
            "Gorgons have broken into the Kingdom's petting zoo, spreading madness and petrification. Fight your way through the enraged goats and put an end to the gorgon leader!",
            "A particularly troublesome djinn thinks it's being smart by harassing our northern caravans with illusion magic and wild beasts. Mere guards cannot hope to defend against this: this matter needs someone made of sterner stuff.",
            "Okay Fighter, it's time to do what you do best! Can you survive the trials of the Quaking Arena and emerge as champion?",
            "AAARGH? RWARR! RASHURFASURRWARANKASDG!",
            "RWARWRUURGAR! (*mouth-froth*)",
            "RARARKGH! BLAAURUGH! RWARAR!",
            "The great and terrible Bleaty has ravaged our lands for too long. Only a hero capable of defying death itself can stand up to him and rid us of this bearded terror!",
            "Your sleep has become fitful, and your dreams torment you. Your battle against the terrible Bleaty did not end in his lair ... you can feel it. A strange force compels you to go adventuring in the south.",
            "The ancient stone labyrinths to the north call you. There is something final about them, you can feel it. Whether this means an end to the nightmares or an end to you is uncertain.",
            "In the Kingdom's seedy criminal underworld, not even the faintest whispers of fortune remain unheeded. It is said that Lord Sillyname possesses a mighty and unique treasure, and it is your plan to take it.",
            "You've infiltrated Lord Sillyname's castle, but the keep is swarming with well-equipped guards. You'll have to be superbly opportunistic if you want to get through this situation alive.",
            "You've decided to lay low in the depths of Sillyname's keep, but now is the time to claim your prize -- and your acclaim as a master thief.",
            "A group of renegades has been discovered near one of the Kingdom's outlying villages. Military forces are being sent to clear the camp, but there's always room for an opportunistic hero to sneak in first.",
            "A map you claimed from the bandit camp highlights what appears to be the primary outlaw stronghold. You have a nose for opportunity. You also have a nose for danger. Right now, the air stinks of both.",
            "In addition to Midas' hideout, your plundered bandit map points out an abandoned sludge mine. Although it's known to have been flooded out long ago when the goblin miners got careless, it seems another group has crept in and started secret renovations.",
            "A cruel and powerful troll-beast patrols the Eastern Peaks, terrorising local settlements and stealing people in the night. Now warrior can stand up to the creature, but a quick blade and silent feet may just prevail.",
            "It seems that your prowess in the Eastern Peaks has attracted the attention of some important people. A local lord whose family was slain by the Creeplight death cult has asked you to accept his revenge contract. The conditions stipulate thoroughness above all else -- all creatures must be slain.",
            "The ultimate assassin's challenge awaits you. One of your own kind, a veteran stalk known as \"Draugi\", has discarded the vows of the fellowship to carve out an icy kingdom in the east. Stop the oathbreaker, and you'll be greatly rewarded.",
            "Legends of the Zompocalypse tell of one brave priest's struggle against the neverending army of darkness. It's a pretty vague prophecy, but it's good enough for you.",
            "The Zompocalypse is upon us! A very, very evil zombie has risen from the dead and terrifies pretty much everyone. It's up to you to use your unique undead-killing powers and put a stop to its evil scheme!",
            "You've stopped the Zompocalypse, but can you go one step further and destroy it at its source? An ancient and powerful triad of undead lords controls the rituals that led to the Zompocalypse, and they will surely strike again unless someone sallies forth to defeat them once and for all!",
            "It's raw, squelchy and its very existence is an affront to the monk order. It's a common creature known as the Meat Man, and you've been sent on a traditional pilgrimage to present your bare-fisted wrath to as many of them as possible. Your journey begins on the Isle of Blegh.",
            "Your pilgrimage continues into the swampy depths of the south. There, a foul mirror of the holy one's skill and resolve awaits.",
            "The long journey ends with your greatest challenge yet. Within the abominable slime pits, strength of body and mind are constantly tested by foul and destructive beings.",
            "The Glowing Guardian demands a champion to fight for his cause against a particularly galling undead lord. Since paladins are naturally quite good at championing things, it falls to you to get the job done.",
            "It's not only the Glowing Guardian who seeks spiritual champions, and the Paladins answer a wide range of calls -- paying homage through humility and kindness, or steel and glory. right now, Taurog seeks the latter sort of champion to dispose of some heretical dragonspawn.",
            "Owing to a recent druid shortage, the Earthmother is looking for a Paladin to champion her cause. Not her first choice, but sometimes deities have to settle for general purpose holy men, y'know? She wants you to target and destroy a particularly irksome naga warrior in her name.",
            "Ancient texts report a great and mysterious source of magical power in the Deadly Death Bog. Unfortunately, a barbarian class has constructed an impenetrable stone fortress on the site. They also hate all that 'magic stuff'.",
            "After a few more futile attempts at correctly translating the ancient text, you decide that there's only one place that can unlock the true secrets of such a garbled script: the aptly-named Malfunctionarium. It can only be hoped that nothing will go horribly wrong while you're there.",
            "Up for some glory, wizard? Seek out the golem factory in the Alphae Nostalge mountains and prove your mettle as a spellcaster",
            "The blobby, sentient jellies known as the Bloo Goo have been studied as a magical curiosity for centuries. Your Kingdom's mages believe that they've discovered something new and valuable about these creatures, but they'll need to collect some fresh samples.",
            "Examining the Bloo Goo itself has provided little information, but evidence points to a nearby flooded tomb that may hold the answers you seek.",
            "The tomb goes deeper, and the power of the Bloo Goo grows. You are nearing whatever secret the tomb holds, to be certain, but you still need to contend with the tomb's increasingly mysterious guardians.",
            "Those who seek the darkest of power can only rise by stepping on those who have sought and failed before. You are ready to begin treading the path. By wary of the sacrifices you must make ... and be strong enough to accept the rewards.",
            "It is said that the druids of the western forest guard a sinister artifact, stolen long ago from the sanctum of Dracul the Undying and hidden from those who would use it for evil. The opportunity to study this blade cannot be passed up, and as a newly-inaugurated member of the Bloodmages, it has been decided that you shall embark upon the perilous task of claiming it.",
            "You have the blade, but you need to cover your tracks. It is said one of Dracul's champions is carving a bloody swathe through the west in search of the blade -- you must seize the opportunity to destroy this creature before it realizes you've become the target.",
            "Transmuters have always wanted to shape existence through magic, but their meddling has finally caught up with them. In seeking new avenues of power, the struggling order will have to correct its three greatest mistakes.",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?"
        ],
        [
            "Boss(es)",
            "Medusa (Level 8)",
            "Imadjinnius",
            "Mister Goat",
            "Punycrush McSissywiz",
            "Fodder Von Flee",
            "Antimony",
            "Bleaty",
            "Bleaty",
            "Super Bleat Man, Tormented Bleat, Tower of Bleat, Bleaty",
            "Groundskeeper (Level 5)",
            "Guard Captain (Level 9)",
            "Sillyname",
            "Lord Lüt and Mr Treshar",
            "Midas",
            "Yohoho",
            "Shard",
            "Anubiss",
            "Shard and Draugr",
            "Bad Ash",
            "Mister Evil",
            "The Triad, The Triad and The Triad",
            "The Punching Bag",
            "Berglwergl",
            "Superduper",
            "Bael Von Blud",
            "Scalespit",
            "Ssseth",
            "Rath",
            "Fergle",
            "Super Meat Man and Iron Man",
            "Whurl'doff Goo",
            "Eeblis",
            "The Undefeatable",
            "Kim Royce",
            "Trikkistix",
            "The Immovable",
            "Rockslide",
            "?",
            "?",
            "?",
            "Force",
            "?",
            "?",
            "?",
            "?"
        ],
        [
            "Monsters",
            "Goats and Gorgons",
            "All unlocked monsters and Desert Trolls",
            "All unlocked monsters",
            "Desert Trolls, Goats, Warlocks and Zombies",
            "Bandits, Djinns, Dragon Spawn, Plants (Erosive Eelroots, Corrosive Creepers and Poisonous Pods), Serpents and Zombies",
            "Doom Armours, Goo Blobs, Steel Golems, Succubi and Thralls",
            "Goblins, Gorgons and Terror Goats",
            "Goblins, Goo Blobs, Gorgons, Meat Men, Naga and Serpents",
            "Dragon Spawns, Golems, Goo Blobs, Rock Trolls and Wraiths",
            "Grounds Watchers and Trapped Chests",
            "Castle Guards and Trapped Chests",
            "Castle Guards, Mercenaries, Spellslingers and Trapped Chests",
            "Bandits, Goblins, Meat Men, Minotaurs and Serpents",
            "Burn Vipers, Foyter, Goblins, Golden Statues, Meat Men, Minotaurs, Prist and Wheeze-hard",
            "Animated Armours, Bandits, Goblin Miners, Minotaurs and Zombies",
            "Frigid Corpses, Fronzen Trolls and Meat Men",
            "Cultists, Golems, Serpents and Zombies",
            "Berserkers, Burn Vipers, Frozen Trolls, Wraiths and Zombies",
            "Heretics, Vampires, Wraiths and Zombies",
            "Golems, Meat Men, Serpents, Warlocks and Zombie",
            "Gelatinous Things, Gorgons, Serpents and Thralls",
            "Goblins, Gorgons, Meat Men and Mystery Meats",
            "Gorgons, Meat Men, Naga, Plants (All), Vampires, Warlocks and Wraiths",
            "Acid Blob, Gelatinous Thing, Golem, Goo Blob, Meat Men, Muck Walker, Slime Blob and Zombie",
            "Bilious Corpses, Serpents, Vampires and Wraiths",
            "Animated Armor, Dragon Spawn, Goo Blobs, Serpents and Steel Golem",
            "All unlocked monsters, Naga and Plants (Mysterious Murkshades)",
            "Berserkers, Goblins, Goo Blobs and Gorgons",
            "Goats, Goo Blobs, Gorgons, Illusions, Vampires and Warlocks",
            "Animated Armours, Golems and Meat Men",
            "Animated Armours, Bloo Goos, Goats and Serpents",
            "Bloo Goo, Dancing Blades, Djinn, Golem and Imps",
            "Animated Armours, Bloo Goo, Desert Trolls, Djinns, Imps and Serpents",
            "Blood Snake, Cultists, Damned Ones, Goo Blob, Rusalkas and Wraiths",
            "Bandits, Bridge Troll, Druids, Goats, Goblins, Meat Men, Tokoloshes and Zombies",
            "Cave Snakes, Goblins, Goo Blobs, Minotaurs and Wraiths",
            "All Unlocked Monsters",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?"
        ],
        [
            "Preparations",
            "None allowed",
            "Blacksmith",
            "Blacksmith, Witch and Alchemist",
            "None allowed",
            "Blacksmith",
            "None allowed",
            "None allowed",
            "Thief Den and Mage Tower",
            "None allowed",
            "None allowed",
            "None allowed",
            "None allowed",
            "None allowed",
            "Thief Den, Alchemist, Witch and Church (Dracul only)",
            "None allowed",
            "None allowed",
            "Bazaar",
            "None allowed",
            "None allowed",
            "Bazaar and Witch",
            "None allowed",
            "None allowed",
            "Alchemist and Witch",
            "None allowed",
            "No preparation allowed",
            "Blacksmith and Alchemist",
            "None allowed",
            "None allowed",
            "Mage Tower",
            "None allowed",
            "No preparation allowed",
            "Blacksmith and Mage Tower",
            "None allowed",
            "No preparation allowed",
            "Mage Tower, Blacksmith and Bazaar",
            "None allowed",
            "None allowed",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?",
            "?"
        ],
        [
            "Reward",
            "150 Gold",
            "Platemail",
            "",
            "250 Gold",
            "Whurrgarbl",
            "",
            "350 Gold",
            "Trisword",
            "",
            "150 Gold",
            "Balanced Dagger",
            "",
            "250 Gold",
            "Gloves of Midas",
            "",
            "350 Gold",
            "Venom Dagger",
            "",
            "150 Gold",
            "Stone Sigil",
            "",
            "250 Gold",
            "Martyr Wraps",
            "",
            "350 Gold",
            "Agnostic Collar",
            "",
            "150 Gold",
            "Mage Plate",
            "",
            "250 Gold",
            "Blue Bead",
            "",
            "350 Gold",
            "Vampiric Blade",
            "?",
            "150 Gold",
            "400 Gold",
            "?",
            "150 Gold",
            "400 Gold",
            "?",
            "150 Gold",
            "400 Gold",
            "?"
        ]
    ],
    "pageTitle": "Difference between revisions of \"Class Challenges\" - DDwiki",
    "title": "",
    "url": "http://www.qcfdesign.com/wiki/DesktopDungeons/index.php?title=Class_Challenges&diff=15210&oldid=13680",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 660153967,
    "recordOffset": 660126589,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "List of Class Challenges You cannot earn any gold in class challenges excluding what you bring out of the dungeon. Each of the main 12 classes have three challenges for you to conquer. They come in Bronze, Silver, and Gold challenges. Completing a Silver challenge unlocks an item. If you beat all the gold challenges in the Guild, Thief Den, Church, or Wizard's Tower you can veto one item, preventing it from appearing in a shop. Revision as of 14:45, 10 December 2013 {{MainNav}}   {{MainNav}}       |}   |}   |-   |-   | ? +   | ? +   | ? +   | ? +   | ? +   | Gold +  ",
    "textAfterTable": "v · t · e Desktop Dungeons General Concepts: New Players Guide · Strategy · Unlocking content · Quests · Traits · Mana · Leveling · Items · Scoring · Class Challenges Classes: Guild Thief Den Church Mage Tower Tier 1  Fighter  Thief  Priest  Wizard Tier 2",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}