{
    "relation": [
        [
            "Flood",
            "Large number of similar exposure units",
            "Accidental, uncontrollable",
            "Potentially catastrophic",
            "Definite losses",
            "Determinable probability distribution of losses",
            "Economically feasible",
            "Insurable?"
        ],
        [
            "Fire",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Depends",
            "No"
        ],
        [
            "Disability",
            "Yes",
            "Yes",
            "No",
            "Yes",
            "Yes",
            "Depends",
            "Yes"
        ],
        [
            "Terrorism",
            "Yes",
            "Yes",
            "No",
            "No",
            "Yes",
            "Depends",
            "Yes"
        ],
        [
            "",
            "No",
            "No (man-made, though not by the insured)",
            "Yes",
            "Yes",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Ideal Requisites for Insurability",
    "title": "",
    "url": "http://2012books.lardbucket.org/books/enterprise-and-individual-risk-management/s10-03-ideal-requisites-for-insurabil.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456823,
    "recordOffset": 443522,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15794=Catastrophic losses may occur in two circumstances. In the first, all or many units of the group are exposed to the same loss-causing event, such as war, flood, tornado, mudslide, forest fire, hurricane, earthquake, tsunami, terrorist attack, or unemployment. For example, if one insurer had assumed the risk of damage by wind (hurricane) for all houses in the Miami, Florida, area, it would have suffered a catastrophic loss in 1992 when many structures were damaged simultaneously by Hurricane Andrew (and in fact several insurers were unable to withstand the losses). The 2005 hurricanes, which caused the largest-ever insured losses, are an example of a megacatastrophe that affected many units. These are examples of exposure units that suffer from the same cause of loss because of geographic proximity. Exposure units are susceptible to dependent lossWhen loss to one exposure unit affects the probability of loss to another. when loss to one exposure unit affects the probability of loss to another. Thus, fire at one location increases the probability of fire at other homes in the area: their experience is dependent. In the early days of insurance in the United States, many fire insurance companies concentrated their business in small areas near their headquarters. This worked in New York City, for example, until a major fire devastated large sections of the city in 1835. Because of their concentrated exposures, several insurers suffered losses to a large percentage of their business. The insurers were unable to pay all claims, and several went bankrupt., 17528=A recent example of catastrophe exposure is the case of the risk of mold. Mold created a major availability and affordability issue in the homeowner’s and commercial property insurance markets in the early 2000s. The Wall Street Journal article, “Hit With Big Losses, Insurers Put Squeeze on Homeowner Policies,” reported massive exclusions of mold coverage because of the “avalanche of claims.”Jeff D. Opdyke and Christopher Oster, “Hit With Big Losses, Insurers Put Squeeze on Homeowner Policies,” Wall Street Journal, May 14, 2002., 22848=When the probability distribution of losses for the exposure to be insured against cannot be calculated with reasonable accuracy, the risk is uninsurable. An example of purported uninsurability due to inability to predict losses is the nuclear power industry. Insurance experts convinced government officials in 1957 that the risk of loss caused by an incident at a nuclear power site was too uncertain (because of lack of experience and unknown maximum severity) for commercial insurers to accept without some government intervention. As a result, the government limited the liability of owners of nuclear power plants for losses that could arise from such incidents., 34815=The second example in Table 6.1 \"Examples of Insurable and Uninsurable Risks\" is the peril/risk of fire. Fire is an insurable risk because it meets all the required elements. Even this peril can be catastrophic, however, if fires cannot be controlled and a large geographical area is damaged, such as the large fires in Colorado and Arizona in 2002. Disability is another type of peril that is considered insurable in most cases. The last example is the risk of terrorism. As noted above, it is no longer considered an insurable risk due to the catastrophic element associated with this peril since the September 11, 2001, attack., 1025=This content was accessible as of December 30, 2012, and it was downloaded then by Andy Schmitz in an effort to preserve the availability of this book., 18244=A second type of catastrophe exposure arises when a single large value may be exposed to loss. September 11, 2001, represents such catastrophic loss. Tremendous value was concentrated in the towers of the World Trade Center. The possibility of a human-made catastrophe of such magnitude was not anticipated. Private insurers stopped short of calling the terrorist attacks “acts of war”—which would have been excluded from coverage—and honored the policies covering the World Trade Center and the lives of the victims. However, one consequence was the industry’s action to immediately exclude terrorism coverage from new policies until the Terrorism Risk Insurance Act (TRIA) of 2002 provided stop-gap coverage from the federal government. When insurers and reinsurers (the insurers of the insurance companies) see the peril as having a far higher probability than previously perceived, they know that they can no longer accurately predict future losses, and their immediate reaction is to exclude the peril. Because of regulation and oversight (see Chapter 8 \"Insurance Markets and Regulation\"), however, the industry cannot make policy changes instantaneously.Insurance is regulated by the states, a topic that will be covered in more detail in Chapter 7 \"Insurance Operations\". When private insurers can no longer provide coverage, a solution may be to create pools such as those described in the box below, “Who Should Insure Against Megacatastrophes?” More on this topic and on reinsurance will be explained in Chapter 7 \"Insurance Operations\"., 5803=Soon after the devastation of Hurricane Katrina became known, the Mississippi attorney general filed a lawsuit against insurers claiming that the flood should be covered by homeowner’s insurance policies. The controversy over coverage was explored in the September 8, 2005, New York Times article, “Liability Issue: Wind or Water?” Is this question so open-ended?}",
    "lastModified": "Sun, 30 Nov 2014 17:08:00 GMT",
    "textBeforeTable": "Table 6.1 Examples of Insurable and Uninsurable Risks Table 6.1 \"Examples of Insurable and Uninsurable Risks\" provides an analysis of the insurability characteristics of a few common perils and risks. The first column lists the requirements for insurability that we have just discussed. Note that the risk of flooding is not considered insurable because of its potential for catastrophe: many exposures can suffer losses in the same location. Thus, flooding is covered by the federal government, not by private insurers. Hurricanes, though similar to floods, are covered by private insurers, who obtain reinsurance to limit their exposure. After a catastrophe like Hurricane Andrew, however, many reinsurers became financially strapped or insolvent. Summary of Insurable Risks The possible loss must also be relatively large compared to the size of the premium. If the losses the insurer pays plus the cost of insurer operations are such that the premium must be very large in relation to the potential loss, insurance is not economically feasible. From the viewpoint of the insured, when the expected loss premium is high relative to the maximum possible loss, internal budgeting for the risk is preferable to insurance. The use of deductibles (a form of retention) to eliminate insurance reimbursement for frequent small losses helps make automobile collision premiums economically feasible. The deductible eliminates claims for small losses. Small automobile collision losses have such",
    "textAfterTable": "The second example in Table 6.1 \"Examples of Insurable and Uninsurable Risks\" is the peril/risk of fire. Fire is an insurable risk because it meets all the required elements. Even this peril can be catastrophic, however, if fires cannot be controlled and a large geographical area is damaged, such as the large fires in Colorado and Arizona in 2002. Disability is another type of peril that is considered insurable in most cases. The last example is the risk of terrorism. As noted above, it is no longer considered an insurable risk due to the catastrophic element associated with this peril since the September 11, 2001, attack. Insurance companies use cost-benefit analysis to determine whether they should bring a new product to the market. In Chapter 4 \"Evolving Risk Management: Fundamental Tools\", you learned about the time value of money and computation for such decisions. Key Takeaways In this section you studied that a risk perfectly suited for insurance meets the following requirements: The number of similar exposure units is large. The losses that occur are accidental. A catastrophe cannot occur. Losses are definite. The probability distribution of losses can be determined. The cost of coverage is economically feasible. Discussion Question Explain whether the following risks and perils are insurable by private insurers:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}