{
    "relation": [
        [
            "Records",
            "Korean Pro Sports Single-Match Highest Attendance New Record",
            "K League Championship Single-Match Highest Attendance New Record",
            "K League Single-Regular Season Highest Average Attendance New Record",
            "K League Single-Regular & Post Season Highest Average Attendance New Record",
            "K League Single-Regular & Post Season Highest Total Attendance New Record",
            "K League Single-Season Highest Total Attendance New Record"
        ],
        [
            "Date / Season",
            "2010-05-05",
            "2010-12-05",
            "2010 Season",
            "2010 Season",
            "2010 Season",
            "2010 Season"
        ],
        [
            "Matches",
            "1",
            "1",
            "14",
            "15",
            "15",
            "19"
        ],
        [
            "Attendance",
            "60,747",
            "56,759",
            "30,849",
            "32,576",
            "488,641",
            "546,397"
        ],
        [
            "Notes",
            "",
            "",
            "League : 14 matches",
            "League : 14 matches Championship : 1 match",
            "League : 14 matches Championship : 1 match",
            "League : 14 matches Championship : 1 match League Cup : 4 matches"
        ]
    ],
    "pageTitle": "FC Seoul - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/FC_Seoul",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881816435,
    "recordOffset": 881759124,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28070=From the beginning of 1988, Lucky-Goldstar Hwangso pushed forward a relocation to Seoul[9] At the end of the 1989 season, the Korea Professional Football League (renamed as the K League in 1998), worried about the financial stability of the clubs, invited a number of clubs to play in Seoul. Thus, the Lucky-Goldstar Hwangso, which had always wanted to be based in the capital, moved to Seoul Stadium (Currently Dongdaemun Stadium) in Seoul at the end of 1989 The club finished first season in Seoul as champions. The club changed its name to LG Cheetahs in 1991 to mirror the LG Twins, a professional baseball team also owned by LG Group. After several seasons in Seoul, the club was forced to move in 1996, as part of the K League's decentralization policy. This policy was carried out to stimulate the growth of football in the provinces. In addition, in 1995, Korea was bidding to host the 2002 FIFA World Cup. This warranted the construction of a soccer-specific stadium in Seoul. The three clubs based in Seoul – LG Cheetahs, Ilhwa Chunma, and Yukong Elephants did not want to recognize the decentralization policy. Ultimately, it proved necessary for the Korean government to issue an eviction order to the disaffected clubs. However, the government did guarantee if the clubs built a soccer-specific stadium in Seoul, the clubs could have a Seoul franchise and return to Seoul., 26005=FC Seoul was officially announced on 18 August as the new club and founded on 22 December 1983, and started out in 1984 as Lucky-Goldstar Football Club, owned and financially supported by the Lucky-Goldstar Group (currently LG Group), with the Chungcheong region as its franchise and Hwangso (meaning bull) as its mascot., 334504=※ As of 31 December 2014 ※ Bye results and W/O results are counted. ※ Penalty shoot-outs results are counted as a drawn match. ※ AFC Champions League results include the 1999–2000 Asian Cup Winners' Cup and the 2001–02 Asian Club Championship., 284236=※ K League Championship results are not counted. ※ 1993, 1998, 1999, 2000 seasons had penalty shoot-outs instead of draws. ※ A : Adidas Cup, P : Prospecs Cup, PM : Philip Morris Cup, D : Daehan Fire Insurance Cup, 44086=FC Seoul's No. 12 is retired for the supporters. The main supporter group of FC Seoul is Suhoshin (Guardian Deity) and was organized in March 2004. There are also some minor supporter groups such as West Story and Seoulobba., 39374=FC Seoul appointed Nelo Vingada as manager on December 14, 2009. Vingada won the K League and League Cup with FC Seoul. FC Seoul had 20 wins, 2 draws, and 6 losses in the 2010 season under Vingada's management., 46308=From 1999 to 2001, FC Seoul wore red and blue stripes but returned to all red in the 2002 season and In 2005, FC Seoul changed to red and black stripes and this colour has been in use since., 411609=For details on U-18 Team, see FC Seoul Reserves and Academy. As of 2014 Note: Flags indicate national team as defined under FIFA eligibility rules. Players may hold more than one non-FIFA nationality., 30344=As a result, 3 clubs were evicted from Seoul to other cities. This entailed the move of the LG Cheetahs to the Anyang Sports Complex in the city of Anyang, a satellite city of Seoul, 21 km away. The club was now known as the Anyang LG Cheetahs. In the upcoming years, a solid base of supporters was formed, and it established a strong league rivalry with the Suwon Samsung Bluewings. This rivalry was partly fueled by the fact that LG Group and Samsung Group, which owned the Suwon club, were also considered rivals in the business world, especially in electronics. The club continued to grow and in 2000, they won their third Championship, behind the firepower of striker Choi Yong-Soo., 46013=In 1995, Lucky-Goldstar Group pushed ahead with Corporate identity unification and the company colour was changed to red. So FC Seoul's jersey colour was changed from yellow to red as part of the unification project., 42962=FC Seoul legend Choi Yong-soo was hired to manage the club in 2012, after previously serving as the assistant manager and caretaker for the club in 2011. In 2013, AFC Champions League campaign has earned Choi Yong-soo the 2013 AFC Coach of the Year award, becoming the second Korean in succession to win the prestigious individual accolade following last year’s winner Kim Ho-kon., 39781=FC Seoul recorded an attendance of 60,747 against Seongnam Ilhwa on May 5, 2010 at Seoul World Cup Stadium, this is the highest single-match attendance record in South Korean professional sports history.[17][18] FC Seoul also recorded the single-season (League, K League Championship, League Cup) highest total attendance record – 546,397 and the single-regular & post season (League, K League Championship) highest average attendance record of 32,576.[19][20][21], 14301=The club was officially founded as Lucky-Goldstar FC in 1983, by the Lucky-Goldstar Group. FC Seoul have won 5 League titles, 2 League Cups and 1 FA Cup. FC Seoul is one of the most successful and popular clubs in the K League Classic, with financial backing from the GS Group.[3] In 2012, FC Seoul was evaluated as the most valuable football brand in the K League Classic.[4][5], 26526=In order to launch the professional football club, Lucky-Goldstar Group had a preparation period from 1982[7] and demanded that the original franchise should be Seoul.[8] In the 1984 season, the club finished seventh out of the eight clubs. The club fared better in the 1985 season when they won the championship with the help of Thailand national football team player Piyapong Pue-On, who was the top scorer, as well as the top assistor., 45910=FC Seoul wore both yellow jersey and red colour jerseys in home matches from 1984 to 1986., 40814=On December 13, 2010, FC Seoul wanted to extend Vingada's 1 year contract but FC Seoul and Vingada could not come to an agreement over the salary conditions, resulting in Vingada returning home to Portugal.[22], 37378=FC Seoul's 2009 AFC Champions League campaign began with a 2–1 win over Indonesian side Sriwijaya FC. However, 3 winless matches followed with losses to Gamba Osaka and Shangdong Luneng and a 1–1 draw again against Luneng. It looked impossible for Seoul to qualify for the Round of 16, but a dramatic come-from-behind victory over reigning champion Gamba Osaka and Sriwijaya FC's unexpected victory over Shandong Luneng meant FC Seoul finished in second place in Group F. On June 24, 2009, FC Seoul beat Kashima Antlers 5–4 on penalties after a 0–0 draw in the Round of 16 clash and advanced to the Quarter-finals,[15] but were beaten 4–3 on aggregate by Qatari club Umm Salal.[16] FC Seoul's appearance in the AFC Champions League was its first since the Asian Club Championship Era., 45050=The FC Seoul's current mascot is SSID, SSID is extraterrestrial. The SSID Stands for Seoul & Sun In Dream. It is said that SSID was beamed down to Seoul World Cup Stadium by his intergalactic spaceship on April 6, 2004. Former mascots were bull and cheetah., 41446=On August 25, 2010, FC Seoul beat Jeonbuk Hyundai Motors 3–0 to become the 2010 League Cup winner.[23] FC Seoul were also crowned K League champions as a 2–1 win over Jeju United in the second leg of the play-off series final saw them triumph 4–3 on aggregate in K League Championship final, thus, achieving their first double in FC Seoul's history. The crowd of 56,769 at the 2nd leg also set the record of the highest attendance in K League Championship history.[24][25][26], 34795=Şenol Güneş managed FC Seoul for a three-year period from December 8, 2006.[11] The club started the 2007 season with 3 consecutive wins and a draw, and a spectacular result in the Seoul–Suwon derby match with FC Seoul defeating Suwon Samsung 4–1.[12] Following a draw with Gwangju Sangmu in round 16, FC Seoul was defeated 1–0 by Suwon Samsung. 80% of the regular squad was injured and FC Seoul failed to qualify for the play-off phase of the season. However, they succeeded in getting into the final of the K League Cup. The second season under Güneş was different. There were no major injuries and although Park Chu-Young, the ace of FC Seoul at that time, was transferred to Ligue 1 club Monaco, the \"Double Dragons\" of FC Seoul (Lee Chung-yong, Ki Sung-yueng) made a big progress and Dejan Damjanović scored 14 goals. This resulted in a second place finish in the K League regular season, and progress to the play-offs. FC Seoul defeated Ulsan Hyundai in the play-off semi-final but was defeated by Suwon in the final. Despite the loss, the club still qualified for the 2009 AFC Champions League.[13] The Şenol Güneş era ended on November 25, 2009, with the manager returning to Trabzonspor.[14], 32023=For the 2002 FIFA World Cup in Korea and Japan, 10 brand new stadiums of World Cup standards were built in Korea. After the World Cup, the Korean World Cup Organizing Committee and the KFA actively supported the move of regional K League clubs into the new stadia. This was designed to avoid or at least minimize any financial losses through having to maintain a stadium in playing condition without regular income. However, due to the previous decision by the K League to exclude any member club from being based in Seoul, Seoul World Cup Stadium remained vacant, except as a host of some international friendlies. Thus, the city government of Seoul and the KFA both actively sought for a K League club to play at the stadium to take on the cost of maintaining the stadium. Initially, it was intended to create a new club, but when it later transpired that any club playing in Seoul World Cup Stadium would have to pay partially for the construction fees of the stadium, this would have placed an unreasonable burden on a fledgling club. Thus, the KFA tried to lure one of the current clubs to Seoul. The Anyang LG Cheetahs, with the financial backing of the LG Group, who not only viewed the move back to Seoul as a way to increase its advertising presence, but had the right to come back to Seoul because it had its franchise moved by force in 1996, as part of the K League's decentralization policy. Anyang LG announced in February 2004 that it would pay the share of the construction fees (which turned out to be 15 billion wons, or at that time 15 million USD).[10] This proposed move provoked a significant amount of controversy from the Korean football fans as KFA and K League failed to launch a new football club based in Seoul due to a high Seoul franchise fee. Regardless, KFA and K League ultimately permitted relocation of Anyang LG Cheetahs., 324996=[1] In 1986, Tournament name was Professional Football Championship [2] In 1988 and 1989, Tournament name was National Football Championship [3] In 2000, Tournament name was 1999–2000 Asian Cup Winners' Cup [4] In 2002, Tournament name was 2001-02 Asian Club Championship, 257779=※ Notes (1) In only 1987 season, All K League clubs wore white jersey in home match, coloured jersey in away match like Major League Baseball. (2) 2002 1st kit and 2003 1st kit are same but colour of adidas logo and 3 stripes on shoulder are different (3) Original 2014–15 1st Kit had white socks, but white socks are weared at only just 5 matches in March 2014, then changed to red socks. In 2015, Name and number printing pont on Jersey is changed.}",
    "lastModified": "Fri, 31 Jul 2015 14:54:05 GMT",
    "textBeforeTable": "Attendance new records by FC Seoul[edit] Attendance records[edit] 39.28% +240 1448 1688 371 371 480 1222 Total 40.00% +30 56 86 12 21 22 55 1986–2014 AFC Champions League 50.00% -3 6 3 1 0 1 2 1999, 2001 Super Cup 50.00% +31 60 91 15 8 23 46 1996-2014 FA Cup 85.71% +8 5 13 1 0 6 7 1988, 1989 National Football Championship 38.49% +174 1321 1495 342 342 428 1112 1984-2014 K League Notes Win% GD GA GF L D W Pld Season Competition ※ As of 31 December 2014 ※ Bye results and W/O results are counted. ※ Penalty shoot-outs results are counted as a drawn match. ※ AFC Champions League results include the 1999–2000 Asian Cup Winners' Cup and the 2001–02 Asian Club Championship. All-time competitions records[",
    "textAfterTable": "Total attendance & Average attendance[edit] ※ Season total attendance is K League Regular Season, League Cup, FA Cup, AFC Champions League in the aggregate and friendly match attendance is not included. ※ K League season total attendance is K League Regular Season and League Cup in the aggregate. Season Season Total Att. K League Total Att. Regular Season Average Att. League Cup Average Att. FA Cup Total / Average Att. ACL Total / Average Att. Friendly Match Att. Att. Ranking Notes 1984–2003 Official attendance records don't have credibility 2004 223,529 223,529 15,363 6,529 No home match N/A N/A 2005 458,605 458,605 22,010 32,415 No home match N/A 17,211 (vs Boca Juniors) K League Season Total Att. 1st 2006 357,231 315,698 18,782 11,921 41,533 / 13,844 N/A 61,235 (vs F.C. Tokyo) K League Season Total Att. 2nd",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}