{
    "relation": [
        [
            "SNP ID",
            "rs879089",
            "rs931161",
            "rs931162",
            "rs1152994",
            "rs2275922"
        ],
        [
            "Clin",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Chr 01 pos",
            "20,642,023(+)",
            "20,639,278(-)",
            "20,638,914(-)",
            "20,635,615(+)",
            "20,639,815(+)"
        ],
        [
            "Sequence Context",
            "GGAAA(C/G/T)GATGC",
            "GCATG(C/T)TTTGA",
            "GCCTC(G/T)GAGCT",
            "aggcc(A/G)aggcg",
            "TCCAG(A/G)TTACA"
        ],
        [
            "AA Info",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Type",
            "intron-variant",
            "intron-variant",
            "intron-variant",
            "intron-variant",
            "intron-variant"
        ],
        [
            "MAF",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "PINK1 Gene - GeneCards | PINK1 Protein | PINK1 Antibody",
    "title": "",
    "url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=PINK1&rf=/home/genecards/current/website/carddisp.pl&go_func=8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467728063,
    "recordOffset": 467650578,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{261216=Protects against mitochondrial dysfunction during cellular stress by phosphorylating mitochondrial proteins. Involved in the clearance of damaged mitochondria via selective autophagy (mitophagy) by mediating activation and translocation of PARK2. Targets PARK2 to dysfunctional depolarized mitochondria through the phosphorylation of MFN2. Activates PARK2 in 2 steps: (1) by mediating phosphorylation at Ser-65 of PARK2 and (2) mediating phosphorylation of ubiquitin, converting PARK2 to its fully-active form (PubMed:24660806, PubMed:24751536, PubMed:24784582, PubMed:25527291)., 263493=This gene encodes a serine/threonine protein kinase that localizes to mitochondria. It is thought to protect cells from stress-induced mitochondrial dysfunction. Mutations in this gene cause one form of autosomal recessive early-onset Parkinson disease. [provided by RefSeq, Jul 2008]}",
    "textBeforeTable": "Sequence variations from dbSNP and Humsavar for PINK1 Gene Variants for PINK1 Gene No data available for Paralogs for PINK1 Gene Paralogs for PINK1 Gene PINK1 (if available) Gene Tree for TreeFam: PINK1 (if available) Gene Tree for ENSEMBL: Evolution for PINK1 Gene",
    "textAfterTable": "Structural Variations from Database of Genomic Variants (DGV) for PINK1 Gene Variant ID Type Subtype PubMed ID nsv834369 CNV Loss 17160897 nsv870827 CNV Gain 21882294 Relevant External Links for PINK1 Gene HapMap Linkage Disequilibrium report PINK1 Human Gene Mutation Database (HGMD) PINK1 Locus Specific Mutation Databases (LSDB) PINK1 No data available for Polymorphic Variants from UniProtKB/Swiss-Prot for PINK1 Gene Disorders for PINK1 Gene MalaCards: The human disease database. (3) Diseases for PINK1 Gene including... Search for PINK1 Gene in MalaCards »",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}