{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "No",
            "26",
            "35",
            "19",
            "69",
            "6",
            "4",
            "14",
            "51",
            "29",
            "93",
            "38",
            "17",
            "9",
            "8",
            "41",
            "7",
            "71",
            "5"
        ],
        [
            "Rider",
            "Dani Pedrosa",
            "Cal Crutchlow",
            "Stefan Bradl",
            "Nicky Hayden",
            "Alvaro Bautista",
            "Andrea Dovizioso",
            "Marc Marquez",
            "Michele Pirro",
            "Andrea Iannone",
            "Randy De Puniet",
            "Bradley Smith",
            "Karel Abraham",
            "Danilo Petrucci",
            "Hector Barbera",
            "Aleix Espargaro",
            "Hiroshi Aoyama",
            "Claudio Corti",
            "Colin Edwards"
        ],
        [
            "Bike",
            "Honda",
            "Yamaha",
            "Honda",
            "Ducati",
            "Honda",
            "Ducati",
            "Honda",
            "Ducati Test",
            "Ducati",
            "ART",
            "Yamaha",
            "ART",
            "Suter BMW",
            "FTR Kawasaki",
            "ART",
            "FTR Kawasaki",
            "FTR Kawasaki",
            "FTR Kawasaki"
        ],
        [
            "Time",
            "1:32.322",
            "1:32.671",
            "1:32.813",
            "1:32.956",
            "1:33.109",
            "1:33.238",
            "1:33.403",
            "1:33.625",
            "1:33.833",
            "1:34.081",
            "1:34.538",
            "1:35.309",
            "1:35.403",
            "1:39.248",
            "1:43.517",
            "",
            "",
            ""
        ],
        [
            "Diff",
            "",
            "0.349",
            "0.491",
            "0.634",
            "0.787",
            "0.916",
            "1.081",
            "1.303",
            "1.511",
            "1.759",
            "2.216",
            "2.987",
            "3.081",
            "6.926",
            "11.195",
            "",
            "",
            ""
        ],
        [
            "Prev.",
            "",
            "0.349",
            "0.142",
            "0.143",
            "0.153",
            "0.129",
            "0.165",
            "0.222",
            "0.208",
            "0.248",
            "0.457",
            "0.771",
            "0.094",
            "3.845",
            "4.269",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Valencia MotoGP Test Day 2 Final Times: Pedrosa Leads Crutchlow, Marquez Impresses | MotoMatters.com | Kropotkin Thinks",
    "title": "",
    "url": "https://motomatters.com/results/2012/11/14/valencia_motogp_test_day_2_final_times_p.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884518471,
    "recordOffset": 884489926,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{65002=My interest in Dovi's performance derives from the fact that, of all the riders changing bikes, the Duc is recognised as the most difficult to extract good times with and pretty much everyone has acknowledged that it carries the portent of a poisoned chalice. Dovi met the qualifications Jarvis laid down at the beginning of the 2012 season for graduating to the factory Yamaha team, but his ace was trumped. Dovi and Crutchlow have turned on a great deal of the most interesting racing this year and I for one hope to see Dovi being able to continue to scrap up towards the front next year; I feel this test indicates he has perhaps a better chance to do that than most of us thought would be the case., 58308=Marquez would have (entirely theoretically) done about 1:32.2 ish - 8th fastest - squeezing Hayden back to 9th, and a shade under 0.5 slower than Bradl. About 0.8 slower than that bike's previous rider isn't half bad in the circumstances., 57915=So if we take 1.3 secs. off the test times, that would put Dovi on the Duc at 1:32 - only about 2-3 /10ths slower than he was on the T3 Yam - not too shabby at all. It would also have put him as fastest Duc in the session by nearly 0.5, and 7th on the sheets displacing Hayden. I think that Dovi's debut time on the Duc is the best 'new little Duccer' we've seen since '07., 46132=I think Pedrosa had something like 6 or 8 tests before the 2006 season even started., 57592=QP was the only really dry session for the race; Pedrosa put in an absolute blinder of 1:30.844. Let's say, rounding that out a little to allow for the extra impetus of going for pole: a 1:31, so assuming he was giving it a pretty hard go, the optimal track time was around 1.3 seconds slower yesterday.}",
    "lastModified": "Sat, 01 Aug 2015 03:31:32 GMT",
    "textBeforeTable": "Times at the end of second day of testing at Valencia: A dry track allowed Marc Marquez to make his debut aboard the RC213V, the young Spaniard making a very impressive debut. Marquez built speed quickly, ending the day a little over a second behind Pedrosa after just 27 laps on the bike, and three tenths slower than Alvaro Bautista. Andrea Dovizioso was also quicker than the first day, finally getting some dry time on the Ducati and ending nine tenths behind Pedrosa. Bradley Smith put in laps on both a damp track and in the dry, finishing the day 2.2 seconds behind Pedrosa. The heavy rain promised for the second day of the MotoGP test at Valencia never came, the track drying towards the end of the day, allowing almost everyone to get out and put in a number of laps on a dry track. Dani Pedrosa ended the day on top of the timesheets, posting a time underneath the race lap record, a sign that the condition of the track was good enough at the end. Cal Crutchlow ended as 2nd fastest, a third of a second behind Pedrosa, and a little over a tenth quicker than Stefan Bradl, who has just announced a contract extension with LCR and HRC.  Valencia, Spain MotoGP in",
    "textAfterTable": "  Race Details 2013 Login or register to post comments Tweet Comments Dovisiso Submitted by HAILERS on Wed, 2012-11-14 17:34. Well, seeing as how the tests were in mixed weather and no real hard data to go with.............and being no Dovisiso fan..............he did quite a bit better than the last Ducati lead rider at Valencia who qualified what? 2 seconds in arrears. So actually Dovisiso looks pretty good. Then again, nobody expected much from the last Ducati lead rider. 1 2 3 4 5 Total votes: 161",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}