{
    "relation": [
        [
            "Date",
            "Nov 18, 1999",
            "Aug 2, 2000",
            "Dec 16, 2002",
            "Jan 27, 2004",
            "Sep 22, 2004",
            "Mar 2, 2005",
            "Mar 2, 2005",
            "Jun 1, 2005",
            "Feb 17, 2006",
            "Mar 6, 2006",
            "Jul 11, 2006",
            "Oct 25, 2006",
            "Sep 8, 2008",
            "Oct 15, 2012",
            "Mar 6, 2013",
            "Mar 6, 2013",
            "Apr 23, 2013",
            "Jul 11, 2014",
            "Mar 2, 2015",
            "Mar 4, 2015",
            "Mar 4, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "REIN",
            "FP",
            "AS",
            "PRDP",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Reinstatement after maintenance fee payment confirmed",
            "Expired due to failure to pay maintenance fee",
            "Assignment",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: NEW VENTURE HOLDINGS, LLC, MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DELUXE PATTERN CORPORATION;FARM & COUNTRY REAL ESTATE COMPANY;PATENT HOLDING COMPANY;AND OTHERS;REEL/FRAME:016610/0200 Effective date: 20050502",
            "Owner name: CADENCE INNOVATION LLC, MICHIGAN Free format text: CHANGE OF NAME;ASSIGNOR:NEW VENTURE HOLDINGS, LLC;REEL/FRAME:017575/0145 Effective date: 20051014",
            "Owner name: BANK OF AMERICA, N.A., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:NEW VENTURE HOLDINGS, LLC;REEL/FRAME:017946/0365 Effective date: 20050502",
            "Owner name: BANK OF AMERICA, N.A., CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNORS:CADENCE INNOVATION LLC F/K/A;NEW VENTURE HOLDINGS, LLC;REEL/FRAME:018109/0095 Effective date: 20050502",
            "Owner name: BROOKS KUSHMAN P.C., MICHIGAN Free format text: SECURITY AGREEMENT;ASSIGNOR:NEW VENTURE HOLDINGS LLC;REEL/FRAME:018433/0266 Effective date: 20050803",
            "Year of fee payment: 8",
            "",
            "",
            "",
            "Effective date: 20130306",
            "Owner name: GLOBAL IP HOLDINGS LLC, MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CADENCE INNOVATION LLC;REEL/FRAME:033300/0707 Effective date: 20131206",
            "Effective date: 20150304",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6196607 - Trim panel assembly and plastic interior trim panel for use therein - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6196607?dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986806.32/warc/CC-MAIN-20150728002306-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486033959,
    "recordOffset": 486012499,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While embodiments of the invention have been illustrated and described, it is not intended that these embodiments illustrate and describe all possible forms of the invention. Rather, the words used in the specification are words of description rather than limitation, and it is understood that various changes may be made without departing from the spirit and scope of the invention. Because the base section 30 raises the auxiliary connector portion 32, an unsightly hole need not be formed through the side wall portion 42 of the auxiliary section 18 to allow the slider 62 to form the connector portion 32. The lifter 60 and the slide 62 are positioned as illustrated in FIG. 5 during a plastic injection step to form the base section 30 and the auxiliary connector portion 32. Both the lifter 60 and the slide 62 are moveable between their extended positions shown in FIG. 5 and retracted positions (now shown). Referring now to FIG. 5, there is illustrated a lifter 60 and a slide 62 for forming the base section 30 and the auxiliary connector portion 32, respectively. The lifter 60 is located within an injection mold whereas the slide is typically located outside the injection mold. The outer surface 40 of the auxiliary section 18 is a Class A surface and the auxiliary section 18 is a flag-shaped section of the interior trim panel 14. The inner wall portion 50 is",
    "textAfterTable": "US6656397 Oct 24, 2000 Dec 2, 2003 Delphi Technologies, Inc. Method of making a door trim assembly US6723263 Sep 25, 2001 Apr 20, 2004 Delphi Technologies, Inc. Apparatus and method of making interior trim panel US6756003 Mar 4, 2002 Jun 29, 2004 Visteon Global Technologies, Inc. Method of attaching thermoplastic attachments to a substrate US6838027 Nov 30, 2000 Jan 4, 2005 Delphi Technologies, Inc. Method of making an interior trim panel US6942280 * Jun 12, 2003 Sep 13, 2005 Guardian Industries Corp. System for attaching colored insert to vehicle frame assembly US6951321 * Mar 27, 2003 Oct 4, 2005 The Boeing Company Efficient cargo liner installation US6966594 Mar 1, 2004 Nov 22, 2005 Lear Corporation Vehicle trim panel and method of reducing BSR US6983978 * May 12, 2004 Jan 10, 2006 Lear Corporation Modular automotive",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}