{
    "relation": [
        [
            "Date",
            "Aug 20, 1990",
            "Jan 10, 1992",
            "Jun 14, 1994",
            "Jul 5, 1994",
            "Jul 5, 1994",
            "Apr 27, 1998",
            "Apr 11, 2002"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ARCO CHEMICAL TECHNOLOGY, INC., DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:MALLIKARJUN, RAMESH;REEL/FRAME:005411/0443 Effective date: 19900327",
            "Owner name: ARCO CHEMICAL TECHNOLOGY, L.P. A PARTNERSHIP OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:ARCO CHEMICAL TECHNOLOGY, INC.;REEL/FRAME:005970/0340 Effective date: 19911220",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4968747 - Compatibilized blends of crystalline propylene polymers and styrenic copolymers - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4968747?dq=6322901",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484648759,
    "recordOffset": 484617667,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51442=Methods of obtaining ethylene-propylene copolymers and ethylene-propylene-diene terpolymers are well known in the art and are described, for example, in ver Strate, \"Ethylene-Propylene Elastomers\" , Encyclopedia of Polymer Science and Engineering, Vol. 6, Wiley-Interscience (1988), p. 522-564 (the teachings of which are incorporated herein by reference). The weight average molecular weight of suitable ethylene-propylene copolymers and ethylene-propylene-diene terpolymers is preferably from about 1,000 to 1,000,000. The ethylene-propylene copolymers and ethylene-propylene-diene terpolymers may be blended with polyethylene (preferably, high density polyethylene); polyethylene:elastomer ratios of from about 0.05:1 to 1:1 generally are preferred. Blends of this type are available commercially, including \"IM-7565\" (a 0.5:1 blend of high density polyethylene and ethylene-propylene-diene terpolymer available from Uniroyal Chemical Company)., 63386=However, the preferred procedure is to intimately mix the components in the form of granules and/or powder in a high shear mixer at an elevated temperature. Intimate mixing may be accomplished by the use of extrusion compounding machines such as single or twin screw compounding extruders or thermoplastic extruders having preferably at least a 20:1 L/D ratio and a compression ratio of about 3 or 4:1. The polyblend may be either supplied directly to a molding machine or converted into pellet form for further processing., 67353=Examples of fillers which may be blended with the resin compositions of this invention include, but are not limited to, mineral fillers such as calcium carbonate, dolomite, silicates, silicas, talc, koalin, mica, magnesium phosphate, barium sulfate, titanium oxide, and the like, organic fillers such as carbon black, and fibrous fillers such as glass fiber (including strands and chopped fiber), carbon fiber, graphite fiber, synthetic thermoplastic fiber (e.g., aliphatic polyamide, aromatic polyamide, polyethylene, polypropylene), ceramic fiber, and boron fiber. The weight ratio of resin to filler is preferably from about 0.5:1 to 20:1., 32186=Bartlett et al (Mod. Plastics December 1981, p. 60) teach the use of hydrogenated styrene/butadiene block copolymers as compatibilizers for blends of general purpose polystyrene and polypropylene., 70342=These examples demonstrate the preparation of the thermoplastic resin compositions of this invention by a two step compounding procedure. In the first step, 80 parts by weight of a styrene/maleic anhydride copolymer containing about 14 weight percent maleic anhydride and having a melt flow rate (Condition L) of 1.6 g/10 min. was melt-blended with 20 parts by weight of \"IM-7565\" elastomeric olefin polymer (a 2:1 blend of EPDM rubber and high density polyethylene, available from Uniroyal Chemical Company). In Examples 2-5, sufficient \"Bondfast 2B\" (an ethylene/glycidyl methacrylate/vinyl acetate terpolymer available commercially from Sumitomo Naugatuck Co. Ltd.) was also added to bring the amount of epoxy group-containing olefinic copolymer in the final thermoplastic resin composition to the level shown in Table I. For comparative purposes, no epoxy group-containing olefinic copolymer was added to Example 1.}",
    "textBeforeTable": "Patent Citations  TABLE III__________________________________________________________________________Example # 13 14 15 16 17 18 19__________________________________________________________________________Crystalline Propylene Polymer A-1 A-2 A-3 A-4 A-5 A-6 A-7pbw 35 70 55 45 60 65 38Random Styrenic Copolymer B-1 B-2 B-3 B-4 B-5 B-6 B-7pbw 35 10 30 25 20 13 40Elastomeric Olefin Polymer C-1 C-2 C-3 C-4 C-5 C-6 C-7pbw 25 19 5 27 18 15 10Epoxy Group-Containing Olefinic Copolymer D-1 D-2 D-3 D-4 D-5 D-6 D-7pbw 5 1 10 3 2 7 12__________________________________________________________________________ D-7: An ethylene/glycidyl acrylate copolymer containing 20 weight percent glycidyl acrylate. D-6: An ethylene/glycidyl methacrylate/vinyl butyrate terpolymer terpolymer containing 85 weight percent ethylene, 5 weight percent glycidyl methacrylate, and 10 weight percent vinyl butyrate. D-5: An ethylene/propylene/3,4-epoxy butene/vinyl acetate copolymer containing 70 weight percent ethylene, 10 weight percent propylene, 12 weight percent 3,4-epoxy butene, and 8 weight percent vinyl acetate. D-4: An ethylene/p-glycidyl styrene/n-butyl acrylate terpolymer containing 60 weight percent ethylene, 10 weight percent p-glycidyl styrene, and 30 weight percent n-butyl acrylate. D-3: An ethylene/propylene/allyl glycidyl ether terpolymer containing 70 weight percent ethylene, 15 weight percent propylene, and 15 weight percent allyl glycidyl ether. D-2: An ethylene/glycidyl methacrylate copolymer containing 10 weight percent glycidyl methacrylate, prepared in accordance with the procedures of U.S. Pat. No. 4,444,950. D-1: An ethylene/glycidyl methacrylate/vinyl acetate terpolymer containing 90 weight percent ethylene, 7 weight percent glycidyl methacrylate, and 3 weight percent vinyl acetate, prepared in accordance with the procedures of U.S.",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 * Bartlett et al, Modern Plastics, Dec. 1981, p. 60. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5212239 * Feb 22, 1991 May 18, 1993 Arco Chemical Technology, L.P. Resin blends containing crystalline propylene polymers and styrenic copolymers US5225483 * Jul 22, 1991 Jul 6, 1993 Exxon Chemical Patents Inc. Thermoplastic composition of polypropylene and styrene copolymer resins US5585441 * May 22, 1995 Dec 17, 1996 Mobil Oil Corporation Elastomer - Modified thermoplastic olefin polymer compositions US5962572 * Dec 29, 1995 Oct 5, 1999 Applied Elastomerics, Inc. Oriented gel and oriented gel articles US6034176",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}