{
    "relation": [
        [
            "Cited Patent",
            "US3368117 *",
            "US3675083 *",
            "US3699396 *",
            "US3710324 *",
            "US3815099 *",
            "US3867000 *",
            "US3993935 *",
            "US4016369 *",
            "US4050098 *",
            "US4253087 *",
            "US4420793 *",
            "EP0015054A1 *",
            "EP0017412A1 *"
        ],
        [
            "Filing date",
            "Jun 13, 1966",
            "Sep 14, 1970",
            "Apr 21, 1971",
            "Apr 1, 1970",
            "Sep 20, 1972",
            "Sep 10, 1973",
            "Dec 16, 1974",
            "Mar 9, 1976",
            "Nov 17, 1975",
            "Mar 8, 1979",
            "Sep 21, 1981",
            "Jan 15, 1980",
            "Mar 24, 1980"
        ],
        [
            "Publication date",
            "Feb 6, 1968",
            "Jul 4, 1972",
            "Oct 17, 1972",
            "Jan 9, 1973",
            "Jun 4, 1974",
            "Feb 18, 1975",
            "Nov 23, 1976",
            "Apr 5, 1977",
            "Sep 20, 1977",
            "Feb 24, 1981",
            "Dec 13, 1983",
            "Sep 3, 1980",
            "Oct 15, 1980"
        ],
        [
            "Applicant",
            "Ncr Co",
            "Digital Equipment Corp",
            "Honeywell Bull Soc Ind",
            "Digital Equipment Corp",
            "Digital Equipment Corp",
            "Gte Automatic Electric Lab Inc",
            "Xerox Corporation",
            "Bell Telephone Laboratories, Incorporated",
            "Gulf & Western Industries, Inc.",
            "Nestar Systems Incorporated",
            "Asea Aktiebolag",
            "Fanuc Ltd.",
            "AMP INCORPORATED (a New Jersey corporation)"
        ],
        [
            "Title",
            "Voltage distribution circuit arrangements for high-density packaging of electronic systems",
            "Universal bus arrangement for data processing systems",
            "Mounting system for printed circuit boards",
            "Data processing system",
            "Data processing system",
            "Latching spring clip device for securing electrical cable connectors to printed wiring cards",
            "Printed circuit board connection",
            "Addressing arrangements for communications networks",
            "Self-addressing modules for programmable controller",
            "Self-assigning address system",
            "Electrical equipment",
            "Bus connection systems",
            "A circuit card interconnection assembly"
        ]
    ],
    "pageTitle": "Patent US4647123 - Bus networks for digital data processing systems and modules usable therewith - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4647123?dq=6377161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482026107,
    "recordOffset": 481996358,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In some instances, the upper continuous conductor bus network S may not be employed in frame or rack A. In that instance, a modified frame A1, as schematically illustrated in FIG. 19, could be used. This frame has a motherboard recess 500 extending along area D. Recess 500 supports a motherboard unit 502 which is snapped in place and held thereby a series of detents 504. Motherboard unit 502 has spaced module receptacles 510-522 for receiving board edge extensions 60 as previously described. By supplying frames with an upper receptacle to accept unit 502, the initial investment by a customer need only involve the novel bus network L. Thereafter, updating of the system can be done by utilizing the selectably inserted, elongated motherboard unit 502 assembled into previously provided recess 500. FIGS. 17, 17A and 17B illustrate another example of how to use the present invention to create control systems. In this instance, a system processor 340 is connected to upper bus network S and communicates directly with external circuitry 342. Separate and distinct local controllers 344, 346 are also connected to network S as shown in FIGS. 13 and 14. These local controllers 344, 346 are isolated from each other. In the illustrated embodiment, controller 344 includes microprocessor 350 together with I/O terminals 352, 354. In this manner, local controller 344 is a mini-computer and can be synchronized or otherwise coordinated by system processor 340.",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4853831 * Feb 10, 1988 Aug 1, 1989 Nec Corporation Bus connection structure for interruption control system US4954949 * Oct 2, 1989 Sep 4, 1990 Commodore-Amiga, Inc. Universal connector device for bus networks in host computer/co-processor computer system US5006961 * Oct 12, 1989 Apr 9, 1991 Catene Systems Corporation Segmented backplane for multiple microprocessing modules US5115235 * Sep 25, 1989 May 19, 1992 Cabletron Systems, Inc. Flexible module interconnect system US5157578 * Mar 20, 1992 Oct 20, 1992 Kabushiki Kaisha Toshiba Hybrid printed circuit board US5162675 * Apr 14, 1989 Nov 10, 1992 Digital Communications Associates, Inc. Dual personal computer architecture peripheral adapter board and circuit",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}