{
    "relation": [
        [
            "Citing Patent",
            "US7093161 *",
            "US7278051",
            "US7526675",
            "US7805630 *",
            "US9058264 *",
            "US20130055015 *"
        ],
        [
            "Filing date",
            "Sep 4, 2002",
            "Mar 8, 2005",
            "Jun 23, 2006",
            "Jul 27, 2006",
            "Aug 9, 2012",
            "Aug 9, 2012"
        ],
        [
            "Publication date",
            "Aug 15, 2006",
            "Oct 2, 2007",
            "Apr 28, 2009",
            "Sep 28, 2010",
            "Jun 16, 2015",
            "Feb 28, 2013"
        ],
        [
            "Applicant",
            "Onspec Electronic, Inc.",
            "Onspec Electronic, Inc.",
            "Mcm Portfolio Llc",
            "Microsoft Corporation",
            "Huawei Device Co., Ltd.",
            "Huawei Device Co., Ltd."
        ],
        [
            "Title",
            "Software recovery method for flash media with defective formatting",
            "Field-operable, stand-alone apparatus for media recovery and regeneration",
            "Software recovery method for flash media with defective formatting",
            "Detection and mitigation of disk failures",
            "Method for repairing communication abnormality between data card and host and data card",
            "Method for repairing communication abnormality between data card and host and data card"
        ]
    ],
    "pageTitle": "Patent US20030070112 - Stored data recovery system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030070112?ie=ISO-8859-1&dq=6,332,126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483367815,
    "recordOffset": 483351872,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0053] The foregoing advantages and features of novelty which characterize the invention are pointed out with additional particularity in the claims annexed hereto and forming a part hereof. [0052] Those of ordinary skill in the art will understand that the invention disclosed herein will have a variety of applications, particularly with regard to establishing a chain of custody in forensic cases. [0051] As previously described, the system will allow for logging or write activity to be performed on a sector of the local storage device or to a file on the flash card data storage media. [0050] Those of ordinary skill in the art will understand that according to the disclosed system data may be recovered by establishing a link between the technical workstation and the flash data storage media through operation of a data recovery application by the technical workstation and controlling the flash data storage by the technical workstation. This allows the data on the storage media of the flash data storage system to be diagnosed and rectified through operation of the technical workstation. Accordingly, the data recovery system will allow for transferring all data which is marked for being changed to an archival facility before making the changes to the flash card data storage medium. [0049] Further, the flash data storage device is operable from the data recovery computer",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7093161 * Sep 4, 2002 Aug 15, 2006 Onspec Electronic, Inc. Software recovery method for flash media with defective formatting US7278051 Mar 8, 2005 Oct 2, 2007 Onspec Electronic, Inc. Field-operable, stand-alone apparatus for media recovery and regeneration US7526675 Jun 23, 2006 Apr 28, 2009 Mcm Portfolio Llc Software recovery method for flash media with defective formatting US7805630 * Jul 27, 2006 Sep 28, 2010 Microsoft Corporation Detection and mitigation of disk failures US9058264 * Aug 9, 2012 Jun 16, 2015 Huawei Device Co., Ltd. Method for repairing communication abnormality between data card and host and data card US20130055015 * Aug 9, 2012 Feb 28, 2013 Huawei Device Co., Ltd. Method for repairing communication abnormality between data card and host and data card *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}