{
    "relation": [
        [
            "Citing Patent",
            "US5754557 *",
            "US5805514 *",
            "US6167544 *",
            "US6173425",
            "US6185141 *",
            "US6246619",
            "US6317852 *",
            "US6349066 *",
            "US6779136 *",
            "US7009898 *",
            "US7054208 *",
            "US7324390",
            "US7360128 *",
            "US7437629 *",
            "US7558137 *",
            "US7782698",
            "US7839701",
            "US8363496 *",
            "US8638626 *",
            "US20010027541 *",
            "US20110026339 *",
            "US20110242919 *",
            "US20120106283 *",
            "US20120201085 *",
            "EP1661137A2 *"
        ],
        [
            "Filing date",
            "Oct 10, 1996",
            "Feb 4, 1997",
            "Aug 19, 1998",
            "Apr 15, 1998",
            "May 18, 2000",
            "Feb 7, 2000",
            "Oct 23, 1998",
            "Oct 27, 2000",
            "Feb 5, 2001",
            "Jun 28, 2004",
            "Mar 8, 2005",
            "Jun 7, 2006",
            "Mar 27, 2003",
            "Jun 26, 2003",
            "Aug 30, 2007",
            "Dec 28, 2007",
            "Jun 27, 2007",
            "Jul 20, 2010",
            "Sep 20, 2011",
            "Feb 5, 2001",
            "Jul 20, 2010",
            "",
            "Sep 20, 2011",
            "Apr 19, 2011",
            "Sep 3, 2004"
        ],
        [
            "Publication date",
            "May 19, 1998",
            "Sep 8, 1998",
            "Dec 26, 2000",
            "Jan 9, 2001",
            "Feb 6, 2001",
            "Jun 12, 2001",
            "Nov 13, 2001",
            "Feb 19, 2002",
            "Aug 17, 2004",
            "Mar 7, 2006",
            "May 30, 2006",
            "Jan 29, 2008",
            "Apr 15, 2008",
            "Oct 14, 2008",
            "Jul 7, 2009",
            "Aug 24, 2010",
            "Nov 23, 2010",
            "Jan 29, 2013",
            "Jan 28, 2014",
            "Oct 4, 2001",
            "Feb 3, 2011",
            "Oct 6, 2011",
            "May 3, 2012",
            "Aug 9, 2012",
            "May 31, 2006"
        ],
        [
            "Applicant",
            "Hewlett-Packard Co.",
            "Oki Electric Industry Co., Ltd.",
            "Stmicroelectronics, Inc.",
            "Integrated Device Technology, Inc.",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Vanguard International Semiconductor Corp.",
            "Vanguard International Semiconductor Corporation",
            "Mitsubishi Denki Kabuhsiki Kaisha",
            "Infineon Technologies Ag",
            "Hynix Semiconductor Inc.",
            "Micron Technology, Inc.",
            "Zmos Technology, Inc.",
            "Nec Electronics Corporation",
            "Infineon Technologies Ag",
            "Fujitsu Microelectronics Limited",
            "Hynix Semiconductor, Inc.",
            "Zmos Technology, Inc.",
            "Elpida Memory, Inc.",
            "Samsung Electronics Co., Ltd.",
            "Detlev Richter",
            "Elpida Memory, Inc.",
            "Hynix Semiconductor Inc.",
            "Samsung Electronics Co., Ltd.",
            "Zmos Technology, Inc.",
            "Zmos Technology, Inc."
        ],
        [
            "Title",
            "Method for refreshing a memory, controlled by a memory controller in a computer system, in a self-refresh mode while scanning the memory controller",
            "Method for testing a semiconductor memory device and a semiconductor memory device",
            "Method and apparatus for testing dynamic random access memory",
            "Methods of testing integrated circuits to include data traversal path identification information and related status information in test data streams",
            "Semiconductor device allowing efficient evaluation of fast operation",
            "Self-refresh test time reduction scheme",
            "Method to test auto-refresh and self refresh circuitry",
            "Semiconductor storage device having a self-refresh circuit for automatically refreshing memory cell",
            "Method for testing the refresh device of an information memory",
            "PSRAM for performing write-verify-read function",
            "Method and device for testing a sense amp",
            "Low voltage operation dram control circuits",
            "Method of testing memory device",
            "Method for checking the refresh function of an information memory",
            "Semiconductor memory and testing method of same",
            "Refresh signal generator of semiconductor memory device",
            "Low voltage operation DRAM control circuits",
            "Semiconductor memory device performing refresh operation and method of testing the same",
            "Row address control circuit semiconductor memory device including the same and method of controlling row address",
            "Method for testing the refresh device of an information memory",
            "Semiconductor memory device performing refresh operation and method of testing the same",
            "Precharge Voltage Supplying Circuit",
            "Row Address Control Circuit Semiconductor Memory Device Including The Same And Method Of Controlling Row Address",
            "Low power memory control circuits and methods",
            "Low voltage operation dram control circuits"
        ]
    ],
    "pageTitle": "Patent US5625597 - DRAM having test circuit capable of performing function test of refresh ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5625597?dq=6,910,205",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483249715,
    "recordOffset": 483231187,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Additional advantages and modifications will readily occur to those skilled in the art. Therefore, the invention in its broader aspects is not limited to the specific details, and representative devices shown and described herein. Accordingly, various modifications may be made without departing from the spirit or scope of the general inventive concept as defined by the appended claims and their equivalents. As described, according to the present invention, there is provided a DRAM capable of performing the function test of the refresh counter and the measurement of the counter cycle at the time of self-refresh, accurately in a short period of time, and testing method thereof. Thus, a DRAM device which does not occupy a large area within the device, can be realized at a low production cost. The test control circuit 14a is provided so as to control the driving signal for the N-channel sense amplifier used for carrying out the function test of the refresh counter and the counter cycle of the self-refresh, and is designed to pull up the output node of the N-channel sense amplifier driving signal of the sense amplifier driving circuit to the power potential at the test mode. More specifically, the test control circuit 14a includes the second PMOS transistor P2 connected between the point of connection of the first and third NMOS transistors in series (the output node of the N-channel sense amplifier driving signal) and a Vcc",
    "textAfterTable": "US7782698 Dec 28, 2007 Aug 24, 2010 Hynix Semiconductor, Inc. Refresh signal generator of semiconductor memory device US7839701 Jun 27, 2007 Nov 23, 2010 Zmos Technology, Inc. Low voltage operation DRAM control circuits US8363496 * Jul 20, 2010 Jan 29, 2013 Elpida Memory, Inc. Semiconductor memory device performing refresh operation and method of testing the same US8638626 * Sep 20, 2011 Jan 28, 2014 Samsung Electronics Co., Ltd. Row address control circuit semiconductor memory device including the same and method of controlling row address US20010027541 * Feb 5, 2001 Oct 4, 2001 Detlev Richter Method for testing the refresh device of an information memory US20110026339 * Jul 20, 2010 Feb 3, 2011 Elpida Memory, Inc. Semiconductor memory device performing refresh operation and method of testing the same US20110242919 * Oct 6, 2011 Hynix Semiconductor Inc. Precharge Voltage Supplying Circuit",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}