{
    "relation": [
        [
            "",
            "2004",
            "2005",
            "2006"
        ],
        [
            "Jan. GB",
            "1.5",
            "1.6",
            "1.4"
        ],
        [
            "June GB",
            "1.6",
            "2.1",
            "1.9"
        ],
        [
            "Revision",
            ".1",
            ".5",
            ".5"
        ]
    ],
    "pageTitle": "FRB: FOMC meeting -- June 29-30, 2005 presentation materials",
    "title": "(Percent change, Q4 to Q4)",
    "url": "http://www.federalreserve.gov/monetarypolicy/files/FOMC20050630material.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452489563,
    "recordOffset": 452438663,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4751=The curves overlap in every year from 1975 to 1983, in 1989, and all years between 1993 and 2005., 7286=For Las Vegas, the series begins at about 10 in 1979, rises to about 12 in the middle of that year, and then falls to about negative 3 in late 1979. The series rises to about negative 2 in early 1980 and fluctuates between that point and negative 1 until late 1980. The series then falls to negative 5 toward year-end 1980, rises to about 11 in early 1981, falls to about 1 in late 1980. The series then rises to about 18 in mid-1982, falls to about negative 3 in mid-1982, and then rises to about 16 toward year-end 1982. The series then generally falls to about negative 20 in late 1983, generally rises to about 5 in mid-1986, and then generally falls to about negative 5 in early 1987. The series remains at this level until early 1988 and then rises to about 5 in mid-1990. The series then generally falls to about negative 3 in early 1995, rises to about 5 in early 1996, falls to about negative 1 in mid-1997, rises to about 5 in mid-1998, and then falls to about negative 1 in late 1999. The series then generally rises to about 7 in late 2001, remains at about that level until late 2003, rises to about 40 in late 2004, and then falls to end at a little more than 30 in 2005:Q1., 8271=Title: Real Price Changes: Western Cities Series: San Francisco and Las Vegas Horizon: 1975 to 2005:Q1 Description: Data are plotted as two curves. Units are four-quarter percent change., 9388=Title: Changes in Real House Prices: The United States Series: Changes in real house prices Horizon: 1976 to 2005 Description: Data are plotted as one curve. Units are four-quarter percent change. Shaded bars appear on the figure for 1980, mid-1981 through 1982, mid-1990 to early 1991, and 2001., 1777=The curves overlap in 1974, 1976, 1981, 1987, and 2001., 6086=The curves overlap in 1979, 1981, 1982, 1983, 1990, 1997, and 2003., 9821=Material for Special Staff Presentations on Housing Valuations and Monetary Policy June 29, 2005, 5688=For New York, the series begins at about negative 3 in 1975, generally rises to about 2 in early 1977, and falls to about negative 5 in late 1977. The series then generally rises to about 9 in early 1979. The series falls to a little less than zero in early 1981, rises to about 2 later that year, and then falls to about negative 4 in mid-1982. The series rises to about 22 in late 1986, generally falls to about negative 15 in late 1990, and generally rises to about 12 in late 2002. The series then falls to about 5 in late 2003, generally rises to about 15 in late 2004, and then falls to end at about 12 in 2005:Q1., 2900=For real carrying cost, the series begins at about 6.25 in 1970, generally falls to about 3.5 in late 1979, and generally rises to about 8.5 in early 1982. The series falls to about 5.9 in mid-1983, generally rises to about 7.9 in mid-1984, and generally falls to about 4.25 in early 1987. The series generally rises to about 6.25 in mid-1990, generally falls to about 4.8 in late 1993, and generally rises to about 6.5 in late 1994. The series generally falls to about 5.75 in early 1996, generally rises to about 7 in early 2000, generally falls to about 4.5 in early 2003, and fluctuates between that point and 5.25 until year-end 2004, when the series ends at about 4.5., 8993=The series begins 1976 at about negative 2, rises generally to about 8 in early 1978, falls to about 7 in late 1978, and then rises to about 8 in early 1979. The series generally falls to about negative 4 in early 1980, fluctuates between that point and negative 1 until late 1982, and then generally rises to about 6 in late 1986. The series generally falls to about negative 5 in late 1990. The series generally rises to end at about 9 in year-end 2004., 5964=Title: Real Price Changes: Eastern Cities Series: New York and Miami Horizon: 1975 to 2005:Q1 Description: Data are plotted as two curves. Units are four-quarter percent change., 3279=Title: Price-Rent Ratio and Real Carrying Costs Series: Real carrying cost (interest payments, net taxes, depreciation) and price-rent ratio Horizon: 1970 to 2005 Description: Data are plotted as two curves. Units are percent for real carrying cost and ratio for price-rent ratio., 5056=For Miami, the series begins at about negative 9 in 1975, rises to about negative 1 in 1976, then fluctuates between negative 5 and 9 between 1977 and 1982. The series generally remains a bit under or over zero from 1983 to 1998 when it generally begins to rise, ending at about 20 in 2005:Q1., 2214=For price-rent ratio, the series begins in 1970 at about 20, falls to about 18 toward year-end 1971, and then generally rises to a little more than 24 in mid-1979. The series generally falls to about 20.5 in late 1985, generally rises to about 22 in late 1989, and then generally falls to about 20.5 in mid-1991. The series remains at about that level until late 1997 and then generally rises to end at about 27 in late 2004., 7986=For San Francisco, the series begins in 1975 at about 10, rises generally to about 20 in mid-1977, falls to about 5 in 1978, and rises to about 12 in late 1979. The series then generally falls to about negative 8 in late 1982, generally rises to about 19 in late 1989, and falls to about negative 8 in early 1991. The series rises to about negative 3 later that year and fluctuates between that point and negative 4 until early 1994. The series falls to negative 5 in late 1994 and then generally rises to about 20 in late 2000. The series falls to about 5 in early 2002, rises to about 8 in mid-2002, falls to about 4 in late 2003, and then generally rises to end at about 15 in 2005:Q1.}",
    "TableContextTimeStampAfterTable": "{131588=Note. Figures for Jan. 2005 do not sum to 100 because of rounding., 139843=The curve starts at about 104 at the beginning of 2001 and increases to about 109 in early 2002. It then generally falls to about 90 in early 2005 and rises to about 95 in mid-2005. In the projected area, the curve begins at about 95 and falls through 2006 to end at about 94. A forecast from the April 2005 Greenbook starts at about 93 at the beginning of 2005, then decreases to end at about 90 in 2006., 151960=Title: Jobs Plentiful Versus Hard to Get Series: Jobs plentiful versus hard to get Horizon: 1990 to 2005:Q2 Description: Data are plotted as a curve. Units are diffusion index values. A horizontal line is drawn just above 110 that shows the average for 1997:H1., 132684=Title: Core PCE Prices Series: Core PCE prices Horizon: 1997 to May 2005 Description: Data are plotted as a curve and are presented monthly. Unit is 12-month percent change., 113349=Title: Boston Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 208514=EMBI+ Spreads on a weekly basis for 2003 through mid-2005 for Brazil, Mexico, and Overall excluding Argentina. The range of the y-axis is [1, 15]; units are percentage points. The spreads for Brazil start at about 14 percentage points, and, with considerable volatility, fall to about 3¾ percentage points by early 2005, and rise to about 4¼ percentage points by the end of the period. The spreads for Mexico start at just over 3 percentage points, decline to about 1½ basis points by early 2005, and rise to about 1¾ percentage points by the end of the period. The overall spreads excluding Argentina start at about 6½ percentage points and fall, with some volatility, to about 2½ percentage points by early 2005, and then rise to about 3 percentage points by the end of the period., 150654=A forecast period starts in 2005 at about 66.0 and stays at about that level through 2006., 197748=Title: Profit Share (domestic nonfinancial corporations' ratio of economic profits before tax to sector GDP) Series: Profit share Horizon: 1974 to 2006 (data are projected for 2005 and 2006) Description: Data are plotted as one curve. Data are quarterly. Units are percent., 215562=Monetary Policy Indicators for the euro-area refinance rate and the U.S. target federal funds rate for 2003 through mid-2005. The range of the y-axis is [0, 4]; unit is percent. The euro-area refinance rate starts at 2¾ percent, falls to 2 percent by mid-2003, and remains there through the end of the period. The U.S. target federal funds rate starts at 1¼ percent, falls to 1 percent by mid-2003, stays there through mid-2004, and then rises to 3 percent by the end of the period., 161182=The series for core PCE prices begins in mid-2005 at about 1.8 and generally stays at that level until near the end of 2006. The series is in the 70 percent confidence interval from mid-2005 to late 2006., 213655=Long-Term Nominal and Inflation-Indexed Yields for the Canadian dollar for 2003 through mid-2005. The range of the y-axis is [0, 6]; unit is percent. The nominal yields for the Canadian dollar start at about 5-1/3 percent, and, with considerable volatility, ease to about 5 percent by October 2003, and then decline to just above 4 percent by the end of the period. The inflation-indexed yields for the Canadian dollar start at about 3¼ percent, and, with some volatility, ease to about 3 percent by October 2003, and then fall to about 1¾ percent by the end of the period., 182563=The curves overlap in late 1999., 109565=Title: San Francisco Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 134851=Title: Interest Rates Series: 10-year Treasury rate and federal funds rate Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: The data are plotted as two curves and are presented as a quarterly average. Units are percent., 254450=A line chart displays inflation compensation over the next five years and five to ten years ahead based on Treasury Inflation Protected Securities (TIPS). Both series have moved down significantly since the beginning of 2005., 231841=WTI on a monthly basis for the spot price and for far-dated futures for 2002 through mid-2005 (actual) and for mid-2005 through 2006 (forecast for the spot price only). The range of the y-axis is [15, 65]; unit is dollars per barrel. The WTI spot price starts at about $20 per barrel, rises to about $58 per barrel by mid-2005, rises further to about $62 per barrel by end-2005, and then eases to about $58 per barrel by the end of the forecast period. The WTI far-dated futures start at about $20 per barrel and rise to about $54 per barrel by mid-2005; there is no forecast for the WTI far-dated futures., 119429=The repeat-transactions price index (adjusted) curve and the construction costs curve overlap in 1980 and 1986., 219123=Real Effective Exchange Rates on a monthly basis for the euro and the yen for 2004 through mid-2005 (actual) and for mid-2005 through 2006 (forecast). The range of the y-axis is [90, 105]; index, Jan. 2004 = 100. Both series begin at 100. The index for the euro, with some volatility, falls to about 97 by early 2004, rises to about 103 by late 2004, falls to about 96 by mid-2005, and stays at about that level through the forecast period. The index for the yen, with some volatility, falls to about 94 by mid-2005, and then eases to about 92½ by the end of the forecast period., 111657=Title: Chicago Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 15314=The set of bars at 90+: March 2003 is about 4, March 2004 is about 7, and February 2005 is about 7., 188008=The curves overlap in 1998 and 2001., 214254=Long-Term Nominal and Inflation-Indexed Yields for sterling for 2003 through mid-2005. The range of the y-axis is [0, 6]; unit is percent. The nominal yields for sterling start at about 4½ percent, and, with considerable volatility, rise to about 4¾ percent by October 2003, rise to about 5¼ percent by mid-2004, and then decline to about 4¼ percent by the end of the period. The inflation-indexed yields for sterling start at just above 2 percent, and, with considerable volatility, ease to about 2 percent by October 2003, and then decline to about 1¾ percent by the end of the period., 181721=The real Treasury perpetuity yield series begins in 1986 at about 5.5, falls to about 3.8 a little later that year, and then generally rises to reach about 5 in mid-1988. The series falls to about 3.5 toward year-end 1989, rises to about 4.25 in early 1990, and remains generally at that level until about year-end 1992. The series falls to about 3.75 toward year-end 1993, rises to about 4.5 toward year-end 1994, and falls to about 3.75 in late 1995. The series then rises to about 4.5 in mid-1996, remains generally at that level until mid-1997, and generally falls to about 3.5 in late 1998. From that period, the series generally rises to about 4.5 in late 1999, generally falls to about 3.5 in early 2001, and remains at about that level until about mid-2004. The series then falls to end at a little more than 2 in 2005:Q2., 189846=Title: Financial Ratios (nonfinancial corporations) Series: Cash to assets, and interest expense to cash flow Horizon: 1990 to 2005:Q1 Description: Data are plotted as two curves. Units are percent (right scale for cash to assets and left scale for interest expense to cash flow)., 203187=The share of debt curve begins at about 4.2 in 1989 and drops to about 4 in 1992. It increases through mid-1998 to a bit above 5, decreases to about 4.4 in mid-2001, then increases to end at about 4.8 in late 2004., 121931=Title: Select Hedge Fund Index Returns Series: Aggregate Hedge Fund Index and Convertible Arbitrage Index Horizon: December 31, 2004 - June 24, 2005 Description: Select hedge fund indexes had negative returns., 102358=The June Greenbook (optimal policy) series begins in 2005 at about 5.1 and ends at just over 5.25 in late 2008., 118112=The repeat-transactions price index (adjusted) curve and the rent index curve overlap in 1980, 1986, 1990, 1993, 1994, 1996, and 1997., 117514=The constant-quality price index for new homes series begins in 1980 at about 2.1, falls to about negative 5 in 1982, rises to about 3.9 in 1986, drops to about negative 5 in 1991, rises to about 4 in 1994, and ends at about 2 at the end of 2004., 115600=Title: Miami Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 107835=The optimal policy curve begins at about 1 in mid-2004, rises to about 2.8 in 2005, and drops to about 0.8 in 2006. The series ends in 2008 at about 2.8., 115134=Title: New York Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 146391=The series begins at about 2 in the first quarter of 2000, then dips to about 1.75 by year-end. The curve increases through 2001:Q4 to about 2.25, then generally moves downward to about 1 by 2003:Q3. The series then increases through year-end 2004 to reach about 1.5., 123391=Title: Euro-Dollar Risk Reversals Series: 1-year 25 delta risk reversal Horizon: February 1, 2000 - June 28, 2005 Description: There is a premium for Euro put options., 105680=The Taylor Rule series begins at about 5.6 in 2004, falls to about 5.1 in late 2005, rises to about 6.1 in 2007, and ends slightly under 5.25 in late 2008., 171161=The forecast for 2004 curve starts just above 5 in December 2003. It generally decreases through October 2004 to about 3.7, then increases to end just below 4 in June 2005., 190763=The curves overlap in 1994., 198884=In the projected area, the series begins at about 11 in 2005, rises to about 11.25 toward the end of that year, and then falls to end at about 10.75 in 2006., 164691=A forecast from the December 2004 Greenbook begins at about 103 at the end of 2004 and increases to end at about 105 in 2006:Q4., 113888=The two curves overlap in 1981, 1983, 1988, 1992, 1993, 1994, 1995, and 1997., 230702=Primary Commodity Prices on a monthly basis for metals and non-fuel commodities for 2002 through mid-2005 (actual) and for mid-2005 through 2006 (forecast). The range of the y-axis is [80, 200]; index, Jan. 2002 = 100. The primary commodity prices are IMF indexes. The non-fuel primary commodities index is weighted by U.S. import shares. Both indexes begin at 100. The index for metals rises gradually to about 105 by early 2003, rises sharply to about 190 by mid-2005, and then eases to about 175 by the end of the forecast period. The index for non-fuel primary commodities rises to about 155 by mid-2005, and then eases to just under 150 by the end of the forecast period., 199364=Title: Delinquency Rates Series: Securitized credit card loans, auto loans at finance companies, and home mortgages at banks Horizon: 1996 to 2005 (April for securitized credit card loans and auto loans at finance companies, and Q1 for home mortgages at banks). Description: Data are plotted as three curves. Units are percent., 254861=A line chart displays the evolution of the intended federal funds rate since 1988. The chart indicates that the current period of sustained tightening is roughly comparable to the length of previous tightening episodes., 16337=The set of bars at 780-900: March 2003 is about 13, March 2004 is about 12, and February 2005 is about 11., 182649=Title: Decomposition of High-Yield Spread Series: High-yield spread and compensation for expected loss Horizon: 1990 to 2005 (June 2005 for high-yield spread and 2005:Q2 for compensation for expected loss) Description: Data are plotted as two curves. Units are percentage points., 19042=Source. Freddie Mac 2004 Annual Report, 100146=The June Greenbook (optimal policy) curve overlaps the optimal policy curve and the Taylor Rule curve between 2005 and 2006 and overlaps the Taylor Rule curve again in mid-2007., 125740=Title: Real Personal Consumption Expenditures Series: Real personal consumption expenditures Horizon: 2003 to May 2005 Description: Data are plotted as a curve. Units are trillions of 2000 dollars at an annual rate., 94646=The NASDAQ series begins at about 100 in the beginning of 1995 and generally rises to about 275 in mid-1998. It rises sharply to just under 700 in early 2000, then generally drops to just under 200 in early 2001. The curve stays mostly steady ending in mid-2005 at just under 300., 19463=The income/capital curve begins at about negative 0.18 at the beginning of 1988, then generally rises to about 0.16 in late 1999, and falls a bit to end in early 2003 at about 0.09., 151045=Title: Total Hours Worked Series: Total hours worked and trend Horizon: 1996 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted on two curves. Units are billions of hours at an annual rate., 172861=The forecast for 2005 curve and the forecast for 2004 curve overlap in January 2004., 255435=A line chart displays investment- and speculative-grade corporate risk spreads since early 2002. Both series spiked in 2002 but declined substantially through early 2005. Since May, both risks spreads have widened noticeably., 140366=Title: Real GDP Series: Real GDP Horizon: 2000 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted as a curve. Units are four-quarter percent change., 141468=In the projected period, the series begins at a little less than 4 in 2005:Q1, then decreases to about 3.75 by the end of 2006., 138189=The curve begins at about 255 at the start of 2001, then increases to about 358 in mid-2005. In the projected area, the curve begins at about 359 and generally rises through 2006 to end at about 375. A forecast for the curve from the April 2005 Greenbook starts in early 2005 at about 358 and increases through 2006 to a bit below 375., 110074=The real rent series begins at about negative 5 in 1975, then rises to about 5 in 1984, and ends at about negative 2 in 2005., 99148=The June Greenbook (optimal policy) curve and the optimal policy curve overlap from 2006 to late 2008. The optimal policy curve and the Taylor Rule curve overlap from 2004 until mid-2005., 119956=Title: Current U.S. 3-Month Deposit Rates and Rates Implied by Traded Forward Rate Agreements Series: LIBOR fixed, 3-month forward, 9-month forward Horizon: March 1, 2005 - June 28, 2005 Description: US forward contracts rates rose., 119000=The constant-quality price index for new homes series begins at about 100 in 1979, drops to about 88 in 1992, and ends at about 115 in 2004., 211862=Ten-Year Government Bond Yields for Canada for 2003 through mid-2005. The range of the y-axis is [3, 6]; unit is percent. The yields for Canada start at about 5 percent, and, with considerable volatility, decline to just below 5 percent by October 2003, and then fall to about 3¾ percent by the end of the period., 8232=Data points are heavily grouped together between 2 and 6 annualized price change and between about 80 and 86 average LTV at origination, 2004. Most other data points fall between 6 and 10 annualized price change and 75 and 80 average LTV at origination, 2004., 116133=The two curves overlap in 1980, 1981, 1982, 1983, 1984, 1986, 1989, 1990, 1992, 1995, and 1996., 216070=Monetary Policy Indicators for the Canadian Bank rate for 2003 through mid-2005. The range of the y-axis is [0, 5]; unit is percent. The Canadian Bank rate starts at 3 percent, rises to 3½ percent by mid-2003, falls back to 3 percent by late 2003, falls further to 2¼ percent by mid-2004, rises to 2¾ percent by late 2004, and remains there through the end of the period., 162569=The forecast for 2006 curve begins in September 2004 at about 1.3, then increases to end at about 1.8 in June 2005., 127675=Title: Sales of Single-Family Homes Series: Existing homes and New homes Horizon: 2001 to May 2005 Description: Data are plotted as two curves and are monthly. Units are millions at an annual rate., 160663=The figure has two shaded areas that represent a projection period with a 70 percent confidence interval and a 90 percent confidence interval. The band for the 90 percent confidence interval begins in 2005 at about 1.75, gradually expanding to about 3.25 at the upper end and about 0.5 at the lower end in year-end 2006., 153019=The curve begins at about 21 in 1990, followed by a decrease to about 11 by year-end 1991. It then generally moves upward to reach about 35 in 2000. The curve continues downward through 2003 to about 16, then increases through 2005:Q2 to end at about 24., 102481=The optimal policy and the Taylor Rule curves overlap until mid-2005 and again in late 2008. The optimal policy curve and the June Greenbook curve overlap in late 2007., 110614=The price-rent ratio series begins at just under negative 10 in 1975, rises to about 10 in 1980, drops to about negative 5 in 1986, rises to about 15 in 1990, then drops to about negative 5 in 1998, and ends at about 33 in 2005., 129024=Title: Orders and Shipments of Nondefense Capital Goods (excluding aircraft) Series: Orders and shipments Horizon: 2001 to May 2005 Description: Data are plotted as two curves and are monthly. Units are billions of dollars., 229200=Exports by Category as a twelve-month moving sum for road vehicles and for iron and steel for 1995 through mid-2005. The range of the y-axis is [0, 25]; units are billions of dollars. Both series start at about $2 billion. Exports of road vehicles rise gradually to about $7 billion by mid-2002 and then rise fairly sharply, reaching about $19 billion by the end of the period. Exports of iron and steel fluctuate between about $2 billion to $5 billion until mid-2004, when they rise sharply, reaching about $20 billion by the end of the period., 163648=A forecast from the December 2004 Greenbook starts at about 42 in 2005:Q1 and stays at about that level through 2006., 111148=The real price series begins at about 10 in 1975, then drops to about negative 12 in 1981, rises to about 1 in 1982, drops to about negative 11 in 1983, rises to about 2 in 1984, and ends at about 8 in 2005., 9818=Title: Mortgage Delinquency Rates Series: All loans, and loans at commercial banks Horizon: 1991 to 2005 Description: Data are plotted as curves and are quarterly. Units are percent., 149173=Title: Unemployment Rate Series: Unemployment rate and NAIRU Horizon: 1996 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted on two curves. Units are percent., 185531=Title: Commercial Real Estate Valuation Series: NOI/price ratio and real Treasury perpetuity yield Horizon: 1990 to 2005:Q1 Description: Data are plotted as two curves. Data are quarterly. Units are index, 1990:Q1=5 for NOI/price ratio and percent for real Treasury perpetuity yield., 155803=Title: Hourly Compensation and Core PCE Prices Series: P&C comp per hour, ECI, and Core PCE prices Horizon: 1999 to 2005:Q1 for P&C comp per hour and Core PCE prices; 1999 to March 2005 for ECI Description: Data are plotted as three curves. Units are percent change from a year earlier., 171654=The forecast for 2004 curve and the forecast for 2005 curve overlap in September 2004, October 2004, January 2005, and March 2005., 103015=The optimal policy curve and the Taylor Rule curve overlap and start at about 1.3 in early 2004, then trend up to about 2.1 in mid-2005. The Taylor Rule curve ends in 2008 at about 1.70, and the optimal policy curve ends in 2008 at about 1.75., 186945=The curves overlap in 1990., 6919=Title: Sensitivity of Household Sector to Price Declines Series: September 2003 and March 2005 Horizon: September 2003 and March 2005 Description: Data are plotted as two curves. Horizontal axis units are price decline (percent). Vertical axis units are percent of borrowers with negative equity., 211286=Ten-Year Government Bond Yields for the United States and Germany for 2003 through mid-2005. The range of the y-axis is [3, 6]; unit is percent. The yields for the United States start at just over 4 percent, and, with considerable volatility, rise to about 4½ percent by October 2003, and then ease to just above 4 percent by the end of the period. The yields for Germany start at about 4-1/3 percent, and, with considerable volatility, rise to about 4½ percent by October 2003, and then fall to just below 3¼ percent by the end of the period., 190225=The cash to assets series begins at about 5 in 1990, rises generally to about 7.5 in 1999, falls to about 7 in 2000, and then rises to end at about 10.5 in 2004. The series is projected to end at about the same level in 2005:Q1., 199790=The securitized credit card loans series begins at about 4.25 in 1996, rises generally to about 5.5 in 1997, and then falls generally to about 4.5 in 2000. The series rises generally to about 5.25 in 2001, remains at about that level until mid-2003, and then falls generally to end at a little more than 4 in April 2005., 156710=The Core PCE prices curve starts at about 1 in 1999:Q1 and stays at about that level through 2000; it begins to increase to reach about 2.1 by year-end 2001, then generally decreases through 2005:Q1 to end just below 2., 139493=Title: Broad Real Dollar Series: Broad real dollar Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: Data are plotted as a curve and are presented as a quarterly average. Units are index, 2000=100., 189758=The curves overlap in 2001 and 2003., 204661=In the projected area, the series begins at about 5.5, rises slightly, and then falls to end at a little less than 5.5 in 2006., 132341=The weekly curve starts at about 360 in 2003 and then fluctuates upward to about 450 by midyear. It then generally decreases, remaining at about 350 through 2004. The curve dips to about 299 at the start of 2005, after which it generally increases to end a bit above 300 on June 25, 2005., 7549=The March 2005 curve begins at about 0 percent price decline and about 1 percent of borrowers with negative equity and trends up to end at 30 percent price decline and about 35 percent of borrowers with negative equity., 112761=Title:Cleveland Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 172999=Title: Greenbook Forecasts of Fiscal Impetus Series: Greenbook forecasts of fiscal impetus Horizon: December 2003 to June 2005 Description: Data are plotted as two bars in three groups: as of December 2003, as of December 2004, and as of June 2005. In each group, one bar represents 2004, and the other bar represents 2005. Units are percent of real GDP. A horizontal line is drawn at zero., 162809=The forecast for 2004 curve and the forecast for 2006 curve overlap in March 2005., 104511=The Taylor Rule curve and the optimal policy curve overlap from 2004 to 2005 and again in early 2007. The June Greenbook (optimal policy) curve and the Taylor Rule curve overlap in 2005., 150756=The trend curve starts in 1996 at about 66.6, where it remains through 2002. It then decreases to about 66.3 by year-end 2004., 216785=Monetary Policy Indicators for balances at the Bank of Japan for 2003 through mid-2005. The range of the y-axis is [15, 40]; units are trillions of yen. The balances at the Bank of Japan start at about 20 trillion yen, rise quickly at about 30 trillion yen, fall almost immediately to about 26 trillion yen, rise to about 30 trillion yen by October 2003, stay at about that level through early 2004, rise to about 33 trillion yen in early 2004, and then fluctuate between about 30-34 trillion yen, ending at about 33 trillion yen by the end of the period., 162269=The forecast for 2004 curve begins in December 2003 at about 1.1. It increases to about 1.8 in August 2004, then decreases to end at about 1.6 in June 2005., 184342=The curves overlap from mid-1997 to mid-1998., 128523=At the start of 2001, the new homes curve begins at about 0.9, then decreases to just above 0.8 toward the end of the year. The curve generally continues upward to reach nearly 1.1 by year-end 2002, followed by a decrease to about 0.9 at the start of 2003. It then generally increases, climbing to a bit above 1.2 at the start of 2004, and decreasing to approximately 1.1 by midyear. The curve generally rises through May 2005 to end at about 1.3., 19656=The risk/capital curve begins in early 1988 at about 18, rises a bit to about 24 in 1991, then generally falls to about 9 at the beginning of 2003., 125387=Material for Staff Presentation on the Economic Outlook June 30, 2005, 151817=A forecast period starts in 2005 at about 243 and climbs to nearly 245 by year-end 2006., 138578=Title: Crude Oil Prices Series: West Texas Intermediate Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: Data are plotted as a curve and are presented as a quarterly average. Units are dollars per barrel., 229821=Consumer prices for overall consumer prices and for consumer prices excluding food for 2003 through mid-2005. The range of the y-axis is [-1, 6]; unit is twelve-month percent change. Overall consumer prices start at about ½ percent, rise fairly sharply to about 5¼ percent by mid-2004, and then fall to about 1¾ percent by the end of the period. Consumer prices excluding food start at about -¾ percent and rise to about 1 percent by the end of the period., 187027=Title: Office Vacancy Rate and Rent per Square Foot Series: Vacancy rate and rent per square foot Horizon: 1998 to 2005:Q2 Description: Data are plotted as two curves. Data are quarterly. Units are percent for vacancy rate and dollars for rent per square foot., 110357=Title: San Francisco Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 15201=The set of bars at 80-89: March 2003 is about 5, March 2004 is about 8, and February 2005 is about 8., 95074=The curves overlap in all years except between late 1998 and early 2001., 98728=The optimal policy series begins at about 5.6 in 2004, falls to about 5.1 in late 2005, and ends at about 5.25 in late 2008., 121512=Title: Dow Jones CDX 5-Year Investment Grade Credit Default Swaps Index Series: Dow Jones CDX 5-Year Investment Grade Credit Default Swaps Index Horizon: April 1, 2005 - June 28 2005 Description: The Dow Jones CDX 5-year investment grade credit default swap index increased slightly., 118258=The constant-quality price index for new homes curve and the rent index curve overlap in 1980, 1981, 1986, 1988, 1989, 1992, 1995, 1996, 1997, 1998, 2000, 2001, and 2002., 100661=Both the optimal policy curve and the Taylor Rule curve start at about 1 in mid-2004. Both overlap and rise together to about 3.5 in late 2005. The Taylor Rule curve rises to about 4 in early 2006 and ends in late 2008 at about 3. The optimal policy curve ends at about 3.2 toward the end of 2008., 140968=The figure also has two shaded areas that represent a projection period with a 70 percent confidence interval and a 90 percent confidence interval. The band for the 70 percent confidence interval starts in 2005:Q1 at about 3.75, gradually expanding to about 5.25 on the upper end and 1.75 on the lower end by year-end 2006. The 90 percent confidence interval begins in 2005:Q1 at about 3.75, gradually expanding to a bit above 6 on the upper end and 0.5 on the lower end by year-end 2006., 172487=The forecast for 2005 curve starts at about 0.0 in December 2003 and falls to about negative 0.5 in October 2004. It increases to about negative 0.4 in December 2004, then decreases to end at about negative 0.9 in June 2005., 106999=The optimal policy curve and the Taylor Rule curve overlap between 2004 and 2005. The June Greenbook (optimal policy) curve and the optimal policy curve overlap between 2005 and 2006. The June Greenbook curve overlaps the Taylor Rule curve in 2005 and 2006 and overlaps the optimal policy curve in early 2008., 152320=The curve begins in 1990 at a little less than 110 and then decreases, falling to about 51 by 1992. The curve increases through 2000 until it reaches about 145; it drops to about 71 by 2003 and then rises to end at about 100 in 2005:Q2., 218492=BBB Corporate Bond Spreads on a weekly basis for the euro and the yen for 2002 through mid-2005. The range of the y-axis is [0, 250]; units are basis points. The spreads for the euro start at about 175 basis points, and, with some volatility, rise to about 240 basis points by late 2002, fall to about 100 basis points by mid-2003, and then decline more gradually to about 60 basis points by the end of the period. The spreads for the yen start at about 60 basis points and decline gradually to about 25 basis points by the end of the period., 114996=The two curves overlap in 1976, 1977, 1982, 1983, 1988, 1992, 1993, 1995, and 1998., 131766=Title: Initial Claims Series: Four-week moving average and weekly Horizon: 2003 to June 25, 2005 Description: Data are plotted as two curves. Units are thousands., 96055=The 30-year Treasury bond yield curve begins at about 7.3 in early 1993, drops down to about 5.7 near the end of 1993, then generally trends upward to about 8.2 in late 1994. The curve then falls to about 6.0 at the end of 1995, rises again to about 7.3 in mid-1996, and ends 1996 at about 6.4., 153409=Title: Persons Working Part-Time for Economic Reasons Series: Persons working part-time for economic reasons Horizon: 1994 to 2005:Q2 Description: Data are plotted as a curve. Unit is percent of household employment. A horizontal line is drawn slightly above 3.0 that shows the average for 1997:H1. Note that 2005:Q2 is the April-May average., 136681=For 2001, about 0.5. For 2002, about 1.0. For 2003, just below 1.0. For 2004, about 0.8. For 2005, the bar shows a forecast at about 0.3. For 2006, the bar shows a forecast just above 0.3., 102197=The Taylor Rule series begins at about 5.6 in 2004, falls to about 5.1 in late 2005, rises to about 5.85 in 2007, and ends at about 5.1 in late 2008., 19192=Title: Private Mortgage Insurers Series: Income/capital and risk/capital Horizon: 1988 to 2003 Description: Data are plotted as two curves and are annual. Units are ratios., 53152=Note: Shading represents NBER recessions (as shown in the chart, approximately 1980, mid-1981 through 1982, mid-1990 to early 1991, and 2001)., 112336=The real price series begins at about 9 in 1975, drops to about negative 16 in 1982, rises to about 8 in 1983, and ends at about 1 in 2005., 183717=For compensation for expected loss, the series begins at about 4 in early 1990, falls to about 3.75 in mid-1990, and then rises to about 4 in early 1991. The series gradually rises overall to about 4 toward year-end 1995, falls to about 3.5 in early 1997, and then generally rises, reaching a little less than 4 in late 1998. The series falls a bit in early 1999 and generally rises to a little more than 4 in late 2000. The series then falls to about 3 in 2002, remains at about that level until mid-2003, and falls to a little less than 3 in late 2003. The series generally rises to end at about 3.5 in 2005:Q2., 136183=The curves overlap in 2001., 190891=Title: Payouts to Shareholders (nonfinancial corporations) Series: Cash mergers, share repurchases, and dividends Horizon: 2001 to 2005:Q1 Description: Data are plotted as stacked bars. As shown in the chart, approximate values are as follows., 164831=A forecast from the December 2003 Greenbook starts in 2003:Q4 at about 99, then increases through 2005:Q4 to end at nearly 103., 224981=Merchandise Trade in terms of exports and imports on a monthly basis for 2003 through mid-2005. The range of the y-axis is [20, 70]; units are billions of dollars. Exports start at about $33 billion and rise fairly steadily to about $62 billion by the end of the period. Imports start at about $34 billion and rise to about $52 billion by the end of the period., 16217=The set of bars at 720-779: March 2003 is about 44, March 2004 is about 44, and February 2005 is about 43.5., 173548=As of December 2003, 2004 is at about 0.7, and 2005 is at about negative 0.4. As of December 2004, 2004 is at about 0.6, and 2005 is at about negative 0.1. As of June 2005, 2004 is at about 0.5, and 2005 is at about 0.3., 247093=A bar chart displays the current probability of a pause in tightening computed from market data and the same probabilities computed as of the time of the May meeting. The chart indicates that investors put high odds on pause in tightening by the end of 2005., 120324=Title: Spread Between 2- and 10-Year Treasury Yields Series: 2-Year Treasury Yield and 10-Year Treasury Yield spread and Average since 1980 Horizon: January 1980 - June 2005 Description: The spread narrowed below the average., 116532=The price-rent ratio series begins at about negative 4 in 1978 and stays mostly steady until about 2000, when it begins to climb sharply, ending at about 63 in 2005., 114267=The price-rent ratio series begins at about negative 8 in 1975, rises to about 25 in 1987, drops to about negative 8 in 1995, and ends at about 20 in 2005., 184948=The net operating income series starts at about 120, generally rises until reaching about 180 in 1985, remaining at about that level until early 1986, and then falls to about 160 toward the end of that year. The series generally remains at that level until mid-1990, rises to about 170 toward year-end, and then generally rises again until reaching about 270 in early 2001. The series then generally falls to end at about 200 in 2005:Q1., 104069=The Taylor Rule curve starts at about 1 in mid-2004, rises to about 3.7 in early 2006, falls to about 2.1 in 2007, and ends at just under 3 in 2008., 185913=The NOI/price ratio series begins at 5 in 1990, generally rises to about 6.5 toward year-end 1993, then rises slightly to about 7 in early 1995, and remains generally at that level until early 1998. The series gradually falls to about 6.25 in early 1999, remains at about that level until early 2000, and rises gradually to about 6.75 in mid-2001. The series then falls to end at about 4.25 in 2005:Q1., 99730=The optimal policy series and the Taylor Rule curve overlap and start at about 1.3 in early 2004 and trend up to about 2.1 in mid-2005. In early 2006, the curves stop overlapping. The Taylor Rule series ends in 2008 at about 1.80, and the optimal policy series ends 2008 at about 1.85., 129692=Shipments are at approximately 62 at the start of 2001, then decrease to about 52 by year-end. The curve remains at about 54 through the start of 2003, then continues generally upward through May 2005 to end at about 65., 123700=Title: IMM Net Non-Commercial Euro Positions Series: IMM Net Non-Commercial Euro Positions Horizon: January 2005 - June 2005 Description: Non-commercial Euro positions decreased., 165763=A forecast from the December 2003 Greenbook begins in 2003:Q1at about 101, then climbs to end at about 108 in 2005:Q4., 202681=Title: Households With Any Payments 60 Days Past Due Series: Share of households and share of debt Horizon: 1989 to 2004 Description: Data are plotted as two curves. Units are percent., 213074=Long-Term Nominal and Inflation-Indexed Yields for the euro for 2003 through mid-2005. The range of the y-axis is [0, 6]; unit is percent. The nominal yields for the euro start at about 4¼ percent, and, with considerable volatility, ease to about 4 percent by October 2003, and then decline to about 2¾ percent by the end of the period. The inflation-indexed yields for the euro start at about 2½ percent, and, with considerable volatility, decline to about 2 percent by October 2003, and then fall to just below 1 percent by the end of the period., 252131=A line chart reports a measure of the term premium for the forward rate maturing ten years ahead. This measure suggests that the term premium has declined substantially since the middle of June 2004., 162696=The forecast for 2004 curve and the forecast for 2005 curve overlap in January 2004 and October 2004., 188700=The bond default rate series begins at about 1.8 in 1990, remains generally at that level until later in that year, and then rises to about 3.25 in early 1991. The series then generally falls to 0.6 in late 1991, rises to a little more than 1 in early 1992, falls to 0.5 later in that year, and remains generally at that level until late 1998. The series then generally rises to a little more than 1 in mid-1999, falls a little to 0.9 around year-end 1999, rises to a little more than 1 in 2000, and remains at about that level until rising to about 2.9 in early 2001. The series falls to about 2.25 later that year and then rises to about 3.75 in 2003. The series falls to a little more than zero in 2004 and rises to about 0.9 before falling a bit to end at about 0.5 in May 2005., 163777=A forecast from the December 2003 Greenbook begins at about 29 in 2003:Q4, then decreases through 2005:Q4 to end at about 26., 116010=The real rent series begins at about negative 4 in 1978, rises to about 5 in 1981, and ends at about 3 in 2005., 143785=The figure also has two shaded areas that represent a projection period with a 70 percent confidence interval and a 90 percent confidence interval. The 70 percent confidence interval begins in 2005:Q1 at about 5.25, gradually expanding to nearly 6 on the upper end and 4.25 on the lower end by year-end 2006. The 90 percent confidence interval begins in 2005:Q1 at about 5.25, gradually expanding to about 6.5 on the upper and about 3.75 on the lower end by year-end 2006., 185397=The curves overlap in 1995 and 2001., 10273=The loans at commercial banks series begins at about 3.4 in 1991, then mostly falls to end in 2005:Q1 at about 1.4., 184442=Title: Commercial Real Estate Prices and Net Operating Income Series: Price and net operating income (NOI) Horizon: 1980 to 2005:Q1 Description: Data are plotted as two curves. Data are quarterly. Units are index, 1978=100, ratio scale., 201210=The auto loans at finance companies series and the home mortgage at banks curves overlap periodically in 2000, 2001, and 2002., 149710=A forecast period starts in 2005 at a bit above 5 and remains at about that point through 2006., 118849=The repeat-transactions price index (adjusted) series begins at about100 in 1979, drops to about 92 in 1983, and ends at about 141 in 2004., 253110=A chart plots the level of the funds rate and the prescriptions from a range of interest rate rules over the period from 1988 to present. The current level of the funds rate is at the upper end of the range of interest rate rule prescriptions. In addition, the prescriptions tend to flatten out over the next year based on the staff's outlook for output and inflation., 180547=Title: Equity Valuation Series: 12-month forward trend E/P ratio for S&P 500 and real Treasury perpetuity yield (yield on synthetic perpetuity minus Philadelphia Fed 10-year expected inflation) Horizon: 1986 to 2005:Q2 Description: Data are plotted as two curves. Data are quarterly. Units are percent., 171529=The forecast for 2006 curve starts at about 4 in September 2004, then decreases to end at about 3.4 in June 2005., 150894=A forecast period starts in 2005 at about 66.3 and decreases through 2006 to end just above 66.0., 132956=The curve starts at about 1.7 in 1997 and then continues generally downward through mid-1998 until it reaches about 1.0. It fluctuates upward to about 2.0 in 2000, followed by a decrease to about 1.5 by year-end. In 2001, the curve increases to approximately 2.2, drops to about 1.5 by midyear, then increases to end the year at about 2.2. The curve drops to about 1.6 near mid- 2002, then increases to just below 2.5 by year-end. The curve generally decreases through the start of 2004 to approximately 1.0, then rises to end at about 1.6 in May 2005., 149457=The unemployment rate curve starts in 1996 at about 5.5; it then decreases, reaching a little less than 4 by year-end 2000. The curve continues upward to about 6.25 at the start of 2004, then decreases to just above 5 by the end of the year., 111908=The price-rent ratio series begins at about negative 5 in 1975, rises to about 10 in 1978, and ends at about 11 in 2005., 210488=Exhibit 12 is a three-by-four array of panels of weekly data. All graphs are shaded yellow from November 2003 through the end of the period (mid-2005) to indicate the period of time during which the central banks of the countries discussed on this page tightened monetary policy. The four top panels plot \"Ten-Year Government Bond Yields\" for the United States and Germany, Canada, the United Kingdom, and Japan. The four middle panels plot \"Long-Term Nominal and Inflation-Indexed Yields\" for the euro, the Canadian dollar, sterling, and the yen. The four bottom panels plot \"Monetary Policy Indicators\" for the United States and the euro area, Canada, the United Kingdom, and Japan., 94934=The S&P 500 series begins at about 100 in 1995, rising steadily and remaining between 200 and 300 between mid-1997 and mid-2005., 121141=Title: High Yield and Auto Debt Spreads Series: GM, Ford, and High Yield Index Horizon: January 3, 2005 - June 28, 2005 Description: High yield and auto debt spreads widened., 136262=Title: Fiscal Impetus Series: Fiscal impetus Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: The data are plotted as bars. There are six bars. Units are percent of GDP. A horizontal line is drawn at zero., 117282=The repeat-transactions price index (adjusted) series begins at about 4.7 in 1979, drops to about negative 3.9 in 1981, rises to about 4.2 in 1986, falls to about negative 4.1 in 1990, and climbs to about 7.9 in 2005:Q1., 115386=The price-rent ratio series begins at about negative 5 in 1975, rises to just under 30 in 1988, drops to about negative 9 in 1997, and ends at about 20 in 2005., 124053=Title: Global 10-Year Sovereign Debt Yields Series: Australia, UK, US, Canada, and Germany Horizon: March 15, 2005 - June 28, 2005 Description: 10-year sovereign debt yields decreased., 150283=The labor force participation rate curve starts in 1996 at approximately 66.5, then fluctuates between about 67.0 and 67.1 through 1999. The curve continues upward through early 2000 to about 67.3, followed by a decrease to approximately 66.9 by year-end. The curve rises to about 67.2 in 2001, after which it trends downward to about 65.7 at the end of 2004., 99416=Title: Core PCE Price Inflation (4-quarter change) Series: Optimal policy, Taylor Rule, and June Greenbook (optimal policy) Horizon: 2004 to 2008 Description: Data are plotted as three curves. Units are not defined., 235933=Current Account in terms of percent of GDP and in terms of level (billions of dollars) for 1995 through early 2005 (actual) and for early 2005 through 2006 (forecast). The range of the left y-axis, measured in terms of percent of GDP, is [-10, 1]. The range of the right y-axis, measured in terms of level or billions of dollars, a.r., is [-1000, 100]. The graph shows the current account to be in deficit for the entire period; the two series track closely most of the period, but the gap between them widens beginning in late 2004. The current account in terms of level starts at a deficit of about $125 billion, which widens to about $780 billion by early 2005. The forecast shows the deficit widening further, to about $960 billion by end-2006. The current account in terms of percent of GDP starts at a deficit of about 1¾ percent of GDP, which widens to a deficit of nearly 6½ percent of GDP by early 2005. The forecast shows the deficit widening further to about 7¼ percent of GDP by end-2006., 105970=The June Greenbook (optimal policy) and the Taylor Rule curves overlap until mid-2005 and again in late 2008. The optimal policy and the Taylor Rule curves overlap from early 2004 until early 2006. The optimal policy and the June Greenbook curves overlap in late 2007., 98864=The June Greenbook (optimal policy) series begins in 2005 at about 5.1 and ends in late 2008 at about 5.25., 113600=The real price series begins at about 0 in 1978, drops to about negative 1 in 1980, rises to about 25 in 1986, drops to about negative 13 in 1990, and ends at about 9 in 2005., 188279=Title: Bond Default and C&I Loan Delinquency Rates Series: Bond default rate (six-month moving average) and C&I loan delinquency rate Horizon: 1990 to 2005 (May 2005 for bond default rate and 2005:Q1 for C&I loan delinquency rate) Description: Data are plotted as two curves. Units are percent of outstandings., 161858=Title: Evolution of the Greenbook Forecast For Core PCE Prices Series: Forecast for 2004, forecast for 2005, and forecast for 2006 Horizon: December 2003 to June 2005 Description: Data are plotted as three curves. Units are percent change, Q4/Q4. The dates on the x-axis represent the Greenbook publication date., 151708=The trend curve starts at about 222 in 1996, then increases through the end of 2004 to about 243., 149817=The NAIRU curve begins at just over 5 in 1996 and stays at about that level through the forecast period., 122741=Title: Euro-Dollar Series: Euro-dollar Horizon: January 3, 2004 - June 28, 2005 Description: The dollar appreciated against the Euro., 127971=The existing homes curve begins in 2001 at just below 4.5. It then generally increases, reaching about 4.9 by 2001:Q3, and decreasing through year-end to a bit above 4.5. The curve rises to about 5.2 at the start of 2002, falls to about 4.7 by midyear, then continues generally upward through mid-2003 to about 5.9. The curve then decreases to about 5.3 at the start of 2004, and generally rises to about 6.1 by the end of the year. The curve dips to a bit below 6.0 at the beginning of 2005, then increases to end at about 6.2 in May 2005., 4101=For basic model, the series begins at about 7.5 in 2005:Q1, and then generally falls to end at about 4 in year-end 2006., 200694=The home mortgages at banks series begins at about 2.25 in 1996, remains at about that level until late 1998, then rises to about 2.5 in early 1999; later in that year, the series falls to a little less than 2, rises again to about 2, and then falls to about 2. The series remains at about that level until midyear 2000 then rises to about 2.5 in early 2001. Afterward, the series falls generally to about 1.5 in mid-2003, rises to about 1.75 in late 2003, and then falls to end at about 1.25 in 2005:Q1., 186327=The real Treasury perpetuity yield series begins at about 4.25, rises to about 4.75 by late 1990, and then generally falls to about 3.5 in 1993. The series rises to about 4.75 in late 1994, falls to about 3.75 in late 1995, rises to about 4.25, and remains at about that level until mid-1997. The series then generally falls to about 3 in late 1998, rises to a little more than 4 in late 1999, and then falls to about 3.5 in early 2001. After rising slightly to about 3.75 a bit later in 2001, the series then fluctuates between 3.75 and 2.9 until mid-2004. The series falls to end at about 2.5 in 2005:Q1., 204015=Title: Household Net Worth to DPI Series: Household net worth to DPI Horizon: 1995 to 2006 (data is projected for part of 2005 and all of 2006) Description: Data are plotted as one curve. Data are quarterly. Unit is ratio., 14546=Title: Loan-to-Value Ratios of Interest-Only Mortgages at Origination Series: March 2003, March 2004, and February 2005 Horizon: March 2003, March 2004, and February 2005 Description: Data are plotted as three bars in four groups: less than 70; 70-79; 80-89; and 90+. Units are percent of interest-only mortgage debt., 110211=The two curves overlap in 1981, 1986, 1987, 1991, 1999, and 2003., 19815=The two curves overlap at about 1997., 165493=A forecast from the December 2004 Greenbook starts in 2004:Q2 at nearly 108, then increases to end at about 118 in 2006:Q4., 15085=The set of bars at 70-79: March 2003 is about 46, March 2004 is about 55, and February 2005 is about 60., 199053=Solid vertical bars are present in 1974, most of 1980, toward year-end of 1981 and extending through 1982, most of 1990 and the early part of 1991, and 2001., 135224=The 10-year Treasury rate curve begins at about 5 at the start of 2001 and drops to about 4.8 by year-end. It increases to a bit above 5 in mid-2002, decreases through mid-2003 to about 3.8, and generally increases to about 4.8 in mid-2004. The curve falls to about 4 in mid-year 2005. In the projected area, the curve begins slightly above 4 in mid-2005 then remains at about that level until year-end 2006. A forecast for the curve from the April 2005 Greenbook starts at about 4.1 in early 2005 and remains at about that level through 2006., 247524=A line chart displays two- and ten-year Treasury yields since the beginning of 2004. Ten-year yields have moved lower, on balance, over this period, while the two-year yield has risen appreciably. As a result, the yield curve is quite flat at present., 129346=At the start of 2001, orders of nondefense capital goods are about 64 but then decrease to about 50 toward year-end. The orders curve increases to approximately 54 at the beginning of 2002, then fluctuates between about 50 and 53 through the end of the year. The curve then generally trends upward through May 2005 to end at about 65., 101091=The Taylor Rule curve and the optimal policy curve overlap from 2004 to late 2005 and again around early 2007. All three curves overlap in 2005. The June Greenbook curve and the Taylor Rule curve continue to overlap through early 2006., 143297=Title: Unemployment Rate Series: Unemployment rate Horizon: 2000 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted as a curve. Units are percent., 135779=The federal funds rate curve begins at about 5.8 at the start of 2001. It drops through mid-2004 to about 1, then increases to about 3.5 in mid-2005. In the projected area, the curve begins at about 3.5 in mid-2005 and generally rises to end just below 4 in 2006. A forecast for the curve from the April 2005 Greenbook starts at about 3 in mid-2005 and ends at about 3.5 at the start of 2006., 114900=The real rent series begins at about negative 4 in 1975 and ends at about 1 in 2005., 146104=Title: Core PCE Prices Series: Core PCE prices Horizon: 2000 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted as a curve. Units are four-quarter percent change., 10099=The all loans series begins in 1991 at about 5.2, drops to about 3.9 in 1994, then rises to about 5.5 in 2001, and generally falls to end in 2005:Q1 at about 4.3., 117772=The rent index (adjusted) series begins at just under 0 in 1979, rises to about 4.2 in 1986, and ends at about 1 at the end of 2004., 200122=The auto loans at finance companies series begins at about 3 in 1996, rises generally to about 3.5 in 1997, and then falls generally to about 2 in 2000. The series rises a bit to about 2.25 and remains at about that level until late 2001. The series then falls to about 2 in early 2002, rises a bit to about 2.1 in mid-2003, and falls to about 2 toward the end of that year. The series remains generally at about that level until late 2004 when the series falls to a little less than 2 in early 2005 and then rises to end at a little more than 2 in April 2005., 102055=The optimal policy series begins at about 5.6 in 2004, falls to about 5.1 in late 2005, and ends slightly under 5.25 in late 2008., 111367=The real rent series begins at about negative 5 in 1975, rises to about 1 in 1982, and ends at just above 0 in 2005., 138936=The curve begins at about 30 at the start of 2001 and drops to about 20 by the end of the year. It increases through the start of 2003 to about 35 and dips to about 30 through the end of the year. The curve then generally increases to about 57 in mid-2005. In the projected area, the curve begins at about 57 in mid-2005 and generally rises through 2006 to end at about 60. A forecast from the April 2005 Greenbook starts at about 50 in early 2005, then increases a bit through 2006 to end at about 54., 94383=Title: U.S. Stock Market Indexes Series: NASDAQ and S&P 500 Horizon: 1995 to 2005 Description: Data are plotted on two curves. Units are index, January 3, 1995=100., 3472=Title: Projection of Real Price Changes Series: History and staff forecast, basic model, and error-correction model Horizon: 2002 to 2006 (forecast period begins after 2005:Q1) Description: Data are plotted as three curves. Units are four-quarter percent change. Vertical line is located at 2005:Q1., 171962=Title: Contribution of Oil Prices to Real GDP Growth Series: Forecast for 2005 and forecast for 2004 Horizon: December 2003 to June 2005 Description: Data are plotted as two curves. Units are percentage points. A horizontal line is drawn at zero. The dates on the x-axis represent the Greenbook publication date. Note that the contribution of oil prices to real GDP growth is relative to prices in the December 2003 Greenbook., 115850=The real price series begins at about negative 9 in 1976, rises to about 8 in 1979, drops to about negative 7 in 1981, and ends at about 20 in 2005., 147172=In the projected period, the series starts at about 1.5 in 2005:Q1, followed by an increase to just above 2 by the fourth quarter. It then decreases to just below 2 at the end of 2006., 225418=Exports to China from Taiwan, Korea, and Japan for 2003 through mid-2005. The range of the y-axis is [-20, 180]; unit is twelve-month percent change. All the series are somewhat volatile. The twelve-month percent change of exports from Taiwan starts at about 120 percent, rises immediately to nearly 180 percent, drops quickly to about 70 percent by early 2003, rises to about 160 percent by early 2004, and falls to about 10 percent by the end of the period. The twelve-month percent change of exports from Korea starts at about 55 percent, rises immediately to about 80 percent, drops quickly to about 30 percent by early 2003, rises to about 70 percent by mid-2004, and falls to just above 20 percent by the end of the period. The twelve-month percent change of exports from Japan starts at about 30 percent, rises immediately to about 65 percent, drops to about 25 percent by mid-2003, and then falls to about 0 percent by the end of the period., 184777=The price series begins at about 130 in 1980, generally rises to 235 in late 1990, falls to about 180, and then generally rises to end at about 300 in 2005:Q1., 202964=The share of households curve begins at about 5.4 in 1989 and drops to about 4.6 in 1992. It increases through mid-1998 to about 6, drops to about 5.2 in mid-2001, then increases to end at almost 7 in late 2004., 125491=STRICTLY CONFIDENTIAL (FR) CLASS I-FOMC* *Downgraded to Class II upon release of the July 2005 Monetary Policy Report., 119291=The repeat-transactions price index (adjusted) curve and the constant-quality price index for new homes curve overlap in 1985., 110896=Title: Chicago Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 7823=Title: LTV at Origination Against Price Change Series: Plot points by state. Not all plot points are labeled. Horizon: 1999 to 2003 Description: Data are plotted as a scatter plot. Horizontal axis units are annualized price change, 1999-2003 (percent). Vertical axis units are average LTV at origination, 2004., 123016=Title: Interest Rate Differentials Series: US 2-year Treasury note and 2-year German Schatz Horizon: June 28, 2004 - June 28, 2005 Description: The US 2-year Treasury note rate increased, while the 2-year German Schatz rate decreased., 180952=The 12-month forward trend E/P ratio for S&P 500 series begins in 1986 at about 9, then generally falls until reaching a little more than 6 in mid-1987. The series then rises to about 8.5 by year-end 1987, falls a bit to nearly 8 in early 1988, stays at about that level until later that year, and then the series falls to about 7.8 in mid-1989. The series generally rises to about 9 by year-end 1990. It generally falls to a little more than 4 near year-end 1999. The series remains at about that level until late 2000, rises generally to about 7 in mid-2002, maintains its position at about that level until early 2003, and then generally drops to about 5.5 by year-end 2003. From that point, the series generally rises to end just under 6 in 2005:Q2., 140639=The series begins at about 4 in 2000:Q1, then increases to about 5 in the second quarter. It falls through 2001:Q4 to about 0, increases to reach about 2.25 in 2002:Q3, then decreases to about 2 by 2003:Q1. The series climbs to about 5 toward the second quarter of 2004, then decreases to approximately 4 by year-end., 160995=The band for the 70 percent confidence interval begins in 2005 at about 1.75, gradually expanding to about 2.75 at the upper end and about 1 at the lower end in year-end 2006., 104229=The optimal policy curve begins at about 1 in mid-2004, rises to about 2.8 in 2005, and drops to about 2.5 in 2006. The series ends in 2008 at about 3.7., 15573=Title: Credit Scores of Interest-Only Mortgages Series: March 2003, March 2004, and February 2005 Horizon: March 2003, March 2004, and February 2005 Description: Data are plotted as three bars in four groups: FICO Scores 420-659, 660-719, 720-779, and 780-900. Units are percent of interest-only mortgage debt., 209431=Ten-Year Government Bond Yields on a weekly basis for U.S. Treasury bonds and for weighted-average foreign bonds for 2003 through mid-2005. The range of the y-axis is [3.0, 5.0]; unit is percent. The yields for weighted-average foreign bonds are the average of rates for Australia, Canada, the euro area, Japan, Sweden, Switzerland, and the United Kingdom, weighted by trade shares. The yields for U.S. Treasury bonds start at about 4.1 percent, and, with considerable volatility, fall to about 3.2 percent by mid-2003, rise to about 4.6 percent by early 2005, and then fall to just under 4 percent by the end of the period. The yields for weighted-average foreign bonds start at about 4.1 percent, and, with considerable volatility, fall to about 3.4 percent by mid-2003, rise to nearly 4.5 percent by mid-2004, fall to about 3.6 percent by early 2005, rise quickly to about 3.85 percent and then fall to about 3.3 percent by the end of the period., 7314=The September 2003 curve begins at about 0 percent price decline and about 2 percent of borrowers with negative equity and trends up to end at 30 percent price decline and about 43 percent of borrowers with negative equity., 112487=The real rent series begins at about negative 5 in 1975 and ends at just below 0 in 2005., 212194=Ten-Year Government Bond Yields for the United Kingdom for 2003 through mid-2005. The range of the y-axis is [3, 6]; unit is percent. The yields for the United Kingdom start at about 4½ percent, and, with considerable volatility, rise to about 5 percent by October 2003, rise further to about 5¼ percent by mid-2004, and then fall to about 4¼ percent by the end of the period., 162943=Title: Price of Imported Oil Series: Price of imported oil Horizon: 2003 to 2006. Data are projected from the June 2005 Greenbook, the December 2004 Greenbook, and the December 2003 Greenbook. Description: Data are plotted as a curve. Units are dollars per barrel., 187681=The rent per square foot series begins at about 22, generally rises to 24 in late 1999, and then falls to about 23.75 in early 2000. The series rises to about 26.5 in early 2001, generally falls to about 22.25 in mid-2003, remains at about that level until late 2004, and then rises to end at about 23.1 in 2005:Q2., 126054=The curve starts in 2003:Q1 just above 7.2, followed by an increase to just above 7.4 by 2003:Q3. It dips to about 7.4 in 2003:Q4, then increases through 2004:Q2 to about 7.6. The curve decreases to a bit less than 7.6 in 2004:Q3, then moves upward to end at nearly 7.9 in May 2005., 108117=The Taylor Rule curve and the optimal policy curve overlap from 2004 to 2005 and again in early 2007., 103270=The June Greenbook (optimal policy) curve begins in 2005 at slightly over 2 and ends in 2008 at about 1.9., 109823=The real price series begins at about 10 in 1975, drops to about negative 9 in 1983, rises to about 19 in 1990, then drops down again to about negative 9 in 1991. The series generally rises to about 20 in 2001 and ends at about 15 in 2005., 16099=The set of bars at 660-719: March 2003 is about 35, March 2004 is about 36, and February 2005 is about 37., 151359=The total hours worked curve starts at about 216 in 1996 and continues upward to about 236 by 2001. The curve falls to about 230 in 2002, remains at about 234 in 2003, then generally rises through year-end 2004 to about 236., 12849=Title: IO Share of RMBS Against Price Change Series: Plot points by state. Not all plot points are labeled. Horizon: 1999 to 2003 Description: Data are plotted as a scatter plot. Horizontal axis is annualized price change, 1999-2003 (percent). Vertical axis is IO share of RMBS (percent). r = 0.3, 146670=The figure also has two shaded areas that represent a projection period with a 70 percent confidence interval and a 90 percent confidence interval. The 70 percent confidence interval starts in 2005:Q1 at about 1.5, gradually expanding to about 2.75 on the upper end and slightly above 1 on the lower end by year-end 2006. The 90 percent confidence interval begins in 2005:Q1 at about 1.5, gradually expanding to about 3.25 on the upper end and about 0.5 on the lower end by the end of 2006., 190465=The interest expense to cash flow series begins at about 25 in 1990, rises slightly in 1991, and then generally falls to about 15 in 1997. The series rises to a little more than 20 in 2001 and then falls to end at about 12 in 2004. The series is projected to end at about 11 in 2005:Q1., 107675=The Taylor Rule curve starts at about 1 in mid-2004, rises to about 3.2 in early 2006, falls to about 1.2 in 2007, and ends in late 2008 at about 2., 104394=The June Greenbook (optimal policy) curve begins in 2005 at about 2.8 and ends at about 3.7 in late 2008., 193400=Title: High-Yield Bond Issuance as a Share of Total Bond Issuance (nonfinancial corporations) Series: High-yield bond issuance as a share of total bond issuance Horizon: 1997 to 2005:H1 Description: Data are plotted as bars. As shown in the chart, approximate values are as follows., 122365=Title: Euro-Area 3-Month Deposit Rates and Rates Implied by Traded Forward Rate Agreements Series: Libor fixed, 3-month forward, and 9-month forward Horizon: March 1, 2005 - June 28, 2005 Description: Euro forward contracts rates rose., 113014=The price-rent ratio series begins at about negative 3 in 1975, drops to about negative 7 in 1982, and ends in 2005 at about 6., 119552=The constant-quality price index for new homes curve and the construction costs curve overlap in 1981, 1989, 1990, 1995, and 1998., 224213=Merchandise Trade Balance as a twelve-month moving sum for 1985 through mid-2005. The range of the y-axis is [-20, 80]; units are billions of dollars. The trade balance starts at a deficit of about $2 billion, falls to a deficit of about $15 billion by early 1986, rises into surplus by mid-1990 and reaches a surplus of about $10 billion by early 1991, falls back into deficit in mid-1993 and reaches a deficit of about $12 billion by the beginning of 1994, rises back into surplus by the end of 1994 and reaches a surplus of about $46 billion by mid-1998, falls to a surplus of about $14 billion by mid-2004, and then rises sharply to a surplus of about $72 billion by the end of the period., 198120=The series begins in 1975 at a little more than 9 and rises to about 13.25 toward year-end. The series falls to about 12 in 1976, rises to a little more than 13 in 1977, falls to a little more than 11 in 1978, rises to almost 13 later that year, and then generally falls to about 8 in 1980. The series rises to about 10.5 in 1981 and generally falls to about 8 in late 1982. The series then rises to about 12 in 1984 and then generally falls (a brief increase occurred in 1985) to about 9 in 1986. The series rises generally to about 11.5 in late 1988, generally falls to about 8.5 in 1991, and generally rises again to about 13.25 in 1997. The series then falls generally to about 6 in late 2001 and then generally rises to end at about 11.25 in 2004., 163517=A forecast from the June 2005 Greenbook starts slightly above 43 in 2005:Q1, then increases to end at about 55 in 2006., 189494=The C&I loan delinquency rate series begins at about 5 in 1990, rises to about 6 in 1991, and then falls to about 2 in 1994. The series falls to about 1.75 in 1997 and rises almost to 4 in 2002. The series then falls to end at about 1.5 in 2005:Q1., 201388=Title: Bank Lending Standards for Consumer Loans (average for credit cards and other consumer loans) Series: Bank lending standards for consumer loans Horizon: 1996 to 2005:Q2 Description: Data are plotted as one curve. There is a horizontal zero line. Above the horizontal line represents tighter standards, below the horizontal line represents easier standards. Units are net percent., 98983=The Taylor Rule series begins at about 5.6 in 2004, falls to about 5.1 in late 2005, rises to about 5.4 in late 2006, and ends at about 5.3 in late 2008., 152664=Title: Jobs Hard to Fill Series: Jobs hard to fill Horizon: 1990 to 2005:Q2 Description: Data are plotted as a curve. Unit is percent. A horizontal line is drawn a bit above 25 that shows the average for 1997:H1. Note that 2005:Q2 is the April-May average., 171345=The forecast for 2005 curve starts at about 3.9 in December 2003 and rises through March 2004 to about 4. It then generally decreases through June 2005 to end at about 3.6., 136953=Title: Equity Prices Series: Wilshire 5000 Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: Data are plotted as a curve and represent the quarter-end. Units are index, ratio scale., 98440=Title: Unemployment Rate Series: Optimal policy, Taylor Rule, and June Greenbook (optimal policy) Horizon: 2004 to 2008 Description: Data are plotted as three curves. Units are not defined., 195577=Title: Share of High-Yield Bond Proceeds Used to Refinance Existing Debt Series: Share of high-yield bond proceeds used to refinance existing debt Horizon: 1997 to 2005:H1 Description: Data are plotted as bars. As shown in the chart, approximate values are as follows., 100372=Title: Federal Funds Rate Series: Optimal policy, Taylor Rule, and June Greenbook (optimal policy) Horizon: 2004 to 2008 Description: Data are plotted as three curves. Units are not defined., 118477=Title: Levels of Real House Prices and Construction Costs Series: Repeat-transactions price index (adjusted), constant-quality price index for new homes, and construction costs Horizon: 1979 to 2004 Description: Data are plotted as three curves. Units are index (1979=100)., 4233=For error-correction model, the series begins at about 7.5 in 2005:Q1, and then generally falls to end at about negative 1.75 in year-end 2006., 14962=The set of bars at less than 70: March 2003 is about 45, March 2004 is about 33, and February 2005 is about 25., 132027=The four-week moving average curve starts at just below 400 at the beginning of 2003 and then rises to about 449 by midyear. The curve continues generally downward, remaining at about 350 through 2004; it dips to just above 300 at the start of 2005, then increases to end at about 325 on June 25, 2005., 95807=Title: 30-Year Treasury Bond Yield Series: 30-Year Treasury Bond Yield Horizon: 1993 to 1996 Description: Data are plotted as a curve. Units are percent., 207734=Stock Prices on a weekly basis for emerging markets and for industrial countries for 2003 through mid-2005. The range of the y-axis is [75, 200]; ratio scale, Jan. 3, 2003 = 100. Both series begin at 100 and are somewhat volatile. The emerging markets series falls to about 93 by early 2003, rises to about 155 by early 2004, declines to about 135 by mid-2004, and then rises to about 172 by the end of the period. The industrial countries series falls to about 87 by early 2003, rises to about 124 by early 2004, declines to about 117 by mid-2004, and then rises to about 135 by the end of the period., 214888=Long-Term Nominal and Inflation-Indexed Yields for the yen. Although the dates on the chart are set for 2003 through mid-2005, the data actually begin in early 2004. The range of the y-axis is [0, 6]; unit is percent. The nominal yields for the yen start in early 2004 at about 1-1/3 percent, and, with some volatility, rise to nearly 2 percent by mid-2004, and then decline to about 1 percent by the end of the period. The inflation-indexed yields for the yen start in early 2004 at just above 1 percent, and, with some volatility, decline to about ½ percent by the end of the period., 170757=Title: Evolution of the Greenbook Forecast for Real GDP Series: Forecast for 2004, forecast for 2005, and forecast for 2006 Horizon: December 2003 to June 2005 Description: Data are plotted as three curves. Units are percent change, Q4/Q4. The dates on the x-axis represent the Greenbook publication date., 14431=Note. Data are from purchase originations in 2004, 120685=Title: TIPS Breakevens and Crude Oil Futures Series: 5-year TIPS breakeven rate, 10-year TIPS breakeven rate, and Front month crude oil futures Horizon: January 13, 2005 - June 28, 2005 Description: TIPS breakeven rates decreased, while the front month crude oil futures increased., 156542=The ECI curve starts at about 3 in 1999:Q1 and increases to just above 4 through 2000. The curve then generally decreases to end at about 3.1 in March 2005., 151595=A forecast period starts in 2005 at about 236 and increases through 2006, reaching approximately 244., 116905=Title: Changes in Real House Prices and Rents Series: Repeat-transactions price index (adjusted), constant-quality price index for new homes, and rent index (adjusted) Horizon: 1979 to 2005:Q1 Description: Data are plotted as three curves. Units are four-quarter percent change., 219801=Euro-Area Confidence Indicators on a monthly basis for the industrial and consumer sectors for 2002 through mid-2005. The range of the y-axis is [-25,5]; unit is diffusion index. A diffusion index is defined as the percent of respondents reporting an increase minus the percent of respondents reporting a decrease. The series for the industrial sector starts at about -15, rises to about -3 by late 2004, and falls to about -11 by the end of the period. The series for the consumer sector starts at about -11, falls to about -22 by early 2003, rises to about -15 by early 2004 and stays at about that level through the end of the period., 165628=A forecast from the June 2005 Greenbook starts a bit above 112 in 2005:Q2; then increases to end just above 116 in 2006:Q4., 114729=The real price series begins at about negative 3 in 1976, then rises to just over 20 in 1987, drops to about negative 12 in 1990, and ends at about 12 in 2005., 231453=Broad Real Dollar on a monthly basis for 2002 through mid-2005 (actual), and for mid-2005 through 2006 (forecast). The range of the y-axis is [75, 105]; index, Jan. 2002 = 100. The actual broad real dollar starts at 100, declines to about 87 by mid-2005, and then eases slightly to about 86 by the end of the forecast period., 114476=Title: New York Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 160291=Title: Core PCE Prices Series: Core PCE prices and stronger compensation pressures Horizon: 2000 to 2006. Data are projected for 2005 to 2006. Description: Data plotted as two curves. Confidence intervals are represented as two bands. Units are four-quarter percent change., 100970=The June Greenbook (optimal policy) curve begins in mid-2005 at about 3.1 and ends at about 3.7 in late 2008., 111495=The two curves overlap in 1979, 1981, 1983, 1984, 1986, and 1991 through 1999., 201873=The series begins at about 20 in 1996, rises to 35 in midyear, then falls generally to 5 toward year-end 1998. The series then rises to about 10 in early 1999, falls generally to about zero in 2000, and then rises to about 20 in early 2001. The series fluctuates between 20 and 12 from that point until late 2002 and then falls generally to end at about negative 13 in 2005:Q2., 100027=The June Greenbook (optimal policy) curve begins in 2005 at slightly over 2 and ends in 2008 at about 1.85., 112588=The two curves overlap in 1980, 1983, 1984, 1986, 1991, 1992, 1995, 1997, 2001, and 2002., 116283=Title: Miami Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 137287=The curve begins at about 10,400 at the start of 2001 and drops to about 9,500 by midyear. It increases to about 11,000 in early 2002, drops to about 7,800 by mid-2002, then generally increases to about 12,500 in mid-2005. In the projected area, the curve begins at about 12,500 in mid-2005 and rises to end just above 13,000 in 2006. A forecast for the curve from the April 2005 Greenbook starts slightly below 12,000 in early 2005 and increases through 2006 to end just below 13,000., 212603=Ten-Year Government Bond Yields for Japan for 2003 through mid-2005. The range of the y-axis is [0, 3]; unit is percent. The yields for Japan start at about 7/8 percent, and, with considerable volatility, rise to about 1½ percent by October 2003, rise further to about 1-7/8 percent by mid-2004, and then fall to about 1¼ percent by the end of the period., 117916=The repeat-transactions price index (adjusted) curve and constant-quality price index for new homes curve overlap from 1980 through 1987, and in 1990, 1991, 1992, 1995, 1996, and 1997., 217701=Earnings per Share on a yearly basis for the euro area and Japan for 1990-2004 (actual) and 2005-2006 (forecast). The range of the y-axis is [-50, 350]; index, 1990=100. Earnings per share is defined as operating earnings per share in local currency for MSCI indexes; forecasts are from I/B/E/S surveys in mid-June 2005. Both series start at 100. Earnings per share for the euro area fall to about 60 by 1993, rise to about 180 by 2000, fall to about 120 by 2002, rise to about 275 by 2004, and then rise to about 330 over the forecast horizon. Earnings per share for Japan, with some volatility, fall to about -40 by 2001, rise to about 130 by 2004, and rise further to about 175 over the forecast horizon., 137827=Title: House Prices Series: OFHEO repeat-transactions index Horizon: 2001 to 2006. Data are projected from the April 2005 Greenbook for 2005 and 2006. Description: Data are plotted as a curve and are presented quarterly. Units are index, 1980:Q1=100, ratio scale., 246346=A line chart displays the current expected path of the funds rate derived from federal funds futures along with the expected path as of the time of the May meeting. The chart indicates that investors expect the funds rate to plateau at a level of about 3-3/4 percent beginning early in 2006. The current funds rate path is somewhat lower than the path anticipated at the time of the May meeting at horizons beyond the first quarter of 2006., 164564=A forecast from the June 2005 Greenbook starts at nearly 106 in 2005:Q2, then rises to end at about 107 in 2006:Q4., 114017=Title: Boston Series: Price-rent ratio Horizon: 1975 to 2005 Description: Data are plotted as a curve. Units are percent deviation from long-run level., 161398=The series for stronger compensation pressures begins in 2005 at about 1.5, rising generally until it reaches about 3 toward the end of 2006. The series is in the 70 percent confidence interval in 2005 and early 2006. The series then rises into the 90 percent confidence interval from about mid-2006 until near the end of 2006., 119152=The construction costs series begins at about 100 in 1979, drops to about 91 in 1991, and ends at about 103 at the end of 2004., 106633=Both the optimal policy curve and the Taylor Rule curve start at about 1.3 in early 2004, then trend up to about 2.1 in mid-2005. The Taylor Rule curve ends in 2008 at about 1.70, and the optimal policy curve ends in 2008 at about 1.75., 187386=The vacancy rate series begins at about 8.75 in 1998, drops a bit to about 8.5 in late 1998, rises to about 8.8 in early 1999, and then generally falls to about 7 in mid-2000. The series generally rises to about 14.5 in early 2003 and gradually falls to end at about 12.5 in 2005:Q2., 204336=The series begins at about 4.75 in 1995, rises until reaching about 5.75 in early 1998, falls to about 5.5 later that year, and then rises generally to about 6.25 in early 2000. The series falls generally to a little less than 5 in 2002. The series then rises generally from that point to about 5.5 in early 2005., 103388=The optimal policy curve and the Taylor Rule curve overlap between 2004 and 2005. The June Greenbook (optimal policy) curve and the optimal policy curve overlap between 2005 and 2006. The June Greenbook curve overlaps the Taylor Rule curve between 2005 and 2007 and overlaps the optimal policy curve in early 2008., 153850=The curve starts at about 3.7 in 1994, then generally falls to about 2.3 by 2000. It increases to about 3.2 in 2001, dips to almost 3.0 in 2002, and rises through early 2004 to about 3.4. The curve then decreases to end at about 3.0 in 2005:Q2., 183027=For high-yield spread, the series begins at about 7.5 in early 1990, rises to about 10 in early 1991, and then generally falls to about 4.5 in early 1992. The series generally falls again, reaching about 3.75 in mid-1994. From that point, the series then generally rises to about 4.5 in late 1995, falls to 3.5 in mid-1998, and rises to about 6 in late 1998. The series falls to 4.5 in late 1999 and rises to about 9 in 2000. From this point, the series fluctuates between a little less than 8 and about 11 until late 2002. The series generally falls to about 3.75 in early 2005, rises to about 4.25 in early 2005, and falls slightly to end at a little more than 4 in June 2005., 216474=Monetary Policy Indicators for the U.K. repo rate for 2003 through mid-2005. The range of the y-axis is [0, 6]; unit is percent. The U.K. repo rate starts at 4 percent, falls to 3½ percent by late 2003, rises to 4¾ percent by late 2004, and remains there through the end of the period., 171796=The forecast for 2006 curve overlaps the forecast for 2004 curve and the forecast for 2005 curve in December 2004., 3870=For history and staff forecast, the series begins at about 6 in 2002, rises generally to about 8 in late 2004 and then falls to about 7.5 in 2005:Q1. After that point the series falls to end at about 1 in year-end 2006., 172723=The forecast for 2004 curve starts at about 0.0 in December 2003. It decreases through June 2005 to end at about negative 0.5., 15982=The set of bars at 420-659: March 2003 is about 9.5, March 2004 is about 9, and February 2005 is about 9., 162437=The forecast for 2005 curve starts in December 2003 at about 1.0, then generally rises to end at about 2.1 in June 2005., 149973=Title: Labor Force Participation Rate Series: Labor force participation rate and trend Horizon: 1996 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted on two curves. Units are percent., 112082=Title: Cleveland Series: Real price and real rent Horizon: 1975 to 2005 Description: Data are plotted as two curves. Units are four-quarter percent change., 164056=Title: Core PPI Intermediate Materials Prices Series: Core PPI intermediate materials prices Horizon: 2003 to 2006. Data are projected from the June 2005 Greenbook, the December 2004 Greenbook, and the December 2003 Greenbook. Description: Data are plotted as a curve. Units are index, 2000=100, ratio scale., 165013=Title: Core Nonfuel Import Prices Series: Core nonfuel import prices. Horizon: 2003 to 2006. Data are projected from the December 2004 Greenbook, the June 2005 Greenbook, and the December 2003 Greenbook. Description: Data are plotted as a curve. Units are index, 2000=100, ratio scale.}",
    "lastModified": "Thu, 11 Apr 2013 19:12:41 GMT",
    "textBeforeTable": "Bottom-right panel Core PCE Prices In the projected period, the series starts at about 1.5 in 2005:Q1, followed by an increase to just above 2 by the fourth quarter. It then decreases to just below 2 at the end of 2006. The figure also has two shaded areas that represent a projection period with a 70 percent confidence interval and a 90 percent confidence interval. The 70 percent confidence interval starts in 2005:Q1 at about 1.5, gradually expanding to about 2.75 on the upper end and slightly above 1 on the lower end by year-end 2006. The 90 percent confidence interval begins in 2005:Q1 at about 1.5, gradually expanding to about 3.25 on the upper end and about 0.5 on the lower end by the end of 2006. The series begins at about 2 in the first quarter of 2000, then dips to about 1.75 by year-end. The curve increases through 2001:Q4 to about 2.25, then generally moves downward to about 1 by 2003:Q3. The series then increases through year-end 2004 to reach about 1.5. Title: Core PCE Prices Series: Core PCE prices Horizon: 2000 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted as a curve. Units are four-quarter percent change. Bottom-left panel .0 5.1 5.1 2006",
    "textAfterTable": "Exhibit 4 Does Any Slack Remain In The Labor Market? Top-left panel Title: Unemployment Rate Series: Unemployment rate and NAIRU Horizon: 1996 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted on two curves. Units are percent. The unemployment rate curve starts in 1996 at about 5.5; it then decreases, reaching a little less than 4 by year-end 2000. The curve continues upward to about 6.25 at the start of 2004, then decreases to just above 5 by the end of the year. A forecast period starts in 2005 at a bit above 5 and remains at about that point through 2006. The NAIRU curve begins at just over 5 in 1996 and stays at about that level through the forecast period. Top-right panel Title: Labor Force Participation Rate Series: Labor force participation rate and trend Horizon: 1996 to 2006; Data are projected for 2005 and 2006. Description: Data are plotted on two curves. Units are percent. The labor force participation rate curve starts in 1996 at approximately 66.5, then fluctuates between about 67.0 and 67.1 through 1999. The curve continues upward through early 2000 to about 67.3, followed by a decrease to approximately 66.9 by year-end. The curve rises to about 67.2 in 2001, after which it trends downward to about 65.7 at the end of 2004. A forecast period starts in 2005",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}