{
    "relation": [
        [
            "Date",
            "Sep 28, 2000",
            "Jan 6, 2006",
            "Nov 26, 2007",
            "Mar 8, 2010",
            "Jul 30, 2010",
            "Sep 21, 2010"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Owner name: MITSUBISHI ELECTRIC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KABUSHIKI KAISHA ADVANCED DISPLAY;REEL/FRAME:020156/0143 Effective date: 20071111",
            "",
            "",
            "Effective date: 20100730"
        ]
    ],
    "pageTitle": "Patent US6426784 - Liquid crystal display and method for assembling the same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6426784?dq=6462713",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486660775,
    "recordOffset": 486645140,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that the invention is not limited to the foregoing embodiment and various changes and modifications may be made without departing from the spirit and scope of the invention. Although the liquid crystal display module positioning parts 9 having the positioning holes 9 a are fixed on the left and right side portions of the liquid crystal display module 3 in this embodiment, it is also preferable to directly form the positioning holes 9 a on the left and right side portions of the liquid crystal display module 3. In such a modification, number of the parts is reduced. Although the upper case 1 is composed of a resin material and the lower case 2 is composed of a magnesium alloy in this embodiment, it is also preferable that the upper case 1 is composed of a metal material such as magnesium alloy and the lower case 2 is composed of other metal material or a resin material. A narrow frame can be achieved also in such a modification. The same advantage is achieved by arranging the positioning ribs 8 on the left and right side portions of the liquid crystal display module 3 and by arranging the positioning holes 9 a, which are the contacting portions with the positioning ribs 8, on the left and right side portions 1C, 1D of the upper case 1. Also in this modification, the positioning",
    "textAfterTable": "JP41131641A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6784951 * Aug 6, 2001 Aug 31, 2004 Advanced Display Inc. Display device, manufacturing method thereof and image terminal unit employing the same US7088403 * Nov 8, 2002 Aug 8, 2006 Lg.Philips Lcd Co., Ltd. Liquid crystal display US7133090 * Jun 29, 2004 Nov 7, 2006 Lg.Philips Lcd Co., Ltd. Liquid crystal display module assembly US7474364 * Dec 27, 2001 Jan 6, 2009 Lg Display Co., Ltd. Structure for mounting an inverter US8223276 Jan 25, 2008 Jul 17, 2012 Funai Electric Co., Ltd. Cabinet of electronic equipment US20040150947 * Jan",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}