{
    "relation": [
        [
            "Cited Patent",
            "US3637994 *",
            "US3641316 *",
            "US3678251 *",
            "US3702464 *",
            "US3831119 *",
            "US3868057 *"
        ],
        [
            "Filing date",
            "19 Oct 1970",
            "17 Aug 1970",
            "4 Mar 1971",
            "4 May 1971",
            "14 Dec 1972",
            "4 Jun 1973"
        ],
        [
            "Publication date",
            "25 Jan 1972",
            "8 Feb 1972",
            "18 Jul 1972",
            "7 Nov 1972",
            "20 Aug 1974",
            "25 Feb 1975"
        ],
        [
            "Applicant",
            "Trw Inc",
            "Dethloff Juergen",
            "Frank H Delpino",
            "Ibm",
            "Electronic Memories & Magnetic",
            "Robert C Chavez"
        ],
        [
            "Title",
            "Active electrical card device",
            "Identification system",
            "Analog entry data card for game scoring, or the like, and method of using the same",
            "Information card",
            "Credit card and reader apparatus",
            "Credit card and indentity verification system"
        ]
    ],
    "pageTitle": "Patent US3934122 - Electronic security card and system for authenticating card ownership - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US3934122",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472130159,
    "recordOffset": 472109758,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While there has been described what is at present considered to be the preferred embodiment of the invention, it will be understood that various modifications may be made therein, and it is intended to cover in the appended claims all such modifications as falls within the true spirit and scope of the invention. For the three digit code 4-1-3, if switch 17B is actuated, a pulse would appear on conductor 17 at the B input of the OR gate 38 causing the OR gate 38 to conduct such that the pulse is conducted through AND gate 29 to the flip-flop 33. Consequently, a logical zero signal would appear at A input of the AND gates 26-29, thereby inhibiting further operation of the logic circuitry 23 until the flip-flops 30-33 are reset. The same result occurs if switch 14B is actuated. It should be recognized that if the user does not key the preselected code into the terminal 12, then the authenticity indicator 42 would not be energized. For example, assuming again that the correct code sequence is 4-1-3, if, after switches 18B and 16B have been operated, the user depresses switch 15B, then a pulse would appear on conductor 15 to the B input terminal of the AND gate 28, consequently causing the output signals of the flip-flop 32 to change state. Accordingly, a logic zero is applied to the C input of the AND gate",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4001550 * 4 Dec 1975 4 Jan 1977 Schatz Vernon L Universal funds transfer and identification card US4038522 * 11 Feb 1976 26 Jul 1977 General Signal Corporation Integrated card reader system US4079356 * 30 Mar 1976 14 Mar 1978 The United States Of America As Represented By The Secretary Of The Army Coded electronic lock and key US4092524 * 13 May 1976 30 May 1978 Societe Internationale Pour L'innovation Systems for storing and transferring data US4102493 * 13 May 1976 25 Jul 1978 Societe Internationale Pour L'innovation Systems for storing and transferring data US4105156 * 16 Dec 1976 8 Aug 1978 Dethloff Juergen Identification system safeguarded",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}