{
    "relation": [
        [
            "Property",
            "@label?",
            "gd:orgDepartment?",
            "gd:orgJobDescription?",
            "gd:orgName?",
            "gd:orgSymbol?",
            "gd:orgTitle?",
            "@primary?",
            "@rel?",
            "gd:where?"
        ],
        [
            "Type",
            "xs:string",
            "orgDepartment",
            "orgJobDescription",
            "orgName",
            "orgSymbol",
            "orgTitle",
            "xs:boolean",
            "xs:string",
            "where"
        ],
        [
            "Description",
            "A simple string value used to name this organization. It allows UIs to display a label such as \"Work\", \"Volunteer\", \"Professional Society\", etc.",
            "Specifies a department within the organization.",
            "Description of a job within the organization.",
            "The name of the organization.",
            "Symbol of the organization.",
            "The title of a person within the organization.",
            "When multiple organizations extensions appear in a contact kind, indicates which is primary. At most one organization may be primary. Default value is \"false\".",
            "A programmatic value that identifies the type of organization; see below for details.",
            "A place associated with the organization, e.g. office location."
        ]
    ],
    "pageTitle": "Common Elements: \"Kinds\"   |   Google Data APIs   |   Google Developers",
    "title": "",
    "url": "https://developers.google.com/gdata/docs/2.0/elements",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 29,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 855362099,
    "recordOffset": 855330697,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{111648=If a particular instance of a recurring event is deleted, then that instance appears as a <gd:recurrenceException> containing a <gd:entryLink> that has its <gd:eventStatus> set to \"http://schemas.google.com/g/2005#event.canceled\". (For more information about canceled events, see RFC 2445.), 106505=Specifically, the string usually begins with a DTSTART property that indicates the starting time of the first instance of the event, and often a DTEND property or a DURATION property to indicate when the first instance ends. Next come RRULE, RDATE, EXRULE, and/or EXDATE properties, which collectively define a recurring event and its exceptions (but see below). (See section 4.8.5 of RFC 2445 for more information about these recurrence component properties.) Last comes a VTIMEZONE component, providing detailed timezone rules for any timezone ID mentioned in the preceding properties., 24334=The collection of elements that together describe a contact is called the Contact \"kind.\" Some of the elements in the Contact kind are ordinary Atom or RSS elements; others are defined by Google in a namespace called the \"Google Data namespace.\" By convention, the Google Data namespace is usually referred to in XML code using the gd: alias; for example, the element that contains a telephone or fax number is <gd:phoneNumber>. The schema URL for the Google Data namespace is http://schemas.google.com/g/2005., 148169=Last updated April 27, 2012., 108592=A recurring event that takes place every morning from 6:00 to 7:00 a.m., Pacific time, from March 14 through March 21, 2006:, 110729=For example, say you have a meeting every Tuesday and Thursday at 2:00 p.m. If you change the attendance list for this Thursday's meeting (but not for the regularly scheduled meeting), then it becomes an exception. If you change the time for this Thursday's meeting (but not for the regularly scheduled meeting), then it becomes specialized., 131673=A two-day event (on June 6 and June 7) with a string description:, 49324=All categories below are in the http://schemas.google.com/g/2005 scheme., 93122=Equivalent to the Recurrence ID property specified in section 4.8.4.4 of RFC 2445. Appears in every instance of a recurring event, to identify the original event.}",
    "lastModified": "Fri, 27 Apr 2012 20:51:11 GMT",
    "textBeforeTable": "Properties Note: If you're using the Contact kind in the context of the Contacts API, please remember that the Contact kind version 2.0 (described in this document) is used by the Contacts API since version 3.0 of the API. Category element: <atom:category scheme=\"http://schemas.google.com/g/2005#kind\" term=\"http://schemas.google.com/contact/2008#contact\"/> Represents a contact: a person, a venue such as a club or a restaurant, or an organization. Contact kind Elements and attributes are presented in standard XPath notation. Optional element, multiple instances allowed elementName* Optional element elementName? Required element elementName In the tables in this document, we use the following conventions for required and optional elements: Typographical conventions The information in this document doesn't cover all possible properties and attribute values for kinds. Services may extend kinds, so a particular service may use properties and values not included in this document. Extensibility One approach that might help is to use the client libraries we provide rather than to try to construct kinds by hand. The client libraries provide various methods for adding and changing data in an entry of a given kind; see the client library documentation for details. It may be hard to figure out exactly what information you need to include when creating an entry of a particular kind, especially because some elements in the kinds contain other kinds. Creating kinds We also don't include information about standard Atom elements that would be meaningless in the",
    "textAfterTable": "gd:where? A place associated with the contact. Examples <entry xmlns='http://www.w3.org/2005/Atom' xmlns:gd='http://schemas.google.com/g/2005'> <category scheme='http://schemas.google.com/g/2005#kind' term='http://schemas.google.com/contact/2008#contact'/> <title>Elizabeth Bennet</title> <content>My good friend, Liz. A little quick to judge sometimes, but nice girl.</content> <gd:email rel='http://schemas.google.com/g/2005#work' primary='true' address='liz@gmail.com'/> <gd:email rel='http://schemas.google.com/g/2005#home' address='liz@example.org'/> <gd:phoneNumber rel='http://schemas.google.com/g/2005#work' primary='true'> (206)555-1212 </gd:phoneNumber> <gd:phoneNumber rel='http://schemas.google.com/g/2005#home'> (206)555-1213 </gd:phoneNumber> <gd:phoneNumber rel='http://schemas.google.com/g/2005#mobile'> (206) 555-1212 </gd:phoneNumber> <gd:im rel='http://schemas.google.com/g/2005#home' protocol='http://schemas.google.com/g/2005#GOOGLE_TALK' address='liz@gmail.com'/> <gd:postalAddress rel='http://schemas.google.com/g/2005#work' primary='true'> 1600 Amphitheatre Pkwy Mountain View, CA 94043 </gd:postalAddress> <gd:postalAddress rel='http://schemas.google.com/g/2005#home'> 800 Main Street Mountain View, CA 94041 </gd:postalAddress> <gd:organization> <gd:orgName>Google, Inc.</gd:orgName> <gd:orgTitle>Tech Writer</gd:orgTitle> </gd:organization> </entry> Profile kind Represents a profile associated with a Google user or other entity. The Profile kind shares much structure with the Contact kind. However, it differs in some ways: it cannot contain extended properties or be marked as deleted, for example. Category element: <atom:category scheme=\"http://schemas.google.com/g/2005#kind\" term=\"http://schemas.google.com/contact/2008#profile\"/> The Profile kind was introduced in version 3.0 of the Contacts API. Properties Property Description atom:category* Categories. Instances with the @label attribute are treated as tags. For information on using the @scheme attribute, see the \"Category element\" note at beginning of this section. atom:content Notes about the profile. atom:link* Links to related information. Specifically, atom:link[@rel='alternate'] links to an HTML page describing the profile. atom:title Profile's name. This field is read only. gd:email* Email addresses. gd:im* IM addresses. gd:name? Name, in structured form. gd:organization* Organization. gd:phoneNumber*",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}