{
    "relation": [
        [
            "",
            "View files and folders",
            "Download or sync files to another device",
            "Make a copy of files to save in Google Drive",
            "Comment and suggest edits in files",
            "Edit documents, spreadsheets, presentations, and drawings",
            "Share or unshare files with others",
            "Add or remove files from a folder",
            "Upload and delete file versions",
            "Delete files and folders",
            "Transfer ownership of files and folders to others"
        ],
        [
            "Can view",
            "x",
            "x",
            "x",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Can comment",
            "x",
            "x",
            "x",
            "x",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Can edit",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "",
            ""
        ],
        [
            "Is owner",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x"
        ]
    ],
    "pageTitle": "Change your sharing settings - Docs editors Help",
    "title": "",
    "url": "https://support.google.com/docs/answer/2494886?hl=en&ctx=cb&src=cb&cbid=16zn1wzkjbivf&cbrank=0&rd=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883347639,
    "recordOffset": 883332980,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Select a link sharing option. To see a full list of options, click More. These options include:   Click the dropdown menu below \"Link sharing on\" in the sharing box. Click Share for files or the share icon for folders in the top-right corner of the screen . Open the file or folder. Sign in to Drive or a Docs, Sheets, or Slides home screen. To choose who can see your file or folder: You can control how visible your files are to other people, from keeping files completely private to allowing anyone on the web to see them. Choose how visible to make your file or folder You can choose how visible your files and folders are, as well as what others can do with these files and folders, when you share in Google Drive, Docs, Sheets, and Slides. Change your sharing settings Help forumForum Docs editors Docs editors Help",
    "textAfterTable": "  x x Add or remove files from a folder     x x Upload and delete file versions     x x Delete files and folders       x Transfer ownership of files and folders to others       x Change what others can do with your file After you’ve shared a file with others, you can change the type of access specific people or groups can have. Open the file. Click Share in the top-right corner. Click Advanced in the bottom-right corner of the sharing box. Using the dropdown menu next to the user’s name, select the type of access you want them to have. Click Done. Remove sharing privileges If you are the owner of a file or folder, you can choose to remove editors’ ability to share files with others in Google Drive, Docs, Sheets, and Slides. This allows you to control everyone who is able to view or edit the file or folder. Related topics How to share a file or folder Transfer ownership of files and folders Share this:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}