{
    "relation": [
        [
            "Citing Patent",
            "US6994591 *",
            "US7625231",
            "US7690923",
            "US20050032428 *",
            "WO2009102607A1 *"
        ],
        [
            "Filing date",
            "Aug 9, 2004",
            "Jun 26, 2008",
            "Feb 13, 2008",
            "Aug 9, 2004",
            "Feb 5, 2009"
        ],
        [
            "Publication date",
            "Feb 7, 2006",
            "Dec 1, 2009",
            "Apr 6, 2010",
            "Feb 10, 2005",
            "Aug 20, 2009"
        ],
        [
            "Applicant",
            "Hon Hai Precision Ind. Co., Ltd",
            "Yamaichi Electronics Co., Ltd.",
            "Fci Americas Technology, Inc.",
            "Chien Hsun Huang",
            "Fci Americas Technology Inc"
        ],
        [
            "Title",
            "Electrical connector for use with flexible printed circuit",
            "Adaptor for cable connector",
            "Two-sided FPC-to-PCB compression connector",
            "Electrical connector",
            "Two-sided fpc-to-pcb compression connector"
        ]
    ],
    "pageTitle": "Patent US6808412 - Cable connector - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6808412?dq=%235,519,867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468165307,
    "recordOffset": 468147640,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27564=This application claims priority from Japanese Patent Application No. 2002-134691 filed May 9, 2002, which is incorporated hereinto by reference.}",
    "textBeforeTable": "Patent Citations The present invention has been described in detail with respect to preferred embodiments, and it will now be apparent from the foregoing to those skilled in the art that changes and modifications may be made without departing from the invention in its broader aspects, and it is the intention, therefore, in the appended claims to cover all such changes and modifications as fall within the true spirit of the invention. In this regard, while the contact terminals 42 ai are provided so that the contact section 42 a is located beneath the group of electrodes 32E of the flexible printed circuit 32 in the above-mentioned embodiment, the contact terminals may have a structure other than the above, in which the contact terminals may be provided so that the group of electrodes 32E of the flexible printed circuit 32 are inserted into the cable accommodating section 40 to have the upward position and brought into contact with the contact terminals. On the other hand, when the group of electrodes 32E and the back panel 34 in the flexible printed circuit 32 are removed from the connector body 38, the operating section 44M is pressed against the elastic force of the leaf springs 48A and 48B, whereby the group of electrodes 32E and the back panel 34 in the flexible printed circuit 32 are withdrawn through the space 44 a against the elastic force of the contact terminals",
    "textAfterTable": "US5213534 * Jul 31, 1992 May 25, 1993 Molex Incorporated Electrical connector assembly for flat flexible cable US5562487 * Dec 6, 1994 Oct 8, 1996 Molex Incorporated Electric connector US5738545 * Feb 5, 1997 Apr 14, 1998 Japan Aviation Electronics Industry, Limited Connection device which is electromagnetically shielded with simple structure US5993247 * Dec 1, 1997 Nov 30, 1999 General Motors Corporation Electrical connection for flex circuit device US6022242 * May 8, 1998 Feb 8, 2000 Thomas & Betts International, Inc. Connector used for flexible flat cable US6056572 * Oct 5, 1998 May 2, 2000 Japan Solderless Terminal Manufacturing Co., Ltd. Connector for printed circuit boards US6375486 * Jun 6, 2001 Apr 23, 2002 Hon Hai Precision Ind. Co., Ltd. Card connector assembly having a retention mechanism US6503096",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}