{
    "relation": [
        [
            "Date",
            "Oct 2, 2001",
            "Sep 30, 2003",
            "Jul 17, 2009",
            "Aug 11, 2009",
            "Mar 11, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: HEWLETT-PACKARD COMPANY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KURTZ, BARRY D.;HALEY, LARRY W.;REEL/FRAME:012218/0537 Effective date: 20010910",
            "Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY L.P.,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HEWLETT-PACKARD COMPANY;REEL/FRAME:014061/0492 Effective date: 20030926",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6988086 - Document services management including availability reporting of document ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6988086?dq=4168396",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472752007,
    "recordOffset": 472728947,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30808=This application is related to Non-Provisional U.S. patent application Ser. No. 09/782,765, entitled “DOCUMENT DISTRIBUTION SYSTEM AND METHOD WITH CONSOLIDATED DOCUMENT SERVICES MANAGEMENT”, filed on Feb. 13, 2001, assigned to the assignee of the present invention, and incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although specific embodiments have been illustrated and described herein for purposes of description of the preferred embodiment, it will be appreciated by those of ordinary skill in the art that a wide variety of alternate and/or equivalent implementations may be substituted for the specific embodiments shown and described without departing from the scope of the present invention. Those with skill in the chemical, mechanical, electro-mechanical, electrical, and computer arts will readily appreciate that the present invention may be implemented in a very wide variety of embodiments. This application is intended to cover any adaptations or variations of the preferred embodiments discussed herein. Therefore, it is manifestly intended that this invention be limited only by the claims and the equivalents thereof. Furthermore, by providing document distribution system 10 with availability analysis system 60, an availability of document distribution services 24 can be monitored and availability reports 70 of such availability can be generated. As such, which document distribution services 24 are working and/or available, including, for example, how long and/or how well document distribution services 24 have been working and/or available can reported. Thus, system administrator 58, for example, can review real-time as well as historical analysis of the availability of document distribution services 24, including the availability of document distribution resources 23 providing document distribution services 24. Accordingly, proactive measures can be taken to ensure the availability of document distribution services 24 to users",
    "textAfterTable": "* IBM Technical Disclosure Bulleting; Title: Collaborative Multimedia Annotation using a Centralized Document server; vol. 38; Sep. 1995. * Cited by examiner Classifications U.S. Classification 705/51, 380/201, 380/203 International Classification G06Q10/10, G06Q99/00, H04L29/08 Cooperative Classification H04L69/329, H04L67/16, G06Q10/10 European Classification G06Q10/10, H04L29/08A7, H04L29/08N15 Legal Events Date Code Event Description Oct 2, 2001 AS Assignment Owner name: HEWLETT-PACKARD COMPANY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KURTZ, BARRY D.;HALEY, LARRY W.;REEL/FRAME:012218/0537 Effective date: 20010910 Sep 30, 2003 AS Assignment Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY L.P.,TEXAS Free format text: ASSIGNMENT",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}