{
    "relation": [
        [
            "Citing Patent",
            "US8473720 *",
            "US8533239 *",
            "US8740701 *",
            "US9033799",
            "US9076290",
            "US20090037877 *",
            "US20100317437 *",
            "US20110219040 *"
        ],
        [
            "Filing date",
            "Dec 19, 2006",
            "May 16, 2011",
            "Jun 10, 2010",
            "Dec 30, 2013",
            "Aug 9, 2012",
            "Dec 19, 2006",
            "Jun 10, 2010",
            ""
        ],
        [
            "Publication date",
            "Jun 25, 2013",
            "Sep 10, 2013",
            "Jun 3, 2014",
            "May 19, 2015",
            "Jul 7, 2015",
            "Feb 5, 2009",
            "Dec 16, 2010",
            "Sep 8, 2011"
        ],
        [
            "Applicant",
            "Dxo Labs",
            "Ca, Inc.",
            "Wms Gaming, Inc.",
            "Igt",
            "Collisse Group Limited",
            "Dxo Labs",
            "Wms Gaming, Inc.",
            "Computer Associates Think, Inc."
        ],
        [
            "Title",
            "Method for providing data to a digital processing means",
            "Data packaging system and method",
            "Controlling wagering game system audio",
            "Synchronizing audio in a bank of gaming machines",
            "Application monetization platform",
            "Method for providing data to a digital processing means",
            "Controlling wagering game system audio",
            "Data packaging system and method"
        ]
    ],
    "pageTitle": "Patent US7901291 - Gaming device operable with platform independent code and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7901291?ie=ISO-8859-1&dq=3798359",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459648395,
    "recordOffset": 459609180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45785=This application claims the benefit of U.S. Provisional Patent Application entitled “Gaming Device Operable With Platform Independent Code and Method,” Ser. No. 60/325,974, filed Sep. 28, 2001.}",
    "textBeforeTable": "Patent Citations While the present invention has been described in connection with what is presently considered to be the most practical and preferred embodiments, it is to be understood that the invention is not limited to the disclosed embodiments, but on the contrary is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the claims. It is thus to be understood that modifications and variations in the present invention may be made without departing from the novel aspects of this invention as defined in the claims, and that this application is to be limited only by the scope of the claims. The platform or operating system sold under the trademark MACINTOSH™, has a graphical user interface (GUI) that utilizes windows, icons, and a mouse to make it relatively convenient for novices to use the computer productively. Rather than learning a complex set of commands, the user can operate a computer with this operating system by pointing to a selection on a menu and clicking a mouse button. The GUI is embedded into this operating system which means that all applications that run on a compatible computer have a similar user interface. The platform or operating system sold under the trademark MICROSOFT WINDOWS™, is a family of operating systems for personal computers. This family of operating systems, adopted by much of the personal computer world, provides a graphical user interface",
    "textAfterTable": "US4618150 Mar 6, 1985 Oct 21, 1986 Kabushiki Kaisha Universal Game machine with selective stop means for moving display US4624459 Sep 12, 1985 Nov 25, 1986 Bally Manufacturing Corporation Gaming device having random multiple payouts US4660107 Mar 8, 1984 Apr 21, 1987 Chippendale Jr Arthur Method and apparatus for cueing and pacing in audio and audio-visual work US4695053 Mar 7, 1986 Sep 22, 1987 Bally Manufacturing Corporation Gaming device having player selectable winning combinations US4712189 Oct 23, 1984 Dec 8, 1987 Hitachi, Ltd. Table driven translator US4732386 Feb 19, 1986 Mar 22, 1988 Howard Rayfiel Visible randomly intermeshing, multi-wheel chance game apparatus US4733593 Mar 19, 1987 Mar 29, 1988 Peter Rothbart Mixed meter metronome US4791558 Feb 13, 1987 Dec 13, 1988 International Business Machines Corporation System and method for generating an object module in a first format and then converting the first format into a format which is",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}