{
    "relation": [
        [
            "Date",
            "12 Jul 2006",
            "18 Aug 2010",
            "24 Oct 2014",
            "18 Mar 2015",
            "5 May 2015"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20150318"
        ]
    ],
    "pageTitle": "Patent US6533741 - Articulated upper extremity splint to immobilize and support an injured limb - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6533741",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471125231,
    "recordOffset": 471099707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27375=The patent to Lee et al., U.S. Pat. No. 5,342,288, issued on Aug. 30, 1994, for Traction Splint, discloses a traction splint for a long bone extremity fracture in which the traction splint includes a frame. The length of the frame and an angle of an ischial pad of the traction splint relative to the frame are adjusted simultaneously. The frame includes side members. Each side member includes parallel rods. The parallel rods are telescopically received by respective tubes of the side members. By retracting and extending the rods into the tubes, respectively, the extent of the respective rods are adjustable. For releasably securing the tubes, respectively, in selected positions relative to the rods, lock nuts are provided. The inner wall of each of the lock nuts is threaded. The ends of the tubes facing the rods, respectively, are formed with external threads and are received, respectively, by the internally threaded nuts. Disposed within each of the bores of the lock nuts are temporarily yieldable collets. A tight releasable locking engagement is provided between the rods and the tubes, respectively, for maintaining the adjusted length of the traction splint., 26399=In the U.S. patent to Lee, U.S. Pat. No. 4,419,991, granted on Dec. 13, 1983, for a Splint, there is disclosed a splint that includes a frame. The frame comprises upper and lower limb support sections pivotally and rotatably interconnected. The support sections are interconnected so that one section can be adjusted to a position inclined upwardlly or downwardly relative to the other section, or can be moved to a position extending laterally at an angle away from the other section, or can be adjusted to a position involving up, down and lateral movement of the sections for the purpose of angulated limb section. Each section includes parallel side members. Each side member includes a rod telescopically received by a tube. A cylindrical nut is threaded on the threaded end of each of the tubes and is arranged to releasably press the tube into frictional engagement with the associated rod for adjusting independently the length of each side member., 39564=The locking device 31 includes a cylindrically-shaped nut 32 (FIGS. 5 and 6). The nut 32 is formed with an axial bore 33. The inner wall of the nut 32 surrounding the bore 33 is threaded. The end of tube 26 facing the rod 25 is formed with external threads and is received by the bore 33 of the nut 32. Disposed within the bore 33 of the nut 32 is a temporarily yieldable collet 34. The collet 34, in the exemplary embodiment, is made of brass. At the end of the rod 25 facing the trough 27 is an internally threaded collet stop 35 with a bearing surface end to prevent the collet 34 from being removed from the rod 25. The rod 25 passes freely through the nut 32 and the collet 34 and enters the tube 26. The rod 25 is detachably secured to the collet stop 35 through threaded engagement. By rotating the nut 32 into threaded engagement with the tube 26 to move the nut 32 toward the trough 27, the collet 34 is urged toward the tube 26 and the collet 34 is temporarily compressed by the wall surrounding the bore 33 of the nut 32 until a tight releasable locking engagement is made between the rod 25 and the tube 26. The compression of the collet 34 causes the collet 34 to releasably grip the rod 25. The releasable locking devices 30 and 31 are of the type disclosed in the U.S. patent to Lee, et al., U.S. Pat. No. 5,342,288, granted on Aug. 30, 1994 for Traction Splint and is disclosed herein by reference., 28571=Reel Research And Development, Inc. of Ben Lomond, Calif., during the year 1982 manufactured and sold The Reel Splint pediatric articulated traction splint, Reel Splint 8800 Series. The Reel Splint pediatric articulated traction splint has been used as an upper extremity traction splint and includes a frame. The frame comprises upper and lower limb support sections pivotally and rotatably interconnected. The support sections are interconnected so that one support section can be adjusted relative to the other support section upwardly and downwardly, or can be moved to a position extending laterally or at an angle away from the other support section. Each support section includes parallel rods. The parallel rods are telescopically received by tubes, respectively, for adjusting respectively the length at which each parallel rod extends outwardly from the associated tube. Lock nuts, respectively, releasably secure the rods in the adjusted positions to the associated tubes., 29574=In the patent to Maddox, U.S. Pat. No. 1,340,630, issued on May 18, 1920, for an Arm Abduction Splint, there is disclosed a splint for an injured arm. The splint includes a support frame to retain an injured arm in a desired position. The frame comprises rods that are pivotally and rotatably moved relative to one another and are releasably secured in the adjusted position. Trough-shaped plates are adjustably movable on the associated rods in the axial direction thereof and are releasably secured in the adjusted position., 30120=The patent to Santana, U.S. Pat. No. 5,312,322, issued on May 17, 1994, for Three Point Extension Splint To Treat Flexion Contractures About Limb Synovial Hinge Joints, discloses a three point extension splint for correcting a flexion contracture about a limb synovial hinge joint. The three point extension splint comprises a proximal contact member for contacting the proximal section of an extremity above the flexion crease of a synovial hinge joint and a distal contact member for contacting the distal section of an extremity below the flexion crease of the synovial hinge joint. A resilient hinge joins the proximal contact member and the distal contact member. A cupping member forms the posterior assembly. Adjustable releasable straps join the bridge to the cupping member and secure the cupping member to the synovial hinge joint. Adjustable releasable straps secure the proximal contact member and the distal contact hinge member to the proximal section of the extremity above the flexure crease of the synovial hinge joint and below the flexure crease of the synovial hinge joint, respectively.}",
    "textBeforeTable": "Patent Citations Depicted in FIG. 10 is a suitable adjunctive pad 90. The pad 90 extends along the length of the proximal support section 15 and along the length of the distal support section 16. The pad 90, in the exemplary embodiment, is of a width to accommodate the trough 22 and the trough 27. In the exemplary embodiment the width of the pad 90 is approximately four and one-half inches. In the exemplary embodiment, the thickness of the pad 90 is approximately one quarter to one-half inch in length. In the exemplary embodiment, the core of the pad 90 is made of a suitable soft and padded foam material. Such foam material may be closed cell to inhibit moisture absorption. An outer closed cell material or nylon envelopes the foam material of the pad 90 to prevent the seeping of foreign substances or contaminant fluids into the core of the pad 90. The pad 90 provides alignment and support for fractures which are adjacent to the elbow of the injured person. The pad 90 increases patient comfort and eliminates the use of adjunctive medical product padding. Suitable seams, not shown, are formed in the pad 90 intermediate the ends thereof for flexure. In the exemplary embodiment, the pad 90 is freely disposed between the limb of the injured person and the support sections 15 and 16 of the frame 11. At the free end of the trough",
    "textAfterTable": "US4947835 5 Apr 1989 14 Aug 1990 Dynasplint Systems, Inc. Adjustable splint assembly US5046488 * 9 Mar 1990 10 Sep 1991 Schiek Sr James W Support belt for the lumbar vertebrae US5232435 4 Feb 1992 3 Aug 1993 Saul Leibinsohn Splint US5312322 2 Nov 1992 17 May 1994 The United States Of America As Represented By The Secretary Of The Navy Three point extension splint to treat flexion contractures about limb synovial hinge joints US5342288 3 Aug 1992 30 Aug 1994 Roger Lee Traction splint US5358469 5 Aug 1991 25 Oct 1994 Ultraflex Systems, Inc. Dynamic splint US5383844 * 21 Sep 1992 24 Jan 1995 Smith & Nephew Donjoy, Inc. Humeral fracture brace US5407420 * 12 Nov 1992 18 Apr 1995 Smith & Nephew Donjoy, Inc. Fully adjustable shoulder brace",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}