{
    "relation": [
        [
            "Date",
            "May 24, 2004",
            "Jul 6, 2009",
            "Oct 21, 2009",
            "Oct 21, 2009",
            "Aug 9, 2013",
            "Dec 27, 2013",
            "Feb 18, 2014"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SAMSUNG ELECTRONICS CO., LTD., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KIM, DAE-JIN;REEL/FRAME:015365/0176 Effective date: 20040510",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "Effective date: 20131227"
        ]
    ],
    "pageTitle": "Patent US6980426 - Tablet monitor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6980426?dq=6,826,762",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472077575,
    "recordOffset": 472056159,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23994=This application claims the benefit of Korean Patent Application No. 2003-53835, filed on Aug. 4, 2003, in the Korean Intellectual Property Office, the disclosure of which is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although a few embodiments of the present invention have been shown and described, it would be appreciated by those skilled in the art that changes may be made in these embodiments without departing from the principles and spirit of the invention, the scope of which is defined in the claims and their equivalents. Further, at the same time, when the monitor main body and the supporting stand are connected to each other, the handle may be connected to the monitor main body. As is described above, according to the present invention, the monitor main body and the supporting stand may be simply and firmly connected to each other, so that the tablet monitor is used with more convenience. If the first connecting protrusion 54 comes out of the first connecting hole 52, the pin member 56 elastically moves down, so that the handle 30 is separated from the monitor main body 20. Thus, the handle 30 may be folded. Further, the first connecting protrusion 54 of the supporting stand 40 is inserted in the first connecting hole 52 provided in the handle 30, so that the pin member 56 moves up, and then, is inserted in the pin supporting hole 26 on the handle accommodating part 24. Through this process, the handle 30 is connected to the monitor main body 20. The second connecting protrusion 64 of the supporting stand",
    "textAfterTable": "KR19990024544A Title not available KR19990041572A Title not available KR20010059724A Title not available KR20010083865A Title not available KR20020062624A Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7551426 * Mar 30, 2007 Jun 23, 2009 Compal Electronics, Inc. Portable electronic apparatus with function of adjusting tilt angle of body and base thereof US7591444 * Jan 3, 2005 Sep 22, 2009 Hannspree, Inc. Foldable stand for a display US8096517 * Jul 23, 2009 Jan 17, 2012 Steven Hamilton Steering",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}