{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,151 topics 2,126,246 replies",
            "85,563 topics 1,154,127 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,768 replies",
            "5,996 topics 75,824 replies",
            "50,550 topics 466,313 replies",
            "22,767 topics 196,335 replies",
            "4,274 topics 60,518 replies",
            "1,127 topics 8,222 replies",
            "3,609 topics 115,768 replies"
        ],
        [
            "Last Post Info",
            "GTA V Deeper Story Themes/M... By Official General 4 minutes ago",
            "Did anyone had problem with... By Militia 41 minutes ago",
            "6 Star Wanted Level Survival? By Militia A day ago",
            "Is Lance mentally ill? By hot-temper27 2 hours ago",
            "Unique Vehicles By Militia 15 hours ago",
            "PROOFED & RARE vehicle... By OrionSR 2 minutes ago",
            "Reasons why Vice City is be... By hot-temper27 An hour ago",
            "Why Doesn't Claude Speak? By dadrilla 55 minutes ago",
            "The incredible Arachnid By Cerium 9 hours ago",
            "Why everyone hates Luis Lopez? By theGTAking101 5 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=142971&p=1876507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107140431,
    "recordOffset": 107113912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12839=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14454=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 21248=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 103129=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9470=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 47733=Google, Bing, Yahoo, Crubbiestimp42, Benny164, Loves GTA, Midnight Hitman, nls_whs_2010, Terra_S4, pockings, Remmer, monkb4skunk, auntjeff, blacknambala, Choco Taco, Jlogano22, BenStone, YngDady, This Guy Is Here, VikDarkbomb, saintsrow, statistic, CjLosSantos, xInfamousRYANx, timiw, FreshPrinceOfLosSantos, TimmyM56, Google Mobile, Owl Man, toxluv, xiaoshung, iTs Empire xD, CanOdope, unholyblade29, joeACdude43, dbthesuperstar, Facebook, Lebowski_RS, DrunkenMunkey78, jamesr1994, Shadowfennekin, TheIllaDopest, Sneakerhead., MetroBaller, Pegassi Autobot, Fozzie_420, Viezo, 10_STAX, Footballgrl70, JaegerPilot1, _Douglas_, JASONBRODYSONOFRAMBO, Warablo, Hominin, Pat, Ac3snip3r12345, TwisterVictor1, darkmajesty06, esato, NcShane, Synshade, Captain Sensib1e, Anotic, McH2Oz2, RussianCommie, HeavyDuke, Ray, Red Lynx 23, Official General, NikkoCharger, KoingWolf, ash-274, mhe77, Mr. Fahrenheit, Nikobellic23, Swoorup, lord tammerlain, Indignation, Lil_Timmis, fireguy109, Bob_Dole, rapha1996, ap4321, IDredMan, livejoker, driver7, The Mysterious One, Nebenezer, transambill, Roadrage158, !M4G3_N4T10N, redeyejedi, Markuza97, Hyde Original, flyboy7, LittleFamily580, theGTAking101, MythicBurritoz, Smale45, zCows, Mauron, Fonshway, JRC99, gunziness, The_Riddler, DeejayProdigy, Shiest Bubble, Black_MiD, Kyle17, StangOne50, X Reaper X, axel4488, GTAonlineplayer, SM64Guy, BurnettVice, OrionSR, quadro09, GTA_Matt24, Quarthon, dTrutha, RiseAgainBH, East_On_Bimmer_St, veryrarevibes, SuperKingBender, DeucesR, GTAV112, gtuned, countingfingers, kk9fan97, Lupin_III, Ezuu, Bane X01, FMMZ, PoeticWhisper, thehambone, blackblue, Shenmue18, RageJenB, Nameless Foot Soldier, superthunder866, ZODIAC 4 v2, WhosYu, JPull07, A.O.D.88, Slam_Jones, crack1king, synn8773, TweektheLegend, Ettayaa_Ghost, chriscarr99, Sims3RULES, MagnumForce, jedijosh920, zSaintX, Turner5150, Liquid715, RedRyder2142, Valtiel150, Crackhead_Ben, Brazil301, Neuling2000, Joethebuilder, Lilscotton, JSIII95, Kuru821, mattmathers, CaptainMarvel, Scarface187, Paul_silvana10910, NRShaggy, Saliva, Mr. Jago, Zello, Run Down That Guy, miles2195, customkingpimp, No_Future, Wyattw26, ClaudX, Twin Turbo, ice_phoenix_66, Dbzk1999, LeeTone, Cudwieser, poppafewpills, RM76, UltraGizmo64, owlboogie, yakoshadow, Cancerslug, SomeDBKid, Maxistar102, Neopolitan, D3ViOU5, Nick1020, A Maned Wolf, Rented, zeffer604, Niobium, Mach1bud, TexasRocks, sweller, JackCarter, swe_seifer, o_Marvelous, Tekno_Gecko, E.E.27, 16764=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 19004=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By VikDarkbomb The Paleto Bay Mayors Offic... 614,096 replies 15,211 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By YngDady Free Bravado Buffalo S. 2,288,144 replies 113,585 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,486 topics 416,739 replies Adding contacts to iFruit (... By jedijosh920 24 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}