{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,174 topics 2,126,729 replies",
            "85,563 topics 1,154,178 replies",
            "1,071 topics 11,082 replies",
            "4,218 topics 64,769 replies",
            "5,996 topics 75,831 replies",
            "50,556 topics 466,339 replies",
            "22,767 topics 196,345 replies",
            "4,275 topics 60,541 replies",
            "1,127 topics 8,223 replies",
            "3,611 topics 115,894 replies"
        ],
        [
            "Last Post Info",
            "Top 5 best V characters? By Johnny Spaz A minute ago",
            "Character switch scenarios By Shadowfennekin A minute ago",
            "The Ultimate 100% Save File... By theIdahoSyndicate 5 hours ago",
            "Which Vehicle Do You Prefer? By PhillBellic 18 hours ago",
            "Was LCS as good as other GTAs? By Militia 11 hours ago",
            "Anyone really dislikes dual... By OG Viking 16 minutes ago",
            "The Ultimate 100% Save File... By GTAGuy1995 2 minutes ago",
            "Playstation store version ps3 By L337jonas 3 hours ago",
            "What do you hate of GTA 2? By Cerium 10 hours ago",
            "Your First GTA By Edward Nashton 7 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=125920&p=1511197",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105112277,
    "recordOffset": 105096664,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18682=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14110=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20971=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 57185=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9391=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12558=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16493=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By quadro09 The Paleto Bay Mayors Offic... 614,377 replies 15,213 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Blujet95 Show us your NG character!... 2,290,523 replies 113,658 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,507 topics 416,485 replies Trying to replace MP clothe... By ShenLong Kazama 8 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}