{
    "relation": [
        [
            "No.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            ""
        ],
        [
            "Club",
            "HOU",
            "MIN",
            "SEA",
            "BAL",
            "KC",
            "CHI",
            "SD",
            "PIT",
            "MIA",
            "COL",
            "OAK",
            "NYM",
            "CWS",
            "CIN",
            "CLE",
            "WSH",
            "TOR",
            "LAD",
            "STL",
            "SF",
            "ATL",
            "TOR",
            "STL",
            "BOS",
            "TB",
            "ARI",
            "MIL",
            "MIL",
            "TEX",
            "NYY",
            "BOS",
            ""
        ],
        [
            "Player",
            "Correa, Carlos",
            "Buxton, Byron",
            "Zunino, Mike",
            "Gausman, Kevin",
            "Zimmer, Kyle",
            "Almora, Albert",
            "Fried, Max",
            "Appel, Mark",
            "Heaney, Andrew",
            "Dahl, David",
            "Russell, Addison",
            "Cecchini, Gavin",
            "Hawkins, Courtney",
            "Travieso, Nick",
            "Naquin, Tyler",
            "Giolito, Lucas",
            "Davis, D.J.",
            "Seager, Corey",
            "Wacha, Michael",
            "Stratton, Chris",
            "Sims, Luke",
            "Stroman, Marcus",
            "Ramsey, James",
            "Marrero, Deven",
            "Shaffer, Richie",
            "Trahan, Stryker",
            "Coulter, Clint",
            "Roache, Victor",
            "Brinson, Lewis",
            "Hensley, Ty",
            "Johnson, Brian",
            "TOTAL"
        ],
        [
            "Signed",
            "6/7",
            "6/13",
            "7/2",
            "7/13",
            "6/7",
            "7/10",
            "6/15",
            "DNS",
            "7/13",
            "6/12",
            "6/15",
            "6/8",
            "6/18",
            "6/22",
            "6/15",
            "7/13",
            "6/10",
            "6/30",
            "6/14",
            "6/12",
            "6/6",
            "7/3",
            "6/29",
            "6/20",
            "7/13",
            "6/9",
            "6/8",
            "6/8",
            "6/12",
            "7/13",
            "6/26",
            ""
        ],
        [
            "Value",
            "7.2",
            "6.2",
            "5.2",
            "4.2",
            "3.5",
            "3.25",
            "3",
            "2.9",
            "2.8",
            "2.7",
            "2.625",
            "2.55",
            "2.475",
            "2.375",
            "2.25",
            "2.125",
            "2",
            "1.95",
            "1.9",
            "1.85",
            "1.825",
            "1.8",
            "1.775",
            "1.75",
            "1.725",
            "1.7",
            "1.675",
            "1.65",
            "1.625",
            "1.6",
            "1.575",
            "81.75"
        ],
        [
            "Bonus",
            "4.8",
            "6",
            "4",
            "4.32",
            "3",
            "3.9",
            "3",
            "0",
            "2.6",
            "2.6",
            "2.625",
            "2.3",
            "2.475",
            "2",
            "1.75",
            "2.925",
            "1.75",
            "2.35",
            "1.9",
            "1.85",
            "1.65",
            "1.8",
            "1.6",
            "2.05",
            "1.713",
            "1.7",
            "1.675",
            "1.525",
            "1.625",
            "1.2",
            "1.575",
            "67.013"
        ],
        [
            "+/-",
            "-2.4",
            "-0.2",
            "-1.2",
            "0.12",
            "-0.5",
            "0.65",
            "0",
            "",
            "-0.2",
            "-0.1",
            "0",
            "-0.25",
            "0",
            "-0.375",
            "-0.5",
            "0.8",
            "-0.25",
            "0.4",
            "0",
            "0",
            "-0.175",
            "0",
            "-0.175",
            "0.3",
            "-0.012",
            "0",
            "0",
            "-0.125",
            "0",
            "-0.4",
            "0",
            "-4.592"
        ]
    ],
    "pageTitle": "Only one first-round Draft pick didn't sign as Friday's deadline passed | royals.com",
    "title": "Below is a look at when each first-round pick signed, how much he signed for vs. the assigned pick value and the difference between those two numbers. All dollar figures in millions.",
    "url": "http://m.royals.mlb.com/news/article/34843532",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 152564899,
    "recordOffset": 152533169,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11850=\"Our final offer exceeded the available bonus pool money and was essentially up to the last dollar we could offer prior to falling into the second-tier penalty, which would have resulted in the loss of a first-round Draft selection. While, as we have shown in past years, we are willing to be aggressive with our financial offer, we simply did not feel it was in the best interest of the organization to forfeit our first-round selection in the 2013 amateur Draft.\", 13868=It was a much more relaxed deadline day compared with 2011, with so many more picks this year signing early. Last year, 98 of the 331 players in the first 10 rounds were unsigned when deadline day began. This time around it was just 17 of 338. Only five of the top 60 were still out there when Friday began, compared with 34 of the top 60 a year ago., 14241=It appears that the new system also helped rein in spending. In 2011 the average bonus of first-rounders was $2.84 million. This year the 30 first-rounders who signed had an average bonus of $2.40 million. Teams even came in under this year's assigned value, spending $4.592 million less than the combined assigned values for the 31 picks who came to terms with teams., 15444=No teams went over their Draft pool so much as to lose a 2013 Draft pick. Several -- the Red Sox, Cubs, Astros, Royals, Dodgers, Mariners, Giants, Cardinals, Blue Jays and Nationals -- all unofficially went over their pools and will have to pay a subsequent tax., 14632=Much of the savings came from the top of the Draft, with the top 10 average bonus $2 million less than last year's top 10. That's also true in the comparison with the assigned pick value. It started with Carlos Correa at No. 1 signing for $2.4 million less than the assigned value of the pick. Mike Zunino, at No. 3, signed for $1.2 less than assigned pick value, Kyle Zimmer was a $500,000 \"discount\" at No. 5 and David Dahl cost the Rockies $100,000 less than value at No. 10. Each of the top 10 picks who signed this year received less than last year's equivalent picks. The top 10 picks -- minus No. 8 Appel -- received a combined $17.94 million less than picks 1 through 8 and pick No. 10 combined in 2011. The rest of the first round made $3.2 million more than a year ago.}",
    "textBeforeTable": "FIRST-ROUND SIGNINGS Appel will return to Stanford for his senior year, and the Pirates will get a compensation first-round pick in next year's Draft at No. 9 overall. Only Mark Appel, the No. 8 overall pick taken by the Pirates, did not sign. Because Pittsburgh didn't have too much wiggle room with its Draft pool, it was believed the most it would be able to offer Appel was approximately $4 million. 0 COMMENTS | MLB.com By Jonathan Mayo / Pirates GM Neal Huntington talks about taking Stanford pitcher Mark Appel with When 5 p.m. ET came and went, and the dust had settled, all but one of the first-round picks from the 2012 First-Year Player Draft were signed and presumably ready to start their professional careers. +",
    "textAfterTable": "\"We were unable to reach an agreement with first-round selection Mark Appel and bring him into our already strong organization,\" Pirates general manager Neal Huntington said in a released statement. \"Our final offer exceeded the available bonus pool money and was essentially up to the last dollar we could offer prior to falling into the second-tier penalty, which would have resulted in the loss of a first-round Draft selection. While, as we have shown in past years, we are willing to be aggressive with our financial offer, we simply did not feel it was in the best interest of the organization to forfeit our first-round selection in the 2013 amateur Draft.\" The new Draft rules state that any money spent above a team's pool, up to 5 percent over, will incur a tax. If a team goes over that threshold, it would then forfeit Draft picks. \"Selecting Mark was a calculated risk, as we knew he would be a difficult sign,\" Huntington continued. \"As an organization we need to continue to take these types of calculated risks. While we would have preferred to add Mark to the group of talented prospects in our system, we wish Mark, and his family, nothing but success in the future.\" The day began with just a half-dozen first-rounders still unsigned, but Andrew Heaney signed with the Marlins and Ty Hensley signed with the Yankees in the early afternoon. Richie Shaffer joined the Rays not long after that,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}