{
    "relation": [
        [
            "Season",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Career"
        ],
        [
            "GP/GS",
            "29/9",
            "24/0",
            "32/19",
            "32/32",
            "117/60"
        ],
        [
            "FG%",
            ".418",
            ".351",
            ".405",
            ".432",
            ".416"
        ],
        [
            "3PT%",
            ".250",
            ".000",
            ".277",
            ".349",
            ".308"
        ],
        [
            "FT%",
            ".563",
            ".533",
            ".720",
            ".822",
            ".715"
        ],
        [
            "Reb",
            "124",
            "33",
            "130",
            "194",
            "481"
        ],
        [
            "Ast",
            "33",
            "4",
            "31",
            "66",
            "134"
        ],
        [
            "Blk",
            "16",
            "1",
            "8",
            "21",
            "45"
        ],
        [
            "Stl",
            "57",
            "10",
            "67",
            "103",
            "237"
        ],
        [
            "Points",
            "186",
            "34",
            "250",
            "341",
            "821"
        ],
        [
            "PPG",
            "6.4",
            "1.4",
            "7.8",
            "10.7",
            "7.0"
        ]
    ],
    "pageTitle": "GOFROGS.COM - Chelsea Prince Bio - TCU Horned Frogs Official Athletic Site",
    "title": "",
    "url": "http://www.gofrogs.com/sports/w-baskbl/mtt/prince_chelsea00.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472900147,
    "recordOffset": 472871468,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40605=02/17/2015, 39572=03/19/2015, 57054=W. Basketball | 04/02/2015, 58983=W. Basketball | 03/20/2015, 41579=· Started all 32 games, averaging 32.3 minutes per contest. · Set the TCU single-season record with 103 steals. · Named Big 12 Defensive Player of the Year, becoming just the second Horned Frog to earn the league's top defensive honor, joining Sandora Irvin. · Ended career with 237 steals, ranking third in program history. · Led TCU with 6.1 rebounds per contest, grabbing 10 or more boards in five contests. · Led the Big 12 with 3.2 steals per game. · Set single-season career highs in points (341), points per game (10.7), minutes (1,033), made field goals (115), field-goal percentage (.432), made 3-pointers (37), 3-point percentage (.349), made free-throws (74), free-throw percentage (.822), rebounds per game (6.1), assists (66), blocks (21) and steals (103). · Scored in double figures in 19 contests with three double-doubles. · Registered three or more steals in 17 games. · Connected on 36 of first 38 attempts from the free-throw to open the season. · Opened the season with her second-career double-double, posting 11 points and 10 rebounds against Houston Baptist. · Followed up two games later with her third-career double-double, recording a then-career best 18 points with 12 rebounds against SMU. Went a perfect 11-for-11 from the free-throw line against the Mustangs. · Averaged 15.3 points during four-game span against Iowa State, No. 16 Oklahoma State, Kansas and Oklahoma to help TCU to 3-1 record. · Against the Cyclones, Prince scored the game-winning layup with 1.6 seconds left and stole the ensuing inbounds attempt to seal the 24-point comeback. · Posted 15 points off 4-of-5 effort from field and 6-of-6 performance from the charity stripe in win over No. 16 Oklahoma State. · Tallied a then-career best 19 points with three 3-pointers to help lead TCU to first win over Kansas in Lawrence on Jan. 14. · Posted 11 points and four steals in TCU's first-ever road win over Oklahoma State in Stillwater on Jan. 24. · Flirted with a triple-double performance in TCU's win over Texas on Feb. 1, posting 12 points, nine rebounds and seven steals while sinking a career-best four 3-pointers. · Connected on the go-ahead 3-pointer with just over a minute remaining and blocked the Longhorns' shot attempt on the other end to help seal the win. · Posted eight points, 10 rebounds, four assists and three steals in win over Texas Tech in Fort Worth on Feb. 8. · Racked up 17 steals in three-game span against Kansas State (Feb. 11), Oklahoma (Feb. 14) and Kansas (Feb. 17). · Tallied 16 points at No. 3 Baylor, highlighted by 8-of-8 performance from free-throw line. · Registered 11 points and eight rebounds in TCU's first-ever win over West Virginia on Feb. 24. · Averaged 16.5 points, 8.0 rebounds and 4.0 steals in TCU's pair of WNIT contests. · Helped TCU secure its first win in postseason play since 2008 over Stephen F. Austin with career-high 20 points and career-best five 3-pointers. · Followed up with double-double performance at Southern Miss, posting 13 points and 11 rebounds with 8-of-10 effort from charity stripe., 38687=01/07/2015, 59380=W. Basketball | 03/19/2015, 56380=The TCU women's basketball team hosted its 2014-15 End of Season Banquet at the Dee J. Kelly Alumni and Visitors Center on Wednesday evening to..., 39818=03/08/2015, 57894=TCU women's basketball head coach Raegan Pebley has announced four different options for camps during the month of June., 57104=TCU women's basketball seniors Donielle Breaux, Chelsea Prince and Natalie Ventress will participate in the invite-only 2015 Tampa Combine this weekend ..., 38183=04/02/2015, 38956=12/18/2014, 57502=TCU women's basketball supporters are invited to attend the 2014-15 End of Season Banquet held at the Dee J. Kelly Alumni and Visitors Center at 6:30 p...., 55986=W. Basketball | 04/22/2015, 41120=· Big 12 Defensive Player of the Year (2014-15) · All-Big 12 Honorable Mention (2014-15) · Big 12 All-Defensive Team (2014-15) · Four-time TCU Female Athlete of the Week, 56717=W. Basketball | 04/15/2015, 57452=W. Basketball | 03/31/2015, 58201=W. Basketball | 03/23/2015, 57844=W. Basketball | 03/25/2015, 58594=W. Basketball | 03/22/2015, 40325=02/24/2015, 39192=11/25/2014, 38448=03/23/2015, 47653=\u0095 Posted one of the better freshman campaigns in recent memory, recording six games of three or more steals, including back-to-back games of six steals against UNLV and Boise State. \u0095 Lone played in the Mountain West to post six or more steals in two conference games while leading the Frogs in steals in conference action. \u0095 Prince ranked third in the league in steals with 2.4 per contest and posted six games of three or more defensive rebound games, including four of four or more. \u0095 Opened the season grabbing a team-high and game-high 12 boards against Georgia. \u0095 Tallied eight points and six boards against UTSA. \u0095 Had a breakout game against Hartford, scoring 15 points on 6-of-9 shooting. \u0095 Named Mountain West Player of the Week after scoring 16 points against Lamar and 12 points against Houston. \u0095 Led TCU in scoring against Lamar on 7-of-10 shooting. \u0095 Scored 10 points against defending national champion Texas A&M, while also posting seven steals, which ranks sixth all-time for a single game at TCU. \u0095 Tallied a career-high four blocks against Sam Houston State while making her first career start. \u0095 Scored 14 points, highlighted by a 6-of-8 effort from the free-throw line, while also grabbing six steals for the second-straight game against Boise State., 40070=02/28/2015, 56330=W. Basketball | 04/16/2015}",
    "textBeforeTable": "\u0095 Tabbed as the No. 121 player nationally by Dan Olson Collegiate Girls Report. \u0095 Excelled in multiple sports at Dunbar High and was the 12th ranked guard in the state of Texas by Premier Basketball Report. \u0095 Also ranked in the top 150 players in Texas by Premier and sat in the top 150 players in the nation according to All-Star Girls Report. \u0095 Earned all-region and all-district team accolades during her junior season. \u0095 Closed out her high school career averaging 11 points per game and four steals during her senior campaign. \u0095 Also earned letters in track and field and cross country. DUNBAR HIGH SCHOOL \u0095 Posted one of the better freshman campaigns in recent memory, recording six games of three or more steals, including back-to-back games of six steals against UNLV and Boise State. \u0095 Lone played in the Mountain West to post six or more steals in two conference games while leading the Frogs in steals in conference action. \u0095 Prince ranked third in the league in steals with 2.4 per contest and posted six games of three or more defensive rebound games, including four of four or more. \u0095 Opened the season grabbing a team-high and game-high 12 boards against Georgia. \u0095 Tallied eight points and six boards against UTSA. \u0095 Had a breakout game against Hartford, scoring 15 points",
    "textAfterTable": "TCU Women's Basketball Home     Email this article   Printer-friendly format MORE HEADLINES Basketball Arena Renovation Taking Shape W. Basketball | 04/22/2015 Click here to view photos of TCU's basketball arena renovation, which is currently taking shape in Fort Worth. TCU Holds End of Season Banquet W. Basketball | 04/16/2015 The TCU women's basketball team hosted its 2014-15 End of Season Banquet at the Dee J. Kelly Alumni and Visitors Center on Wednesday evening to... #FrogVision: TCU Basketball Renovation W. Basketball | 04/15/2015 FrogVision takes a closer look at the $72 million dollar renovation of the TCU basketball arena.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}