{
    "relation": [
        [
            "",
            "Flag of United States",
            "Flag of China",
            "Flag of South Korea",
            "Flag of Australia",
            "Flag of Italy",
            "Flag of Russia",
            "Flag of France",
            "Flag of North Korea",
            "Flag of Germany",
            "Flag of Japan",
            "Flag of Great Britain",
            "Flag of Netherlands",
            "Flag of Azerbaijan",
            "Flag of Brazil",
            "Flag of Czech Republic",
            "Flag of Slovakia",
            "Flag of Finland",
            "Flag of Romania",
            "Flag of Spain",
            "Flag of Zimbabwe",
            "Flag of Austria",
            "Flag of Cuba",
            "Flag of Kazakhstan",
            "Flag of Armenia",
            "Flag of Indonesia",
            "Flag of Taiwan",
            "Flag of India",
            "Flag of Thailand",
            "Flag of Colombia",
            "Flag of Hungary",
            "Flag of Norway",
            "Flag of Sweden",
            "Flag of Turkey",
            "Flag of Vietnam",
            "Flag of Algeria",
            "Flag of Argentina",
            "Flag of Belarus",
            "Flag of Croatia",
            "Flag of Georgia",
            "Flag of Kyrgyzstan",
            "Flag of Mexico",
            "Flag of Switzerland",
            "Flag of Tajikistan",
            "Flag of Togo",
            "Flag of Ukraine",
            "Flag of Uzbekistan"
        ],
        [
            "Gold",
            "7",
            "13",
            "5",
            "3",
            "3",
            "2",
            "0",
            "1",
            "4",
            "3",
            "2",
            "1",
            "1",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Silver",
            "7",
            "3",
            "6",
            "2",
            "4",
            "4",
            "7",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Bronze",
            "8",
            "4",
            "1",
            "5",
            "2",
            "3",
            "2",
            "4",
            "1",
            "2",
            "3",
            "2",
            "0",
            "3",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Total",
            "22",
            "20",
            "12",
            "10",
            "9",
            "9",
            "9",
            "7",
            "6",
            "6",
            "6",
            "4",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Medal Tally Beijing Olympics 2008",
    "title": "",
    "url": "http://lessonko.com/medal-tally-beijing-olympics-2008/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 141313563,
    "recordOffset": 141297907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Copyright © 2015 lessonko.com.}",
    "TableContextTimeStampAfterTable": "{21566=Below are some Highlights in Olympics Medal Tally per Country 2008 USA Medal Count and Summer Olympics Highlights 2008 China Medal Count and Summer Olympics Highlights 2008 Canada Medal Count and Summer Olympics Highlights 2008 Australia Medal Count and Summer Olympics Highlights 2008 Great Britain Medal Count and Summer Olympics Highlights 2008 South Korea Medal Count and Summer Olympics Highlights 2008 India Medal Count and Summer Olympics Highlights 2008 Germany Medal Count and Summer Olympics Highlights 2008 Russia Medal Count and Summer Olympics Highlights 2008 Japan Medal Count and Summer Olympics Highlights 2008 France Medal Count and Summer Olympics Highlights 2008 Spain Medal Count and Summer Olympics Highlights 2008 Italy Medal Count and Summer Olympics Highlights, 41533=Di na masayo, Marami na kasi ang nag ooptimized ng 2008 Olympics Medal Tally Count. At least naranasan ko ang maka first place sa SERPS hehehe, 31389=[...] info: Watch Beijing Olympics 2008 Online for Free, Medal Tally Beijing Olympics 2008 Update Results, 2008 Beijing Olympics Medal Count/Medal Tally, Beijing 2008 Olympics Medal Tally Count, Updates [...], 43071=[...] visit the following: 2008 Beijing Olympics Medal Tally 2008 Beijing Olympics Medal Count and Tally Medal Tally Beijing Olympics 2008 2008 Beijing Olympics Medal Tally and Standings Olympics News and Updates Beijing Olympics 2008 [...], 45298=[...] on Beijing 2008 Olympics Medal Tally Count, Updates and Results 2008 Beijing Olympics Medal Tally Medal Tally Beijing Olympics 2008 Beijing 2008 Olympics Medal Tally Count, Updates and Results Beijing 2008 Olympics Medal Tally [...], 33360=[...] seems that the keywords to beat is Medal Tally Beijing Olympics 2008 I will be optimizing this one from now on. Others are looking for ways on how to Watch Beijing [...], 23670=Additional info: Watch Beijing Olympics 2008 Online for Free, Medal Tally Beijing Olympics 2008 Update Results, 2008 Beijing Olympics Medal Count/Medal Tally, Beijing 2008 Olympics Medal Tally Count, Updates and Results,Beijing 2008 Olympics Medal Tally Count, Updates and Results, Beijing 2008 Olympics Medal Tally Count, Beijing Olympics 2008 Medal Tally Standings Updates, 47186=[...] Beijing Olympics Medal Tally,Medal Tally Beijing Olympics 2008,Watch Beijing Olympics 2008 Online for Free,Beijing medal Standings,USA Official Olympics Medal [...], 26732=Categories: Medal Tally Beijing Olympics 2008 Tags: Medal Tally Beijing Olympics 2008, 3440=Its seems that the keywords to beat is Medal Tally Beijing Olympics 2008 I will be optimizing this one from now on. Others are looking for ways on how to Watch Beijing Olympics 2008 Online for Free but others are just want to surf the results online which is much easier to do., 3958=Below is the Current Medal Ranking Standings of every country. Updates will be posted every hours. Visit this page for Updates in Standings. Or you can visit 2008 Beijing Olympics Medal Tally Count, Updates and Results page which automatically updates itself.}",
    "textBeforeTable": "Below is the Current Medal Ranking Standings of every country. Updates will be posted every hours. Visit this page for Updates in Standings. Or you can visit 2008 Beijing Olympics Medal Tally Count, Updates and Results page which automatically updates itself. Its seems that the keywords to beat is Medal Tally Beijing Olympics 2008 I will be optimizing this one from now on. Others are looking for ways on how to Watch Beijing Olympics 2008 Online for Free but others are just want to surf the results online which is much easier to do. Medal Tally Beijing Olympics 2008 Check //--> } ch_query = ch_queries[ch_selected]; if ( ch_selected < ch_queries.length ) { var ch_selected=Math.floor((Math.random()*ch_queries.length)); var ch_queries = new Array( ); ch_sid = \"Chitika Premium\"; ch_vertical =\"premium\"; ch_non_contextual = 4; ch_height = 250; ch_width = 250; ch_type = \"mpu\"; ch_client = \"juler\"; //--> } ch_query = ch_queries[ch_selected]; if ( ch_selected < ch_queries.length ) { var ch_selected=Math.floor((Math.random()*ch_queries.length)); var ch_queries = new Array( ); ch_default_category = \"81\"; ch_non_contextual = 1; ch_height = 60; ch_width = 468; ch_client = \"juler\";",
    "textAfterTable": "Below are some Highlights in Olympics Medal Tally per Country 2008 USA Medal Count and Summer Olympics Highlights 2008 China Medal Count and Summer Olympics Highlights 2008 Canada Medal Count and Summer Olympics Highlights 2008 Australia Medal Count and Summer Olympics Highlights 2008 Great Britain Medal Count and Summer Olympics Highlights 2008 South Korea Medal Count and Summer Olympics Highlights 2008 India Medal Count and Summer Olympics Highlights 2008 Germany Medal Count and Summer Olympics Highlights 2008 Russia Medal Count and Summer Olympics Highlights 2008 Japan Medal Count and Summer Olympics Highlights 2008 France Medal Count and Summer Olympics Highlights 2008 Spain Medal Count and Summer Olympics Highlights 2008 Italy Medal Count and Summer Olympics Highlights Additional info: Watch Beijing Olympics 2008 Online for Free, Medal Tally Beijing Olympics 2008 Update Results, 2008 Beijing Olympics Medal Count/Medal Tally, Beijing 2008 Olympics Medal Tally Count, Updates and Results,Beijing 2008 Olympics Medal Tally Count, Updates and Results, Beijing 2008 Olympics Medal Tally Count, Beijing Olympics 2008 Medal Tally Standings Updates",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}