{
    "relation": [
        [
            "Company",
            "Market Cap:",
            "Employees:",
            "Qtrly Rev Growth (yoy):",
            "Revenue:",
            "Gross Margin:",
            "EBITDA:",
            "Operating Margin:",
            "Net Income:",
            "EPS:",
            "P/E:",
            "PEG (5 yr expected):",
            "P/S:"
        ],
        [
            "VCRA",
            "615.30M",
            "326",
            "0.27",
            "95.67M",
            "0.62",
            "6.50M",
            "0.04",
            "546.00K",
            "0.04",
            "693.51",
            "2.71",
            "6.35"
        ],
        [
            "MSI",
            "15.79B",
            "21,000",
            "0.03",
            "8.56B",
            "0.50",
            "1.53B",
            "0.15",
            "719.00M",
            "2.37",
            "23.77",
            "1.34",
            "1.84"
        ],
        [
            "NOK",
            "15.51B",
            "105,265",
            "-0.19",
            "41.61B",
            "0.27",
            "-911.47M",
            "-0.06",
            "-5.67B",
            "-1.53",
            "N/A",
            "11.89",
            "0.37"
        ],
        [
            "RIMM",
            "6.15B",
            "16,500",
            "-0.47",
            "12.59B",
            "0.31",
            "1.55B",
            "-0.03",
            "-847.00M",
            "-1.67",
            "N/A",
            "-1.38",
            "0.47"
        ],
        [
            "Industry",
            "188.90M",
            "698.00",
            "0.14",
            "193.68M",
            "0.35",
            "4.70M",
            "0.01",
            "N/A",
            "N/A",
            "15.01",
            "0.81",
            "0.99"
        ]
    ],
    "pageTitle": "3 Stocks With Recent Intensive Insider Selling | Seeking Alpha",
    "title": "",
    "url": "http://seekingalpha.com/article/1098951-3-stocks-with-recent-intensive-insider-selling?source=cc",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 214121603,
    "recordOffset": 214089523,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4065=1. Seattle Genetics (NASDAQ:SGEN) is a biotechnology company focused on the development and commercialization of monoclonal antibody-based therapies for the treatment of cancer. The company's lead program, Adcetris, received accelerated approval from the U.S. Food and Drug Administration in August 2011 for two indications. In addition, under a collaboration with Millennium: The Takeda Oncology Company, Adcetris received conditional approval from the European Commission in October 2012. Seattle Genetics also has three other clinical-stage antibody-drug conjugate [ADC] programs: SGN-75, ASG-5ME and ASG-22ME. Seattle Genetics has collaborations for its ADC technology with a number of leading biotechnology and pharmaceutical companies, including Abbott (NYSE:ABT), Agensys (an affiliate of Astellas (OTCPK:ALPMF)), Bayer (OTCPK:BAYZF), Celldex Therapeutics (NASDAQ:CLDX), Daiichi Sankyo (OTCPK:DSKYF), Genentech, GlaxoSmithKline (NYSE:GSK), Millennium, Pfizer (NYSE:PFE) and Progenics (NASDAQ:PGNX), as well as ADC co-development agreements with Agensys and Genmab (OTC:GNMSF)., 279=The company reported the third-quarter financial results on November 7 with the following highlights:}",
    "TableContextTimeStampAfterTable": "{9310=The company reported the third-quarter financial results on November 5 with the following highlights:, 20927=The company expects 2012 to be the eleventh consecutive year of delivering at least 13% EPS growth, prior to special items. The company expects at least 10% EPS growth in 2013 and well into the future., 10014=For the full year 2012, the company's revenue guidance is between $100 million and $102 million. For the full year 2012, the company expects GAAP earnings per share between $0.09 and $0.11, non-GAAP earnings per share between $0.33 and $0.35, and non-GAAP Adjusted EBITDA between $10.0 million and $11.0 million., 20148=The company reported the third-quarter financial results on October 9 with the following highlights:, 434=Seattle Genetics anticipates that revenues from Adcetris net product sales will be in the range of $132 million to $137 million in 2012.}",
    "lastModified": "Thu, 30 Jul 2015 14:15:36 GMT",
    "textBeforeTable": "Seattle Genetics' competitors include ImmunoGen (NASDAQ:IMGN) and Pfizer. Here is a table comparing these companies. Competition Seattle Genetics anticipates that revenues from Adcetris net product sales will be in the range of $132 million to $137 million in 2012. Outlook $313.9 million Cash $13.7 million Net loss $49.8 million Revenue The company reported the third-quarter financial results on November 7 with the following highlights: Financials Thomas Reynolds sold 66,588 shares on December 6-10 and currently holds 57,601 shares or less than 0.1% of the company. Thomas Reynolds is Chief Medical Officer of the company. Clay Siegall sold 8,249 shares on January 2-4 pursuant to a Rule 10b5-1 trading plan adopted by Dr. Siegall and described in a Form 8-K filed on June 15, 2012. Clay Siegall currently holds 1,170,961 shares or 1.0% of the company. Clay Siegall co-founded Seattle Genetics in 1998 and is the company's President, Chief Executive Officer and Chairman of the Board of Directors. Eric Dobmeier sold 100,983 shares on December 17 - January 4 pursuant to a Rule 10b5-1 trading plan adopted on November 14, 2012. Eric Dobmeier currently holds 122,846 shares or 0.1% of the company. Eric Dobmeier serves as Chief Operating Officer of the company. Insider sells (click",
    "textAfterTable": "Robert Flury sold 600 shares on Janurary 2 pursuant to a Rule 10b5-1 trading plan adopted on August 27, 2012. Robert Flury currently controls 64,778 shares or 0.3% of the company. Robert Flury has served as Vice President of Sales since August 2007. Robert Zollars sold 49,200 shares on December 10-31 pursuant to a Rule 10b5-1 trading plan adopted on August 27, 2012. Robert Zollars currently controls 1,033,860 shares or 4.3% of the company. Robert Zollars is Chairman and CEO of the company. Hany Nada sold 389,659 shares on December 4-20 pursuant to a Rule 10b5-1 trading plan adopted on November 26, 2012. Hany Nada currently controls 1,168,977 shares or 4.9% of the company. Hany Nada serves as a director of the company. Victoria Perkins sold 4,500 shares on December 13 pursuant to a Rule 10b5-1 trading plan adopted on August 27, 2012. Victoria Perkins currently holds 33,182 shares or 0.1% of the company. Victoria Perkins has served as Vice President of Services since December 2005. Financials The company reported the third-quarter financial results on November 5 with the following highlights: Revenue $26.0 million Net income $1.7 million Cash $121 million Outlook For the full year 2012, the company's revenue guidance is between $100 million and $102 million.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}