{
    "relation": [
        [
            "Company/City",
            "Check-X-Change/ Portland",
            "Check Mart/ Portland",
            "Cash Connection/ Portland",
            "Payroll Advance Systems/ Portland",
            "Check Cash/ Portland"
        ],
        [
            "Max. Loan",
            "$100",
            "$500 25% payck",
            "$500 25% payck",
            "$200",
            "$300"
        ],
        [
            "Max. Term",
            "14 days",
            "14 days",
            "14 days",
            "10 days",
            "14 days"
        ],
        [
            "Fee/$100",
            "$18",
            "$15",
            "$15",
            "$20",
            "$15"
        ],
        [
            "APR/$100 14 days",
            "469%",
            "391%",
            "391%",
            "521%",
            "391%"
        ],
        [
            "Roll-Over Allowed?",
            "Yes",
            "Yes",
            "NA",
            "No",
            "Yes"
        ]
    ],
    "pageTitle": "DFI: A Report on the Payday Loan Industry",
    "title": "",
    "url": "http://www.in.gov/dfi/2366.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 504132819,
    "recordOffset": 504105066,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28711=In the last few years, nineteen states and the District of Columbia have adopted legislation or regulations that authorize and regulate payday loans. The District of Columbia, Mississippi, Kentucky, Nevada, and South Carolina legislatures enacted bills in their 1998 session to permit and regulate payday loans., 81815=The South Carolina Department of Consumer Affairs closed a 1992 complaint against Speedy Cash, Inc. for making loans without a license from the South Carolina Board of Financial Institutions for making payday loans. Speedy Cash was accused of charging $60 to lend $200 for 14-day periods on personal checks held for deposit. Without admitting violations of law, the company ceased operations in South Carolina. The Department got a preliminary injunction against GSC Enterprises in 1994 for illegal and unconscionable collection practices and unlicensed lending. One complaint against GSC involved a $68 charge to borrow $100 for two weeks for an effective interest rate of 1632%. The Department filed a third case in 1997 against check cashing outlets, alleging illegal loans, excess charges, violation of Truth in Lending, unconscionable debt collection, and violation of South Carolina's Unfair Trade Practices Act., 52133=Payday lending is not legal in Pennsylvania. The small loan interest rate cap is $9.50 per $100 loaned per year, or an APR of 23.57%. Pennsylvania's Attorney General has brought cases against payday lending in Philadelphia. The check cashing law adopted in 1998 prohibits check cashers from making payday loans. The Mercer County Community Action Agency surveyors found payday lending thriving in Western Pennsylvania. All of the six lenders surveyed charged $15 per $100, or 391% APR for 14 day loans. One lender set a 7 day maximum term, producing a 782% APR. Only one lender permitted rollovers on loans, while two would lend again the next day. None of those surveyed quoted an APR when asked., 85000=In a 1996 case, Cash-N-Go of West Virginia signed a Consent Order with the Attorney General's office. The complaint alleged that Cash-N-Go made loans through its check cashing business without being licensed as a financial company. A permanent injunction was entered to halt the business and to pay refunds. (Circuit Court of Kanawha County, West VA. Civil Action No. 96-C-2291.) Check cashing legislation adopted in 1998 continued the prohibition against payday lending., 35504=Nineteen states and the United States Virgin Islands do not permit payday loans due to small loan interest rate caps and by specific prohibitions against payday lending by check cashers. States have enforced this ban with varying degrees of enthusiasm. The Attorneys General in Virginia, West Virginia, Pennsylvania, Michigan, and Maryland have brought cases against payday lenders as unlicensed small loan companies. Georgia's Industrial Loan Commissioner ruled in 1998 that payday lending violated the Georgia Industrial Loan Act. Alabama's Department of Banking issued 150 cease and desist orders in mid-1998, charging payday lenders with violating interest rate caps. A consent agreement negotiated between the Alabama Check Cashers Association and the Department of Banking, however, permits payday lending to continue in Alabama under restrictions until the case is heard or the legislature adopts legislation. (See Appendix B)., 20704=Missouri licenses about 450 lenders and reports fast growth. Oklahoma estimates that 900 of 1400 licensed small lenders are in the payday loan business. Idaho, which had two payday lenders in 1993, now has 74. In two years, Iowa payday lenders increased from eight to sixty-four. Louisiana licenses 345 lenders. The number of lenders almost tripled in Wyoming in two years with over $5 million in loans made in 1997, compared to $2.3 million in 1996. Mississippi officials estimated over 350 locations made payday loans in 1998 before regulation. By late March of 1998, Indiana had 96 licensees with 225 branches for a total of 321 locations in Indiana., 23429=Check Into Cash, Inc., based in Cleveland, TN, opened its first store in 1993 and now operates 340 outlets in 15 states. The company reported revenues of $21.4 million in 1997 and almost exceeded that amount ($21.2 million) for the first half of 1998. For the first six months of 1998, Check Into Cash completed 652,000 transactions attributable to 120,000 customers. Bad debt expense has ranged from 2.3% to 5.6% since 1993., 23869=Other large stand alone payday lenders include National Cash Advance and Check & Go. The company reported a volume of $9.9 million in 1996, nearly triple 1995 revenue. National Cash Advance, another Tennessee company, opened 165 stores in less than three years. Another large stand-alone payday lender, Check 'N Go, started with one store in Cincinnati in 1994 and has about 400 outlets nationwide. Check 'N Go charges $20 for every $100 loaned., 77434=A payday loan complaint brought by Addison Parker, a legal aid attorney with the Appalachian Research and Defense Fund of Kentucky, Inc., resulted in the first published Federal court decision involving payday lending. Judge Joseph M. Hood of the Eastern District of Kentucky issued an order December 11, 1997, refusing to dismiss a complaint against Larry York d/b/a HLT Check Exchange. The Court found the transactions to be interest bearing loans, not check cashing. Judge Hood held that HLT's payday loans were subject to Kentucky's Usury statute, the Kentucky Consumer Loan Act, the Civil RICO statute (18 U.S.C. _ 1964(c)), the federal Truth In Lending Act, and the Kentucky Consumer Protection Act. The Acting General Counsel for the Kentucky Department of Financial Institutions, which licenses check cashers, filed an affidavit in support of the lender but failed to persuade the judge that payday lending is permitted under Kentucky's check casher law. The case was settled., 75793=The Florida Department of Banking and Finance also filed an Administrative Complaint for Imposition of Sanctions and Notice of Rights August 28, 1998 against A Tropical Title Loan, Inc, located in Port St. Lucie, FL for unlicensed lending. At least 350 small loans were made at finance charges of 520% APR., 54865=The Columbia Consumer Education Council called twelve companies advertising payday loans in South Carolina. Legislation adopted in 1998 sets a maximum $15/$100 fee and limits loans to $300 for a maximum term of 31 days. Fees quoted by lenders ranged from $15 per $100 to $30 per $100 loaned. Although South Carolina law prohibits rollovers, two companies stated that loans could be renewed. None of those surveyed quoted an APR when asked., 23117=Stand alone payday loan companies have experienced explosive growth in the last five years. Advance America, Cash Advance Centers, a South Carolina company, have 426 branches in 16 states. The company opened its first store in November 1997 and expects to have over 500 outlets by the end of 1998., 75095=The Florida Comptroller, Department of Banking and Finance, sought an emergency cease and desist order June 8, 1998 against Treasure Coast Cash, Inc, an unlicensed Stuart, Florida payday lender. The Comptroller cited Treasure and its principals for unlicensed lending under Chapters 516 and 687, Florida Statutes. Typical loans cost consumers 520% APR, with some payday loans up to 1560%. The Order also cited Treasure for collection practices that used, without authority, letterhead from the Martin County Sheriff's Office. The Comptroller listed violations including unlicensed consumer finance loans, interest in excess of 18% usury limit, and deceptive debt collection practices., 13424=In 1997 CFA published a report on check cashing and payday loan practices which found that state consumer protections are inadequate to prevent rate-gouging and to promote informed decisions. This report updates the status of payday lending under state laws and regulations, surveys payday loan terms in 8 states, and offers recommendations to policymakers and advice to consumers., 29037=Alabama's legislature considered a bill but adjourned without adopting pending legislation. Pennsylvania's 1998 legislature adopted a check cashing law that prohibits cashing or advancing money on post-dated checks. A bill to raise the loan amount ceiling in California was withdrawn after consumer advocates objected and proposed amendments to establish reporting requirements for lenders. The Georgia legislature did not adopt bills filed to permit payday lending., 77122=The Kansas Attorney General obtained a 1992 consent judgment against Greenbacks, Inc. d/b/a Advance Checking and Check-Time in a case alleging that consumers were charged $25 per $100 loaned, resulting in annual percentage rate of 1,300% for a one-week loan., 19879=Payday lending has exploded in the last few years. Colorado is one of the few states with an industry-wide annual report available. For 1997, the Attorney General reported that 188 lenders made 374,477 post-dated check loans totaling $42,823,089. The average annual percentage rate charged on these loans was 485.26%. The average term for loans was 16.58 days. Over 58,000 of these loans, or 15.5%, were refinanced. For the year ended 12/31/97, Washington reported 562,031 loans made by check cashers. These loans were for a total of $144,923,986. The average size loan was $255. Lenders collected $21,541,338 in fees and charged off $2,054,338. Indiana reports that the number of payday lenders jumped from 11 in 1995 to 59 in 1997, with loan volume increasing from $12,688,599 in 1995 to $98 million in 1997., 12630=Jean Ann Fox, Director of Consumer Protection Consumer Federation of America November 1998, 27949=A class action lawsuit filed in Tennessee described borrowers who renewed cash advance loans 20 to 29 times, paying fees of $19 to $24 per $100 loaned. One plaintiff \"rolled over\" loans 24 times in 15 months, borrowing a total of $400 and paying $1,364 while still owing $248. Bank Rate Monitor Online described a Kentucky consumer who borrowed $150 and had paid over $1,000 in fees over a six-month period without paying down the principal. Her solution was to declare bankruptcy. A Wisconsin news article described a consumer who borrowed more than $1200 from all five payday lenders in her town and was paying $200 every two weeks just to cover the fees without reducing principal., 76358=Georgia's Industrial Loan Commissioner John Oxendine found that EZ Cash, Inc., formerly known as Cash Cow, Inc., a Florida payday lender with branches in Georgia, was making small loans in violation of the Georgia Industrial Loan Act. Investigators testified at hearings in January that Cash Cow loaned money at rates of $25 per $100 payable in 15 days, resulting in annual simple interest rates of 600%. In Georgia, it is criminal usury to charge more than 60% interest on loans of less than $3,000. Although the Company used a variety of devices to obscure the loan, such as discount car title vouchers or check-cashing fees, Georgia officials found that these transactions are loans in violation of state law., 84411=Allstate Express Check Cashing, Inc., charged a 30% fee that amounted to an effective annual percentage rate of 730 percent when the check was held 15 days. The Circuit Court of the City of Richmond ruled that the owner of Allstate was personally liable for the $237,254 restitution judgment entered against the company in March 1995. Greenberg was ordered to pay $30,000 for attorney's fees to the Commonwealth, but the order was overturned by the Virginia Supreme Court. Claims for restitution were filed by 642 former customers., 83487=Virginia's Attorney General brought a series of cases in 1992 and 1993 against check cashers making payday loans, charging unauthorized small loan lending in violation of the Virginia Consumer Finance Act. In 1994, Virginia's Attorney General reached a $2.5 million settlement with an Alexandria-based \"cash advance\" firm, Cash Now Three, which advanced funds against personal checks, held them for 14 days, and charged a service fee of 28 percent of the amount financed, or an effective annual rate of 730%. Cash Now should have been a licensed small loan company in which case they would have been limited by a 36% APR usury cap on loans of $2500 or less. A Virginia court ruled that the practice of advancing cash against a customer's check dated for sometime in the future constituted the making of loans and that the fees charged greatly exceeded the limits imposed by the Consumer Finance Act., 74801=31 State of Alabama State Banking Department Summary of Consent Order Regarding \"Payday Loans,\" October 14, 1998, 40929=CFA member organizations surveyed payday lenders in eight states to learn the terms of payday loans and whether key disclosures are being made to consumers. Groups in Florida, California, South Carolina, Tennessee, Oregon, Illinois, Virginia, and Pennsylvania called 85 payday lenders during mid-1998 to ask the maximum loan and term, the fee, whether roll-over of loans is allowed, if a written agreement is required, and what the Annual Percentage Rate is the quoted loan. (See Appendix A for state surveys.), 21843=A seminar at the National Check Cashers Association 1998 convention drew standing room only crowds for check cashers interested in going into payday lending. As check cashers lose a portion of their traditional business to electronic delivery of state benefits and federal payments, check cashers are searching for profitable financial services to replace check cashing. The National Check Cashers Association has issued a position paper in support of payday lending and is working on a model legislative proposal for states that have not authorized payday lending. Loan & Check, a vendor to the trade, claims that payday loans will grow by 600% over the next ten years., 89362=The National Check Cashers Association policy position on payday lending supports state regulation of payday lending, state fee caps and disclosures, maximum loan size of up to $1,000 with inflation adjustment, and a maximum loan term of 31 days. NaCCA's position on \"extensions and rollovers\" would limit them to avoid an undue spiraling of obligations. NaCCA also supports limits on multiple deferred deposit transactions by setting a cap on the total amount of all transactions with the same provider. NaCCA supports a Code of Ethical Standards for the deferred deposit industry. (\"The Consumer's Choice: The Role of Deferred Deposit Services in Meeting Short Term Financial Needs,\" National Check Cashers Association, June 8, 1998.), 72907=The Alabama Attorney General issued an opinion July 7, 1994 that payday loans are loans covered by the Alabama Small Loan Act, the Mini-Code and are subject to Truth in Lending disclosure requirements. No action to enforce the 1994 opinion was taken until July 1, 1998 when the Alabama State Banking Department filed cease and desist orders against 150 check cashing companies making payday loans in violation of Alabama's small loan act which prohibits making loans for $749 or less without a license. The Alabama Check Cashers Association counter sued the state, seeking a declaratory judgment on whether the Alabama Small Loan Act applies to \"Payday Loans\" and \"Catalog Sales.\" The trade association complaint sought injunctive relief to stop enforcement of the cease and desist orders. The case was assigned to a retired judge for mediation pending trial.30 The consent agreement issued by Judge Reese October 9, 1998 permits payday lending to continue with restrictions pending a final court ruling or the adoption of legislation in Alabama. Parties to the injunction can make payday loans with fees up to 16.67% of the check including the fee. (This computes to 521% APR if the loan is repaid in 14 days or 1042% APR if repaid in 7 days.) Lenders may not renew or consolidate one payday loan with another, must provide written agreements, and may not file criminal charges for NSF returned checks.31 Other payday lenders may sign the consent agreement to remain in business pending the final resolution of the case., 78432=At least eight cases are pending in state and federal courts in Kentucky. Judge Hood, of the United States District Court for the Eastern District of Kentucky granted class status in October 1998 in Lucille Riley, et al v. Larry K. York D/B/A Hazard Check Exchange, No. 98-268. Action has been stayed in federal court on other cases while the Kentucky Supreme Court considers issues raised by litigation., 24377=Check cashing outlets have formed partnerships with national banks to make payday loans, including in states where check cashers are prohibited from charging typical payday loan rates or extending credit. Eagle National Bank, a federally charted bank located in Upper Darby, Pennsylvania, makes \"Cash Till Payday\" loans of up to $500 through Dollar Financial Group's check cashers in several states. Dollar Financial Group claims that Eagle National Bank is able to export Pennsylvania's deregulated bank loan fees to consumers in other states. Eagle charges up to $17.50 per $100 for 14 day payday loans (454% APR). In 1997, Eagle National Bank made 204,499 payday loans, with $31 million of the bank's loans small consumer loans (36% of loans made). The Comptroller of the Currency gave a \"Satisfactory\" Community Reinvestment Act rating to the bank in 1998, despite complaints by consumer organizations about the bank's triple-digit interest rate loans., 22532=Ace Cash Express, the largest chain of check cashing outlets is based in Irving, Texas, and operates 725 Company-owned stores and 100 franchise stores in 29 states. Its small-loan product offered in 240 stores provides earnings growth. Ace's 1997 payday loan revenue of $10.1 million was double the volume of business in 1996. Act is now opening stores inside Wal-Mart Supercenters. An Oregon news report noted that Ace Cash Express charges $18 to borrow $100 for 14 days, for an effective interest rate of 469%.., 54592=PA Check Cashing Licensing Act of 1998, § 505 (a) prohibits check cashers from making payday loans. 7 Pa. Cons Stat. Ann. § 6201 et seq. Caps small loan fees at $9.50/$100/year or 23.57% APR., 79670=In 1997, the Michigan Attorney General issued Notices of Intended Action to five check cashers for operating an illegal consumer loan service. Payday loan companies were charging in excess of 1000% APR. Michigan investigators found that five check-cashing companies charged annual rates of interest ranging from 416 to 1,095 percent while Michigan law allows a 25 percent rate for consumer loans. Michigan's Financial Institutions Bureau issued a ruling in 1995 that cash advances on checks held for future deposit is lending under Michigan's Regulatory Loan Act of 1963. Three of the entities signed assurances of discontinuance to settle the complaints brought by the Attorney General, agreeing to comply with the Michigan Consumer Protection Act and with applicable usury and licensing statutes. The Michigan Financial Institutions Bureau has determined that check cashers who charge their regular check cashing fee plus a 5% interest rate are in compliance with Michigan's general usury law and do not have to be licensed under the Regulatory Loan Act. Since Michigan does not regulate check cashers or set maximum check cashing fees, this decision permits payday loans at unlimited rates without APR disclosure., 74707=30 Alabama Attorney General Opinion No. 94-00210, issued July 7, 1994, 72252=Va. Code Ann. § 6.1-432 et. seq. Check cashers are prohibited from making loans or cashing post-dated checks. Consumer Finance Act, Va. Code Ann. § 6.1-272.1 caps interest rates for loans of $2500 or less at 36% APR., 89174=For a copy of the CFA/NCLC Model State Deferred Deposit Loan Act, send $10 to Consumer Federation of America, 1424 16th Street NW, Suite 604, Washington, DC 20036.}",
    "textBeforeTable": "Table One States With Specific Payday Loan Law/Regulations Most states create some type of criminal or administrative penalties. However, only seven states provide for some type of limited private right of action allowing the consumer to obtain relief against the lender. Only a small number prohibit the lender from threatening to file or filing criminal charges against a consumer as a mechanism to collect on the debt. These payday loan laws apply to check cashers in seven of the nineteen states. Typical payday loan laws exempt these transactions from usury or interest rate caps, set a maximum fee and term for loans, restrict roll-overs or multiple loans, and require licensing by state regulators. Six state payday loan laws or regulations require lenders to disclose their fees as an Annual Percentage Rate. The maximum fees result in APRs for a $100 14-day loan range from 261% in Florida to 625% in Colorado. Thirteen of the 20 jurisdictions set the maximum fee at $15 per $100 loaned, a 391% APR on a 14 day loan. Sixteen states set a maximum loan term, but only Oklahoma sets a minimum term of 30 days to repay payday loans of $101 or less. Alabama's legislature considered a bill but adjourned without adopting pending legislation. Pennsylvania's 1998 legislature adopted a check cashing law that prohibits cashing or advancing money on post-dated checks. A bill to raise the loan amount ceiling in California was withdrawn after consumer advocates objected and proposed amendments to establish reporting",
    "textAfterTable": "782%/391% N Y 2 KS 30/$780 scale of fees$ 782%/391% Y Y No Limit KY 60/$500 $15 per $100 For 14 days 782%/391% Y N 2 LA 30/$500 scale of fees$$ 521%/261% N Y No Limit MN 30/$350 scale of fees$$$ 782%/391% N Y No Limit MS 30/$400 18% 938%/469% N N No Limit MO 10 mon/$500 $15/$100 782%/391% N N No Limit NE 31/$500 $15/$100 782%/391% N N 2 NV To be set by regulation N N No Limit NC 31/$300 15% 782%/391% N Y No Limit OH 6 mon/$500 5%/mon. + 782%/391% N Y No Limit OK 30/$101 20% 1042%/521% Y N $100 SC 31/$300 15% 782%/391% Y Y No Limit TN 31/$500 15% or $30 782%/391% Y Y 3 WA 31/$500 15% + 782%/391% N Y No Limit WY 30/ $30 or 20% 1042%/521% Y Y No Limit * % of face amount of check cc Applies to check cashers only $ $5.50 for loans $0 to $50, 10% of loans + $5 for $50 to $100, 7% + $5 for $100 to $250, 6% +$5 for $250 to $300. $$ $5 for loans $0 to $99, $10 for loans $100-$200, $15 for loans $201-$500. $$$ $5.50 for loans $0 - $50, 10% + $5 loans $50 - $100, 7% + $5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}