{
    "relation": [
        [
            "",
            "Fair value, January 31, 2009",
            "Interest accrued and capitalized",
            "Treasury loan",
            "Unrealized gain/(loss)",
            "Fair value, December 31, 2009",
            "Interest accrued and capitalized",
            "Unrealized (gain)/loss",
            "Fair value, at December 31, 2010"
        ],
        [
            "ML subordinated loan",
            "$ -",
            "61",
            "-",
            "(61)",
            "$ -",
            "66",
            "1,135",
            "$ 1,201"
        ],
        [
            "ML II deferred purchase price",
            "$ -",
            "34",
            "-",
            "(34)",
            "$ -",
            "34",
            "1,353",
            "$ 1,387"
        ],
        [
            "ML III equity contribution",
            "$ 2,824",
            "171",
            "-",
            "1,299",
            "$ 4,294",
            "173",
            "2,266",
            "$ 6,733"
        ],
        [
            "TALF financial interest",
            "$ -",
            "2",
            "100",
            "699",
            "$ 801",
            "4",
            "(75)",
            "$ 730"
        ],
        [
            "Total",
            "$ 2,824",
            "268",
            "100",
            "1,903",
            "$ 5,095",
            "277",
            "4,679",
            "$ 10,051"
        ]
    ],
    "pageTitle": "FRB: Federal Reserve System Audits: Annual Report 2010",
    "title": "",
    "url": "http://www.federalreserve.gov/publications/annual-report/2010-federal-reserve-system-audits.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 44,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987402.78/warc/CC-MAIN-20150728002307-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433789551,
    "recordOffset": 433691116,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{164153=The Board's financial statements do not include financial data for the Council. Activity related to the Board and Council, as of December 31, 2010 and 2009, is summarized in the following table:, 256369=Concurrent with the November 2008 restructuring of its financial support to AIG, the FRBNY established two limited liability companies (LLCs). The FRBNY extended credit to Maiden Lane II LLC (ML II), a Delaware limited liability company formed to purchase non-agency RMBS from the reinvestment pool of the securities lending portfolios of several regulated U.S. insurance subsidiaries of AIG. ML II borrowed $19.5 billion from the FRBNY and used the proceeds to purchase non-agency RMBS that had an approximate fair value of $20.8 billion as of October 31, 2008 from AIG's domestic insurance subsidiaries. The FRBNY is the sole and managing member and the controlling party of ML II and will remain as the controlling party as long as the FRBNY retains an economic interest in ML II. As part of the agreement, the AIG subsidiaries also received from ML II a fixed deferred purchase price of up to $1.0 billion, plus interest on any such fixed deferred purchase price outstanding. The interest rate on the FRBNY's senior loan is one-month Libor plus 100 basis points, and the interest rate on the fixed deferred purchase price is one-month Libor plus 300 basis points. After ML II has first paid the FRBNY's senior loan, including accrued and unpaid interest, and then the fixed deferred purchase price in full, including accrued and unpaid interest, any net proceeds will be divided between the FRBNY, which is entitled to receive five-sixths, and the AIG subsidiaries, which are entitled to receive one-sixth. The FRBNY's loan and the fixed deferred purchase price payable to the AIG subsidiaries are collateralized by all of the assets of ML II through a pledge to the collateral agent., 253000=The FRBNY extended a senior loan of approximately $28.8 billion and JPMC extended a subordinated loan of $1.15 billion to finance the acquisition of the assets. The loans are collateralized by all of the assets of ML through a pledge to the collateral agent. The FRBNY is the sole and managing member and the controlling party of ML and will remain as such as long as the FRBNY retains an economic interest in ML. The interest rate on the senior loan is the primary credit rate in effect from time to time. The interest rate on the JPMC subordinated loan is the primary credit rate plus 450 basis points. JPMC bears losses associated with the portfolio through its subordinated loan plus accrued interest on the loan. Once the principal and interest are paid, residual gains, if any, will be allocated to the FRBNY. The two-year accumulation period that followed the closing date for ML ended on June 26, 2010. Consistent with the terms of the ML transaction, the distributions of the proceeds realized on the asset portfolio held by ML, after payment of certain fees and expenses, now occur on a monthly basis unless otherwise directed by the Federal Reserve., 334327=The following table presents the components of the AIG loan at December 31 (in millions):, 285044=Activity related to Treasury securities, GSE debt securities, and Federal agency and GSE MBS, including the premiums, discounts, and realized gains and losses, is allocated to each Reserve Bank on a percentage basis derived from an annual settlement of the interdistrict settlement account that occurs in April of each year. Activity related to foreign currency denominated assets, including the premiums, discounts, and realized and unrealized gains and losses, is allocated to each Reserve Bank based on the ratio of each Reserve Bank's capital and surplus to aggregate capital and surplus at the preceding December 31., 521421=In 2008, after relocating operations to a new facility, the Federal Reserve Bank of San Francisco (FRBSF) classified its former Seattle branch office building as held for sale, and the building is reported at fair value as a component of \"Other Assets\" in the Combined Statements of Condition. During the year ended December 31, 2010, the FRBSF recorded an adjustment of $6.7 million to the fair value of the building and reported the charge as a component of \"Operating expenses: Other\" in the Combined Statements of Income and Comprehensive Income. The fair value of the building as of December 31, 2010 was based on appraised valuation., 360265=Federal agency and GSE MBS are reported at stated maturity in the table above. The estimated weighted average life of these securities at December 31, 2010, which differs from the stated maturity primarily because it factors in prepayment assumptions, is approximately 4.2 years., 264941=The Board of Governors, the Treasury, and the FDIC (parties) jointly announced on January 15, 2009 that they would provide financial support to Bank of America Corporation (Bank of America). Under this arrangement, the Federal Reserve Bank of Richmond (FRBR) would have provided funding support for possible future principal losses relating to a designated pool of up to $118 billion of financial instruments. On September 21, 2009, the parties announced that they had reached an agreement with Bank of America to terminate the agreement. As part of the termination of the agreement, Bank of America paid $57 million in compensation for out-of-pocket expenses incurred by the FRBR and for commitment fees required by the agreement., 20911=In our opinion, the Board maintained, in all material respects, effective internal control over financial reporting as of December 31, 2010, based on the criteria established in Internal Control--Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission., 454802=Certain ABS CDO issuers can issue short-term eligible investments under Rule 2a-7 of the Investment Company Act of 1940 if the ABS CDO contains arrangements to remarket the securities at defined periods. The investments must contain put options (2a-7 Puts) that allow the purchasers to sell the ABS CDO at par to a third-party (Put Provider), if a scheduled remarketing is unsuccessful due to reasons other than a credit or bankruptcy event. The total notional value of ABS CDOs held by ML III with embedded 2a-7 Puts, for which AIGFP was, directly or indirectly, the Put Provider, was $1.6 billion at 2009. There were no remaining ABS CDO investments held by the LLC with embedded 2a-7 puts as of December 31, 2010., 394783=The net income (loss) attributable to ML, ML II, ML III, and CPFF for the year ended December 31, 2009 and for TALF LLC from the inception date of February 4, 2009 to December 31, 2009 was as follows (in millions):, 453403=At December 31, 2010, approximately 30 percent and 13 percent of the properties collateralizing the non-agency RMBS held by ML II were located in California and Florida, respectively, based on the geographical location data available for the underlying loans by aggregate unpaid principal balance., 374962=The FRBNY's maximum exposure to loss at December 31, 2010 and 2009 was $55,434 million and $73,879 million, respectively. These estimates incorporate potential losses associated with assets recorded on the FRBNY's Consolidated Statements of Condition, net of the fair value of subordinated interests (beneficial interest in consolidated VIEs)., 103532=Estimated amounts that will be amortized from accumulated other comprehensive income into net periodic benefit cost (credit) in 2011 are shown below:, 263734=The Board of Governors, the Treasury, and the Federal Deposit Insurance Corporation (FDIC) (parties) jointly announced on November 23, 2008, that they would provide financial support to Citigroup, Inc. (Citigroup). The agreement, which was executed on January 16, 2009, provided funding support for possible future principal losses relating to a designated pool of up to $301 billion of Citigroup's assets. The funding support was for a period of 10 years for residential assets and 5 years for nonresidential assets. No funding support was provided to Citigroup under this agreement, and on December 23, 2009, the parties terminated the agreement. As a result, the Bank had no contractual obligation at December 31, 2010 or 2009. As consideration for terminating the agreement, Citigroup paid the FRBNY a $50 million termination fee and reimbursed the FRBNY for its out-of-pocket expenses. The termination fee was recognized during the year-ended December 31, 2009, and is reported as a component of \"Other income\" in the Consolidated Statements of Income., 246686=The Asset-Backed Commercial Paper Money Market Mutual Fund Liquidity Facility (AMLF) provided funding to depository institutions and bank holding companies to finance the purchase of eligible high-quality asset-backed commercial paper (ABCP) from money market mutual funds. The Federal Reserve Bank of Boston administered the AMLF and was authorized to extend these loans to eligible borrowers on behalf of the other Reserve Banks. The authorization for the AMLF expired on February 1, 2010., 530425=1. In 2010, there is additional restricted cash totaling $9 million that may be required to be advanced by ML for property level expenses or improvements. Return to table, 569103=At December 31, 2010 and 2009, the weighted-average discount rate assumptions used in developing the postretirement benefit obligation were 5.25 percent and 5.75 percent, respectively., 590480=In 2009, the Reserve Banks continued their check restructuring initiatives to align check processing infrastructure and operations with declining check processing volumes. Additional announcements in 2009 included restructuring plans associated with discontinuing check print sites., 340224=The total of the Treasury securities, GSE debt securities, and Federal agency and GSE MBS, net excluding accrued interest, held in the SOMA at December 31 was as follows (in millions):, 548840=The System's Committee on Investment Performance (CIP) is responsible for establishing investment policies, selecting investment managers, and monitoring the investment managers' compliance with its policies. The CIP is supported by staff in the OEB in carrying out these responsibilities. At December 31, 2010, the System Plan's assets were held in seven investment vehicles: a liability-linked account, two actively managed long-duration fixed income portfolios, an indexed U.S. investment-grade bond fund, an indexed U.S. equity fund, an indexed non-U.S. developed-markets fund, and a money market fund., 371607=Foreign currency working balances held and foreign exchange contracts executed by the FRBNY to facilitate international payments and currency transactions it makes on behalf of foreign central banks and U.S. official institution customers were not material as of December 31, 2010 and 2009., 380215=Total realized and unrealized gains (losses) for the year-ended December 31, 2010, were as follows (in millions):, 520858=The Reserve Banks had capitalized software assets, net of amortization, of $146 million and $134 million at December 31, 2010 and 2009, respectively. Amortization expense was $54 million and $52 million for the years ended December 31, 2010 and 2009, respectively. Capitalized software assets are reported as a component of \"Other assets\" in the Combined Statements of Condition and the related amortization is reported as a component of \"Operating expenses: Other\" in the Combined Statements of Income and Comprehensive Income., 379733=1. The amount reported as \"Consolidated variable interest entities: Other liabilities\" in the Combined Statements of Condition includes $695 million and $980 million related to cash collateral received on swap contracts at December 31, 2010 and 2009, respectively. The amount also includes accrued interest, unearned registration fees, and accrued other expenses. Return to table, 235075=The twelve Federal Reserve Banks (Reserve Banks) are part of the Federal Reserve System (System) created by Congress under the Federal Reserve Act of 1913 (Federal Reserve Act), which established the central bank of the United States. The Reserve Banks are chartered by the federal government and possess a unique set of governmental, corporate, and central bank characteristics., 579197=Net postretirement benefit costs are actuarially determined using a January 1 measurement date. At January 1, 2010 and 2009, the weighted-average discount rate assumptions used to determine net periodic postretirement benefit costs were 5.75 percent and 6.00 percent, respectively., 564296=Employees of the Reserve Banks participate in the defined contribution Thrift Plan for Employees of the Federal Reserve System (Thrift Plan). The Reserve Banks match employee contributions based on a specified formula. Effective April 1, 2009, the Reserve Banks match 100 percent of the first 6 percent of employee contributions from the date of hire and provide an automatic employer contribution of 1 percent of eligible pay. For the first three months of the year ended December 31, 2009, the Reserve Banks matched 80 percent of the first 6 percent of employee contributions for employees with less than five years of service and 100 percent of the first 6 percent of employee contributions for employees with five or more years of service. The Reserve Banks' Thrift Plan contributions totaled $94 million and $82 million for the years ended December 31, 2010 and 2009, respectively, and are reported as a component of \"Salaries and benefits\" in the Combined Statements of Income and Comprehensive Income., 527457=In support of financial market stability activities, the Reserve Banks entered into commitments to provide financial assistance to financial institutions. The contractual amounts shown below are the Reserve Banks' maximum exposures to loss in the event that the commitments are fully funded and there is a default by the borrower or total loss in value of pledged collateral. Total commitments at December 31, 2010 and 2009 were as follows (in millions):, 163131=The Board contracted for audit services on behalf of entities that are included in the combined financial statements of the Federal Reserve Banks. The entities reimburse the Board for the cost of the audit services. The Board accrued liabilities of $322,000 and $138,000 in audit services and recorded receivables of $322,000 and $138,000 from the entities as of December 31, 2010 and 2009, respectively., 549461=The diversification of the Plan's investments is designed to limit concentration of risk and the risk of loss related to an individual asset class. The liability-linked account, funded in 2008, seeks to defease a portion of the System Plan's liability related to retired lives using a Treasury securities portfolio. The policy governing this account calls for cash-matching the first two years of a portion of retiree benefits payments and immunizing the remaining obligation. The two long-duration fixed income portfolios are separate accounts benchmarked to the Barclays Long Government/Credit Index, which was selected as a proxy for the liabilities of the Plan. While these portfolios are both actively managed, the guidelines are designed to limit portfolio deviations from the benchmark. The indexed U.S. investment-grade bond fund tracks the Barclays U.S. Aggregate Index, which is a broader fixed income index than the Barclays Long Government/Credit Index, but has a shorter duration and average maturity. The indexed U.S. equity fund is intended to track the overall U.S. equity market across market capitalizations. The indexed non-U.S. developed markets equity fund is intended to track the Morgan Stanley Capital International (MSCI) Emerging Markets Index, Europe, Australia, Far East plus Canada Index, which includes stocks from 23 markets deemed by MSCI to be \"developed markets.\" Finally, the money market fund, which invests in high-quality money market securities, is the repository for cash balances and adheres to a constant dollar methodology., 511242=In December 2009, the FRBNY received preferred interests in two VIEs, AIA LLC and ALICO LLC. The FRBNY does not consolidate these VIEs because it does not have a controlling financial interest. The FRBNY's maximum exposure to any potential losses of the VIEs, should any occur, is limited to the recorded value of the FRBNY's investment in the preferred interests and dividends receivable from the VIEs. The following table shows financial information as of December 31, 2010 (in millions):, 501625=3. Commercial mortgage loans, with a December 31, 2009 fair value of $2,440 million, were transferred from Level 3 to Level 2 because they are valued at December 31, 2010 based on quoted prices for identical or similar instruments in non-active markets (Level 2). These investments were valued in the prior year based on non-observable inputs (Level 3). Return to table, 309387=The Reserve Banks are exempt from federal, state, and local taxes, except for taxes on real property. The Reserve Banks' real property taxes were $41 million and $37 million for the years ended December 31, 2010 and 2009, respectively, and are reported as a component of \"Operating expenses: Occupancy\" in the Combined Statements of Income and Comprehensive Income., 296716=\"Federal Reserve notes outstanding, net\" in the Combined Statements of Condition represents the Federal Reserve notes outstanding, reduced by the Reserve Banks' currency holdings of $180 billion and $193 billion at December 31, 2010 and 2009, respectively., 65623=The Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (Dodd-Frank Act), which was signed into law and became effective on July 21, 2010, changed the scope of some services performed by the System. Among other things, the Dodd-Frank Act establishes a Bureau of Consumer Financial Protection (Bureau) as an independent bureau within the System that will have rule-writing authority with respect to most federal financial consumer protection statutes and supervisory authority with respect to these statutes over some institutions previously supervised by the Board. The Dodd-Frank Act will also vest the Board with all supervisory and rule-writing authority for savings and loan holding companies. In addition, the Dodd-Frank Act creates a Financial Stability Oversight Council (FSOC) of which the Chairman of the Board is a member. Some of the FSOC's responsibilities include identifying systemically important nonbank financial companies to be supervised by the Board. The Dodd-Frank Act also establishes the Office of Financial Research (Office) within the U.S. Department of Treasury to provide support to the FSOC and the member agencies., 513789=The fair value of FRBNY's preferred interests in AIA LLC and ALICO LLC was not materially different from the amounts reported as \"Preferred interests\" in the Combined Statements of Condition as of December 31, 2010 and 2009., 168964=In 2007, the Council began a rewrite of the Home Mortgage Disclosure Act processing system, for which the Board provides data processing services. The total cost of the rewrite for the Council is $2.7 million of which the Board expense to support this effort was $464,000 through December 31, 2010., 262698=On January 14, 2011, upon closing of the recapitalization plan, the cash proceeds from certain asset dispositions, specifically the initial public offering of AIA and the sale of ALICO, were used first to repay in full the revolving line of credit extended to AIG by the FRBNY, including accrued interest and fees, and then to redeem a portion of the FRBNY's preferred interests in ALICO LLC taken earlier by the FRBNY in satisfaction of a portion of the revolving line of credit. The remaining FRBNY preferred interests in ALICO LLC and AIA LLC, valued at approximately $20 billion, were purchased by AIG through a draw on the Treasury's Series F preferred stock commitment and then transferred by AIG to the Treasury as partial consideration for the transfer to AIG of all outstanding Series F shares. In addition, the FRBNY's commitment to lend any funds under the revolving line of credit was terminated., 326712=The fair value of TALF loans reported in the Combined Statements of Condition as of December 31, 2010 and 2009 includes $121 million and $557 million in unrealized gains, respectively. FRBNY attributes substantially all changes in fair value of non-recourse loans to changes in instrument-specific credit spreads., 306157=During the period prior to the Bureau transfer date of July 21, 2011, there is no limit on the funding that can be provided to the Bureau and that is assessed to the Reserve Banks; the Board of Governors must provide the amount estimated by the Secretary of the Treasury needed to carry out the authorities granted to the Bureau under the Dodd-Frank Act and other federal law. After the transfer date, the Dodd-Frank Act requires the Board of Governors to fund the Bureau in an amount not to exceed a fixed percentage of the total operating expenses of the Federal Reserve System as reported in the Board of Governors' 2009 annual report. The fixed percentage of total operating expenses of the System is 10% for 2011, 11% for 2012, and 12% for 2013. After 2013, the amount will be adjusted in accordance with the provisions of the Dodd-Frank Act., 244407=Foreign currency liquidity swap arrangements provided the Reserve Banks with the capacity to offer foreign currency liquidity to U.S. depository institutions. The authorization for these swap arrangements expired on February 1, 2010., 322832=The following table presents the TALF loans at fair value as of December 31 by ASC 820 hierarchy (in millions):, 246257=The Transitional Credit Extension (TCE) program provided liquidity support through secured loans to broker-dealers that were in the process of transitioning to the bank holding company structure. The authorization for the TCE program expired on February 1, 2010, and the last loan matured on April 29, 2009., 372110=The total foreign currency held under U.S. dollar liquidity swaps in the SOMA at December 31, 2010 and 2009, was $75 million and $10,272 million, respectively., 17149=February 28, 2011 McLean, VA, 245497=The Term Securities Lending Facility Options Program (TOP) offered primary dealers the opportunity to purchase an option to draw upon short-term, fixed-rate TSLF loans in exchange for eligible collateral. The program was suspended effective with the maturity of the June 2009 TOP options, and authorization for the program expired on February 1, 2010., 336906=The activity related to the allowance for AIG loan restructuring for the years-ended December 31 was as follows (in millions):, 80300=Rental expenses under the operating leases were $6,882,000 and $3,947,000 for the years ended December 31, 2010 and 2009, respectively. The Board entered into a new operating lease in January 2011. The estimated future minimum lease payments associated with the new lease total $78,702,000 over a ten year period., 171137=The Bureau of Engraving and Printing is the sole supplier for currency printing and also provides retirement services. The currency costs incurred as of December 31, 2010 and 2009, are reflected in the following table:, 356814=The remaining maturity distribution of Treasury securities, GSE debt securities, Federal agency and GSE MBS bought outright, and securities sold under agreements to repurchase at December 31, 2010 was as follows (in millions):, 394318=1. The TALF LLC's unrealized loss on beneficial interest represents Treasury's financial interest in the net income of TALF LLC for the year ended December 31, 2010. Return to table, 424289=The following table summarizes commercial mortgage loans held by ML at December 31, 2010 (in millions):, 80825=Deferred Rent--The change in deferred rent was $528,000 and $1,666,000 for the years ended December 31, 2010 and 2009, respectively., 431680=The following table summarizes the notional amounts of derivative contracts outstanding as of December 31, 2010 and 2009, and the change in notional amounts is representative of the volume of activity for the year ended December 31, 2010 (in millions):, 176163=In accordance with standards of the Public Company Accounting Oversight Board (United States) and Government Auditing Standards, we have also issued our report dated February 28, 2011, on our tests of the Board's internal control over financial reporting. The purpose of that report is to describe the scope and the results of that testing. That report is an integral part of an audit performed in accordance with standards of the Public Company Accounting Oversight Board (United States) and Government Auditing Standardsand should be considered in assessing the results of our audit., 304925=When directed by the Secretary of the Treasury, the Reserve Banks are required by the Federal Reserve Act to serve as fiscal agent and depositary of the United States Government. By statute, the Treasury has appropriations to pay for these services. During the years ended December 31, 2010 and 2009, the Reserve Banks were reimbursed for substantially all services provided to the Treasury as its fiscal agent., 149598=The Board provides certain postemployment benefits to eligible former or inactive employees and their dependents during the period subsequent to employment but prior to retirement. Postemployment costs were actuarially determined using a December 31 measurement date and discount rates of 3.50% and 4.00% as of December 31, 2010 and 2009, respectively. The accrued postemployment benefit costs recognized by the Board as of December 31, 2010 and 2009, were $701,000 and $1,754,000, respectively., 599283=The closing of the AIG recapitalization plan, which occurred on January 14, 2011, is discussed in Note 3. On February 11, 2011, Treasury announced the consolidation of the Treasury Retail Securities operations and, as a result, the related operations currently performed at the Federal Reserve Bank of Cleveland will be consolidated at the Federal Reserve Bank of Minneapolis. Treasury plans to complete the consolidation by the end of 2011, and the Federal Reserve Bank of Cleveland is evaluating the consolidation efforts and has not yet determined the effects on the 2011 financial statements. There were no other subsequent events that require adjustments to or disclosures in the combined financial statements as of December 31, 2010. Subsequent events were evaluated through March 22, 2011, which is the date that the Board issued the combined financial statements., 580333=Federal Medicare Part D subsidy receipts were $4.3 million and $6.4 million in the years ended December 31, 2010 and 2009, respectively. Expected receipts in 2011, related to benefits paid in the years ended December 31, 2010 and 2009, are $1 million., 128745=A relatively small number of Board employees participate in the Civil Service Retirement System (CSRS) or the Federal Employees' Retirement System (FERS). These defined benefit plans are administered by the U.S. Office of Personnel Management, which determines the required employer contribution levels. The Board's contributions to these plans totaled $452,000 and $329,000 in 2010 and 2009, respectively. The Board has no liability for future payments to retirees under these programs and is not accountable for the assets of the plans., 555958=The following tables present the financial instruments recorded at fair value as of December 31 by ASC 820 hierarchy (in millions):, 247192=The Commercial Paper Funding Facility (CPFF program) enhanced the liquidity of the commercial paper market in the U.S. by increasing the availability of term commercial paper funding to issuers and by providing greater assurance to both issuers and investors that issuers would be able to roll over their maturing commercial paper. The authorization to purchase high-quality commercial paper through the CPFF program expired on February 1, 2010. The Commercial Paper Funding Facility LLC (CPFF) was a Delaware limited liability company formed on October 14, 2008, in connection with the implementation of the CPFF program, to purchase eligible three-month unsecured commercial paper and ABCP directly from eligible issuers using the proceeds of loans made to CPFF by the FRBNY. The FRBNY's loans to CPFF were eliminated in consolidation of CPFF into the combined financial statements. The last commercial paper purchased by the CPFF matured on April 26, 2010, and the CPFF was dissolved on August 30, 2010. CPFF's financial statements as of May 31, 2010 and for the period January 1, 2010, through May 31, 2010, and as of and for the year-ended December 31, 2009 were last published on August 30, 2010., 10888=The management of the Board of Governors of the Federal Reserve System (\"the Board\") is responsible for the preparation and fair presentation of the balance sheet as of December 31, 2010, and for the related statement of revenues and expenses and changes in cumulative results of operations, and cash flows for the year then ended (the \"Financial Statements\"). The Financial Statements have been prepared in conformity with accounting principles generally accepted in the United States of America and, as such, include some amounts which are based on management judgments and estimates. To our knowledge, the Financial Statements are, in all material respects, fairly presented in conformity with generally accepted accounting principles and include all disclosures necessary for such presentation., 540539=The weighted-average assumptions used in developing the accumulated pension benefit obligation for the System Plan as of December 31 were as follows:, 502766=5. Investments with a fair value of $209 million as of December 31, 2009 were reclassified from CDOs to Non-agency RMBS. Return to table, 104490=On October 30, 2008, the Board approved a non-qualified plan for Officers of the Board. The retirement benefits covered under the Board Officer Pension Enhancement (BOPE) increases the pension benefit calculation from 1.8% above the Social Security integration level to 2.0%. Activity for the BOPE as of December 31, 2010 and 2009, is summarized in the following tables:, 304600=In the event of a decrease in capital paid-in, the excess surplus, after equating capital paid-in and surplus at December 31, is distributed to the Treasury in the following year., 502072=4. Non-agency RMBS, with a December 31, 2009 fair value of $3,830 million, were transferred from Level 3 to Level 2 because they are valued at December 31, 2010 based on quoted prices in non-active markets (Level 2). These investments were valued in the prior year on non-observable model based inputs (Level 3). There were also certain non-agency RMBS for which valuation inputs became less observable during the year ended December 31, 2010 which resulted in $2,647 million in transfers from Level 2 to Level 3. There were no other significant transfers between Level 2 and Level 3 during the year. Return to table, 372595=There were no transactions related to the foreign currency liquidity swaps during the years ended December 31, 2010 and 2009., 254307=In September 2008, the Board of Governors authorized the FRBNY to lend to American International Group, Inc. (AIG). Initially, the FRBNY provided AIG with a revolving line of credit collateralized by the pledge of a substantial portion of the assets of AIG. Under the provisions of the original agreement, the FRBNY was authorized to lend up to $85 billion to AIG for two years at the three-month Libor, with a floor of 350 basis points, plus 850 basis points. In addition, the FRBNY assessed AIG a one-time commitment fee of 200 basis points on the full amount of the commitment and a fee of 850 basis points per annum on the undrawn credit line. A condition of the credit agreement was that AIG would issue to a trust, for the sole benefit of the fiscal treasury, preferred shares convertible to approximately 78 percent of the issued and outstanding shares of the common stock of AIG. The AIG Credit Facility Trust (AIG Trust) was formed January 16, 2009 and the preferred shares were issued to the AIG Trust on March 4, 2009. The AIG Trust had three independent trustees who control the AIG Trust's voting and consent rights. The FRBNY cannot exercise voting or consent rights., 170000=Sec. 1017 of the Dodd-Frank Act requires the Board to fund the Bureau the amount needed to carry out the authorities granted to the Bureau under Federal consumer financial law. Beginning July 2011, the Act limits the amount to be transferred each fiscal year to a fixed percentage of the System's total operating expenses. During 2010, the Board received and processed funding requests for the Bureau totaling $32,770,000., 62995=The Federal Reserve System (the System) was established by Congress in 1913 and consists of the Board of Governors (the Board), the Federal Open Market Committee, the twelve regional Federal Reserve Banks, the Federal Advisory Council, and the private commercial banks that are members of the System. The Board, unlike the Reserve Banks, was established as a federal government agency and is supported by Washington, D.C. based staff numbering approximately 2,100, as it carries out its responsibilities in conjunction with other components of the Federal Reserve System., 368144=The remaining maturity distribution of foreign currency denominated assets at December 31, 2010, was as follows (in millions):, 375320=The classification of significant assets and liabilities of the consolidated VIEs at December 31 was as follows (in millions):, 249859=Pursuant to a put agreement with the FRBNY, TALF LLC has committed to purchase assets that secure a TALF loan at a price equal to the principal amount outstanding plus accrued but unpaid interest, regardless of the fair value of the collateral. Funding for the TALF LLC's purchases of these securities is derived first through the fees received by TALF LLC from the FRBNY for this commitment and any interest earned on its investments. In the event that such funding proves insufficient for the asset purchases that TALF LLC has committed to make under the put agreement, the Treasury committed to lend up to $20 billion, and on March 25, 2009, the Treasury funded $100 million. On July 19, 2010, this commitment was reduced to $4.3 billion to reflect the fact that only $43 billion of TALF loans were outstanding when the program closed to new lending on June 30, 2010. Treasury's loan to TALF LLC bears interest at a rate of the one-month London interbank offered rate (Libor) plus 300 basis points. In addition to Treasury's commitment, the FRBNY committed, as a senior lender, to lend up to $180 billion to TALF LLC if it needed the funding to purchase assets pursuant to the put agreement. The FRBNY's maximum exposure was subsequently reduced to $38.7 billion when the program closed to new lending. Any loan that the FRBNY makes to TALF LLC would be senior to any Treasury loan and would bear interest at a rate of the one-month Libor plus 100 basis points. To the extent that Treasury and the FRBNY have extended credit to TALF LLC, their loans are secured by all of the assets of TALF LLC. The FRBNY is the managing member and the controlling party of TALF LLC and will remain the controlling party as long as it retains an economic interest in TALF LLC. After TALF LLC has paid all operating expenses and principal due to the FRBNY, the remaining proceeds of the portfolio holdings will be distributed in the following order: principal due to Treasury, interest due to the FRBNY, and interest due to Treasury. Any residual cash flows will be shared between the FRBNY, which will receive 10 percent, and the Treasury, which will receive 90 percent., 420006=The following table summarizes the state in which residential mortgage loans are collateralized and the property types of the commercial mortgage loans held in the ML portfolio at December 31, 2010:, 519048=The Reserve Banks lease space to outside tenants with remaining lease terms ranging from one to fourteen years. Rental income from such leases was $34 million and $32 million for the years ended December 31, 2010 and 2009, respectively, and is reported as a component of \"Other income\" in the Combined Statements of Income and Comprehensive Income. Future minimum lease payments that the Reserve Banks will receive under noncancelable lease agreements in existence at December 31, 2010 are as follows (in millions):, 81930=Employees of the Board who became employed prior to 1984 are covered by a contributory defined benefits program under the System Plan. Employees of the Board who became employed after 1983 are covered by a non-contributory defined benefits program under the System Plan. Contributions to the System Plan are actuarially determined and funded by participating employers. In 2010, the System made $580 million in contributions to the System Plan; the contributions may be adjusted upon completion of the 2011 actuarial valuation. The Board was not assessed a contribution for 2010., 17514=We have audited the internal control over financial reporting of the Board of Governors of the Federal Reserve System (the \"Board\") as of December 31, 2010, based on criteria established in Internal Control--Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. The Board's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Assertion report. Our responsibility is to express an opinion on the Board's internal control over financial reporting based on our audit., 401161=1. The TALF LLC's unrealized loss on beneficial interest represents Treasury's financial interest in the net income of TALF LLC for the year ended December 31, 2009. Return to table, 601260=During 2010, the OIG completed 21 audits, inspections, and evaluations (table 1) and conducted a number of follow-up reviews to evaluate action taken on prior recommendations. Due to the sensitive nature of some of the material, certain reports were only issued internal to the Board, as indicated. OIG investigative work resulted in five arrests, five indictments, one criminal information, six convictions, and one termination, as well as $837,148 in monetary recoveries and $3,810,050 in criminal fines and restitution. Two investigations were closed during the year. The OIG also issued two semiannual reports to Congress and performed approximately 50 reviews of legislation and regulations related to the operations of the Board and/or the OIG., 525410=At December 31, 2010, the Reserve Banks had unrecorded unconditional purchase commitments and long-term obligations extending through the year 2021 with a remaining fixed commitment of $178 million. Purchases of $54 million and $28 million were made against these commitments during 2010 and 2009, respectively. These commitments are for maintenance of currency processing machines and have variable and/or fixed components. The variable portion of the commitments is for additional services above the fixed contractual service limits., 242876=The FOMC authorized and directed the FRBNY to purchase GSE debt securities and Federal agency and GSE MBS, with a goal to provide support to mortgage and housing markets and to foster improved conditions in financial markets more generally. The FRBNY was authorized to purchase up to $175 billion in fixed-rate, non-callable GSE debt securities and $1.25 trillion in fixed-rate Federal agency and GSE MBS. Purchases of GSE debt securities began in November 2008, and purchases of Federal agency and GSE MBS began in January 2009. The FRBNY completed the purchases of GSE debt securities and Federal agency and GSE MBS in March 2010. The settlement of all Federal agency and GSE MBS transactions was completed by August 2010., 244772=The Term Auction Facility (TAF) promoted the efficient dissemination of liquidity by providing term funds to depository institutions. The last TAF auction was conducted on March 8, 2010, and the related loans matured on April 8, 2010., 305448=The Board of Governors assesses the Reserve Banks to fund its operations and the operations of the Bureau and, for a two-year period, the OFR. These assessments are allocated to each Reserve Bank based on each Reserve Bank's capital and surplus balances as of December 31 of the prior year for the Board of Governor's operations and as of the most recent quarter for the Bureau and OFR operations. The Board of Governors also assesses each Reserve Bank for the expenses incurred by the Treasury to produce and retire Federal Reserve notes based on each Reserve Bank's share of the number of notes comprising the System's net liability for Federal Reserve notes on December 31 of the prior year., 551511=The System Plan's policy weight and actual asset allocations at December 31, by asset category, are as follows:, 270977=The Dodd-Frank Act established the Bureau as an independent bureau within the Federal Reserve System, and section 1017 of the Dodd-Frank Act provides that the financial statements of the Bureau are not to be consolidated with those of the Board of Governors or the Federal Reserve System. Section 152 of the Dodd-Frank Act established the Office of Financial Research (OFR) within the Treasury. The Board of Governors funds the Bureau and OFR through assessments on the Reserve Banks as required by the Dodd-Frank Act. The Reserve Banks reviewed the law and evaluated the design of and their relationships to the Bureau and the OFR and determined that neither should be consolidated in the Reserve Banks' combined financial statements., 279585=The FRBNY may engage in sales of securities under agreements to repurchase (reverse repurchase transactions) with primary dealers and, beginning August 2010, with selected money market funds as an open market operation. These reverse repurchase transactions may be executed through a tri-party arrangement, similar to repurchase transactions. Reverse repurchase transactions may also be executed with foreign official and international account holders as part of a service offering. Reverse repurchase agreements are collateralized by a pledge of an amount of Treasury securities, GSE debt securities, and Federal agency and GSE MBS that are held in the SOMA. Reverse repurchase transactions are accounted for as financing transactions, and the associated interest expense is recognized over the life of the transaction. These transactions are reported at their contractual amounts as \"System Open Market Account: Securities sold under agreements to repurchase\" and the related accrued interest payable is reported as a component of \"Other liabilities\" in the Combined Statements of Condition., 384130=Total realized and unrealized gains (losses) for the year-ended December 31, 2009, were as follows (in millions):, 260334=On December 1, 2009, the FRBNY's commitment to lend to AIG was reduced to $35 billion from $60 billion when the outstanding balance of the FRBNY's loan to AIG was reduced by $25 billion in exchange for a liquidation preference of nonvoting perpetual preferred interests in two limited liability companies. AIG created these limited liability companies to hold, directly or indirectly, all of the outstanding common stock of American Life Insurance Company (ALICO) and American International Assurance Company Ltd. (AIA), two life insurance holding company subsidiaries of AIG. The FRBNY was to be paid a 5 percent cumulative dividend on its nonvoting preferred interests through September 22, 2013 and a 9 percent cumulative dividend thereafter. Although the FRBNY had certain governance rights to protect its interests, AIG retained control of the LLCs and the underlying operating companies. The initial value of the FRBNY's preferred interests as of December 1, 2009 was $16 billion for the AIA Aurora LLC (AIA LLC) and $9 billion for the ALICO Holdings LLC (ALICO LLC), which represented a percentage of the fair market value of AIA and ALICO, respectively., 370627=There were no foreign exchange contracts related to open market operations outstanding as of December 31, 2010., 434567=The following table summarizes the fair value of derivative instruments by contract type on a gross basis as of December 31, 2010 and 2009, which is reported as a component of \"Consolidated variable interest entities: Investments held by consolidated variable interest entities\" in the Combined Statement of Condition (in millions):, 438452=The table below summarizes certain information regarding protection sold through CDS as of December 31 (in millions):, 573089=For measurement purposes, the assumed health care cost trend rates at December 31 are as follows:, 285680=Warehousing is an arrangement under which the FOMC has approved the exchange, at the request of the Treasury, of U.S. dollars for foreign currencies held by the Treasury over a limited period of time. The purpose of the warehousing facility is to supplement the U.S. dollar resources of the Treasury for financing purchases of foreign currencies and related international operations. Warehousing agreements are designated as held-for-trading purposes and are valued daily at current market exchange rates. Activity related to these agreements is allocated to each Reserve Bank based on the ratio of each Reserve Bank's capital and surplus to aggregate capital and surplus at the preceding December 31., 66795=Section 1017 of the Dodd-Frank Act provides that the financial statements of the Bureau are not to be consolidated with those of the Board or the System. The Board has also determined that neither the FSOC nor the Office should be consolidated in the Board's financial statements. Accordingly, the Board's financial statements do not include financial data of the Bureau, the Office, or the FSOC other than the funding that the Board is required by the Dodd-Frank Act to provide. (See Notes 13 and 14), 312662=In January 2010, the FASB issued Accounting Standards Update 2010-06, Fair Value Measurements and Disclosures (Topic 820). New requirements for disclosure of information about transfers among the hierarchy's classification and the level of disaggregation of classes of assets were effective for the Reserve Banks for the year beginning on January 1, 2010, and the required disclosures are included in Note 5, Note 9, and Note 13. Other requirements, including the gross presentation of purchases, sales, issuances, and settlements in the reconciliation for Level 3 fair value measurements are effective for the Reserve Banks in 2011 and are not expected to have a material effect on the Reserve Banks' combined financial statements., 175463=We have audited the financial statements of the Board of Governors of the Federal Reserve System (the \"Board\") as of and for the year ended December 31, 2010, and have issued our report thereon dated February 28, 2011. We conducted our audit in accordance generally accepted auditing standards as established by the Auditing Standards Board (United States), auditing standards of the Public Company Accounting Oversight Board (United States), and the standards applicable to financial audits contained in Government Auditing Standards, issued by the Comptroller General of the United States., 314827=The remaining maturity distribution of loans outstanding at December 31, 2010, and total loans outstanding at December 31, 2009, were as follows (in millions):, 243726=The FOMC authorized and directed the FRBNY to establish central bank liquidity swap arrangements, which could be structured as either U.S. dollar liquidity or foreign currency liquidity swap arrangements. U.S. dollar liquidity swap arrangements were authorized with 14 foreign central banks to provide liquidity in U.S. dollars to overseas markets. The authorization for these swap arrangements expired on February 1, 2010. In May 2010, U.S. dollar liquidity swap arrangements were reestablished with the Bank of Canada, the Bank of England, the European Central Bank, the Bank of Japan, and the Swiss National Bank; these arrangements will expire on August 1, 2011., 336634=The fair value of the AIG revolving line of credit provided by the FRBNY, based on estimated and actual draws and repayments, was not materially different from the net amount reported in the Combined Statements of Condition as of December 31, 2010 and 2009., 493510=The tables below present a reconciliation of all assets and liabilities measured at fair value on a recurring basis using significant unobservable inputs (Level 3) as of December 31, 2010 and 2009 (in millions). Unrealized gains and losses related to those assets still held at December 31, 2010 and 2009, are reported as a component of \"Consolidated variable interest entities: Investments held by consolidated variable interest entities, net\" in the Combined Statements of Condition., 429903=Futures contracts are agreements to buy and sell financial instruments for a set price on a future date. Initial margin deposits are made upon entering into futures contracts in the form of cash or securities. During the period that a futures contract is open, changes in the value of the contract are recorded as unrealized gains or losses by revaluing the contracts daily to reflect the market value of the contract at the end of each day's trading. Variation margin payments are paid or received, depending upon whether unrealized gains or losses result. When the contract is closed, ML will record a realized gain or loss equal to the difference between the proceeds from (or cost of) the closing transaction and ML's cost basis in the contract. The use of futures transactions involves the risk of imperfect correlation in movements in the price of futures contracts, interest rates, and the underlying hedged assets. ML is also at risk of not being able to enter into a closing transaction for the futures contract because of an illiquid secondary market. ML had pledged cash collateral related to future contracts of $18 million and $40 million as of December 31, 2010 and 2009, respectively., 523397=Rental expense under operating leases for certain operating facilities, warehouses, and data processing and office equipment (including taxes, insurance, and maintenance when included in rent), net of sublease rentals, was $30 million and $27 million for the years ended December 31, 2010 and 2009, respectively., 129683=The Board provides certain life insurance programs for its active employees and retirees. Activity as of December 31, 2010 and 2009, is summarized in the following tables:, 553856=Employer contributions to the System Plan may be determined using different assumptions than those required for financial reporting. The System Plan's actuarial funding method is expected to produce a recommended annual funding range between $350 and $400 million. In 2011, the System will make monthly contributions of $35 million and will reevaluate the monthly contributions upon completion of the 2011 actuarial valuation. The Reserve Banks' projected benefit obligation, funded status, and net pension expenses for the BEP and the SERP at December 31, 2010 and 2009, and for the years then ended, were not material., 608894=The Federal Banking Agency Audit Act (Pub. L. No. 95-320) authorizes the Government Accountability Office (GAO) to audit certain aspects of Federal Reserve System operations. The Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (Dodd-Frank Act) directs GAO to conduct additional audits with respect to these operations. For example, under the Dodd-Frank Act, GAO is required to conduct a one-time audit of the existing credit facilities established by the Federal Reserve under section 13(3) of the Federal Reserve Act between December 1, 2007, and July 21, 2010. GAO is instructed to examine the involvement of the Reserve Banks in the establishment and operation of any such emergency facility or program. The Dodd-Frank Act also instructs GAO to conduct operational audits of all future credit facilities established under section 13(3), and of discount window and open market transactions engaged in after July 21, 2010. However, GAO is prohibited from disclosing participant- and transaction-specific information until the Federal Reserve Board is required to disclose this information. Additionally, GAO is required to complete an audit of Reserve Bank governance no later than July 21, 2011., 546219=Estimated amounts that will be amortized from accumulated other comprehensive loss into net periodic pension benefit expense in 2011 are shown below:, 16470=In accordance with Government Auditing Standards, we have also issued our report dated February 28, 2011, on our tests of the Board's compliance with certain provisions of laws, regulations, contracts, and grant agreements and other matters. The purpose of that report is to describe the scope of our testing of compliance and the results of that testing, and not to provide an opinion on compliance. That report is an integral part of an audit performed in accordance with Government Auditing Standards and should be considered in assessing the results of our audit., 574432=Assumed health care cost trend rates have a significant effect on the amounts reported for health care plans. A 1 percentage point change in assumed health care cost trend rates would have the following effects for the year ended December 31, 2010 (in millions):, 410139=At December 31, 2010, the ratings breakdown of the $19.6 billion of debt securities, which are recorded at fair value in the ML portfolio as a percentage of aggregate fair value of all securities in the portfolio was as follows:, 170598=Sec. 155(c) of the Dodd-Frank Act requires the Board to provide an amount sufficient to cover the expenses of the Office for the 2-year period following the date of the enactment (July 21, 2010). The expenses of the FSOC are included in the expenses of the Office. During 2010, the Board received and processed funding requests for the Office totaling $9,515,944., 281244=Activity related to securities purchased under agreements to resell, securities sold under agreements to repurchase, and securities lending is allocated to each of the Reserve Banks on a percentage basis derived from an annual settlement of the interdistrict settlement account that occurs in April each year., 563963=At December 31, 2010 and 2009, a portion of short-term investments was available for futures trading. There were $1 million of Treasury securities pledged as collateral for each of the years ended December 31, 2010 and 2009., 406964=ML's investment portfolio consists primarily of Federal agency and GSE MBS, non-agency RMBS, commercial and residential mortgage loans, and derivatives and associated hedges. Following is a description of the significant holdings at December 31, 2010 and the associated credit risk for each holding:, 338501=The allowance for loan restructuring represented the economic effect of the reduction of the interest rate on loans the FRBNY made to AIG prior to April 17, 2009 as part of the loan restructuring that occurred on that date. The restructuring charges were recovered over the remaining term of the related loan as adjustments to the allowance, which resulted from periodic evaluations and are reported as a component of \"Interest income: American International Group, Inc., net\" on the Combined Statements of Income and Comprehensive Income. The average balance of the loans to AIG under the revolving line of credit, net of the allowance for restructuring, during the year ended December 31, 2010 and 2009, was $22,874 million and $39,099 million, respectively., 388054=The net income (loss) attributable to ML, ML II, ML III, CPFF, and TALF LLC for the year-ended December 31, 2010 was as follows (in millions):, 82524=Effective January 1, 1996, Board employees covered under the System Plan are also covered under a Benefits Equalization Plan (BEP). Benefits paid under the BEP are limited to those benefits that cannot be paid from the System Plan due to limitations imposed by Sections 401(a)(17), 415(b) and 415(e) of the Internal Revenue Code of 1986. Activity for the BEP as of December 31, 2010 and 2009, is summarized in the following tables:, 363287=The FRBNY enters into commitments to buy Treasury and GSE debt securities and records the related securities on a settlement-date basis. There were no commitments to buy Treasury and GSE debt securities as of December 31, 2010., 517389=Bank premises and equipment at December 31 included the following amounts for capitalized leases (in millions):, 579678=The Medicare Prescription Drug, Improvement and Modernization Act of 2003 established a prescription drug benefit under Medicare (Medicare Part D) and a federal subsidy to sponsors of retiree health care benefit plans that provide benefits that are at least actuarially equivalent to Medicare Part D. The benefits provided under the Reserve Banks' plan to certain participants are at least actuarially equivalent to the Medicare Part D prescription drug benefit. The estimated effects of the subsidy are reflected in actuarial loss (gain) in the accumulated postretirement benefit obligation and net periodic postretirement benefit expense., 72005=The following is a summary of the components of the Board's property, equipment, and software, at cost, net of accumulated depreciation and amortization as of December 31, 2010 and 2009:, 401630=Following is a summary of the consolidated VIEs' subordinated financial interest for the years ended December 31, 2010 and 2009 (in millions):, 531447=As a result of the closing of the AIG recapitalization plan on January 14, 2011, the revolving line of credit was paid in full, including interest and fees, and FRBNY's commitment to lend any further funds was terminated., 67697=Revenues--The Federal Reserve Act authorizes the Board to levy an assessment on the Reserve Banks to fund its operations. The Board levies the assessment based on each Reserve Bank's capital and surplus balances as of December 31 of the prior year., 523065=At December 31, 2010, the Reserve Banks were obligated under noncancelable leases for premises and equipment with remaining terms ranging from one to approximately thirteen years. These leases provide for increased rental payments based upon increases in real estate taxes, operating costs, or selected price indices., 150279=A reconciliation of beginning and ending balances of accumulated other comprehensive income (loss) for the years ended December 31, 2010 and 2009, is as follows:, 370303=At December 31, 2010 and 2009, the authorized warehousing facility was $5 billion, with no balance outstanding., 427050=On an ongoing basis, ML pledges collateral for credit or liquidity related shortfalls based on 20 percent of the notional amount of sold CDS protection and 10 percent of the present value of future premiums on purchased CDS protection. Failure to post this collateral constitutes a TRS event of default. Separately, ML and JPMC engage in bilateral posting of collateral to cover the net mark-to-market (MTM) variations in the swap portfolio. ML nets the collateral received from JPMC from the bilateral MTM posting only to the extent that the reference obligations indicate JPMC as the original counterparty to Bear Stearns on March 14, 2008. The values of ML's cash equivalents and investments, purchased by the re-hypothecation of cash collateral associated with the TRS, were $0.8 billion and $0 billion, respectively, as of December 31, 2010, and $0.8 billion and $0.5 billion, respectively, as of December 31, 2009. In addition, ML has pledged $1.0 billion and $1.5 billion of Federal agency and GSE MBS to JPMC as of December 31, 2010 and 2009, respectively., 245130=The Term Securities Lending Facility (TSLF) promoted liquidity in the financing markets for Treasury securities. Under the TSLF, the FRBNY could lend up to an aggregate amount of $200 billion of Treasury securities held in the SOMA to primary dealers on a secured basis for a term of 28 days. The authorization for the TSLF expired on February 1, 2010., 249426=The TALF loans were extended on a nonrecourse basis. If the borrower does not repay the loan, the FRBNY will enforce its rights in the collateral and may sell the collateral to TALF LLC, a Delaware limited liability company, established on February 4, 2009, for the purpose of purchasing such assets. As of December 31, 2010, the FRBNY has not enforced its rights to the collateral because there have been no defaults., 303007=The Board of Governors requires the Reserve Banks to maintain a surplus equal to the amount of capital paid-in as of December 31 of each year. Accumulated other comprehensive income is reported as a component of \"Surplus\" in the Combined Statements of Condition and the Combined Statements of Changes in Capital. Additional information regarding the classifications of accumulated other comprehensive income is provided in Notes 13, 14, and 15., 313418=In March 2010, the FASB issued Accounting Standards Update 2010-11, Derivatives and Hedging, (Topic 815), which clarifies embedded credit derivatives that are subject to the FASB's guidance on derivatives and hedging and defines the embedded credit derivatives that are required to be evaluated for bifurcation and separate accounting. The adoption of this accounting guidance was effective for the Reserve Banks on July 1, 2010 and did not have a material effect on the Reserve Banks' combined financial statements., 364927=The Reserve Bank's foreign currency denominated assets, including accrued interest, valued at amortized cost and foreign currency market exchange rates at December 31 was as follows (in millions):, 590232=In 2010, the Reserve Banks announced the consolidation of some of their currency processing operations. As a result of this initiative, currency processing operations performed by two Reserve Bank Branch offices will be consolidated., 313958=In July 2010, the FASB issued Accounting Standards Update 2010-20, Receivables (Topic 310), which requires additional disclosures about the allowance for credit losses and the credit quality of loan portfolios. The additional disclosures include a rollforward of the allowance for credit losses on a disaggregated basis and more information, by type of receivable, on credit quality indicators, including the amount of certain past due receivables and troubled debt restructurings and significant purchases and sales. The adoption of this accounting guidance is effective for the Reserve Banks on December 31, 2011, and is not expected to have a material effect on the Reserve Banks' combined financial statements., 590777=Restructuring plans announced prior to 2009 included the acceleration of their check restructuring initiatives to align the check processing infrastructure and operations with declining check processing volumes. The new infrastructure consolidated operations into two regional Reserve Bank processing sites; one in Cleveland, for paper check processing, and one in Atlanta, for electronic check processing. Additional announcements in 2008 included restructuring plans associated with the closure of a check processing contingency center and the consolidation of check adjustments sites., 373005=The total assets of consolidated VIEs, including cash, cash equivalents, and accrued interest, at December 31 were as follows (in millions):, 578354=Estimated amounts that will be amortized from accumulated other comprehensive loss into net periodic postretirement benefit expense in 2011 are shown below:, 323986=The following table presents a reconciliation of TALF loans measured at fair value using significant unobservable inputs (Level 3) during the year-ended December 31, 2010 and for the period February 4, 2009, to December 31, 2009, (in millions):, 311274=In June 2009, the FASB issued Statement of Financial Accounting Standards (SFAS) 166, Accounting for Transfers of Financial Assets--An Amendment to FASB Statement No. 140 (codified in ASC 860). The new standard revises the criteria for recognizing transfers of financial assets as sales and clarifies that the transferor must consider all arrangements when determining if the transferor has surrendered control. The adoption of this accounting guidance was effective for the Reserve Banks for the year beginning on January 1, 2010, and did not have a material effect on the Reserve Banks' combined financial statements., 409310=As of December 31, 2010, approximately 38.3 percent and 12.3 percent of the properties collateralizing the non-agency RMBS held by ML were located in California and Florida, respectively, based on the total unpaid principal balance of the underlying loans., 10750=February 28, 2011, 252207=To facilitate the merger of The Bear Stearns Companies, Inc. (Bear Stearns) and JPMorgan Chase & Co. (JPMC), the FRBNY extended credit to Maiden Lane LLC (ML) in June 2008. ML is a Delaware limited liability company formed by the FRBNY to acquire certain assets of Bear Stearns and to manage those assets over time, in order to maximize the potential for the repayment of the credit extended to ML and to minimize disruption to the financial markets. The assets acquired by ML were valued at $29.9 billion as of March 14, 2008, the date that the FRBNY committed to the transaction, and largely consisted of Federal agency and GSE MBS, non-agency residential mortgage-backed securities (RMBS), commercial and residential mortgage loans, and derivatives and associated hedges., 320765=At December 31, 2010 and 2009, the Reserve Banks did not have any impaired loans and no allowances for loan losses were required. There were no impaired loans during the years ended December 31, 2010 and 2009., 360559=The par value of Treasury securities and GSE debt securities that were loaned from the SOMA at December 31 was as follows (in millions):, 514410=Bank premises and equipment at December 31 were as follows (in millions):, 183919=March 22, 2011 Washington, DC, 80628=The Board leases and subleases space, primarily to other governmental agencies. The revenues collected from these leases are $1,937,000 and $2,504,000 in 2010 and 2009, respectively., 415762=The performance profile for the commercial and residential mortgage loans at December 31, 2010, was as follows (in millions):, 541556=Net periodic benefit expenses for the years ended December 31, 2010 and 2009, were actuarially determined using a January 1 measurement date. The weighted-average assumptions used in developing net periodic benefit expenses for the System Plan for the years were as follows:, 174749=There were no subsequent events that require adjustments to or disclosures in the financial statements as of December 31, 2010. Subsequent events were evaluated through February 28, 2011, which is the date the financial statements were available to be issued., 448775=At December 31, 2010, the type/sector and rating composition of the ML II's $16.2 billion non-agency RMBS portfolio, recorded at fair value, as a percentage of aggregate fair value, were as follows:, 477135=The following tables present the financial instruments recorded in VIEs at fair value as of December 31 by ASC 820 hierarchy (in millions):, 540226=The accumulated benefit obligation for the System Plan, which differs from the estimated actuarial present value of projected benefit obligation because it is based on current rather than future compensation levels, was $7,136 million and $6,430 million at December 31, 2010 and 2009, respectively., 331815=At December 31, 2010 and 2009, no TALF loans were over 90 days past due or in nonaccrual status., 15587=In our opinion, such financial statements present fairly, in all material respects, the financial position of the Board of Governors of the Federal Reserve System as of December 31, 2010 and 2009, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America., 248409=The Term Asset-Backed Securities Loan Facility (TALF) assisted financial markets in accommodating the credit needs of consumers and businesses of all sizes by facilitating the issuance of asset-backed securities (ABS) collateralized by a variety of consumer and business loans. The Board of Governors authorized the offering of TALF loans collateralized by newly-issued ABS and legacy commercial mortgage-backed securities (CMBS) until March 31, 2010, and TALF loans collateralized by newly-issued CMBS until June 30, 2010. Under the TALF, the FRBNY was authorized to lend up to $200 billion to eligible borrowers., 434163=2. There were 1,400 and 1,764 CDS and IRS contracts outstanding as of December 2010, and 2009, respectively. Return to table, 241943=The FOMC authorized and directed the FRBNY to purchase $300 billion of longer-term Treasury securities to help improve conditions in private credit markets. The FRBNY began the purchases of these Treasury securities in March 2009 and completed them in October 2009. On August 10, 2010, the FOMC announced that the Federal Reserve will maintain the level of domestic securities holdings in the SOMA portfolio by reinvesting principal payments from GSE debt securities and Federal agency and GSE MBS in longer-term Treasury securities. On November 3, 2010, the FOMC announced its intention to expand the SOMA portfolio holdings of longer-term Treasury securities by an additional $600 billion by June 2011. The FOMC will regularly review the pace of these securities purchases and the overall size of the asset purchase program and will adjust the program as needed to best foster maximum employment and price stability., 514038=As a result of the closing of the AIG recapitalization plan on January 14, 2011, the FRBNY was paid in full for its preferred interests in AIA LLC and ALICO LLC, including accrued dividends., 81146=Substantially all of the Board's employees participate in the Retirement Plan for Employees of the Federal Reserve System (the System Plan). The System Plan provides retirement benefits to employees of the Board, the Federal Reserve Banks, and the Office of Employee Benefits of the Federal Reserve System (OEB). In addition, under the Dodd-Frank Act, employees of the Bureau can elect to participate in the System Plan; however, there were no Bureau participants in the System Plan as of December 31, 2010. The Federal Reserve Bank of New York (FRBNY), on behalf of the System, recognizes the net assets and costs associated with the System Plan in its financial statements. Costs associated with the System Plan are not redistributed to other participating employers., 600377=The Office of Inspector General (OIG) for the Federal Reserve Board operates in accordance with the Inspector General Act of 1978, as amended. The OIG conducts activities and makes recommendations to promote economy and efficiency; enhance policies and procedures; and prevent and detect waste, fraud, and abuse in Board programs and operations, including functions that the Board has delegated to the Federal Reserve Banks. Accordingly, the OIG plans and conducts audits, inspections, evaluations, investigations, and other reviews relating to Board and Board-delegated programs and operations. It also retains an independent auditor to annually audit the Board's and the Federal Financial Institutions Examination Council's financial statements. In addition, the OIG keeps the Congress and the Board of Governors fully informed about serious abuses and deficiencies., 363759=During the years ended December 31, 2010 and 2009, the Reserve Banks recorded net gains from dollar roll and coupon swap related transactions of $782 million and $879 million, respectively. These net gains are reported as \"Non-interest income (loss): Federal agency and government-sponsored enterprise mortgage-backed securities gains, net\" in the Combined Statements of Income and Comprehensive Income., 21223=We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), generally accepted auditing standards as established by the Auditing Standards Board (United States), and the standards applicable to financial audits contained in Government Auditing Standards issued by the Comptroller General of the United States, the accompanying balance sheet, statements of revenues and expenses and changes in cumulative results of operations, and cash flows as of and for the year ended December 31, 2010 of the Board and our report dated February 28, 2011 expressed an unqualified opinion on those financial statements., 442510=The table below summarizes certain information regarding protection bought through CDS as of December 31 (in millions):, 129298=Employees of the Board may also participate in the Federal Reserve System's Thrift Plan or Roth 401(k). Board contributions to members' accounts were $16,695,000 and $14,342,000 in 2010 and 2009, respectively., 575727=The following is a summary of the components of net periodic postretirement benefit expense for the years ended December 31 (in millions):, 532013=The Reserve Banks currently offer three defined benefit retirement plans to their employees, based on length of service and level of compensation. Substantially all of the employees of the Reserve Banks, Board of Governors, and Office of Employee Benefits of the Federal Reserve System (OEB) participate in the Retirement Plan for Employees of the Federal Reserve System (System Plan). In addition, employees at certain compensation levels participate in the Benefit Equalization Retirement Plan (BEP) and certain Reserve Bank officers participate in the Supplemental Retirement Plan for Select Officers of the Federal Reserve Banks (SERP). Under the Dodd-Frank Act, employees of the Bureau can elect to participate in the System Plan. As of December 31, 2010, there were no Bureau participants in the System Plan., 299268=The Term Deposit Facility (TDF) consists of deposits with specific maturities held by eligible institutions at the Reserve Banks. The Reserve Banks pay interest on these deposits at interest rates determined by auction. Interest payable is reported as \"Interest payable to depository institutions\" on the Combined Statements of Condition. There were no deposits held by the Reserve Banks under the TDF at December 31, 2010., 370429=There were no transactions related to the authorized reciprocal currency arrangements with the Bank of Canada and the Bank of Mexico during the years ended December 31, 2010 and 2009., 311917=In June 2009, the FASB issued SFAS No. 167, Amendments to FASB Interpretation No. 46(R), (codified in ASC 810), which expands the scope of Interpretation 46R, Consolidation of Variable Interest Entities and changes the approach for determining whether an entity has a controlling interest in a VIE by making a qualitative assessment of its financial interests. Additional disclosures are required for a variable interest in a VIE. The adoption of this accounting guidance was effective for the Reserve Banks for the year beginning on January 1, 2010, and earlier adoption was prohibited. The adoption of this accounting guidance did not have a material effect on the Reserve Banks' combined financial statements., 426688=ML enters into additional derivative contracts consisting of futures and IRS to economically hedge its exposure to interest rates. For 2010, there were 29 trades executed as IRS. All derivatives are recorded at fair value in accordance with ASC 815. None of the derivatives held by ML are designated as hedging instruments for accounting purposes., 363529=The FRBNY enters into commitments to buy Federal agency and GSE MBS and records the related MBS on a settlement-date basis. There were no commitments to buy or sell Federal agency or GSE MBS as of December 31, 2010., 339286=As a result of the closing of the AIG recapitalization plan on January 14, 2011, all outstanding draws under the revolving line of credit and the related accrued interest, capitalized interest and capitalized commitment fees were paid in full. The remaining amount of the unamortized deferred commitment fees and the allowance for loan restructuring as of the closing of the recapitalization were fully recognized at that date., 522095=The FRBSF disclosed a subsequent event in its 2009 financial statements, related to the termination of a contract for software development. The FRBSF has determined that a portion of the software development program will not be used, and in 2010 reduced the carrying value of the asset by $20.2 million. The adjustment to the asset value is reported as a component of \"Operating expenses: Other\" in the Combined Statements of Income and Comprehensive Income. The FRBSF expects the remaining asset value will be recovered through use in other continuing software development programs., 523724=Future minimum rental payments under noncancelable operating leases, net of sublease rentals, with remaining terms of one year or more, at December 31, 2010, are as follows (in millions):, 261510=On September 30, 2010, AIG announced an agreement with the Treasury, FRBNY, and the trustees of the AIG Trust on a comprehensive recapitalization plan designed to repay all its obligations to American taxpayers. The agreement included an accelerated repayment of the outstanding balance of the FRBNY revolving line of credit including all accrued interest and fees, termination of that facility, the repayment of the FRBNY's preferred interests in AIA LLC and ALICO LLC, and the conversion of the AIG preferred stock currently owned by the Treasury and the AIG Trust into common equity of AIG., 10157=The financial statements of the Board of Governors for 2010 and 2009 were audited by Deloitte & Touche LLP, independent auditors., 78528=Operating Leases--The Board has entered into several operating leases to secure office, training and warehouse space. Minimum annual payments under the operating leases having an initial or remaining noncancelable lease term in excess of one year at December 31, 2010, are as follows:, 287533=Central bank liquidity swaps activity, including the related income and expense, is allocated to each Reserve Bank based on the ratio of each Reserve Bank's capital and surplus to aggregate capital and surplus at the preceding December 31. The foreign currency amounts associated with these central bank liquidity swap arrangements are revalued at current foreign currency market exchange rates., 255503=The Board and the Treasury announced a restructuring of the government's financial support to AIG in November 2008. As part of the restructuring, the Treasury purchased $40 billion of newly-issued AIG preferred shares under the Troubled Asset Relief Program (TARP). The majority of the TARP funds were used to pay down AIG's debt to the FRBNY. In addition, the terms of the original credit agreement were modified to reduce the revolving line of credit to $60 billion; reduce the interest rate to the three-month Libor with a floor of 350 basis points, plus 300 basis points; reduce the fee on undrawn funds to 75 basis points; and extend the term of the agreement to five years. The other material terms of the funding were unchanged. These revised terms were more consistent with terms generally available to other entities with similar credit risk., 513310=The recorded value of the FRBNY's preferred interests, including capitalized dividends, was $16,886 million and $16,068 million for AIA LLC and $9,499 million and $9,038 million for ALICO LLC at December 31, 2010 and 2009, respectively. The FRBNY's preferred interests and capitalized dividends are reported as \"Preferred interests\" and dividends receivable are reported as a component of \"Other Assets\" in the Combined Statements of Condition., 169467=The Office of Employee Benefits of the Federal Reserve System (OEB) administers certain System benefit programs on behalf of the Board and the Reserve Banks, and costs associated with the OEB's activities are assessed to the Board and Reserve Banks. The Board was assessed $2,371,000 and $2,166,000 as of December 31, 2010 and 2009, respectively., 582817=The Reserve Banks offer benefits to former or inactive employees. Postemployment benefit costs are actuarially determined using a December 31 measurement date and include the cost of medical and dental insurance, survivor income, disability benefits, and self-insured workers' compensation expenses. The accrued postemployment benefit costs recognized by the Reserve Banks at December 31, 2010 and 2009, were $146 million and $153 million, respectively. This cost is included as a component of \"Accrued benefit costs\" in the Combined Statements of Condition. Net periodic postemployment benefit expense included in 2010 and 2009 operating expenses were $11 million and $56 million, respectively, and are recorded as a component of \"Salaries and benefits\" in the Combined Statements of Income and Comprehensive Income., 126605=The total accumulated retirement benefit obligation includes a liability for a supplemental retirement agreement and a benefits equalization plan under the Federal Reserve System's Thrift Plan. The total obligation as of December 31, 2010 and 2009 is summarized in the following table:, 183509=In our opinion, such Combined Financial Statements referred to above present fairly, in all material respects, the combined financial position of the Reserve Banks as of December 31, 2010 and 2009, and the combined results of their operations for the years then ended, on the basis of accounting described in Note 4., 353660=Financial information related to securities purchased under agreements to resell and securities sold under agreements to repurchase for the years ended December 31 was as follows (in millions):, 532842=The System Plan provides retirement benefits to employees of the Federal Reserve Banks, Board of Governors, and OEB and in the future will provide retirement benefits to certain employees of the Bureau. The FRBNY, on behalf of the System, recognizes the net asset or net liability and costs associated with the System Plan in its combined financial statements. During the years ended December 31, 2010 and 2009, costs associated with the System Plan were not reimbursed by other participating employers., 610124=In 2010, the GAO completed eight reports on selected aspects of Federal Reserve operations (table 1). In addition, 10 projects concerning the Federal Reserve were in various stages of completion at year-end, 5 of which were required under the Dodd-Frank Act (table 2). The Federal Reserve also provided information to the GAO during the year on numerous other GAO investigations, including 4 completed reviews and 15 ongoing reviews, 8 of which resulted from the Dodd-Frank Act. The reports are available directly from the GAO website., 14014=We have audited the accompanying balance sheets of the Board of Governors of the Federal Reserve System (the \"Board\") as of December 31, 2010 and 2009, and the related statements of revenues and expenses and changes in cumulative results of operations, and cash flows for the years then ended. These financial statements are the responsibility of the Board's management. Our responsibility is to express an opinion on these financial statements based on our audits., 331645=The aggregate remaining principal amount outstanding on TALF loans as of December 31, 2010 and 2009, was $24,703 million and $47,574 million, respectively., 238226=The Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (Dodd-Frank Act), which was signed into law and became effective on July 21, 2010, changed the scope of some services performed by the Reserve Banks. Among other things, the Dodd-Frank Act establishes a Bureau of Consumer Financial Protection (Bureau) as an independent bureau within the Federal Reserve System that will have supervisory authority over some institutions previously supervised by the Reserve Banks under delegated authority from the Board of Governors in connection with those institutions' compliance with consumer protection statutes; limits the Reserve Banks' authority to provide loans in unusual and exigent circumstances to lending programs or facilities with broad-based eligibility; and vests the Board of Governors with all supervisory and rule-writing authority for savings and loan holding companies., 530686=The contractual amount of the commitment related to the AIG secured revolving line of credit represents the maximum commitment at December 31, 2010, to lend to AIG and the unfunded amount represents the maximum commitment reduced by draws outstanding. The amount of the FRBNY's commitment to lend to AIG was reduced during the year ended December 31, 2009 as a result of the debt restructurings described in Note 3, Note 4, and Note 5. The FRBNY's commitment was further reduced during the year ended December 31, 2010, as a result of AIG asset sales. Collateral to secure the FRBNY's loan to AIG includes equity interests of various AIG subsidiaries. The FRBNY did not incur any losses related to the unfunded commitment as of December 31, 2010., 370753=The FRBNY enters into commitments to buy foreign government debt instruments and records the related securities on a settlement-date basis. As of December 31, 2010, there were outstanding commitments to purchase Euro-denominated government debt instruments of $209 million. These securities settled on January 4, 2011, and replaced Euro-denominated government debt instruments held in the SOMA that matured on that date., 456511=At December 31, 2010, the investment type/vintage and rating composition of ML III's $23 billion portfolio, recorded at fair value, as a percentage of aggregate fair value of all securities in the portfolio was as follows:, 75766=Capital Leases--The Board entered into capital leases in 2008 and 2009. Furniture and equipment includes $2,086,000 under capital leases in both 2010 and 2009. Accumulated depreciation includes $1,319,000 and $789,000 under capital leases as of 2010 and 2009, respectively., 262118=Pending the closing of the recapitalization plan, the cash proceeds from certain AIG asset dispositions were held by the FRBNY as agent. On October 29, 2010, AIG completed the initial public offering (IPO) of AIA, successfully obtaining a listing on the Hong Kong Stock Exchange and raising total gross proceeds of $20.5 billion. On November 1, 2010, AIG completed the sale of ALICO to MetLife, initially announced on March 8, 2010, for approximately $15.5 billion, including $6.8 billion in cash and the remainder in equity and equity-linked securities of MetLife., 367361=At December 31, 2010 and 2009, the fair value of foreign currency denominated assets, including accrued interest, was $26,213 million and $25,480 million, respectively. The fair value of government debt instruments was determined by reference to quoted prices for identical securities. The cost basis of foreign currency deposits and securities purchased under agreements to resell, adjusted for accrued interest, approximates fair value. Similar to the Treasury securities, GSE debt securities, and Federal agency and GSE MBS discussed in Note 6, unrealized gains or losses have no effect on the ability of the Reserve Banks, as the central bank, to meet their financial obligations and responsibilities. The fair value is presented solely for informational purposes., 372284=All of the U.S. dollar liquidity swaps outstanding at December 31, 2010 were transacted with the European Central Bank and had remaining maturity distributions of less than 15 days., 245863=The Primary Dealer Credit Facility (PDCF) was designed to improve the ability of primary dealers to provide financing to participants in the securitization markets. Primary dealers could obtain secured overnight financing under the PDCF in the form of repurchase transactions. The authorization for the PDCF expired on February 1, 2010, and the last loan matured on May 13, 2009., 327040=Eligible collateral includes U.S. dollar-denominated ABS that are backed by auto loans, student loans, credit card loans, equipment loans, floorplan loans, insurance premium financial loans, loans guaranteed by the SBA, residential mortgage servicing advances, or commercial mortgage loans. To be considered eligible, collateral must have a credit rating in the highest investment-grade rating category from at least two eligible nationally-recognized statistical rating organizations (NRSROs) and must not have a credit rating below the investment-grade rating category from an eligible NRSRO. In addition to the aforementioned eligibility requirements, collateral also must meet other criteria as stipulated in the TALF program's terms and conditions. The following table presents the collateral concentration and maturity distribution for the remaining unpaid principal and accrued interest as of December 31, 2010 (in millions):, 349268=The following table provides additional information on the amortized cost and fair values of the Federal agency and GSE MBS portfolio at December 31 (in millions):, 331926=Earnings reported by the FRBNY related to the TALF include income and unrealized gains and losses on TALF loans as well as the FRBNY's allocated share of the TALF LLC's net income. Additional information regarding the income of the TALF LLC is presented in Note 9. The following table presents the components of TALF earnings recorded by the FRBNY for the years ended December 31 (in millions):, 501424=2. There were no significant transfers between Level 1 and Level 2 during the year ended December 31, 2010. Return to table, 180833=We have audited the accompanying Combined Statements of Condition of the Federal Reserve Banks (the \"Reserve Banks\") as of December 31, 2010 and 2009 and the related Combined Statements of Income and Comprehensive Income, and of Changes in Capital for the years then ended, which have been prepared in conformity with accounting principles established by the Board of Governors of the Federal Reserve System. These Combined Financial Statements are the responsibility of the Division of Reserve Bank Operations and Payment System's management. Our responsibility is to express an opinion on these financial statements based on our audits., 414819=4. BB+ and lower includes debt securities that were not rated as of December 31, 2010. Return to table, 361707=Other investments consist of cash and short-term investments related to the Federal agency and GSE MBS portfolio. Other liabilities, which are related to purchases of Federal agency and GSE MBS, arise from the failure of a seller to deliver securities to the FRBNY on the settlement date. Although the Reserve Banks have ownership of and records their investments in the MBS as of the contractual settlement date, they are not obligated to make payment until the securities are delivered, and the amount reported as other liabilities represents the Reserve Banks' obligation to pay for the securities when delivered. The amount of other investments and other liabilities held in the SOMA at December 31 was as follows (in millions):, 543580=The components of net periodic pension benefit expense for the System Plan for the years ended December 31 are shown below (in millions):, 68416=Currency Costs--The Federal Reserve Board issues the nation's currency (in the form of Federal Reserve notes), and the Federal Reserve Banks distribute currency and coin through depository institutions. The Board incurs expenses and assesses the Reserve Banks for the expenses related to producing, issuing, and retiring Federal Reserve notes. The assessment is allocated based on each Reserve Bank's share of the number of notes comprising the Federal Reserve Bank System's net liability for Federal Reserve notes on December 31 of the prior year. These expenses and assessments are reported separately from the Board's operating activities in the Board's Statements of Revenues and Expenses and Changes in Cumulative Results of Operations., 76071=The future minimum lease payments required under the capital leases and the present value of the net minimum lease payments as of December 31, 2010, are as follows:, 157545=The Board performs certain functions for the Reserve Banks in conjunction with its responsibilities for the System, and the Reserve Banks provide certain administrative functions for the Board. Activity related to the Board and Reserve Banks as of December 31, 2010 and 2009, is summarized in the following table:, 173275=Commitments--The Board has entered into an agreement with the Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency, through the Council, to fund a portion of the enhancements and maintenance fees for a central data repository project through 2010 with an option to extend maintenance through 2013. The estimated Board expense to support this effort is $7.9 million for the base period and $2.6 million for the option period., 15970=We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the Board's internal control over financial reporting as of December 31, 2010, based on the criteria established in Internal Control--Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 28, 2011 expressed an unqualified opinion on the Board's internal control over financial reporting., 296997=At December 31, 2010 and 2009, all Federal Reserve notes issued to the Reserve Banks were fully collateralized. At December 31, 2010, all gold certificates, all special drawing right certificates, and $925 billion of domestic securities held in the SOMA were pledged as collateral. At December 31, 2010, no investments denominated in foreign currencies were pledged as collateral., 180311=The combined financial statement of the Federal Reserve Banks were audited by Deloitte & Touche LLP, independent auditors, for the years ended December 31, 2010 and 2009., 272765=SDR certificates are issued by the International Monetary Fund (IMF) to its members in proportion to each member's quota in the IMF at the time of issuance. SDR certificates serve as a supplement to international monetary reserves and may be transferred from one national monetary authority to another. Under the law providing for U.S. participation in the SDR system, the Secretary of the Treasury is authorized to issue SDR certificates to the Reserve Banks. When SDR certificates are issued to the Reserve Banks, equivalent amounts in U.S. dollars are credited to the account established for the Treasury and the Reserve Banks' SDR certificate accounts are increased. The Reserve Banks are required to purchase SDR certificates, at the direction of the Treasury, for the purpose of financing SDR acquisitions or for financing exchange stabilization operations. At the time SDR transactions occur, the Board of Governors allocates SDR certificate transactions among the Reserve Banks based upon each Reserve Bank's Federal Reserve notes outstanding at the end of the preceding year. SDRs are recorded by the Reserve Banks at original cost. In 2009, the Treasury issued $3 billion in SDR certificates to the Reserve Banks. There were no SDR transactions in 2010., 259928=On April 17, 2009, the FRBNY, as part of the U.S. government's commitment to the orderly restructuring of AIG over time, in the face of continuing market dislocations, further restructured the AIG loan by eliminating the 350 basis-point floor on the Libor used to calculate the interest rate on the loan. The interest rate on the modified loan is the three-month Libor plus 300 basis points.}",
    "lastModified": "Fri, 04 Oct 2013 17:50:39 GMT",
    "textBeforeTable": "The remaining maturity distribution of loans outstanding at December 31, 2010, and total loans outstanding at December 31, 2009, were as follows (in millions): (5) Loans Back to section top In July 2010, the FASB issued Accounting Standards Update 2010-20, Receivables (Topic 310), which requires additional disclosures about the allowance for credit losses and the credit quality of loan portfolios. The additional disclosures include a rollforward of the allowance for credit losses on a disaggregated basis and more information, by type of receivable, on credit quality indicators, including the amount of certain past due receivables and troubled debt restructurings and significant purchases and sales. The adoption of this accounting guidance is effective for the Reserve Banks on December 31, 2011, and is not expected to have a material effect on the Reserve Banks' combined financial statements. In March 2010, the FASB issued Accounting Standards Update 2010-11, Derivatives and Hedging, (Topic 815), which clarifies embedded credit derivatives that are subject to the FASB's guidance on derivatives and hedging and defines the embedded credit derivatives that are required to be evaluated for bifurcation and separate accounting. The adoption of this accounting guidance was effective for the Reserve Banks on July 1, 2010 and did not have a material effect on the Reserve Banks' combined financial statements. In January 2010, the FASB issued Accounting Standards Update 2010-06, Fair Value Measurements and Disclosures (Topic 820). New requirements for disclosure of information about transfers among the hierarchy's",
    "textAfterTable": "2010 2009 Level 3 $ 24,853 $ 48,183 Total fair value $ 24,853 $ 48,183 The following table presents a reconciliation of TALF loans measured at fair value using significant unobservable inputs (Level 3) during the year-ended December 31, 2010 and for the period February 4, 2009, to December 31, 2009, (in millions): TALF Loans Fair value at February 4, 2009 $ - Net loans originated 61,626 Loan repayments and prepayments (14,000) Total realized and unrealized gains (losses) 557 Fair value at December 31, 2009 $ 48,183 Net loans originated 9,484 Loan repayments and prepayments (32,378) Total realized and unrealized gains (losses) (436) Fair value at",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}