{
    "relation": [
        [
            "Date",
            "Apr 28, 1989",
            "Apr 1, 1994",
            "Jul 7, 1998",
            "Dec 13, 1998",
            "Feb 23, 1999"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: HOECHST CELANESE CORPORATION, A CORP. OF DE, NEW J Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:CALLAHAN, ROBERT W.;REED, BRADLEY W.;REEL/FRAME:005081/0411;SIGNING DATES FROM 19890411 TO 19890418",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19981211"
        ]
    ],
    "pageTitle": "Patent US4976867 - Systems and methods for predetermining maximum pressure differentials for ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4976867?dq=5,583,822",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470321771,
    "recordOffset": 470300374,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26968=U.S. Pat. No. 4,789,468 issued on Dec. 6, 1988 to Sirkar (the entire content of which is expressly incorporated hereinto by reference), discloses a liquid-liquid extraction system which utilizes microporous membranes. In this regard, the system disclosed in this patent relies upon an interface-immobilizing pressure difference effective to prevent the feed liquid from flowing through the micropores of the membrane and dispersing in the extractant liquid on the opposite side of the membrane.}",
    "textBeforeTable": "Patent Citations Therefore, while the invention has been described in connection with what is presently considered to be the most practical and preferred embodiments, it is to be understood that the invention is not to be limited to the disclosed embodiments, but on the contrary, is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the appended claims. As may now be appreciated, the present invention provides a suitable means for predetermining, on a laboratory bench scale, maximum pressure differentials for liquid-liquid extraction systems employing selected microporous hollow fibers and selected feed and extractant liquids. As such, a variety of candidate liquids and/or microporous hollow fibers may be screened for eventual use in a liquid-liquid extraction system without the need to use full scale hollow fiber modules. In addition, the present invention provides detection means for a dynamic liquid-liquid extraction system whereby the presence of the feed liquid in the essentially immiscible extractant liquid (which might be indicative of module failure and/or malfunction) can be sensed. The detector 96 will therefore sense a change in the \"normal\" level of radiation passing through the vessel 92, the change being indicative of the presence of feed liquid in the discharged extractant liquid (i.e., since a change in optical properties of the discharged extractant liquid stream will ensue due to the immiscibility of the feed and extractant liquids). This sensed change will therefore cause the",
    "textAfterTable": "Title US5277821 * Aug 19, 1991 Jan 11, 1994 Symbiotech Incorporated Purification of samples by interphase mass transfer using microporous hollow-fiber membranes US5609765 * Dec 5, 1995 Mar 11, 1997 Bowman; Ronald W. Steam stripping method for the softening of water US6306454 Sep 1, 1999 Oct 23, 2001 Baxter International Inc. Method for producing improved medical devices and devices so produced US7105089 Mar 13, 2003 Sep 12, 2006 3M Innovative Properties Company Liquid—liquid extraction system and method US7122709 Mar 13, 2003 Oct 17, 2006 3M Innovative Properties Company Method for obtaining ethanol US7517455 Aug 29, 2006 Apr 14, 2009 3M Innovative Properties Company Liquid-liquid extraction system and method US20040178147 * Mar 13, 2003 Sep 16, 2004 3M Innovative Properties Company Liquid-liquid extraction system and method US20040181101 * Mar 13, 2003 Sep",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}