{
    "relation": [
        [
            "Citing Patent",
            "US5556533 *",
            "US6887689 *",
            "US7244582 *",
            "US7625722 *",
            "US7996054 *",
            "US20020076727 *",
            "US20050048583 *",
            "US20100200049 *",
            "CN101004404B",
            "WO2000000822A1",
            "WO2001054552A1",
            "WO2010130525A1 *"
        ],
        [
            "Filing date",
            "Jun 6, 1995",
            "Jan 23, 2001",
            "Oct 12, 2004",
            "Oct 12, 2004",
            "Feb 20, 2006",
            "Aug 3, 2001",
            "Oct 12, 2004",
            "",
            "Jan 25, 2007",
            "Jun 29, 1999",
            "Jan 25, 2001",
            "Apr 16, 2010"
        ],
        [
            "Publication date",
            "Sep 17, 1996",
            "May 3, 2005",
            "Jul 17, 2007",
            "Dec 1, 2009",
            "Aug 9, 2011",
            "Jun 20, 2002",
            "Mar 3, 2005",
            "Aug 12, 2010",
            "Aug 25, 2010",
            "Jan 6, 2000",
            "Aug 2, 2001",
            "Nov 18, 2010"
        ],
        [
            "Applicant",
            "A & D Company Limited",
            "Kurt Nilsson",
            "Kurt Nilsson",
            "Kurt Nilsson",
            "Abbott Diabetes Care Inc.",
            "Cardone Michael H.",
            "Kurt Nilsson",
            "Alliance For Sustainable Energy, Llc",
            "上海师范大学",
            "Procter & Gamble",
            "Procter & Gamble",
            "Siemens Aktiengesellschaft"
        ],
        [
            "Title",
            "Voltage applying method for hydrogen-type enzyme electrode",
            "Immobilized carbohydrate biosensor",
            "Immobilized carbohydrate biosensor",
            "Immobilized carbohydrate biosensor",
            "Electrochemical analyte sensor",
            "Microarrays of functional biomolecules and uses therefor",
            "Immobilized carbohydrate biosensor",
            "Biohybrid system for hydrogen production",
            "Electrode modified by chloride, oxide enzyme capable of catalyzing organic reaction in high effect",
            "Device having fecal component sensor",
            "Disposable surface wipe article having a waste contamination sensor",
            "Biosensor for detecting toxins by means of a nucleic acid-coupled enzyme"
        ]
    ],
    "pageTitle": "Patent US5496452 - Substrate regenerating biosensor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5496452?dq=4168396",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479693423,
    "recordOffset": 479666687,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18876=This application is a continuation of PCT/GB91/00684 filed on Apr. 30, 1991., 38387=The glassy carbon disc was activated by a combined chemical and electrochemical technique as described by Bourdillon, J. Am. Chem. Soc. 1984, 106, 4701-4706. The disc was held at +2.2V for 30 seconds and during this time the platinum ring was held at -0.2V. The electrode was transferred to a solution of 0.5M NaKPO4, pH 7.0 and the platinum ring was cleaned by cycling between -0.3V and +1.0V for several hours until a stable voltammogram resulted. The disc was then activated with a carbodiimide (0.1M for 1 hr in 0.1M sodium acetate buffer pH 5.0). Following washing with deionized water the electrode was immersed in a solution of bovine serum albumin (BSA, 20 mg/ml in 0.1M sodium acetate, pH 5.0 for 2 hours) obtained from Sigma. Glycoside moieties of HRP were oxidized with NaIO4 (8 mM.pH 8.3, 0.1M NaHCO3), 2 hours and the unreacted NaIO4 was removed by adding an excess of ethanediol and passing the protein through a Sephadex G-25 column. The BSA modified electrode was immersed in an oxidized peroxidase solution and slowly rotated for 2 hours in a sodium bicarbonate buffer (0.1M at pH 9.0). The resulting imine bond linking BSA to HRP was reduced with NaBH4 (100 ml of 5 mg/ml for 1 hour and repeated once). The electrode was rotated in 0.1M NaKPO4 and the ring cycled between -0.3V and +1.0V for 2 hours to help remove any loosely absorbed protein.}",
    "textBeforeTable": "Patent Citations Detection apparatus produced in accordance with the invention has the capability for continuous monitoring. FIG. 9 shows a version of a closed loop cyanide sensor. The oxygen necessary for production of hydrogen peroxide and cyanide enter the sensor through a gas permeable membrane (4) of large surface area. These gases dissolve in solution and a pump (5) is used to transfer them between the primary (2) and secondary (3) electrodes on a continuous basis as shown by the arrows. The primary electrode which has HRP bound to it (not shown) generates hydrogen peroxide . The secondary electrode detects ferricinium which has been oxidized from ferrocene by oxidized HRP, the HRP having been oxidized by the hydrogen peroxide. A meter (6) gives the extent of conversion of ferrocene to ferricinium through the current passed in reduction back to ferrocene. A further electrode (7) scavenges for unreacted peroxide or unreduced ferricinium etc. The electrode is positioned downstream of the primary and secondary electrodes but before the gas permeable membrane. This self contained system which is open to environmental gases can detect by inhibition of HRP enzymic activity the presence and concentration of cyanide or similar inhibitory gases. The modified electrode was found to remain stable for more than 6 months when stored in 1M phosphate buffer at pH7. FIG. 8 displays the apparent K1 values for cyanide as a function of disc potential. As the disc potential becomes",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5556533 * Jun 6, 1995 Sep 17, 1996 A & D Company Limited Voltage applying method for hydrogen-type enzyme electrode US6887689 * Jan 23, 2001 May 3, 2005 Kurt Nilsson Immobilized carbohydrate biosensor US7244582 * Oct 12, 2004 Jul 17, 2007 Kurt Nilsson Immobilized carbohydrate biosensor US7625722 * Oct 12, 2004 Dec 1, 2009 Kurt Nilsson Immobilized carbohydrate biosensor US7996054 * Feb 20, 2006 Aug 9, 2011 Abbott Diabetes Care Inc. Electrochemical analyte sensor US20020076727 * Aug 3, 2001 Jun 20, 2002 Cardone Michael H. Microarrays of functional biomolecules and uses therefor US20050048583 * Oct 12, 2004",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}