{
    "relation": [
        [
            "Date",
            "Feb 27, 1995",
            "Dec 1, 1999",
            "Nov 10, 2003",
            "Dec 10, 2007",
            "Jun 4, 2008",
            "Jul 22, 2008"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: TOSOH SMD, INC., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:IVANOV, EUGENE Y.;GRIGORIVA, TATYANA F.;BOLDYREV, VLADIMIR V.;REEL/FRAME:007358/0849;SIGNING DATES FROM 19941114 TO 19941125",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20080604"
        ]
    ],
    "pageTitle": "Patent US5522535 - Methods and structural combinations providing for backing plate reuse in ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5522535?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482227163,
    "recordOffset": 482202192,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37180=As to the solid solution component of the metallic solder paste, this preferably comprises a Cu--Sn alloy, most preferably Cu 20-25 wt. % Sn. Mechanical alloying of this mixture is achieved by well-known techniques such a high energy ball milling as described in Material Science And Technology, editors Cahn, Haasen and Kramer, Volume 15, 1991, pp. 194-198. The mixed powders are worked in a ball mill for a period of time depending on milling conditions such as ball to powder charge ratio, rotation speed, etc. Generally, the mixed powders are mechanically alloyed for a period of about 30 minutes to 2 hours, with 90 minutes being preferred. This results in a solid solution having particles on the order of between about 5-100 microns with crystal sizes within the nanocrystalline range, normally from about 2-100 nm. Other mechanically alloyed solid solutions that can be mentioned are the Cu--In, Cu--Ga, and Cu--Bi solid solutions., 31976=Overlying solderable layer 20, a solder coating 22 of from about 25 to 1000 μms, preferably 500 microns in thickness, of indium, tin, or Sn--Ag solder is provided. The particular solder to be used is chosen carefully so that it will not melt during the cathodic sputtering process., 38526=Once the solder paste is obtained, it should be used to join the target and backing plate within about 30 minutes or so, otherwise, it will prematurely solidify. The paste substance is then coated in a thin layer of about 200 μm to 1000 μm, preferably 500 μm, along the target and backing plate surfaces to be bonded. Temperature of the target and backing plate interfacial surfaces is maintained higher than the m.p. of the low melting point component during application of solder paste 24 to ensure wetting of the surfaces. The surfaces to be joined should be cleaned via sand blasting or the like prior to the bonding method. A compression force may be exerted perpendicular to the coated layer to aid in bonding of the target and backing plate.}",
    "textBeforeTable": "Patent Citations While the forms of the methods and structural combinations described herein constitute different embodiments of the invention, it is to be understood that the invention is not limited to these precise methods and structural combinations described and that changes may be made therein without departing from the scope of the invention which is defined in the appended claims. Again similar to FIG. 2, the inside diameter of tubular target 50 is coated with a thin solderable layer 26 of copper. Solder paste 24 is provided along the tubular interface defined between surfaces 26,22 to bond the target to the backing plate. Similar to the structure shown in FIG. 2, a thin layer of nickel is provided over the backing plate 52 to serve as an adhesive layer 32. Solderable layer 20, preferably composed of copper, is provided over the adhesive layer 32. Overlying solderable layer 20, solder layer 22, here composed of In or In alloy, is provided. Turning now to FIG. 4, there is shown another embodiment which is similar to the target/backing plate assembly combination shown in FIGS. 1 and 2, with the exception that the target and backing plate and layers 32, 20, 22, 24 and 26 utilized to join the target and backing plate are tubular in shape. As shown, elongated tubular target 50 is composed in this embodiment of indium tin oxide. Target 50 is mounted over coaxially disposed tubular backing",
    "textAfterTable": "US4015948 * Aug 6, 1975 Apr 5, 1977 Masatoshi Tsuda Copper-base solder US4278622 * Feb 26, 1980 Jul 14, 1981 Massachusetts Institute Of Technology Method for forming metal, ceramic or polymer compositions US4299629 * Jun 1, 1979 Nov 10, 1981 Goetze Ag Metal powder mixtures, sintered article produced therefrom and process for producing same US4312896 * Mar 3, 1980 Jan 26, 1982 Graham Magnetics, Inc. Novel soldering process comprising coating a dielectric substrate with electroconductive metal protected by nickel carbide US4321289 * Aug 22, 1980 Mar 23, 1982 Norddeutsche Affinerie Aktiengesellschaft Method of and apparatus for the cladding of steel sheet or strip with lower melting metals or alloys US4342816 * Apr 22, 1981 Aug 3, 1982 The United States Of America As Represented By The United States Department Of Energy Fuel cell stack arrangements US4459166 * May",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}