{
    "relation": [
        [
            "Cited Patent",
            "US6088649",
            "US7490004 *",
            "US7788600 *",
            "US20060224312 *",
            "US20060253247 *",
            "US20070124066 *",
            "JPH07103774A"
        ],
        [
            "Filing date",
            "Aug 5, 1998",
            "Dec 1, 2004",
            "Jul 17, 2007",
            "Mar 31, 2005",
            "May 6, 2005",
            "Oct 1, 2004",
            ""
        ],
        [
            "Publication date",
            "Jul 11, 2000",
            "Feb 10, 2009",
            "Aug 31, 2010",
            "Oct 5, 2006",
            "Nov 9, 2006",
            "May 31, 2007",
            ""
        ],
        [
            "Applicant",
            "Visteon Technologies, Llc",
            "Alpine Electronics, Inc.",
            "Harman International Industries, Incorporated",
            "Shunichi Imanishi",
            "De Silva Andrew S",
            "Navitime Japan Co.,Ltd.",
            ""
        ],
        [
            "Title",
            "Methods and apparatus for selecting a destination in a vehicle navigation system",
            "Vehicle navigation apparatus and method of searching for and displaying neighborhood facilities",
            "User interface for multifunction device",
            "Address input method and apparatus for navigation system",
            "Method and apparatus for navigation system for searching selected type of information along route to destination",
            "Navigation device, navigation method, and program",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US7991546 - Display method and apparatus for navigation system for efficiently searching ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7991546?dq=6289460",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480979127,
    "recordOffset": 480958504,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention is described herein with reference to the preferred embodiment, one skilled in the art will readily appreciate that various modifications and variations may be made without departing from the spirit and scope of the present invention. Such modifications and variations are considered to be within the purview and scope of the appended claims and their equivalents. As has been described above, according to the present invention, the display method and apparatus efficiently and intuitively displays the locations of the city surrounding the current vehicle position or any position specified by the user. On the screen of the navigation system, the present invention displays a specially designed screen to implement the city search operation. The display screen includes a state selection box and a city selection box, which are used to find a desired city under the present invention. The navigation system detects the direction specified by the user and moves the cursor to the location of the candidate city in response to every operation of the input device in the order of distance in the specified direction. Thus, the user is able to find the city by its relative location to the current vehicle position or other reference location, thereby enabling to quickly and intuitively search the target city. may be stored in the ROM 140 or other storage medium and is executed by the CPU 139. As noted above,",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US8174499 * Oct 8, 2009 May 8, 2012 Denso Corporation Navigation apparatus US8635021 * May 4, 2012 Jan 21, 2014 Google Inc. Indicators for off-screen content US20100100846 * Oct 8, 2009 Apr 22, 2010 Denso Corporation Navigation apparatus * Cited by examiner Classifications U.S. Classification 701/426, 340/995.24, 340/995.27, 340/995.28 International Classification G01C21/00 Cooperative Classification G01C21/00, G08G1/0969, G01C21/3614, G01C21/3611 European Classification G01C21/00, G01C21/36D2, G01C21/36D3 Legal Events",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}