{
    "relation": [
        [
            "Citing Patent",
            "US5467055 *",
            "US5564087 *",
            "US5574992 *",
            "US5694431 *",
            "US5901346 *",
            "US5987308 *",
            "US6018650 *",
            "US6052568 *",
            "US6215986 *",
            "US6252456",
            "US6362690",
            "US6414562",
            "US6529716 *",
            "US6597244",
            "US6618096",
            "US6941118 *",
            "US7010278 *",
            "US7065154 *",
            "US7095988 *",
            "US7382193",
            "US7408404",
            "US8219047 *",
            "US8351874 *",
            "US20040082305 *",
            "US20090163155 *",
            "US20090253385 *",
            "US20150098525 *",
            "WO2001063792A2 *",
            "WO2003055084A1 *",
            "WO2006073623A2 *"
        ],
        [
            "Filing date",
            "Jan 6, 1995",
            "Nov 3, 1994",
            "Apr 29, 1994",
            "Jan 17, 1996",
            "Dec 17, 1996",
            "Jul 9, 1997",
            "Dec 18, 1996",
            "Aug 24, 1998",
            "Sep 26, 1997",
            "Jul 29, 1999",
            "Apr 19, 2000",
            "May 27, 1997",
            "Jan 11, 2000",
            "Feb 5, 2002",
            "Sep 29, 1997",
            "Apr 19, 2002",
            "Oct 25, 2002",
            "Dec 29, 2000",
            "Feb 26, 2001",
            "Dec 10, 2003",
            "Dec 10, 2003",
            "Dec 19, 2008",
            "Apr 8, 2008",
            "Oct 25, 2002",
            "Dec 19, 2008",
            "Apr 8, 2008",
            "Dec 15, 2014",
            "Feb 26, 2001",
            "Oct 16, 2002",
            "Nov 30, 2005"
        ],
        [
            "Publication date",
            "Nov 14, 1995",
            "Oct 8, 1996",
            "Nov 12, 1996",
            "Dec 2, 1997",
            "May 4, 1999",
            "Nov 16, 1999",
            "Jan 25, 2000",
            "Apr 18, 2000",
            "Apr 10, 2001",
            "Jun 26, 2001",
            "Mar 26, 2002",
            "Jul 2, 2002",
            "Mar 4, 2003",
            "Jul 22, 2003",
            "Sep 9, 2003",
            "Sep 6, 2005",
            "Mar 7, 2006",
            "Jun 20, 2006",
            "Aug 22, 2006",
            "Jun 3, 2008",
            "Aug 5, 2008",
            "Jul 10, 2012",
            "Jan 8, 2013",
            "Apr 29, 2004",
            "Jun 25, 2009",
            "Oct 8, 2009",
            "Apr 9, 2015",
            "Aug 30, 2001",
            "Jul 3, 2003",
            "Jul 13, 2006"
        ],
        [
            "Applicant",
            "Motorola, Inc.",
            "Motorola, Inc.",
            "Motorola, Inc.",
            "Motorola, Inc.",
            "Motorola, Inc.",
            "Kyocera Corporation",
            "Aironet Wireless Communications, Inc.",
            "Celeritek",
            "Nortel Networks Corporation",
            "Motorola, Inc.",
            "Ophir Rf, Inc.",
            "Motorola, Inc.",
            "Skyworks Solutions, Inc.",
            "Ophir Rf, Inc.",
            "Scientific-Atlanta, Inc.",
            "Hitachi Kokusai Electric Inc.",
            "Freescale Semiconductor, Inc.",
            "Nokia Corporation",
            "Motorola, Inc.",
            "Nxp B.V.",
            "Nxp B.V.",
            "Intel Mobile Communications GmbH",
            "Telefonaktiebolaget Lm Ericsson (Publ)",
            "Kirschenmann Mark A.",
            "Infineon Technologies Ag",
            "Paul Wilkinson Dent",
            "Kabushiki Kaisha Toshiba",
            "Ben Ayun Moshe",
            "Qualcomm Inc",
            "Bozeki John J"
        ],
        [
            "Title",
            "Power amplifier and radio transmitter",
            "Method and apparatus for a linear transmitter",
            "Method and apparatus for reducing off-channel interference produced by a linear transmitter",
            "Method and apparatus for average power control",
            "Method and apparatus utilizing a compensated multiple output signal source",
            "Portable terminal having a shared antenna with reduced standing wave ratio",
            "Cellular communication devices with automated power level adjust",
            "Apparatus and method for efficiently implementing a satellite transceiver system",
            "Reducing radio transmitter distortion",
            "Power amplifier load controller and method for controlling a power amplifier load",
            "System and method for closed loop VSWR correction and tuning in RF power amplifiers",
            "Circuit and method for impedance matching",
            "RF transmitter with extended efficient power control range",
            "System and method for closed loop VSWR correction and tuning in RF power amplifiers",
            "System and method for adaptively balancing quadrature modulators for vestigial-sideband generation",
            "Negative feedback amplifier and method of controlling loop gain thereof",
            "Sideband suppression method and apparatus for quadrature modulator using magnitude measurements",
            "Baseband predistortion method for multicarrier transmitters",
            "Apparatus for linear transmitter with improved loop gain stabilization",
            "Preserving linearity of an isolator-free power amplifier by dynamically adjusting gain and phase",
            "Preserving linearity of an isolator-free power amplifier by dynamically switching active devices",
            "Methods for calibrating a transmitter, and radio transmitter",
            "System and method for adaptive antenna impedance matching",
            "Sideband suppression method and apparatus for quadrature modulator using magnitude measurements",
            "Methods for calibrating a transmitter, and radio transmitter",
            "System and Method for Adaptive Antenna Impedance Matching",
            "Digital broadcast transmitting device and exciter",
            "Apparatus for linear transmitter with improved loop gain stabilization",
            "Adaptive transmitter power amplifier",
            "Power management of a transmitter and supporting methods and apparatus"
        ]
    ],
    "pageTitle": "Patent US5423082 - Method for a transmitter to compensate for varying loading without an isolator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5423082?dq=6272333",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488533111,
    "recordOffset": 488506585,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21412=To avoid the use of the isolator, existing frequency modulation (FM) transmitters, which include nonlinear amplifiers, utilize protective feedback circuitry. The protective feedback monitors the voltage standing wave ratio (VSWR) at the nonlinear amplifier's output and correspondingly reduces the amount of output power provided by the nonlinear amplifier to the antenna. This approach generally reduces the nonlinear amplifier's output power by a fixed amount when the VSWR exceeds a predetermined level. For example, when a 3:1 VSWR is detected at the nonlinear amplifier's output, the nonlinear amplifier's output power may be reduced by 3 dB. This approach works for nonlinear amplifiers, but does not include any provisions for maintaining amplifier linearity.}",
    "textBeforeTable": "Patent Citations The present invention provides a method for a transmitter to compensate for the effects of varying antenna loading without utilization of an isolator. With this method, the isolator is not required between the transmitter's amplifying element, or power amplifier, and its antenna to insure optimal transmitter performance. Moreover, the method of the present invention permits elimination of the isolator, thus enabling the transmitter to occupy less volume, cost less, weigh less, and be less band limited than with the isolator, while still maintaining desired transmitter functionality. At the conclusion of the one millisecond training sequence period, the remaining fourteen milliseconds of the slot is used for the transmission of user data or digitized voice information. The training process may be repeated as often as every slot in order to allow the transmitter to track the effects of the time varying antenna load on loop gain and linearity. When the vector representation of the reflected energy is incorporated into this example, the determination of the open loop gain performed during the first portion of the training sequence may be unnecessary. Rather, adjustments to the variable baseband gain stages and the signal source are directly determined from data stored in the transmitters ROM, or supplied via DSP calculation. Reductions in the gains of the variable baseband gain stages are typically necessary to prevent unstable operation of the feedback loop due to mismatched loads present at the antenna. Antenna",
    "textAfterTable": "US7065154 * Dec 29, 2000 Jun 20, 2006 Nokia Corporation Baseband predistortion method for multicarrier transmitters US7095988 * Feb 26, 2001 Aug 22, 2006 Motorola, Inc. Apparatus for linear transmitter with improved loop gain stabilization US7382193 Dec 10, 2003 Jun 3, 2008 Nxp B.V. Preserving linearity of an isolator-free power amplifier by dynamically adjusting gain and phase US7408404 Dec 10, 2003 Aug 5, 2008 Nxp B.V. Preserving linearity of an isolator-free power amplifier by dynamically switching active devices US8219047 * Dec 19, 2008 Jul 10, 2012 Intel Mobile Communications GmbH Methods for calibrating a transmitter, and radio transmitter US8351874 * Apr 8, 2008 Jan 8, 2013 Telefonaktiebolaget Lm Ericsson (Publ) System and method for adaptive antenna impedance matching US20040082305 * Oct 25, 2002 Apr 29, 2004 Kirschenmann Mark A. Sideband suppression method and apparatus for quadrature modulator using magnitude measurements",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}