{
    "relation": [
        [
            "Bug ID",
            "None",
            "None",
            "None",
            "None",
            "CSCdm83659",
            "CSCdm89567",
            "CSCdm94344",
            "CSCdm94755",
            "CSCdp36357",
            "CSCdp41167",
            "CSCDp42333",
            "CSCdp43999",
            "CSCdp46215",
            "CSCdp47638, CSCdp47670",
            "CSCdp48040",
            "CSCdp57898",
            "CSCdp69800",
            "CSCdp79853",
            "CSCdp87405",
            "CSCdp88318",
            "CSCdp90632",
            "CSCdp94989",
            "CSCdr00079",
            "CSCdr08035",
            "CSCdr09578",
            "CSCdr11577",
            "CSCdr11586",
            "CSCds01210",
            "CSCds61359, CSCds71941",
            "CSCds82909",
            "CSCds91822",
            "CSCdt00478",
            "CSCdt21487",
            "CSCdt27824",
            "CSCdt28061",
            "CSCdt33558",
            "CSCdt50396, CSCdt51095",
            "CSCdt50619"
        ],
        [
            "Summary",
            "Unknown discovery behavior when no VTP server.",
            "OAM Ping is only supported if ATM Switch Processor version is 4.0 or above for devices with FC-PFQ card.",
            "The supported ILMI configuration interface types are UNI, PNNI, and IISP.",
            "Multilayer Switch Module gigabit ports displayed as unknown-duplex.",
            "Catalyst 5000 ATM module ports might not be discovered.",
            "ATM domain separation does not occur automatically.",
            "Cannot click and drag Ethernet Bus in map.",
            "IP address change is not updated in map.",
            "The FastEtherChannel link is not discovered between Catalyst 6000 and Catalyst 8540CSR devices.",
            "OAM Ping with End-End option only works between LS1010s.",
            "If the SNMP manageable IP address of a device is changed, ANI may not detect such an IP address change.",
            "Maps and configuration dialogs display offset menus and list boxes in Netscape on a AIX client.",
            "Print does not work properly when zoomed in.",
            "After a port change, both old and new link appear.",
            "The message \"Topology Services already running\" displays when the application is not running.",
            "Deleting all links in an aggregate link on the Layer 2 View is not reflected in the Lan Edge View.",
            "Correct last fail cause not shown for LAN Emulation client.",
            "You might have difficulty highlighting some links.",
            "Creation of VLAN in a domain or deletion of a VLAN from all switches in a domain changes the VTP mode on devices from transparent to server.",
            "Link attributes not updated.",
            "LE Config Server Control Connections report has an empty ELAN field.",
            "VLAN deleted on switches in server mode is reported as deleted from transparent switch.",
            "Sometimes, after performing an operation in the VLAN/ATM configuration dialogs the cursor continues to indicate that the system is busy and the Cancel button does not work.",
            "You cannot create LANE services from the Modify VLAN dialog box.",
            "Disable RMON is reported as successful even when it fails.",
            "VC error chart is blank.",
            "Entering values in the Database Traffic Templates dialog fails and the Java Console displays the error NumberFormatException.",
            "Delete VLAN window remains open after a VLAN is deleted.",
            "Unable to select main topology window from Window menu.",
            "Voice daughter card not displayed in device attributes for Catalyst 6000 series device.",
            "Saved view layouts may change after upgrade from Campus Manager 3.0 to Campus Manager 3.1.",
            "Printing display view map from Topology Services sometimes results in errors.",
            "When the topology map of a large network is exported to Visio, an illegible Visio file is produced.",
            "Entire list of ports in a VTP domain is displayed when certain Transparent VTP domains are selected from VLAN Assignment dialog box.",
            "Unable to view map displaying highlighted device in Trace Report window.",
            "ICS System Manager does not launch from Topology Services context menu.",
            "Display VC Per Device window unusable after selecting a row and clicking Get Info.",
            "Two devices, connected by multiple links, appear to be connected by only one link."
        ],
        [
            "Explanation",
            "Topology Services might display erratic behavior is there is no VTP server on your network. A VTP server is required for Campus Manager.",
            "If a device has an FC-PFQ feature card, the OAM Ping command is supported only if the ATM Switch Processor version is 4.0 or later.",
            "In the Interface Configuration window of ATM Management, the only supported choices for the ILMI Configuration Interface Type are UNI, PNNI, and IISP.",
            "Multilayer Switch Module does not have the MIB to support half- and full-duplex on gigabit ports. Therefore, those ports appear as unknown-duplex.",
            "Some Catalyst 5000 ATM module ports are not discovered, causing Device Attributes dialog box to display some modules as having zero ports.",
            "If you disable an ATM switch port after ATM domain discovery completes, any link from that port appears as a red or dotted line in the Topology view. Topology Services does not automatically delete links from disabled ATM switch ports unless they conflict with newly discovered links. Since the link is no longer in the network, ATM domain separation does not occur automatically. Workaround: Force separation of ATM domains by highlighting affected links in the Topology view and select Edit >Delete Link(s).",
            "In the L2 or LAN Edge View map, you cannot click and drag the Ethernet bus. Workaround: Select the bus using the rubber band approach, including one device connected to the bus. Move the rubber band selected area.",
            "If you change a device IP address, it will not be updated immediately on map. Device displays in red until next polling cycle. Workaround Manually update, delete device and rediscover network or run discovery on neighbors of device.",
            "The link between a Catalyst 6000 device and a Catalyst 8540CSR device cannot be discovered.",
            "The ATM OAM Ping with End-End option with IP address or NSAP prefix works only between LS1010s.",
            "The symptom of this is that the displayed device will continue to indicate the old IP address, even after one or more discovery cycles. It will be marked as unreachable or un-managed. Workaround: Delete the stuck device, and rediscover the same.",
            "Sometimes, when a map or a configuration dialog is launched, the menus or list boxes are not displayed right below the menu. This offset occurs only in the Netscape Navigator browser on a AIX client. Workaround: Move or resize the window.",
            "Print option prints only as much of the upper left corner of the view that fits on one page. Even if you scroll to another part of the map, only upper left corner prints. Workaround: Use Print when not zoomed in to view Entire View or print a view with fewer devices.",
            "After a link is changed to a different port on the same device, both the old and the new link are still displayed. Instead of being displayed as a dashed red line, the old link remains as a solid red line. Workaround: Delete all links originating from both devices and rediscover the two devices.",
            "If you close the Topology Services window and the Loading Files pop-up window while Topology Services is still loading, you will not be able to relaunch the application. Workaround: Wait for the application to launch.",
            "When you delete all links in an aggregate link on Layer 2 View, LAN Edge View is not updated. Workaround: Verify Aggregate Link Attribute field is empty, indicating that links were deleted.",
            "If you select Diagnosis > LE Client > LE Client Status, last fail cause shown for a LAN Emulation client is cause reports by LAN Emulation server.",
            "Some links, such as Token Ring links, might be more difficult to highlight than others. Workaround: Click slightly above or below link to highlight it.",
            "If you create a VLAN in a domain or delete a VLAN from all switches in a domain, VTP mode on devices changes from transparent to server. The problem occurs in Catalyst OS 3.2(8), 4.5(5), 5.2(3), and earlier versions.",
            "If you change link attributes, ANI Server does not properly discover and display change in reports. Workaround: To update link attributes, delete device and rediscover it.",
            "If LE Config Server Control Connections report has an empty ELAN field, assign appropriate non-zero values for the ELAN entries in the LECS database through CLI.",
            "If a VLAN exists on both a VTP server and a transparent switch, and you delete it from VTP server only, it is reported as deleted from transparent switch also. VLAN is not actually deleted from switch and is reported in transparent switch domain after next discovery.",
            "Some VLAN/ATM configuration dialog boxes do not close when you click Cancel, while cursor shows that system is busy. Workaround: Close window by clicking the Close button in the upper right corner of dialog box.",
            "If you select Create a LES/BUS to create LANE services from Modify VLAN dialog box, configuration fails and Java Console displays ATM-VLAN name is not valid. Workaround: 1. Select a VLAN. 2. Select Tool > LANE Management > Add/Modify LANE Services.",
            "If you try to disable RMON and it fails on a device, no error message appears. To check if RMON is disabled, select Tools > RMON Data Collection > Show Enabled Devices.",
            "A blank chart could mean either a continuous polling failure or a failure due to other problems. For example, a blank VC error chart might be due to a continuous polling failure (of VC error related data) or because these statistics might not be supported on certain image versions of ATM switch being polled.",
            "Some traffic values, such as PCR, MCR, and CDVT, should have numeric values. If you enter a nonnumeric value, an error message appears.",
            "Following actions result in problem: 1. Launch Topology Services. 2. Delete an existing VLAN. \"Operation successful\" dialog box appears. 3. Click OK. Delete VLAN window does not close as expected. Busy icon is displayed, and user is unable to perform any operations within window.",
            "Following actions result in problem: 1. Launch Topology Services. 2. Open Layer 2 topology map. 3. Select main topology window from Window menu; nothing happens.",
            "With Topology Services running, select Catalyst 6000 series device with WS-F6k-VPWR card installed and view device attributes. WS-F6k-VPWR card is not displayed as daughter card of WS-X6348-RJ-45 module. Problem observed in Catalyst 6000 series devices running Catalyst OS version 6.1(1a) or earlier. Problem is fixed in Catalyst OS versions 6.2 and 6.1(2). See CSCdt04554 for more information.",
            "Every object (for example, bus, cloud, device, or link) in a view layout is assigned a unique dbId by ANI Server. Since full conversion of ANI database does not occur during upgrade to Campus Manager 3.1, dbId assigned by ANI Server to an object may change. Affected objects are placed in top left corner of saved view layout, possibly changing original view layout.",
            "Labels may not be printed properly if display view map is printed with Labels option selected.",
            "Export topology map of large network into Visio and open resulting file. Device icons are positioned haphazardly and are difficult to make sense of. Workaround: Do not export entire topology map to Visio. Instead, select and export particular devices or segment of network.",
            "When similar VLAN definitions exist on a VTP server and transparent devices, VLAN is added under parent folder and all transparent devices. Thus, VLAN ports are displayed under all transparent devices. Workaround: Run \"Find Ports\" query and enter device name/address to view ports for that device.",
            "Following actions result in problem: 1. Install Campus Manager 3.1. 2. Click Display VCs Per Device. 3. Select device and click Get Info. All VCs in device are displayed. 4. Select a VC and click Trace Report. 5. In Trace Report window, click Highlight Map. Map displaying highlighted device is not launched.",
            "With Topology Services running in Internet Explorer browser, if you select ICS System Manager from context menu, it does not launch. Workaround: Open new Internet Explorer browser and type device IP address as URL\u0097 http://. Launch ICS System Manager from Topology Services running in Navigator browser.",
            "Following actions result in problem: (Scenario #1) 1. Launch Display VC Per Device window. 2. With all VCs highlighted, select a device/port and click Get Info. 3. After Get Info button becomes active again, select a different device/port. 4. Select one of the displayed rows and click Get Info. (Scenario #2) 1. Launch Display VC Per Device window. 2. With all VCs highlighted, select a device/port and click Get Info. 3. Before Get Info button becomes active again, select one of the displayed rows. Exception is returned in Java console, and Display VC Per Device window becomes unusable. Workaround: Close and relaunch Display VC Per Device window.",
            "When two devices are connected by multiple links, deleting and then rediscovering either devices or links causes all links to be stacked on top of each other. Consequently, devices appear as if they are connected by only one link. To correct problem, do a relayout."
        ]
    ],
    "pageTitle": "Release Note (No title available)  [CiscoWorks Campus Manager] - Cisco Systems",
    "title": "",
    "url": "http://www.cisco.com/en/US/products/sw/cscowork/ps563/prod_release_note09186a0080031bfe.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374281823,
    "recordOffset": 374246819,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37026=CSCdt42318, 36603=CSCdt22462, 105913=CSCdr42191, 106706=CSCdr71394, 22577=/cc/td/doc/product/rtrmgmt/cw2000/camp_mgr /sup_dev/c_3.htm, 36174=CiscoWorks2000 sessions do not timeout with Campus Manager running., 55132=CSCds92510, 72537=Changing a VLAN in a Catalyst 1900 or 2820 will not update the User Tracking database., 36291=As long as Campus Manager is running, you are not logged out of current CiscoWorks2000 session, even if idle for a few hours., 97935=CSCds91822, 22353=/cc/td/doc/product/rtrmgmt/cw2000/camp_mgr /sup_dev/dev_spt.htm, 95874=CSCds01210, 86732=CSCDp42333, 36663=Download of Java applets on Windows 2000 machines may take longer than expected if virus checker application is enabled., 18637=Prior to Campus Manager 3.1, Physical and Logical Discrepancy Reports existed only in Topology Services. In this release, these reports also appear as applications in the \"Discrepancy Reports\" folder on the CiscoWorks2000 desktop. These reports display inconsistencies and misconfigurations in your physical and logical network setup., 21619=Individual installation and user guides can be purchased using the Cisco MarketPlace ordering system. Cisco sales representatives, resellers, and users with direct ordering privileges can locate documentation part numbers and other ordering information by selecting the Documentation product family within MarketPlace and navigating to the CiscoWorks2000 section., 96619=CSCds61359, CSCds71941, 97222=CSCds82909, 79357=CSCdt42619, 71374=CSCdp42247, 95383=CSCdr11586, 35888=With CiscoWorks2000 desktop running in Netscape Navigator, shortcuts for Campus Manager applications work as expected., 110927=When tracking Windows 95, Windows NT, and Windows 2000 users in User Tracking, UTLite.exe sometimes returns an empty user name., 46221=If you use Navigator 4.7 as your browser and open Layer 2 summary window with more than 1000 devices, the browser might stop responding., 46068=Netscape might stop responding if you open the Layer 2 summary window with more than 1000 devices., 32870=CSCdp22312, 77106=CSCds81070, 109333=CSCds32582, 62461=CSCdt42600, 76636=CSCds01217, 17511=Prior to Campus Manager 3.1, VLAN Port Assignment existed only in Topology Services. In this release, VLAN Port Assignment can also be started as a separate application from the CiscoWorks2000 desktop. This application gives users the ability to view VLAN summary information, search for ports, configure trunk attributes, and move ports to other VLANs., 35720=Shortcuts for Campus Manager applications do not work when CiscoWorks2000 desktop is running in Internet Explorer 5.5., 86349=CSCdp41167, 99008=CSCdt21487, 119676=Release Notes for Campus Manager 3.1 on AIX and HP-UX Copyright © 2001, Cisco Systems, Inc. All rights reserved., 56870=CSCds92510 (continued), 10890=These release notes are for use with the AIX and HP-UX versions of Campus Manager 3.1 of the CiscoWorks2000 family of products., 61706=CSCdt42404, 36424=To avoid problem, log out of CiscoWorks2000 after using Campus Manager., 72673=Sometimes User Tracking discovery does not find changes in a VLAN for a Catalyst 1900 or 2820 and does not update the database. Therefore, VLAN information for end hosts connecting to 1900 and 2820 might be incorrect., 34392=If you click Logout in the CiscoWorks2000 main window, you are logged out of all applications except for Campus Manager. Thus, you can still add and delete VLANs, as well as look at topology layouts., 34635=Close all topology windows after logging out of CiscoWorks2000., 40404=Campus Manager 3.1 is supported by multi-homed machines (machines with multiple NIC cards, each configured with different IP addresses). Because of CORBA restrictions, only one IP address can be used by client to access CiscoWorks2000 Server., 101980=CSCdt50396, CSCdt51095, 34272=Logging out of CiscoWorks2000 does not log user out of Campus Manager., 107215=CSCdr91094, 94825=CSCdr11577, 46470=CSCdt11838}",
    "textBeforeTable": " Feedback Release Note (No title available) RELEASE NOTES SOFTWARE DOWNLOADS, RELEASE AND GENERAL INFORMATION CISCOWORKS CAMPUS MANAGER END-OF-SALE AND END-OF-LIFE PRODUCTS PRODUCT SUPPORT SUPPORT HOME Hierarchical Navigation Release Note (No title available) CiscoWorks Campus Manager My Cisco Register Account",
    "textAfterTable": "Catalyst 3500 series is supported in IP mode only. Campus Manager supports the Catalyst 3500 series in IP mode only. Cluster mode is not supported. None Launching a telnet session, print, export or similar operations fail and the Java Console displays the error ClassNotFoundException. Browser is waiting for you to answer Security Warning window. Workaround: Check Always Trust content from Cisco in Security Warning window and it will not open again. CSCdm77812 Non-empty CLASSPATH environment variable might produce erratic browser behavior. If your system has a non-empty CLASSPATH environment variable, your browser might behave unpredictably. Workaround: Unset CLASSPATH variable nonglobally: AIX\u0097Unset CLASSPATH variable from terminal window from which you launch browser. HP-UX\u0097Unset CLASSPATH variable from terminal window from which you launch browser. CSCdm83204 Applets do not work when accessed using localhost. Campus Manager applets do not work when accessed using localhost. All three applets will launch, but the system hangs. Workaround: Access the server locally, with the full DNS name, or with the IP address. CSCdm86566 Using online help with several applications. In Campus Manager, if you open more than one application, the online help might be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}