{
    "relation": [
        [
            "CHECKIN",
            "Aug-29",
            "Sep-19",
            "Oct-03",
            "Oct-17"
        ],
        [
            "CHECKOUT",
            "Sep-05",
            "Sep-26",
            "Oct-10",
            "Oct-21"
        ],
        [
            "LIST",
            "$2,904",
            "$2,904",
            "$2,954",
            "$2,019"
        ],
        [
            "SPECIAL",
            "$2,759",
            "$2,759",
            "$2,806",
            "$1,918"
        ],
        [
            "SAVE",
            "5%",
            "5%",
            "5%",
            "5%"
        ],
        [
            "BOOK",
            "BOOK Online",
            "BOOK Online",
            "BOOK Online",
            "BOOK Online"
        ]
    ],
    "pageTitle": "White Sands House, Clearwater Beach",
    "title": "",
    "url": "http://florida-beachrentals.com/unit.cfm?UNIT=539",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 95042691,
    "recordOffset": 95020226,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94720=Approx 2500 Square Feet Yr Built 1949 Sleeps 14 4 Bedroom 3 Bath FIRST FLOOR Downstairs Living Area - 2 Couches, one is a Queen Size Sofa Sleeper, 55\" Flat Screen TV with Cable, 92816=A remodeled 3 story beach house for your family with room to spare.  Breath taking sunsets on the rooftop terrace of this remodeled house. Over 2500 sq feet with two living areas and TVs in almost every room including the master bath.}",
    "textBeforeTable": "  Occupied     view full calender Available               31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1           S F T W T M S Jul 2016                   30 29 28 27 26 25 24 23 22 21 20 19 18 17",
    "textAfterTable": "Property Description A remodeled 3 story beach house for your family with room to spare.  Breath taking sunsets on the rooftop terrace of this remodeled house. Over 2500 sq feet with two living areas and TVs in almost every room including the master bath. Wake up and sit on the balcony with your morning coffee and look at the beauty of Clearwater Beach.  Then walk a few steps to the powdery, white sands for a day of sun and swimming.  Mid-day come back home for a Bar-b-que and lunch on your private patio and the relax with some pool time.  No large condo complex to walk thru. Park at your front door. Just easy access to the beach.  Then search for your favorite restaurant within walking distance - Frenchy''s, Tates, ClearwaterSkye, Calis, Carettas and more. Your Beach home is within walking distance to restaurants and activities in the area.  This 4 bedroom with 3 King size beds gives you all the comforts of home plus some extras.There are flat screen TVs in every bedroom and 55\" flat screens in two living areas with DVD players.  There is even a flat screen in the master bath.  A full size washer and dryer to take",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}