{
    "relation": [
        [
            "Patent application number",
            "20090258098",
            "20110258782",
            "20140101855"
        ],
        [
            "Description",
            "PENETRATING CARRIER, ANTIFUNGAL COMPOSITION USING THE SAME AND METHOD FOR TREATMENT OF DERMATOPHYTE INFECTIONS - An antifungal composition and penetrating carrier system for topical treatment of dermatophytic infection and secondary bacterial infections. The antifungal composition includes various fungistatic and fungicidal essential oil components, or combinations thereof. The penetrating carrier system may include various ingredients, including a penetration enhancer, such as isopropyl myristate.",
            "SYSTEMS AND METHODS FOR PROVIDING A SELF DEFLATING CUSHION - Systems and methods for providing a self deflating cushion whereby a volume of air within the cushion is controllably released to a surface of the cushion thereby providing a cooling effect to the seated anatomy of a user. The cushion further provides a variety of internal, open cell cushioning materials that store and release air during use of the cushion.",
            "SYSTEMS AND METHODS FOR PROVIDING A SELF DEFLATING CUSHION - Systems and methods for providing a self deflating cushion whereby a volume of air within the cushion is controllably released to a surface of the cushion thereby providing a cooling effect to the seated anatomy of a user. The cushion further provides a variety of internal, open cell cushioning materials that store and release air during use of the cushion."
        ],
        [
            "Published",
            "10-15-2009",
            "10-27-2011",
            "04-17-2014"
        ]
    ],
    "pageTitle": "Call, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/call-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443043639,
    "recordOffset": 443010474,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Evan Call, Bountiful, UT US 05-13-2010 CATHODES FOR MICROBIAL ELECTROLYSIS CELLS AND MICROBIAL FUEL CELLS - An apparatus is provided according to embodiments of the present invention which includes a reaction chamber having a wall defining an interior of the reaction chamber and an exterior of the reaction chamber; exoelectrogenic bacteria disposed in the interior of the reaction chamber; an aqueous medium having a pH in the range of 3-9, inclusive, the aqueous medium including an organic substrate oxidizable by exoelectrogenic bacteria and the medium disposed in the interior of the reaction chamber. An inventive apparatus further includes an anode at least partially contained within the interior of the reaction chamber; and a brush or mesh cathode including stainless steel, nickel or titanium, the cathode at least partially contained within the interior of the reaction chamber. 20100119920 Published Description Patent application number Douglas Call, Spring Mills, PA US 09-25-2014 Automatic Release Hand Brake Control System - In a rail vehicle hand brake having a release activated by a pneumatic cylinder, the present control system includes a manual valve having an output connected to a source of pressure at an input when manually activated. A volume is to be charged by the source of pressure. A choke connects the volume to exhaust. The volume and the choke prolong the time the source of pressure is connected to the pneumatic cylinder after the manual valve is activated.",
    "textAfterTable": "Patent applications by Evan Call, Bountiful, UT US Evan W. Call, Bountiful, UT US Patent application number Description Published 20090194453 Convenience IV kits and methods of use - A convenience kit assembled and organized to measure, fill and dispense medication and flush solutions to patients through connections to patient lines and catheters while improving safety and efficacy of such procedures by requiring fewer post-sterilization makes and breaks when compared to similar filling and dispensing methods using conventional components. Further the kit improves flush compliance by facilitating dispensing of flush solutions and decreases likelihood of infections by providing for flushing of patient lines and catheter connecting fittings without any additional line breaks. The kit is provided in resealable, tamper evident kit packaging which permits sealed transport of kit parts after initial opening and follow-on parts use. Convenience of operation is provided by a two syringe assembly which is operable by a single hand by which selective dispensing is accomplished from either of the two syringes while obstructing flow from the other syringe. The kit comprises a clip for the stabilizing the two syringe assembly for use by a single hand. 08-06-2009 20090198211 Convenience IV kits and methods of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}