{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "being downtown, you always want to be extra safe. but nothing bad really happens ever! students are always looking out for one another as well.",
            "not too much of that, and if there is i'm not too sure about it. but i know there are some!",
            "many, many different things for students to do! there is essentially a club for anything. i am a part of a couple already!",
            "students who like to interact with others through clubs or activities. students who like to get involved in any way at all,. the best part for me was the urban setting in downtown kansas city!",
            "well, we're not the typical school in the sense that we don't have a football team, but the basketball team is really good! games are fun, the student union made by students for the students is a really great hang-out place. haven't found seen too many unusual traditions yet!",
            "while it is not unusually expensive, sometimes the financial department has time getting student's financial aids to come through in a timely manner. definitely don't deal with finances at the last minute! but everyone in the financial aid office is willing to help!",
            "join clubs and participate in activities. super close to places like westport, plaza, etc. and just getting to know some of the students is fun!",
            "they have a diverse selection of choices for the students to eat, including a cafeteria, coffeehouses, mexican food, chik-fil-a, subconnections. it is also conveniently located around many other nicer restaurants, for a change of scenery.",
            "never was part of the dorm life, but i'm sure it's a lot of fun!",
            "the academic rigor depends on what subjects you are studying and what classes you take, but nothing i've taken so far has been too intense. most of the teachers are helpful and willing to take time out of their day to help you succeed.",
            "definitely do your best! use the resources made available to you for your advantage. join clubs and activities to meet people!",
            "it's actually a really good school! lots of student activities and helpful resources. the urban setting makes it a lot of fun as well."
        ]
    ],
    "pageTitle": "University of Missouri-Kansas City (UMKC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Missouri-Kansas-City/reviews?_escaped_fragment_=/show/83905",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890810655,
    "recordOffset": 890723640,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53549=Great education for the price. The average student to teacher ratio is 12:1, which is great. The teachers are said to truly care about the success of the student., 466643=© 2015, Cappex.com, LLC, 77885=The campus is minutes away from the Kansas City Plaza. If you think that's too expensive, there are places with half-prices at happy hour, and $4.50 movies before six. From November through February you can ice skate outdoors downtown Kansas City. The selection of restaurants is amazing. You will find Chinese, Korean, Japanese, Greek, Indian, Italian, Mexican, German, Diners, Fusion, etc. The Art Museum is free. The Zoo is probably 20 minutes or less away. As for art and music, there is a number of venues with great local artists, the Jazz and Baseball Museum, the Blue Room, a new concert hall has been built, the Sprint center has plenty of modern artists showing. If you like to explore and have a car or can make good use of the public transportation, you can find something for you here. Even on campus there is a fully-equipped gym, swimming pool, sauna, and field. The Fine Arts college always have concerts going on whether it is jazz, orchestra, plays, musicals, etc. Movies are played free on campus and STUCO plans fun events as well. For example, in the spirit of Halloween I entered a pumpkin carving contest and costume contest. Keep an open mind and make friends because there are people from all walks of life and religions here., 422563=I visited UMKC on their Preview Day in December, and found their staff to be truly interested in each student's goals for the upcoming years. I have been accepted for the fall semester, and I am looking forward to my time there., 249841=I would say that all the construction and development that has happened over the past three years (and will for the next decade as currently planned) have really proved beneficial and resourceful for students, a lot more so than I had anticipated. The academic departments are all filled with sharp staff and caring professors. The material taught is current and applicable for the present day. They really try to prepare you for a changing world. The university administration could definitely use some attention. There is a lack of communication between themselves and other departments and the university's policies, procedures, and rules are not very clear and vary depending on who you talk to. Student involvement on campus is steadily rising and will continue to do so. The website itself is a maze. Most of the links I click on are outdated and just take me to an error page. Some pages have not been updated since 2007. But overall I loved my experience here. The campus is small enough that you really get to know a lot of people you see on a regular basis and interact with them your entire time here without having to search through crowds to find them.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 24 out of 25 people found this review useful. 1 of 103 Jasmine from Kansas City, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am learning a lot I am learning more at college than what I've learned from any of my Advanced Placement courses. The teachers cover broad topics and answer any questions the students have, especially through email or meetings. It also helps if you read about what your going over in class early, so you can get the full learning experience. Login to rate or flag the reviews Sally from Cape Girardeau, MO 12/28/2010 Reviewer is A past student here. 4 out of 7 people found this review useful. 1 person found this inaccurate. 3 of 103 Categories Comments Great for these types of students Students who want to live at home and live in the Kansas City area who are pursuing pharmacy or some other health profession. This is not a school for social events or even sport events. This is strictly a means to an end to undergraduate school. Tips for prospective students There is not a wide variety of students here and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}