{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "WE do offer a school police officer and have many of those Emergency stations around the campus. Plus there are cameras everywhere on campus, keeping eyes on everything.",
            "There is just about any club you can think of for this school. We have performing arts, math team, debate team, and even tennis teams.",
            "It is cheaper to go hear and get your general education classes out of the way than going to the main college in our area. As for me, a worker student paying my own bills and for school, it still is a lot harder to afford going to college.",
            "On occasion, there are activities out on the courtyard like Volleyball, soccer, and sometimes live bands. Our school does many charity events like bake sales and stew contests.",
            "There is a Subway by the courtyard at this school. They server breakfast and lunch but this is the only place to eat while you are there which is kind of a downer. Although there are plenty or vending machines throughout the campus.",
            "You will not find any dorms or housing at this school. But there are apartments not far from the school that one could get.",
            "The academic program is awesome here. You can get just about any general studies class you would need for your major. Teachers help focus on what we really need to learn.",
            "You should register early for classes because the best classes go fast. You should also be respectful of the teacher because if you show them your respect and you need something from them, they are more likely to help you out.",
            "Northeast State is a wonderful school to go to. We have amazing teachers who help us out when we need it. They also have flexible scheduling of the classes which makes it easier for working students."
        ]
    ],
    "pageTitle": "Northeast State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Northeast-State-Community-College/reviews?_escaped_fragment_=/show/79468",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899518343,
    "recordOffset": 899483029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20196=When I went to NESCC in 2009-2011 the only on campus dining choices was Subway. Of all the fast food choices out there I was happy with what was offered. There was some talk of getting in more choices but that may or may not have happened., 112380=The academics are pretty good, but it can depend on the professor. Certain classes are a bit frustrating if you have Windows 8 at home, because some programs won't work unless you're using Windows 7 or Office 2010, meaning you've gotta do most of your assignments on campus., 131440=© 2015, Cappex.com, LLC, 113201=A quality education at an affordable price. Class sizes are small, however in-class social structure is lacking. Also some of the computer software is a little dated, using Windows 7 and Office 2010 products.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 4 out of 5 people found this review useful. 1 of 32 carey from Church Hill, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "08/16/2010 Reviewer is A current student here. 1 out of 3 people found this review useful. 1 person found it offensive. 2 people found this inaccurate. 3 of 32 Categories Comments Great for these types of students Slackers, people who slept through high school, people who don't mind earning less than 50,000 a year for the rest of their lives. Tips for prospective students Be lazy. Don't care. Don't come to class. You'll still make at least a B in most of the classes. There's no motivation to really try or give your all at anything. Bang for the buck It's cheap. I can say that much. However, you aren't getting the experience to do well in a career or at a four-year. The coursework isn't worthwhile and doesn't stimulate critical thinking. Login to rate or flag the reviews Cassandra from Johnson City, TN 02/16/2011 Reviewer is A current student here. 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}