{
    "relation": [
        [
            "Template Detail",
            "Template type",
            "Template name and version",
            "Template Dependencies",
            "Template JAR file and location"
        ],
        [
            "Information",
            "Extension",
            "Oracle WebCenter Custom Portal - 11.1.1.0",
            "Oracle WebCenter Framework Oracle WSM Policy Manager",
            "WC_ORACLE_HOME/common/templates/applications/oracle.wc_custom_portal_template_11.1.1.jar"
        ]
    ],
    "pageTitle": "Fusion Middleware Product Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28280_01/web.1111/e14138/fmw_templates.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00131-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 79595271,
    "recordOffset": 79577238,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 14 Jan 2015 14:06:53 GMT",
    "textBeforeTable": "Table 3-26 Oracle WebCenter Custom Portal Template Details The following table provides key information about this template. The Oracle WebCenter Custom Portal template adds the WC_CustomPortal Managed Server. It also adds a JDBC data source for accessing the WebCenter Portal, Portlet, Activities, and MDS schemas. Oracle WebCenter Custom Portal Template WC_ORACLE_HOME/common/templates/applications/oracle.owc_discussions_template_11.1.1.jar Template JAR file and location Oracle Enterprise Manager - 11.1.1.0 Oracle JRF - 11.1.1.0 Template Dependencies Oracle WebCenter Discussion Server - 11.1.1.0 Template name and version Extension Template type Information Template Detail Table 3-25 Oracle WebCenter Discussion Server Template Details The following table provides key information about this template. The Oracle WebCenter Discussion Server template adds the WC_Collaboration Managed Server and deploys Oracle WebCenter Portal's Discussion application. It also adds a JDBC data source for accessing the Discussions schema. Oracle",
    "textAfterTable": "Oracle WebCenter Custom Services Producer Template The Oracle WebCenter Custom Services Producer template adds the WC_CustomServicesProducer Managed Server. It also adds a JDBC data source for accessing the WebCenter Portal, Activities, and MDS schemas. The following table provides key information about this template. Table 3-27 Oracle WebCenter Custom Producer Template Details Template Detail Information Template type Extension Template name and version Oracle WebCenter Custom Services Producer - 11.1.1.0 Template Dependencies Oracle WebCenter Services Producer Component Oracle WSM Policy Manager Template JAR file and location WC_ORACLE_HOME/common/templates/applications/oracle.wc_custom_services_producer_template_11.1.1.jar Oracle WebCenter Analytics Template The Oracle WebCenter Analytics template adds the WC_Utilities server and the Activities Data Source, and configures the Oracle WebCenter Portal's Analytics application and dependent templates. The following",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}