{
    "relation": [
        [
            "Payment method",
            "",
            "Personal cheque",
            "Credit card"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "BELLE MIXER SWITCH, 240V MINI 150 MOTOR SWITCH. P/NO.70/0194 MINIMIX | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/BELLE-MIXER-SWITCH-240V-MINI-150-SWITCH-P-NO-70-0194-MINIMIX-/331023283553?pt=UK_BOI_Industrial_Tools_Construction_Tools_ET&hash=item4d12867561",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427574235,
    "recordOffset": 427517656,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1180=ON 01279 442714}",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). paid before 13:00 BST (excludes weekends and holidays). Expected dispatch time may vary and is based on seller's order cut-off time. Will usually dispatch within same working day if Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Fri. 7 Aug. and Thu. 13 Aug. Estimated between Standard Int'l",
    "textAfterTable": "Seller's payment instructions Payment must be made by PayPal, Cheque, Debit or Credit Cards. Cheques require 7 days to clear from date of receipt. Goods will be dispatched when payment is cleared. Payment must be received within 7 days or sale will be void and item re-listed. We take no responsibility for goods in postal transit. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}