{
    "relation": [
        [
            "",
            "H",
            "H",
            "H",
            "H",
            "H",
            "H",
            "K",
            "K",
            "K",
            "K",
            "K",
            "K",
            "K",
            "K",
            "T",
            "T",
            "T",
            "T",
            "T",
            "T",
            "T",
            "T",
            ""
        ],
        [
            "Vessel type",
            "Ferry",
            "Dinner/excursion",
            "Gaming",
            "Cruise",
            "Whalewatch/sightsee",
            "Other",
            "Ferry",
            "Dinner/excursion",
            "Gaming",
            "Cruise",
            "Whalewatch/sightsee",
            "Commuter/shuttle",
            "Fishing/dive",
            "Other",
            "Ferry",
            "Dinner/excursion",
            "Gaming",
            "Cruise",
            "Whalewatch/sightsee",
            "Commuter/shuttle",
            "Sailing",
            "Other",
            "TOTAL"
        ],
        [
            "P.V. year 1",
            "$128,560",
            "$11,510",
            "$10,286",
            "$1,439",
            "$30,732",
            "$16,186",
            "$76,283",
            "$247,086",
            "$3,517",
            "$1,226",
            "$11,777",
            "$0",
            "$26,878",
            "$33,721",
            "$56,853",
            "$39,557",
            "$0",
            "$6,421",
            "$205,465",
            "$34,105",
            "$22,760",
            "$80,616",
            "$1,044,979"
        ],
        [
            "P.V. year 5",
            "$532,883",
            "$47,709",
            "$42,634",
            "$5,964",
            "$127,386",
            "$67,091",
            "$316,192",
            "$1,024,174",
            "$14,578",
            "$5,083",
            "$48,817",
            "$0",
            "$111,411",
            "$139,776",
            "$235,656",
            "$163,964",
            "$0",
            "$26,614",
            "$851,652",
            "$141,365",
            "$94,339",
            "$334,155",
            "$4,331,442"
        ],
        [
            "P.V. year 10",
            "$843,055",
            "$75,479",
            "$67,449",
            "$9,435",
            "$201,532",
            "$106,143",
            "$500,235",
            "$1,620,306",
            "$23,063",
            "$8,041",
            "$77,231",
            "$0",
            "$176,259",
            "$221,134",
            "$372,823",
            "$259,401",
            "$0",
            "$42,105",
            "$1,347,366",
            "$223,648",
            "$149,251",
            "$528,654",
            "$6,852,611"
        ],
        [
            "P.V. year 15",
            "$400,130",
            "$35,824",
            "$32,013",
            "$4,478",
            "$95,651",
            "$50,377",
            "$237,421",
            "$769,028",
            "$10,946",
            "$3,817",
            "$36,655",
            "$0",
            "$83,656",
            "$104,954",
            "$176,949",
            "$123,117",
            "$0",
            "$19,984",
            "$639,485",
            "$106,148",
            "$70,837",
            "$250,909",
            "$3,252,377"
        ],
        [
            "Total P.V.",
            "$9,322,334",
            "$834,634",
            "$745,843",
            "$104,329",
            "$2,228,503",
            "$1,173,703",
            "$5,531,497",
            "$17,917,029",
            "$255,029",
            "$88,918",
            "$854,006",
            "$0",
            "$1,949,036",
            "$2,445,252",
            "$4,122,604",
            "$2,868,410",
            "$0",
            "$465,591",
            "$14,898,910",
            "$2,473,058",
            "$1,650,387",
            "$5,845,753",
            "$75,774,827"
        ]
    ],
    "pageTitle": "Home - United States Access Board",
    "title": "",
    "url": "http://www.access-board.gov/79-research/research-on-passenger-vessels",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 274341783,
    "recordOffset": 274262615,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2167=Prepared by: Environmental Engineering Division, DTS-72 Volpe National Transportation Systems Center 55 Broadway, Kendall Square, Cambridge, Massachusetts 02142}",
    "TableContextTimeStampAfterTable": "{9447=This report, undertaken on behalf of the Office of Environment, Energy, and Safety, Office of the Secretary of Transportation (OST) and the Architectural and Transportation Barriers Compliance Board (ATBCB), is an assessment of the feasibility of implementation of the Americans with Disabilities Act of 1990 (ADA) on the passenger vessel industry. The results are findings on technical feasibility and a set of cost data based on assumed access solutions. This exploration of implementation issues will be, in part, the basis for future decision making by OST in the matter of access to waterborne transportation and accommodation assets., 163145=Operating costs for the industry implementation consist of extra fuel and maintenance, given in Table 5-11. The table includes the annual maintenance costs as calculated in Appendix D. These costs are discounted to 1996 at 4.8% and not amortized. The calculation for total costs covers the 40-year period from 1998-2038., 10104=This document was preceded by the \"Interim Report: Approach and Methodology\" dated 1 October 1995, which established the approach for the cost analysis, the technical, economic, and social factors considered, and the assumptions for developing unit costs and applying them to the industry., 101576=Overall, however, the available data indicate a flat to very slow growth rate over the last five years. While Coast Guard MSIS reports the large passenger (Subchapter H) fleet has increased dramatically in that time (approximately 30% to a total of 205), due mainly to new gaming boats, the T fleet has grown at an average annual rate of only 0.4%. The Coast Guard's regulatory evaluation for small passenger vessel certification concluded in 1990 that the T fleet population was staying constant, replacing itself at a 4% annual rate (about 210 per year), with an estimated average service life of 25 years., 311700=Note: Height and length refer to height of barrier and 12:1 length to overcome., 15650=Costs are found using current Office of Management and Budget (OMB) guidance for nominal and real interest rates, assuming 1998 as the start year for implementation and present valued to 1996. The calculation of the impact costs focuses on societal cost, which is the value to society of lost or diverted resources. These include capital outlays for access on new and modified assets and increased operating costs associated with the access features; they are calculated in a forty year cost stream and the present value found at a 4.9% real discount rate. Amortization of capital outlays is not included., 7422=1. The source for all or part of the definition of this term was the Massachusetts Architectural Access Board's Draft Regulation published in December 1994., 75007=New construction: Keel laid on or after assumed effective date of new regulations of 1 January 1998., 24014=The body of the report also has calculations of the \"business\" cost, which is the same as societal cost but includes the expense of amortizing capital outlays. Amortization is at a 7.9% nominal discount rate, also present valued to 1996. The total business cost is estimated from $483.6 million to $573.9 million. The \"actual\" cost is a simple total of the cost stream with no present value discounting; its total is estimated from $968.4 million to $1.15 billion., 98264=The calculation of industry-wide costs entails the extrapolation of unit costs to the fleet, based upon vessel service lives and replacement rates, and the frequency of alterations. A detailed and accurate current fleet snapshot was developed in Section 4.1.3. Historical data for the fleet consists of yearly Treasury Department reports from the late 1800s up to 1965. A large data gap existed for the period from 1966 to 1987. The Coast Guard data management system resumed data collection beginning in 1987., 102202=The Army Corps of Engineers annual Waterborne Transportation Lines16 reports support these conclusions. The scope includes ferries and \"passenger, steam or motor\" vessels, the latter of which are excursion boats and the like. Passenger fishing boats are not covered, and the remaining fleet size tracks reasonably well with the Coast Guard's data. While the summary data in Table 5-2 shows obvious inconsistencies (the ferry fleet certainly did not grow 450% from 1989 to 1991) in data definition and reporting, it is clear that they show no recent growth trend., 75151=Alteration: Alteration undertaken on or after effective date of 1 January 1998. The study will not include \"readily achievable\" access features on existing vessels and will limit its consideration to large \"primary function\" alterations, that is alterations to those parts of the vessels housing their main public activities., 102803=The foregoing data leads to the conclusion that the fleet growth rate will be near 0% for Subchapter T, K, and H vessels for the foreseeable future. Gaming boats make up nearly all of the Subchapter H growth since 1990. Otherwise, the statistics do not support any suggestion of growth., 365801=There is a clear picture of the present disposition of the passenger fleet regulated by the Coast Guard. Historical data have two deficiencies: 1) a gap between 1965 and 1987 when little sorted data of any kind exists; and 2) the period of time before 1965 when good global fleet data were compiled, but not sorted in any useful way to reflect vessel sizes and services. Coast Guard and Army Corps data comprise a good basis for the fleet's last five years, but retrieving better historical data is probably not possible. The statement of data needs will, therefore, be limited to more feasible aims. These are:, 28753=The Coast Guard has also sponsored a study by students of the Worcester Polytechnic Institute (WPI) to rank, in order of feasibility and benefit, several access accommodations on new passenger vessels5. They found that crew training, onboard ramps, signs and alarms, and accessible rest rooms were practicable and that elevators, 1:12 boarding ramps, and emergency equipment were less so. In the latter cases, the effects on small boat designs were given strong consideration., 100214=Overall fleet growth has been stagnant for 30 years; that is, replacement and scrapping rates have been roughly equal. The last annual Treasury Department Merchant Marine Statistics15 report in 1965 listed 5862 passenger vessels, compared to the current fleet of 5770 according to Coast Guard MSIS., 30469=A working meeting was held on April 15, 1996 among representatives of the passenger vessel industry, government, and national advocacy groups to consider in depth the safety and technical issues of access onboard passenger vessels. The findings of that group are included in several portions of this report, including the recommendations sections where the needs for future work are identified. The agenda and minutes of that meeting appear as Appendix I., 329584=The \"raw total\" values come from the detailed industry implementation cost sheets, presented in Appendix E (pp. E-9 and E-10). These actual costs in 1996 dollars are estimated to range from $79.5 million to $263.8 million., 100982=In the data gap between 1965 and 1987, most of those boats fell out of service while the revival of passenger boats for transportation and leisure bloomed, especially on inland waters and around the large cities. Passenger vessels have become more specialized with a much larger proportion of the fleet purpose-built for particular services. Volatile growth and decline of particular fleet segments (e.g. construction booms in dinner/excursion boats in early 1980s and gaming boats in the 1990s) often occur, reacting to public trends and regulations which cannot be forecast., 343010=Table 8-1 summarizes the costs that would be incurred by the sample businesses. Capital costs are given first in 1995 dollars and then amortized ten years from the build year and present valued to 1995. Operating expenses for a thirty year period from the build year are present valued to 1995., 25270=The ADA was signed into law in 1990. Six years later, the impact on the passenger vessel industry is unclear as no regulations have been developed for that mode of transport. This may be partly due to the fact that marine transportation is the \"forgotten stepchild\" among the major modes. However, the marine industry's unique missions and operating environment and the difficulties of applying ADA's various titles thereto are probably a better explanation for the slow pace of implementation., 100541=Treasury data indicate that in the 1950s and early 1960s, the passenger fleet expanded dramatically with the post-war economic expansion and as World War II surplus craft such as PT boats were brought into such services as fishing and charter. Table 5-1 indicates this trend for the build years 1942-46; the same may be observed for build years in the late 1950s as craft from other services moved into the passenger trade., 30022=The Volpe Center chaired an Internal Working Advisory Group (IWAG) made up of government, industry, and advocacy representatives to steer some aspects of the cost study. They were assembled for their advice and comments on the direction of the impact study, although not necessarily to achieve consensus views. The Group met on March 23, 1995 and later reviewed the interim report; the approach used here reflects their comments.}",
    "textBeforeTable": "Food service Vessel Access Solution Set Table 4-3 Access 4 (T fishing boats)-- Single deck access to and within primary function area on one deck only. Accessible head is provided, and other amenities to the extent available to all passengers. Figure 4-3 shows a generic arrangement. Access 4 should apply only to new construction and large alterations of primary function passenger areas. For the cost industry implementation, only new construction is considered since large alterations of these craft are rare. Access 3-- Access accommodations, including passage size, accessible heads, signage and alarms, and food service, provided on one deck. \"Equivalent facilitation\" on that single deck may substitute for some services available on other decks. Multi-deck access is not required since this solution applies only to alterations of small (T) boats, where technical and cost impacts are likely to be much more burdensome. Access 2-- Full access accommodations and passenger services provided to the extent available to all passengers, on at least one deck. Access features on a single deck will most often result, except when other amenities, for example access to open deck, are only available on another deck. Access 1-- All passenger areas of all decks accessible in accordance with the ADAAG, for mobility, sight, and hearing impaired people. This includes passage widths and slopes, elevators or lifts to all decks, accessible heads, signage and alarms, food service accommodations, and tiedowns for wheelchairs. A set of full access solutions is proposed to deal with the",
    "textAfterTable": "100' crew boat conv. T-L/K 185 3 2400 13.0 105' dinner boat T-L/K 600 3 8301 13.8 106' dinner boat T-L/K 550 3 7200 13.1 183' dinner boat T-L/K 1000 3 8280 8.3 192' excursion boat T-L/K 600 4 14272 23.8 200' excursion boat T-L/K 800 3 12250 15.3 80' paddle wheeler T-L/K 500 3 5920 11.8 198' casino boat T-L/K 1900 5 32400 17.1 274' paddle wheeler T-L/K 1200 4 32100 26.8 84' ferry, veh. dk. only T-L/T 90 1 2000 22.2 97' ferry T-L/K 250 2 3731 14.9 127' ferry T-L/K 693 3 5624 8.1 175' ferry T-L/K 1600 3 10700 6.7 40' fishing boat T-S/T 15 1 275 18.3 45' fishing boat T-S/T 10 1 300 30.0 59' fishing boat T-S/T 149 2 1118 7.5 60' fishing boat T-S/T 12 2 820 68.3 5. VESSEL ACCESS COSTS Fleet costs are developed in parallel for both new construction (5.2) and alterations (5.3) by",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}