{
    "relation": [
        [
            "Postage and packaging",
            "Free P&P",
            "Free collection in person"
        ],
        [
            "To",
            "United Kingdom",
            "United Kingdom"
        ],
        [
            "Service",
            "Economy Delivery (Other Courier)",
            "Other Delivery (Collection in Person)"
        ],
        [
            "Delivery*",
            "Estimated between Fri. 7 Aug. and Tue. 11 Aug.",
            ""
        ]
    ],
    "pageTitle": "Genuine AC Schnitzer 20\" x 10J Type IV Racing alloy wheel for BMW, brand new | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/300857911178",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 413798211,
    "recordOffset": 413746242,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70307=Offered by the official U.K. AC Schnitzer importer. For any AC Schnitzer queries please call us on 01485 542000 or email info@ac-schnitzer.co.uk}",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- United Kingdom Change country: Item location: Postage cost can't be calculated. Please enter a valid postcode. Contact the seller- opens in a new window or tab and request a postage method to your location. United Kingdom, but the Postage to: United Kingdom Dersingham, Norfolk, United Kingdom",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within 2 working days of receiving cleared payment - opens in a new window or tab. VAT price: 20.0% (included in the listed price). If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. Payment details Payment method Preferred/Accepted   Accepted",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}