{
    "relation": [
        [
            "Author",
            "C. S. Lewis",
            "Terry Brooks",
            "Robert Jordan",
            "T. H. White",
            "Lloyd Alexander",
            "Piers Anthony",
            "Isaac Asimov",
            "Don Callander",
            "Tracy Hickman",
            "J. R. R. Tolkien",
            "H. G. Wells",
            "Margaret Weis",
            "Orson Scott Card",
            "Frank Herbert",
            "Alan Dean Foster",
            "Arthur C. Clarke",
            "Kurt Vonnegut, Jr.",
            "Larry Niven",
            "Michael Crichton",
            "Robert A. Heinlein",
            "Stephen R. Donaldson",
            "David Eddings",
            "L.E. Modesitt, Jr.",
            "John Peel",
            "Stephen R. Lawhead",
            "Melanie Rawn"
        ],
        [
            "Number of B-a-M Reviews",
            "7",
            "6",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ]
    ],
    "pageTitle": "Famous Science Fiction Authors - Criteria Indicating Fame",
    "title": "",
    "url": "http://www.adherents.com/lit/sf_lists.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 275983691,
    "recordOffset": 275955784,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78856=On 21 January 2000 there were 369 different authors with links in the two separate \"Fantasy:Authors\" and \"Science Fiction:Authors\" sections (after eliminating many duplicates which were on both lists)., 94059=This was is in no way a popularity contest, but authors who have three or more submissions are listed below (as of As of Jun 29 1998, at which time the list had 777 different books suggested by 1014 people). Note that most of these authors are not science fiction/fantasy authors. Of those who are, nearly all are on the \"famous list\"., 47078=The top 20 Authors from the ISFDB Balanced list are below (as of 10 November 1999). It is worth noting that we found this list after compiling this page's list of \"Most Famous\" SF/F authors, and that only 12 of the top 20 authors from this list were among the 50+ authors we had picked as \"most famous.\" (In the total Top 100 ISFDB list, 23 authors were among the \"Most Famous\" list.) One major reason for this is that many of the \"Top 100 Authors\" (such as Mike Resnick) are on the list primarily for awards received for short stories, whereas the \"famous authors\" on our list were more likely to be novelists.}",
    "lastModified": "Wed, 22 Jul 2015 02:33:08 GMT",
    "textBeforeTable": "SF/F Authors Who are Major Characters in Feature Films Movies are such a popular form of popular media that they are often a major contributor to the fame of authors on whose work they are based. An even greater indicator of fame, and sometimes a cause of fame, is when movies are actually about an author. We've moved information about this subject to its own page: SF/F Authors Who are Major Characters in Feature Films. Internet Top 100 SF/F Survey (Cooke) As of Nov. 1, 1999, the Internet Top 100 survey had compiled the votes of 2,510 people. Readers were asked to submit names of SF/F books, along with a rating between 1 to 10. The webmaster for this site is T. Cooke, of Adelaide, Australia. The top 10 highest-ranked books or series are shown below. J.R.R. Tolkien: The Lord of the Rings Douglas Adams: The Hitchhiker's Guide to the Galaxy Kurt Vonnegut: Slaughterhouse-Five Orson Scott Card: Ender's Game Frank Herbert: Dune Stephen King: It; The Stand Ray Bradbury: Fahrenheit 451; Something Wicked This Way Comes George Orwell: 1984; Animal Farm by George Orwell L. Ron Hubbard: Battlefield Earth; Fear; Mission Earth Robert Heinlein: Citizen of the Galaxy; Double Star; Starship Troopers; Stranger in a Strange Land; The Door Into Summer; The Moon is a Harsh Mistress; The Puppet Masters Authors whose names are in bold are",
    "textAfterTable": "1958 A Case of Conscience James Blish 1959 Starship Troopers Robert A. Heinlein 1960 A Canticle for Leibowitz Walter M. Miller, Jr. 1961 Stranger in a Strange Land Robert A. Heinlein 1962 The Man in the High Castle Philip K. Dick 1963 Way Station Clifford D. Simak 1964 The Wanderer Fritz Leiber 1965 ...And Call Me Conrad (re-issued as This Immortal) Roger Zelazny 1966 Dune Frank Herbert 1966 The Moon Is a Harsh Mistress Robert A. Heinlein 1967 Lord of Light Roger Zelazny 1968 Stand on Zanzibar John Brunner 1969 The Left Hand of Darkness Ursula K. Le Guin 1970 Ringworld Larry Niven 1971 To Your Scattered Bodies Go Philip Jose Farmer 1972 The Gods Themselves Isaac Asimov 1973 Rendezvous with Rama Arthur C. Clarke 1974 The Dispossessed Ursula K. Le Guin 1975 The Forever War Joe Haldeman 1976 Where Late the Sweet Birds Sang Kate Wilhelm 1977 Gateway Frederik Pohl 1978 Dreamsnake Vonda McIntyre 1979 The Fountains of Paradise Arthur C. Clarke 1980 The Snow Queen Joan D. Vinge 1981 Downbelow Station C. J. Cherryh 1982 Foundation's Edge Isaac Asimov 1983 Startide Rising David Brin 1984 Neuromancer William Gibson 1985",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}