{
    "relation": [
        [
            "Certification Requirements (certified consultants)",
            "IBM Certified Deployment Professional -IBM Maximo Asset Management V7.5 (Test C2010-570 + C2010-571)",
            "IBM Certified Infrastructure Deployment Professional IBM Maximo Asset Management V7.5 (Test C2010-501)"
        ],
        [
            "Bronze",
            "1",
            "1"
        ],
        [
            "Silver",
            "2",
            "1"
        ],
        [
            "Gold",
            "3",
            "1"
        ]
    ],
    "pageTitle": "IBM PartnerWorld - C&SI Software Practice Accelerator - Gain knowledge, experience and recognition through IBM Practice Accelerators",
    "title": "",
    "url": "http://www-304.ibm.com/partnerworld/wps/servlet/ContentHandler/swg_com_sfw_ibm-cloud-smarter-infrastructure-practice-accelerator",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 252040951,
    "recordOffset": 252017625,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1836=Business Partners interested in Accreditation in Cloud & Smarter Infrastructure can apply through this program. Cloud & Smarter Infrastructure offers two types of accreditation: Product Accreditation and Solution Accreditation. The Product level will focus on product deployment skills in a individual product area. The Solution level allows Business Partners to demonstrate skills and understanding of a broader solution that includes multiple products. The Cloud & Smarter Infrastructure Deployment Accreditation Guide for 2014 has the specific details of the current accreditation requirements for both product and solution accreditation:, 69299=New IBM software solutions may be added to the IBM Software Practice Accelerator portfolio during 2014 and beyond., 3936=The Cloud & Smarter Infrastructure Deployment Accreditation Guide for 2015 has the specific details of the accreditation requirements for both product and solution accreditations:, 67641=DB2 10.1 DBA for Linux, UNIX and Windows (Test C2090-611) and (1 of either Test C2090-610 or Test C2090-730), 4136=C&SI Accreditation Deployment Guide 2015 (PDF, 707KB), 2863=The Cloud & Smarter Infrastructure Deployment Accreditation Guide is now available for 2015. Several certifications will no longer count towards accreditation in 2015: IBM Certified Deployment Professional - Tivoli Workload Scheduler V8.6 (valid through 4/30/2015), IBM Certified Deployment Professional - Tivoli Storage Manager V6.3 (valid through 10/31/2015) and IBM Certified Deployment Professional – Tivoli Endpoint Manager V8.2 (valid through 10/31/2015). Additional certification version requirements for Accreditation may change for the October 2015 revalidation based on certifications that expire in PartnerWorld in September 2015. Your technical enablement manager will notify you so that you will have at least 6 months to obtain any new certifications., 67900=IBM Certified Database Associate DB2 10.1 (Test C2090-610)}",
    "textBeforeTable": "Gain experience applying knowledge, skills and tools by engaging with IBM Solution Services experts to successfully deliver IBM Software Group solutions. Upon successful completion of implementation training, you have the opportunity to engage with IBM Software Services in support of practice acceleration via four engagement models: Deployment experience Cloud and Smarter Infrastructure knowledge center Cloud and Smarter Infrastructure Business Partner Technical Enablement Portal Other enablement resources For more information on Implementation training offerings, contact partner1@us.ibm.com. Contact Cloud and Smarter Infrastructure training road maps These are the primary solutions included in the implementation training program. Cloud & Smarter Infrastructure has training available on additional solutions. Training road maps are available to assist you with navigating the content available for you to develop your technical skills IBM Tivoli Network Manager IP Edition V4.1 Operations and Administration This five day workshop covers the installation, configuration, use, customization, integration of Tivoli Network Manager 4.1 with Netcool/OMNIbus, and network monitoring using the Network Manager Pollers. The workshop includes approximately 40% lecture and 60% hands-on exercises. The workshop begins with a basic overview of product components and their associated functions. You configure Tivoli Network Manager and perform a full discovery of simulated networks. To further understand the intricacies of the discovery",
    "textAfterTable": "Note: Deployment experience services are fee based services and will vary based on offering. Contact For more information or to engage IBM Solutions Services, contact Steve Bodayla at sbodayla@us.ibm.com. Accreditation Gain recognition for successfully delivering IBM software solutions. Business Partners who successfully meet both certification and implementation criteria for a particular IBM software solution area may apply for IBM Software Practice Accreditation. Business Partners interested in Accreditation in Cloud & Smarter Infrastructure can apply through this program. Cloud & Smarter Infrastructure offers two types of accreditation: Product Accreditation and Solution Accreditation. The Product level will focus on product deployment skills in a individual product area. The Solution level allows Business Partners to demonstrate skills and understanding of a broader solution that includes multiple products. The Cloud & Smarter Infrastructure Deployment Accreditation Guide for 2014 has the specific details of the current accreditation requirements for both product and solution accreditation: Cloud & Smarter Infrastructure Deployment Accreditation (PDF, 374KB) The Cloud & Smarter Infrastructure Deployment Accreditation Guide is now available for 2015. Several certifications will no longer count towards accreditation in 2015: IBM Certified Deployment Professional - Tivoli Workload Scheduler V8.6 (valid through 4/30/2015), IBM Certified Deployment Professional - Tivoli Storage Manager V6.3 (valid through 10/31/2015) and IBM Certified Deployment Professional – Tivoli Endpoint Manager V8.2 (valid through 10/31/2015). Additional certification version requirements for Accreditation may change for the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}