{
    "relation": [
        [
            "Domain Created On",
            "2011-11-26",
            "3 years, 248 days old"
        ],
        [
            "Last Modified On",
            "2014-04-04",
            "1 year, 118 days ago"
        ],
        [
            "Expires On",
            "2015-11-26",
            "0 years, 116 days from today"
        ]
    ],
    "pageTitle": "AsyaFanatikleri.com, Asya Dizi İzle , Asian Drama , Kore Dizileri , Japon Dizileri ,Uzak Doğu Dizileri | Online Film İzle Seyret | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.asyafanatikleri.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 702476987,
    "recordOffset": 702458757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3708=IP address of asyafanatikleri.com is : 185.103.196.123. The domain asyafanatikleri.com was created on 2011-11-26 and it is 3 years, 248 days old. It will expire on 2015-11-26 which is 0 years, 116 days from today. The homepage of website asyafanatikleri.com has a size of 145732 bytes, and a text size of 18990 bytes, its Text to Code Ratio is 14.98% Homepage of asyafanatikleri.com has 1023 links, 1017 link to internal pages, while 6 link to pages on other websites. It takes 0.83 s ( 175.51 Kb/s ) to load the website asyafanatikleri.com.}",
    "textBeforeTable": "AsyaFanatikleri.com, Asya Dizi İzle , Asian Drama , Kore Dizileri , Japon Dizileri ,Uzak Doğu Dizileri | Online Film İzle Seyret Words count: 19    Unique Words: 16    Length: 132 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 31 recommended tasks to improve your SEO performance. ... Extend the domain for a longer period. Implement browser caching for your site. Implement HTTP compression for your site. Add more high page-rank back-links to your site. Reduce number of links to other pages. Configure the server so that your site IP http://185.103.196.123 is redirected to the site domain name asyafanatikleri.com. Move the 62 inline css components to an external style sheet file. Add in more high quality text content and make the text to code ration to be within 15%-70%. Create one H1 element for your page, put the most important keywords in. Edit the title tag, ensure it contains 1-12 words, and with 10-70 characters.",
    "textAfterTable": "The title will be displayed in search engine results in the form of a direct link to the site. Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Asya Dizi Ve Film Keyfi Words count: 5    Length: 23 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] The description is too short! Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : AsyaFanatikleri.com, Asya Dizi İzle , Asian",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}