{
    "relation": [
        [
            "Property Type",
            "Apartments",
            "Apartments",
            "Apartments"
        ],
        [
            "Bedrooms",
            "3bhk",
            "4bhk",
            "5bhk"
        ],
        [
            "Area",
            "2421 sq.ft",
            "4483 sq.ft",
            "4842 sq.ft"
        ],
        [
            "Price",
            "Available On Request",
            "Available On Request",
            "Available On Request"
        ]
    ],
    "pageTitle": "Residential Projects by Happy Home Group | Find Properties by Happy Home Group in Surat",
    "title": "",
    "url": "https://www.commonfloor.com/all-projects-by-happy-home-group-in-surat/bpc-50o70g-46",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897643483,
    "recordOffset": 897582123,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{230891=Expected completion is around Jun 2013, 332295=Expected completion is around Dec 2016, 3494=Incepted in 1999 The Happy Home Group stands tall with its massive and superior quality of construction with its core expertise in creating spacious and comfort oriented spaces. With the leadership under the guidance of Mr. Himmat Patel and Mr. Mukesh Patel, the company is an encouraging spirit of wisdom growth and constructive debate so that people are unbounded to go back to the state of ignorance. The institution invests on highest level of understanding uncompromised on fairness. Moreover, we're acquired a few credits to our name by our projects like Diamond world, Sweet House, Vatslya Bunglow, Shubham Bunglow. All of these projects have been fostering our desire for benchmarks. In short, making possible more smiles. As we look ahead, we foresee a lot of our upcoming projects that'll intensify the war or competition. This we believe will give us a strong foot hold and empower excellence in the realm of construction., 298523=Expected completion is around Jun 2015, 276897=Expected completion is around Jun 2016}",
    "textBeforeTable": "Unit Types Celebrity Greens Happy Home Celebrity Greens is a residential development by Happy Home Group. It offers skillfully designed 3BHK and 4BHK flats. The project is well equipped with all the modern amenities to facilitate the needs of the residents. Overview More Details Enquire Now _gaq.push(['_trackEvent','Enquiry form-lf','Enquire','CAP']);\"> Not Available Listings Available : Under Construction Possession : 3BHK, 4BHK Unit Type: Apartments Property Type: Happy Home Group Builder: 2167Sq ft - 3647Sq ft Price : On Request ongoing Celebrity Greens  in Vesu, Surat",
    "textAfterTable": "Home Loans providers include All Leading Bank Map Amenities Garden Club House Library Tennis Court Gymnasium Basket Ball Court Other About Builder Incepted in 1999 The Happy Home Group stands tall with its massive and superior quality of construction with its core expertise in creating spacious and comfort oriented spaces. With the leadership under the guidance of Mr. Himmat Patel and Mr. Mukesh Patel, the company is an encouraging spirit of wisdom growth and constructive debate so that people are unbounded to go back to the state of ignorance. The institution invests on highest level of understanding uncompromised on fairness. Moreover, we're acquired a few credits to our name by our projects like Diamond world, Sweet House, Vatslya Bunglow, Shubham Bunglow. All of these projects have been fostering our desire for benchmarks. In short, making possible more smiles. As we look ahead, we foresee a lot of our upcoming projects that'll intensify the war or competition. This we believe will give us a strong foot hold and empower excellence in the realm of construction.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}