{
    "relation": [
        [
            "Version",
            "7.x-1.0",
            "6.x-1.0"
        ],
        [
            "Download",
            "tar.gz (142.63 KB) | zip (153.14 KB)",
            "tar.gz (145.68 KB) | zip (153.09 KB)"
        ],
        [
            "Date",
            "2013-Aug-31",
            "2013-Aug-29"
        ]
    ],
    "pageTitle": "Theme project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_theme?page=9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901694003,
    "recordOffset": 901661324,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{156038=(2011-07-25) This theme is now revamp as Zen subtheme (http://drupal.org/project/zen). You will need to install it with this theme as below:}",
    "lastModified": "Sat, 01 Aug 2015 12:20:36 GMT",
    "textBeforeTable": "Other releases Downloads Sankofa was created by Samuel Ayela (sayela) of Rocom Solutions Developers Here is a demo of the theme. Clear your cache and refresh the page Download the latest version of the Nivo Slider jQuery plugin, extract it somewhere and copy this: jquery.nivo.slider.js to sites/all/libraries or sites/sitename/libraries as you require. Install the theme by downloading and extracting it to sites/all/themes or sites/sitename/themes Configuring NIVO Slider The slideshow is based on the popular NIVO Slider. Customizable social media integration - Facebook, Twitter, Google Plus, LinkedIn Ready to use slideshow Tableless design Multiple columns - 1, 2, and 3 Features Sankofa is a clean, tableless, multi-column theme with a wide image slideshow ready for use. July 15, 2012 at 8:54pm sayela on Posted by Sankofa Themes allow you to change the look and feel of your Drupal site. You can use themes contributed by others or create",
    "textAfterTable": "View all releases Read more about Sankofa ⋅ Categories: Actively maintained, Under active development Addari Posted by sakib000 on January 2, 2009 at 11:54am Addari is another clean theme contributed to Drupal from Worthapost. This theme targets those who want cleanliness and web 2.0 mixture for their Drupal based website. Features Rounded Glassy corners of container. 7 Block regions which are Big right sidebar, Right sidebar, Left sidebar, Header, Footer, Content Top & Content Bottom. Pre-Made Search block (just enable search module and set appropriate permission). Mission block positioned on right portion (See in Screenshot) Attractive comment section. Optimized background images that loads very fast. CSS based design without tables. Cross browser support including IE6 New Features in 2.x Increased width of the theme Added dropdown menu Content area has dynamic width depending on blocks Typography changes Minor fix and additions For Drupal 5.x version, please visit This page. RTL: For RTL support please read #733224 Downloads",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}