{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security people are always really friendly and helpful.",
            "None",
            "There is a decent amount of C&O on campus. Not every club that I wanted, but there are a lot none-the-less.",
            "Outdoorsy med students.",
            "There are some great paths for walking right next to the river that is right on the ocean. :)",
            "Most of our money is given back to us with free stuff and events it seems...",
            "Outdoor Recreation programs, events, etc.",
            "Few but good dining options. Have to watch out for some foods that just aren't good here.",
            "Great dorms. Lots of space. Really pricey though.",
            "With a marine bio major, the required courses are equal to that of a med student. I'm pretty busy most of the time.",
            "Don't be afraid to ask questions.",
            "It's a great school. It has great facilities. There is a lot to do on campus."
        ]
    ],
    "pageTitle": "University of New England Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-New-England/reviews?_escaped_fragment_=/show/9413",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888920687,
    "recordOffset": 888855811,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{235074=Very nice dorms to begin with. Easy to make friends. May get boring at times., 309861=© 2015, Cappex.com, LLC, 87979=NOTHING. If you have a car as a Freshman, you should probably thank your mom & dad or grandparents for paying for the EXTREMELY OVER PRICED FRESHMAN PARKING, right now... If you have a car, that means you can get off of that remote campus and explore the surprisingly decent Southern Maine area. L.L bean/ outlet shopping in Freeport, cool restaurants and shops in Portland, beautiful lighthouses up and down the coast, and you can take the Downeaster train to Boston (a two hour trip from the Saco train station). A lot of the beach activity and other lively things happen in the summer May-September. By the time school starts, the weather turns cold and the beaches are deserted... If you do not have a car, well, make friends with someone who does. Otherwise you can take the sketchy Biddeford bus to Wal-Mart., 302230=There is a club for EVERYTHING. Knitting to Rugby to the Alliance our LGBTQ+ club. And if we don't have it you can create a club for it. All you need is a few friends and an advisor. The Women's Rugby Captain and President started Rugby as a club her sophomore year, after just a few years we are now going to be varsity in 2015-16 Check out Clubs and Orgs here: http://www.une.edu/studentlife/biddeford/involvement-activities/clubs-and-organizations, 78463=UNE is a very safe and low key school. Campus security officers are on duty 24/7 and cops make routine visits throughout the day. I can walk from my dorm to the computer lab across campus at 11:30 at night and not think twice about it., 303223=We dedicate the month of April as Gaypril, during Gaypril there is a drag ball and a drag show, usually with a past contestant from Ru Paul's Drag Race. This isn't unusual as much as unique. Right before finals each semester we also have events intended to help you relax run by the Activities Programming Board or the Resident student life association, 95187=Thats all up to you. However, i must warn you that the area is patrolled and enforced by the towns police as if it were Eastern Germany in 1983.}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 24 out of 27 people found this review useful. 1 of 64 Zach from Portland, ME Check out reviews left by other students or leave your own review. You could win a free scholarship. University of New England Reviews University of New England › Maine › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students This school is for students who have an interest in medical fields or marine biology. If you work hard as a student, your hard work will pay off here, and you will not be just another number in the crowd. Tips for prospective students If you want to go to a school that is focused on the success of each and every student, UNE is a great place to be. You have to find a school that fits you. If you love the outdoors, the campus is beautiful. It is on the bank of the Saco River where it meets the Atlantic. I fish about 100 yds from my dorm! I would recommend that anyone whose academic interests meet what the school has to offer, come to the school and meet with the helpful and friendly staff and enjoy the sights of the campus. Bang for the buck Although private colleges do cost more than state schools, the benefits are enormous. First of all, as I said, the classes are very small and personal. No huge lecture halls. The classes are taught by professors, not teaching assistants. I have a friend who attends a state school. She has to pay for her laundry services, I don't. And when we",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}