{
    "relation": [
        [
            "Register",
            "High (first) register",
            "Low (second) register"
        ],
        [
            "Initial consonant",
            "Voiceless",
            "Voiced"
        ],
        [
            "Smooth ending",
            "A1 ngang \"level\"",
            "A2 huyền \"hanging\""
        ],
        [
            "Glottal ending",
            "B1 sắc \"sharp\"",
            "B2 nặng \"heavy\""
        ],
        [
            "Fricative ending",
            "C1 hỏi \"asking\"",
            "C2 ngã \"tumbling\""
        ]
    ],
    "pageTitle": "Vietnamese language - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Vietnamese_language",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864924623,
    "recordOffset": 864853313,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34578=As a result of 1000 years of Chinese rule, much of the Vietnamese lexicon relating to science and politics is derived from Chinese — see Sino-Vietnamese vocabulary. Some 30% to 60% of the lexical stock has naturalized word borrowings from China, although many compound words are composed of native Vietnamese words combined with naturalized word borrowings (i.e. having Vietnamese pronunciation).[citation needed] As a result of French occupation, Vietnamese has since had many words borrowed from the French language, for example cà phê (from French café). Nowadays, many new words are being added to the language's lexicon due to heavy Western cultural influence; these are usually borrowed from English, for example TV (though usually seen in the written form as tivi). Sometimes these borrowings are calques literally translated into Vietnamese (for example, software is calqued into phần mềm, which literally means \"soft part\")., 76646=These dialect regions differ mostly in their sound systems (see below), but also in vocabulary (including basic vocabulary, non-basic vocabulary, and grammatical words) and grammar.[35] The North-central and Central regional varieties, which have a significant amount of vocabulary differences, are generally less mutually intelligible to Northern and Southern speakers. There is less internal variation within the Southern region than the other regions due to its relatively late settlement by Vietnamese speakers (in around the end of the 15th century). The North-central region is particularly conservative; its pronunciation has diverged less from Vietnamese orthography than the other varieties, which tend to merge certain sounds. Along the coastal areas, regional variation has been neutralized to a certain extent, while more mountainous regions preserve more variation. As for sociolinguistic attitudes, the North-central varieties are often felt to be \"peculiar\" or \"difficult to understand\" by speakers of other dialects., 77983=The large movements of people between North and South beginning in the mid-20th century and continuing to this day have resulted in a sizeable number of Southern residents speaking in the Northern accent/dialect and, to a greater extent, Northern residents speaking in the Southern accent/dialect. Following the Geneva Accords of 1954 that called for the temporary division of the country, about a million northerners (mainly from Hanoi, Haiphong and the surrounding Red River Delta areas) moved south (mainly to Saigon and heavily to Biên Hòa and Vũng Tàu, and the surrounding areas) as part of Operation Passage to Freedom. About 3% (~30,000) of that number of people made the move in the reverse direction., 119035=A romanization of Vietnamese was codified in the 17th century by the French Jesuit missionary Alexandre de Rhodes (1591–1660), based on works of earlier Portuguese missionaries Gaspar do Amaral and António Barbosa. This Vietnamese alphabet (quốc ngữ or \"national script\", literally \"national language\") was gradually expanded from its initial domain in Christian writing to become more popular among the general public. However, the Romanized script did not come to predominate until the beginning of the 20th century, when education became widespread and a simpler writing system was found more expedient for teaching and communication with the general population. Under French colonial rule, French superseded Chinese in administration. Vietnamese written with the alphabet became required for all public documents in 1910 by issue of a decree by the French Résident Supérieur of the protectorate of Tonkin. By the middle of the 20th century virtually all writing was done in quốc ngữ, which became the official script on independence. Chữ nho was still in use on early North Vietnamese and late French Indochinese banknotes issued after World War II[43] but fell out of official use shortly thereafter. Only a few scholars and some extremely elderly people are able to read chữ nôm today. In China, members of the Jing minority still write in Chữ Nôm., 151596=The writing system used for Vietnamese is based closely on the system developed by Alexandre de Rhodes for his Vietnamese–Portuguese–Latin dictionary, published in 1651. It reflects the pronunciation of the Vietnamese of Hanoi at that time, a stage commonly termed Middle Vietnamese (tiếng Việt trung đại). The pronunciation of the \"rime\" of the syllable, i.e. all parts other than the initial consonant (optional /w/ glide, vowel nucleus, tone and final consonant), appears nearly identical between Middle Vietnamese and modern Hanoi pronunciation. On the other hand, the Middle Vietnamese pronunciation of the initial consonant differs greatly from all modern dialects, and in fact is significantly closer to the modern Saigon dialect than the modern Hanoi dialect., 122544=The Unicode character set contains all Vietnamese characters and the Vietnamese currency symbol. On systems that do not support Unicode, many 8-bit Vietnamese code pages are available such as VISCII or CP1258. Where ASCII must be used, Vietnamese letters are often typed using the VIQR convention, though this is largely unnecessary with the increasing ubiquity of Unicode. There are many software tools that help type true Vietnamese text on US keyboards, such as WinVNKey and Unikey on Windows, or MacVNKey on Macintosh., 144311=^4 It is unclear what this sound was. According to Ferlus 1992,[46] in the Archaic Vietnamese period (c. 10th century AD, when Sino-Vietnamese vocabulary was borrowed) it was *ɽ, distinct at that time from *r., 121070=Changes in the script were made by French scholars and administrators and by conferences held after independence during 1954–1974. The script now reflects a so-called Middle Vietnamese dialect that has vowels and final consonants most similar to northern dialects and initial consonants most similar to southern dialects (Nguyễn 1996). This Middle Vietnamese is presumably close to the Hanoi variety as spoken sometime after 1600 but before the present. (This is not unlike how English orthography is based on the Chancery Standard of late Middle English, with many spellings retained even after significant phonetic change.)}",
    "lastModified": "Wed, 29 Jul 2015 15:57:22 GMT",
    "textBeforeTable": "Proto-Viet–Muong had no tones to speak of. The tones later developed in some of the daughter languages from distinctions in the initial and final consonants. Vietnamese tones developed as follows: Origin of the tones[edit] Note also that a large number of words were borrowed from Middle Chinese, forming part of the Sino-Vietnamese vocabulary. These caused the original introduction of the retroflex sounds /ʂ/ and /ʈ/ (modern s, tr) into the language. *kj > gi ml > MV ml > mnh > nh *kl, *gl > MV tl > tr *pl, *bl > MV bl > Northern gi, Southern tr *pr, *br, *tr, *dr, *kr, *gr > /kʰr/ > /ks/ > s The following initial clusters occurred, with outcomes indicated: ^4 It is unclear what this sound was. According to Ferlus 1992,[46] in the Archaic Vietnamese period (c. 10th century AD, when Sino-Vietnamese vocabulary was borrowed) it was *ɽ, distinct at that time from *r. ^3 In Middle Vietnamese, the outcome of these",
    "textAfterTable": "Glottal-ending syllables ended with a glottal stop /ʔ/, while fricative-ending syllables ended with /s/ or /h/. Both types of syllables could co-occur with a resonant (e.g. /m/ or /n/). At some point, a tone split occurred, as in many other Southeast Asian languages. Essentially, an allophonic distinction developed in the tones, whereby the tones in syllables with voiced initials were pronounced differently from those with voiceless initials. (Approximately speaking, the voiced allotones were pronounced with additional breathy voice or creaky voice and with lowered pitch. The quality difference predominates in today's northern varieties, e.g. in Hanoi, while in the southern varieties the pitch difference predominates, as in Ho Chi Minh City.) Subsequent to this, the plain-voiced stops became voiceless and the allotones became new phonemic tones. Note that the implosive stops were unaffected, and in fact developed tonally as if they were unvoiced. (This behavior is common to all East Asian languages with implosive stops.) As noted above, Proto-Viet–Muong had sesquisyllabic words with an initial minor syllable (in addition to, and independent of,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}