{
    "relation": [
        [
            "Classification of Investigations",
            "Conflict of Interest",
            "Internal Fraud",
            "External Fraud",
            "False Statements",
            "Misuse of Government Property",
            "Employee Misconduct",
            "Management Misconduct",
            "Technical Allegations - Other",
            "Proactive Initiatives",
            "Theft",
            "Whistleblower Reprisal",
            "Event Inquiries",
            "Total Investigations"
        ],
        [
            "Carryover",
            "1",
            "0",
            "7",
            "1",
            "17",
            "4",
            "3",
            "9",
            "14",
            "0",
            "0",
            "5",
            "61"
        ],
        [
            "Opened Cases",
            "0",
            "1",
            "0",
            "0",
            "6",
            "9",
            "2",
            "5",
            "0",
            "2",
            "1",
            "0",
            "26"
        ],
        [
            "Closed Cases",
            "1",
            "0",
            "7",
            "1",
            "21",
            "8",
            "4",
            "11",
            "12",
            "1",
            "1",
            "2",
            "69"
        ],
        [
            "Cases in Progress",
            "0",
            "1",
            "0",
            "0",
            "2",
            "5",
            "1",
            "3",
            "2",
            "1",
            "0",
            "3",
            "18"
        ]
    ],
    "pageTitle": "NRC: Office of the Inspector General Semiannual Report to Congress (NUREG-1415, Vol. 19, No. 1)",
    "title": "",
    "url": "http://www.nrc.gov/reading-rm/doc-collections/nuregs/staff/sr1415/v19n1/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 628040027,
    "recordOffset": 627999578,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10307=Manuscript Completed: October 2006 Date Published: October 2006 Reporting Period: April 1, 2006 - September 30, 2006, 2245=The U.S. Nuclear Regulatory Commission (NRC) was formed in 1975 to regulate the various commercial and institutional uses of nuclear materials by the Energy Reorganization Act of 1974. The agency succeeded the Atomic Energy Commission, which previously had responsibility for both developing and regulating nuclear activities., 9793=This Semiannual Report to Congress highlights the activities of the U.S. Nuclear Regulatory Commission (NRC) Office of the Inspector General (OIG) for the 6-month period ending September 30, 2006.}",
    "TableContextTimeStampAfterTable": "{44049=The objectives of this evaluation were to evaluate (1) the adequacy of NRC’s information security programs and practices for NRC major applications and general support systems of record for FY 2006, (2) the effectiveness of agency information security control techniques, and (3) the implementation of the NRC’s corrective action plan created as a result of the 2005 FISMA program review., 41088=OIG became aware of a November 2004 staff issue paper to the Commission, commonly known as a SECY Paper, which proposed a new NRC policy for assessing the effectiveness of security measures of material licensees. In the subject SECY Paper, staff expressly requested a “Commission policy decision” before proceeding further on a framework for future agency actions. In a subsequent Staff Requirements Memorandum (SRM), the Commission approved the staff’s proposal and the mechanism for implementing the new policy., 1490=In response, President Jimmy Carter in 1978 signed into law the landmark legislation known as the Inspector General Act (IG Act). The IG Act created independent Inspectors General (IGs), who would protect the integrity of Government; improve program efficiency and effectiveness; prevent and detect fraud, waste and abuse in Federal agencies; and keep agency heads, Congress, and the American people fully and currently informed of the findings of the IGs’ work., 66098=OIG conducted an investigation of the NRC staff’s management of the NRC parking garage contract based on a number of OIG Hotline complaints concerning individuals parking in the NRC White Flint parking garage complex without paying. An NRC contractor is responsible for managing the daily operations of the NRC White Flint garage. Since 2000, OIG has conducted three investigations involving the management of the NRC parking garage. These previous investigations found that a lack of NRC staff oversight of the parking garage contract allowed the contractor to withhold revenue from the NRC from parking receipts, not follow established parking procedures, and embezzle $11,400 of daily parking fees. In November 2005, to again assess if the NRC staff was effectively managing the NRC garage contract, OIG reviewed the procedures used in administering the day-to-day operations by NRC staff and its contractor., 74492=OIG conducted an investigation based on information that Aramark, the contractor for the NRC cafeteria, was overcharging customers for the State of Maryland sales tax. OIG learned that the NRC cafeteria cash registers were upgraded in December 2005, which resulted in an unexplained programming error that entered the Maryland State tax of 5.5 percent instead of 5.0 percent. This error went undetected for 3 months during which time, Aramark charged customers 5.5 percent instead of 5.0 percent for Maryland sales tax. OIG verified that Aramark paid the tax overcharge to the State of Maryland, as required by law., 59725=Emergency Preparedness (EP) measures are designed to address a wide range of event scenarios. Following the events of September 11, the NRC evaluated the EP planning basis, issued orders requiring compensatory measures for nuclear security and safety, and observed license performance during security-based EP drills and exercises and security force-on-force exercise evaluations. Based on the information obtained through the drills and exercises, the staff determined that the EP basis remains valid but recognized that security events differ from accident-initiated events., 61280=OIG conducted a Special Inquiry in response to concerns raised by the public and Members of Congress about the NRC’s approval of the selection by the nuclear industry of a major security corporation to provide the mock aggressor force during NRC evaluations of the security of nuclear power plants. Specifically, as a result of the September 2001 terrorist attacks, the NRC conducted an evaluation of the security and safeguards programs of nuclear power plants. As part of this effort, NRC identified the need to improve the offensive abilities and effectiveness of the mock adversary force that is used to test power plant security. Subsequently, the staff provided the NRC Commission with five alternatives that outlined various processes for the development and implementation of a credible, well-trained, and consistent mock adversary force for Force-on-Force (FOF) exercises. The Commission voted to approve the staff’s recommendation which called for the NRC staff to establish adversary force standards and guidelines and for the industry to select and train a pool of personnel for a Composite Adversary Force (CAF) that would meet the performance standards established by the NRC. Acting on this decision, the Nuclear Energy Institute, an organization that represents the nuclear industry, selected The Wackenhut Corporation (Wackenhut) as the CAF through a competitive contract process. The selection of Wackenhut, a firm that provided security guard services for approximately 50 percent of the Nation’s nuclear power plants, to also act as an adversary force to test nuclear plant security resulted in concerns of a possible conflict of interest., 50175=The Atomic Energy Act provides for a license period of 40 years for commercial nuclear power plants, but includes provisions for extending the license beyond this initial period. This original 40-year term for reactor licenses was based on economic and antitrust considerations—not on limitations of nuclear technology. Due to this selected time period, however, some structures and components may have been engineered on the basis of an expected 40-year service life. The maximum renewal period of licenses is for an additional 20 years. The first operating license will expire in 2006; approximately 10 percent will expire by the end of 2010 and more than 40 percent will expire by 2015. At this time, there are approximately 14 completed license renewal applications, 8 applications under review, and 23 letters of intent to seek license renewal., 70410=OIG determined that all information included in the letter was obtained through open sources in combination with the author’s own calculations. The author is a structural engineer (Ph.D., P.E.), with detailed knowledge of spent nuclear fuel storage systems. OIG also determined that the author obtained knowledge on the NRC’s methodology in calculating damage to spent fuel storage systems by attending public hearings in June 2000, during which NRC staff discussed those specific methodologies., 14940=In addition, for the first time, draft Office of the Executive Director for Operations (OEDO) Procedures were reviewed. The prior OEDO Procedures were changed in 2005, consolidating and replacing previous procedure and guidance documents issued by the OEDO. The stated purpose of the new process is to define and improve predictability, quality, timeliness, and transparency of OEDO activities and functions., 72323=However, OIG learned that one individual was medically cleared to return to work in 1994, but this person never returned to work at NRC and was still receiving OWCP benefits. A review of the individual’s OWCP files reflected a 1991 injury from an attempt to open a jammed restroom door at NRC Headquarters. In July 1993, a vocational rehabilitation counselor informed NRC that the individual was capable of returning to work on an 8-hour a day basis, with minor restrictions. However, in August 1993 NRC terminated the individual from employment based on a “physical inability” to perform the functions of the position. Consequently, the individual began receiving monthly workers’ compensation payments of 75 percent of the employee’s NRC salary., 22283=Special Agent (SA) Malion Bartley was recognized by the PCIE/ECIE for his exceptional dedication, professionalism, and accomplishment in investigating and reporting agency shortcomings in the NRC’s handling of preemption matters. During 2005, SA Bartley conducted an investigation which addressed the lack of action by the the NRC to prevent a number of individual States from regulating nuclear power in areas preempted by Congress to the Federal Government. The Atomic Energy Act mandates that the regulation of byproduct, source, or special nuclear material is the exclusive jurisdiction of the NRC. Congress authorized the Commission to establish programs for cooperation between the NRC and the States with respect to control of radiation hazards associated with the use of certain radioactive materials used in activities such as medicine and construction; however, Congress drew a line between the types of activities deemed appropriate for regulation by individual States and those activities where NRC regulation is required., 68346=OIG conducted a proactive effort after noting that individuals were offering MetroCheks for sale on the Internet auction website, eBay. MetroCheks are a prepaid fare card for use on transportation resources of the Washington Metropolitan Area Transit Authority, including trains, the subway, buses, and van pools. MetroChek transit subsidies are provided by the employers, including the Federal Government, to eligible employees. The sale, trade, or transfer of these tax-free benefits, paid for by the employing agencies, is prohibited. OIG monitored auctions conducted on eBay during the period of March to June 2006 and noted 70 individuals selling $20,250 worth of MetroCheks., 6245=Each September, OIG issues an Annual Plan that summarizes the audits planned for the coming year. Unanticipated high priority issues may arise that generate audits not listed in the Annual Plan. OIG audit staff continually monitor specific issue areas to strengthen OIG’s internal coordination and overall planning process. Under the OIG Issue Area Monitor (IAM) program, staff designated as IAMs are assigned responsibility for keeping abreast of major agency programs and activities. The broad IAM areas address nuclear reactors, nuclear materials, nuclear waste, international programs, security, information management, and financial management and administrative programs., 13439=From April 1, 2006, through September 30, 2006, OIG reviewed more than 300 agency documents, including approximately 140 Commission Papers (SECYs), Staff Requirements Memoranda, and 160 Federal Register Notices, regulatory actions, and statutes. The most significant commentaries are summarized below:, 56836=In January 2000, Congress enacted the Reports Consolidation Act of 2000 (the Act) which requires Federal agencies to provide an annual report that would consolidate financial and performance management information in a more meaningful and useful format for Congress, the President, and the public. Included in the Act is a requirement that, on an annual basis, Inspectors General summarize the most serious management and performance challenges facing their agencies. Additionally, the Act provides that IGs assess their respective agency’s effort to address the challenges, compare and contrast the new challenges listing with previous listings, and identify programs that have had questionable success in achieving results., 65602=In addition, OIG determined that between 1999 and 2005, three concerns regarding security door deficiencies were reported to NRC involving Shearon Harris. OIG found that the NRC staff appropriately addressed these 3 concerns as well as the 19 concerns reported in December 2005. (Addresses Management Challenge #1), 52511=Through this report, OIG will combine the findings of the previous OIG audit reports and GAO’s investigation in order to provide a more complete perspective of NRC’s approach to byproduct material security and control. The specific objective for this report is to discuss whether NRC has adequately transformed its mission to provide for the security of byproduct material in the post-September 11 era in accordance with the expectations of lawmakers and the American people. (Addresses Management Challenge #1), 97152=2The General Services Administration (GSA) is responsible for the management decision on these questioned and unsupported costs. GSA has advised that the decision will be made sometime in 2006., 65155=OIG learned that in December 2005, 19 new security concerns were reported to the NRC. The NRC staff conducted an inspection and substantiated seven of the concerns, but the staff found that the seven concerns did not represent a degradation of plant security. Based on their interviews and inspections, the NRC staff was unable to validate nine concerns. Three of the concerns were investigated by the NRC Office of Investigations., 36241=Homeland Security Presidential Directive-12 (HSPD-12), issued on August 27, 2004, ordered the establishment of a mandatory Government-wide standard for secure and reliable forms of identification for employees and contractors. In February 2005, NIST issued the requirements for a common identification standard for Federal employees and contractors and revised them in March 2006., 18628=The President’s Council on Integrity and Efficiency (PCIE) and the Executive Council on Integrity and Efficiency (ECIE) recognized an OIG audit team and an OIG special agent in 2006 by awarding them the prestigious Award for Excellence. The audit team was recognized for exceptional performance in recommending actions to improve NRC activities to control and account for radioactive materials. The team consisted of Cheryl Miotla, Audit Manager; Michael Cash, Technical Advisor; and Robert Wild, Senior Management Analyst., 23445=OIG learned that since 1992, NRC has allowed the State of Minnesota to enforce annual radiation dose release limits for dry cask storage at a nuclear power plant in the State. Further, the States of Connecticut, Maine, Massachusetts, and New Jersey had also established more stringent radiological dose standards at nuclear power plants than those set by NRC., 35062=OIG performed these audits to evaluate (1) the adequacy of NRC’s information security programs and practices in the NRC regions and the TTC, (2) the effectiveness of the regions’ and TTC’s security control techniques, and (3) the progress towards resolving information security program weaknesses identified during the FY 2003 computer security audits of the regions and TTC., 111836=The Inspector General Act of 1978, as amended (1988), specifies reporting requirements for semiannual reports. This index cross-references those requirements to the applicable pages where they are fulfilled in this report., 17930=The Nuclear Safety Audits Team receives its 2006 PCIE/ECIE Award for Excellence plaques. Pictured from left to right are: Cheryl A. Miotla, Audit Manager; Hubert T. Bell, Inspector General; R.K. Wild, Senior Management Analyst; Stephen D. Dingbaum, Assistant Inspector General for Audits; Michael T. Cash, Technical Advisor; and David C. Lee, Deputy Inspector General., 32620=The Federal Privacy Act of 1974, as amended, establishes safeguards for the protection of records the Federal Government collects, maintains, uses, and disseminates on individuals. It balances the government’s need to maintain information about individuals with the rights of individuals to be protected against invasions of their privacy. The Privacy Act applies when information is retrieved by personal identifier from agency records (e.g., paper records, electronic records, and microfiche) that contain information about individuals. A personal identifier can be a number assigned to an individual or the individual’s Social Security number. This report was issued as the result of information developed during the Fiscal Year (FY) 2006 Federal Information Security Management Act (FISMA) evaluation of the NRC’s information security program., 28947=In accordance with the Atomic Energy Act of 1954, as amended (AEA), the NRC relinquishes its authority to regulate certain byproduct material to 34 States. These Agreement States are responsible for administering approximately 17,300 materials licenses. The AEA also mandates that NRC periodically review agreements and actions taken by Agreement States to ensure compliance with provisions of the Act. NRC established the Integrated Materials Performance Evaluation Program as the mechanism for overseeing Agreement State programs. OIG performed this audit to evaluate NRC’s oversight of Agreement State licensing actions., 53192=During FY 2001, OIG evaluated policies governing the accountability and control of NRC’s non-capitalized Information Technology (IT) property. The review found that property management policies for this equipment adhered to applicable laws and regulations; however, management controls to implement these policies were inadequate or lacking. In addition, the NRC’s Property and Supply System, an online interactive computer system that functions as the official database for the agency’s property transactions, contained inaccurate information. During FYs 2004 and 2005, NRC developed the Space and Property Management System (SPMS), a new property and supply system designed to replace the old system. SPMS became operational on December 13, 2004, and final acceptance of the system by the Office of Administration took place in June 2005., 78396=Disposition of Allegations —April 1, 2006, through September 30, 2006, 54891=Audit of NRC’s FY 2006 Financial Statements, 44452=Audit Results. While the agency has made some improvements since the FY 2005 FISMA independent evaluation, the agency has two significant deficiencies:, 21574=Special Agent Malion A. Bartley receives his 2006 PCIE/ECIE Award for Excellence plaque. Pictured from left to right are: Hubert T. Bell, Inspector General, Joseph A. McMillan, Assistant Inspector General for Investigations; Malion A. Bartley; George A. Mulley, Senior Level Assistant for Investigative Operations and David C. Lee, Deputy Inspector General., 49758=Vermont Yankee Nuclear Power Station applied for License Renewal in January 2006., 2697=NRC’s OIG was established as a statutory entity on April 15, 1989, in accordance with the 1988 amendment to the IG Act. NRC OIG’s mission is to (1) independently and objectively conduct and supervise audits and investigations relating to NRC programs and operations; (2) prevent and detect fraud, waste, and abuse; and (3) promote economy, efficiency, and effectiveness in NRC programs and operations., 54048=NRC policy requires the effective and efficient management of property including sufficient controls to deter or prevent loss through fraud, waste, or misuse. This policy not only applies to property in the agency’s possession, but also to property physically maintained by NRC’s contractors. As of July 30, 2005, SPMS accounted for approximately 17,680 pieces of non-capitalized property with an acquisition cost of approximately $30.4 million. This included 1,343 laptops and 643 personal digital assistants with an acquisition value of approximately $3.6 million., 26791=On September 17, 2006, Joseph A. McMillan, became the new Assistant Inspector General for Investigations in the NRC/OIG. Mr. McMillan most recently served as the Special Agent in Charge of the Mid-Atlantic Field Office, at the Defense Criminal Investigative Service (DCIS), the law enforcement arm of the Department of Defense, Office of Inspector General. In this position, he was responsible for managing all DCIS operations throughout the Washington, D.C. Metropolitan area, Maryland, Virginia, Europe, the Middle East, and Southwest Asia. In addition, during his 18-year career with DCIS, Mr. McMillan held a variety of progressively responsible field and headquarters managerial assignments to include the Assistant Special Agent in Charge of the Philadelphia Field Office, the Program Manager for the DCIS Inspection Program, and the Deputy Director for Technical Services., 76140=Source of Allegations — April 1, 2006, through September 30, 2006, 51918=In February 2005, OIG began an audit to determine if NRC’s oversight of byproduct material provides reasonable assurance that licensees are using the material safely and can account for and control the material. During 2006, OIG issued three reports related to material tracking and licensing. Also during this timeframe, the Government Accountability Office (GAO) conducted an investigation to ascertain whether radioactive sources could be smuggled across U.S. borders. The GAO work culminated in a March 2006 congressional hearing to discuss the results of the investigation., 19627=In July 2002, the Department of Energy (DOE) and NRC established an Interagency Working Group on RDDs to cooperate on areas where the control of radioactive material could be achieved. One area that the group examined was options for establishing a national source tracking system because NRC’s regulations do not require licensees to report radioactive material inventories to the NRC. The DOE/NRC Working Group recommended that NRC develop a tracking system to better understand and monitor the location and movement of certain radioactive sources.}",
    "textBeforeTable": "Summary of Investigations 3 Other Administrative Action 2 Alternative Dispute Resolution 11 Counseling 1 Suspensions and Demotions 3 Terminations and Resignations NRC Administrative Actions:   1 Arrest $1,008 Other Recoveries $86,650 PFCRA Recoveries 1 Sentencing 1 Convictions 1 State Declinations 1 State Referrals 1 Pending DOJ Actions 6 DOJ Declinations 7 DOJ Referrals Status of Investigations 4 Pending Review or Action 1 Processing 5 Correlated to Existing Case 39 Referred to NRC Management and Staff 3 Referred for OIG Audit 26 Referred for OIG Investigation 56 Closed Administratively 134 Total Number Disposition",
    "textAfterTable": "  Audit Listings Internal Program Audit and Special Evaluation Reports Date Title Audit Number 04/14/06 Audit of NRC’s Oversight of Agreement States’ Licensing Actions OIG-06-A-12 06/23/06 Audit of NMSS’ Procedures for Processing Inspection Guidance OIG-06-A-13 06/30/06 Evaluation of Personal Privacy Information Found on NRC Network Drives OIG-06-A-14 07/11/06 Office of the Inspector General Computer Security Audit of Region I - King of Prussia, PA OIG-06-A-15 07/11/06 Office of the Inspector General Computer Security Audit of Region II - Atlanta, GA OIG-06-A-16 07/11/06 Office of the Inspector General Computer Security Audit of Region III - Lisle, IL OIG-06-A-17 07/11/06 Office of the Inspector General Computer Security Audit of Region IV - Arlington, TX OIG-06-A-18 07/11/06 Office of the Inspector General Computer Security Audit of the Technical Training Center, Chattanooga, TN OIG-06-A-19 08/01/06 Audit of NRC’s Implementation of Homeland Security Presidential Directive-12 (HSPD-12) OIG-06-A-20 09/08/06 Audit of NRC’s",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}