{
    "relation": [
        [
            "",
            "10-0",
            "Phillip Koons",
            "2001, 2005",
            "RB Ethan Biddy QB Tanner Koons K Bobby Stonebreaker"
        ],
        [
            "",
            "2007 Record",
            "Head Coach",
            "State Championships",
            "Players to Watch"
        ],
        [
            "",
            "7-3",
            "Reagan Roof",
            "2003",
            "QB Riley Clayborn RB Devin Campbell DL Darren Davenport"
        ]
    ],
    "pageTitle": "UGASports.com - iTrackAction Preview: Tuttle vs. Bethany",
    "title": "",
    "url": "https://uga.rivals.com/content.asp?CID=1014858",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896545403,
    "recordOffset": 896530783,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1924=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 UGASports.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{47180=Prediction: Bethany is not your typical fourth place squad and a tough draw for Tuttle in the first round. However, this Tuttle squad is hungry after their season ended in the semi-finals in 2008 and the loss of one of 3A’s best players in Day will be too much for Bethany to overcome., 41738=November 12, 2009, 45863=Breakdown: Tuttle: The Tigers reloaded once again in 2009 to add another district title to their already crowded trophy case. Tanner Koons stepped into the quarterback role vacated by his brother, Sterling, to lead Tuttle to a perfect regular season.}",
    "textBeforeTable": "--> .style20 {font-family: Geneva, Arial, Helvetica, sans-serif; font-size: 16px; font-weight: bold; } .style19 {font-family: Geneva, Arial, Helvetica, sans-serif; font-size: 16px; } .style18 {font-size: 16px} .style17 {font-family: Geneva, Arial, Helvetica, sans-serif} .style15 {color: #FFFFFF; font-weight: bold; font-family: Geneva, Arial, Helvetica, sans-serif; font-size: 16px; }",
    "textAfterTable": "Breakdown: Tuttle: The Tigers reloaded once again in 2009 to add another district title to their already crowded trophy case. Tanner Koons stepped into the quarterback role vacated by his brother, Sterling, to lead Tuttle to a perfect regular season. Bethany: The Broncos navigated the way through a tough district to make another postseason birth but will attempt to replace veteran quarterback Silas Day, who quit the team before their week ten game against Pauls Valley What Tuttle must do to win: Jump out to an early lead. Tuttle has outscored its opponents by 278 points this season and will need to get momentum on their side early against a scrappy Bethany squad. The more that the Tigers can make Bethany go to the air, the better their chances look. What Bethany must do to win: Control the clock. Bethany has a talented running back in Davin Campbell and will need to put together long drives that deep Tuttle’s offense off the field while also eating valuable time off the clock. A few turnovers or untimely 3-and-outs could spell disaster for the Broncos’ chances. Prediction: Bethany is not your typical fourth place squad and a tough draw for Tuttle in the first round. However, this Tuttle squad is hungry after their season ended in the semi-finals in 2008 and the loss of one of 3A’s best players in Day will be too much for Bethany to overcome.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}