{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are many things around campus to do, such as hookah bars, if youre into that kind of thing. In 2015 there will be a football team so tailgating will be an option. Many people hang out in each others dorms since they are so big.",
            "The commons is amazing! They have so many healthy options and also some not so healthy options. They grow some of their food themselves so its always fresh and tasty. There are also many other options available on campus. The Hoot however, is the worst place to eat. its all fried and burnt. Everywhere else is good, just avoid the hoot.",
            "I actually commute to school, but have spent plenty of nights on campus. The dorms are ridiculously huge. I'm talking actual apartment size. Everyone is friendly and welcoming. They also have plenty of programs in place to get you involved around campus.",
            "This school feels like a more social school rather than academic rigor. The class sizes were small thus leading me to feel like i was still in high school. Seriously, 3 of my five classes had around 30-40 people in them. I also felt that there were way too many opportunities given to make up tests, homework, projects and it made me feel that people didn't earn the grades they got.",
            "Use your meal plan swipes! There are so many people i know that pay for the meal plan and do not use them! Every swipe you dont use is on average about 10 dollars you throw away. I know people who had around 50 left at the end of the semester. Thats 500 dollars out the window.",
            "Kennesaw State University is an awesome school to go to and is ever expanding. It does seem to me, however, that it is a school based more on community involvement rather than academic rigor. That being said, it is still a great school."
        ]
    ],
    "pageTitle": "Kennesaw State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Kennesaw-State-University/reviews?_escaped_fragment_=/show/96382",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910863539,
    "recordOffset": 910713491,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{491969=The Greek Life is definitely growing here. There was just a new sorority added this year, 2012. Take advantage of the opportunity. I have had friends who love it and some who don't. It's all what you make of it., 129917=We've only been around since 1963, so we don't have any unusual traditions...YET., 329393=There are parties if you meet the right people, otherwise it may be hard as this is a commuter school and people are independent so live on campus. There is Kennesaw mountain, a mall, and many restaurants and bars. Kennesaw is getting a football program in 2014 and there is always intramurel sports, 742066=Our student dining hall is ranked one of the highest in the nation and has even beat out those at culinary schools. We have several other dining choices on campus that accept the meal plan as well. The food is delicious and there is a good variety, by fall of 2014 we should have a new taco bar as well., 14051=KSU is rapidly growing and constantly changing - it's an exciting time to be an Owl! The dining hall, The Commons, was added in fall 2009 and a new soccer stadium (where the Atlanta Beat soccer team plays) opened in May 2010. A football team is expected in 2014. The dorms are great because you get your own bedroom regardless of which of the four communities you live in., 226638=Kennesaw has a very diverse population and is accommodating to all types of students, not just traditional high school graduates. It offers clases online for the non-traditional student who may not have time for going to campus or night classes, as well as classes starting from 7:30 am ending at 10:15pm for the students who want to come to class before or after work. There are a number of hybrid classes, and classes offered at the center for continuing education for specific certifications that don't require even being a Kennesaw student. There is a variety of major options and graduate school options so that anyone seeking almost any degree is welcomed and will be taken care of there., 566345=It varies; I remember my ENGL 1101 class was way easier than the equivalent high school course, AP Language and Composition. In contrast, I struggled through CHEM 1211, but in high school I breezed through Chemistry., 833037=© 2015, Cappex.com, LLC, 76275=I will learn about KSU when I attend the walking tour they have in July. They also have a session set up for adult learners in August before school starts., 609477=I've never lived on campus. I live close by, in off-campus housing. More and more off-campus housing is opening each year and the shuttle buses stop at them. From my friends places, the housing is better than other schools. You don't share bedrooms. May have to share a bathroom depending on the floor plan you choose., 319451=I commuted, so I don't have an opinion on this one. But my friends that lived on campus loved it. I have been inside them before (hanging out with friends), and they are very nice, especially the new ones. They are building even more now, since our attendance continues to explode, so I'm sure those will be state-of-the-art, environment-friendly like the other ones too! They will be available around Fall 2012, Summer 2013 I think., 318496=AWESOME dining hall. We got The Commons in 2010, and it has never disappointed. Even students with food allergies can find something tasty to eat there! And if not, the cooks are way cool that they will MAKE something for you! Sweet, huh? They are also environmentally aware. They collaborate with farmers and local growers for their food, and use water sparingly. Even the toilets have a system to cut down on water use! There are many stations- an Asian, ethnic, all-American, pizza/pasta, soul, greens/fruits, sandwich, all kinds! And then there are themes to the food stations- from Greek, to African, to Thai, and everything in between! Yum... seriously, good stuff., 139861=we have tons of sports and intramural activities to chose from. we have everything from tennis to camping. the only sport we don't seem to have is football, but we are planning to have a team in 2014., 104986=There are many things around campus to do, such as hookah bars, if youre into that kind of thing. In 2015 there will be a football team so tailgating will be an option. Many people hang out in each others dorms since they are so big., 571296=In 2009 I lived in the freshman housing and it was pretty decent. They kept everything clean in the building and their were monthly fire drills. KSU housing department tends to have events for students living there,for example: movie nights, parties, and casino night, so I would defiantly recommend freshman trying to find their way on their own and in college live on campus. If you do not wish to live on campus, there are many college style housing located around the campus that the B.O.B (Big Owl Bus) provides transportation to and from school., 775750=This school has everything, or at least it will by Fall 2015. The dorms are the ridiculously high quality- even the worst dorms are better than some of the best dorms on other campuses. With the renovations and additions to so many buildings, there's no way but up from here., 773205=Those emergency buttons and call stations are everywhere, the KSU police is everywhere. They take every report seriously. I have never even once begun to feel unsafe on campus. Also, ask anyone from the class of 2017 about the fire alarms in the University Village Suites. Let's just say there's no way there will ever be a fire that all of the Suites doesn't know about.., 21474=Tuition cost is, by far, the best thing about Kennesaw State University. The low In-state tuition has allowed me to take my core classes at a very acceptable and reasonable price. The campus is beautiful and the new dining hall is very deserving of appraisal. The services on campus are excellent for the cost of attending, and the price is perfect for the quality of education received. I'm sure we will see tuition costs rise dramatically very soon, as the introduction of a football team in 2014 will be spark some increased interest in this tuition state-wide, and possibly even nation-wide., 607735=There isn't going to be a football team until Fall 2015 but there's still Homecoming. They have a Intramural Flag Football game instead.}",
    "textBeforeTable": "01/17/2010 Reviewer is A current student here. 31 out of 33 people found this review useful. 1 of 179 Alicia from Kennesaw, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students I have three roommates and all four of us range from majors like art to biochemistry to young childhood education. All types of students fit in great here. There is a good bit of homework, but it's mostly online with help on the problems. So it's not too terribly bad. Tips for prospective students The best thing to do would be to live on campus and get the unlimited meal plan. This makes everything very easy for a freshmen, plus it saves a lot of money. Also, it'd be great to bring a bike. It is a rather large campus. Bang for the buck The school has a relatively low tuition cost and great pricing for dorms. These dorms can be on the cheap side or on the expensive side. Even the cheap ones, I live in the cheapest dorms, are amazing. They are just like an apartment. The cost for books is great too because i paid less than $500 for this semesters books, and i should get most of it back at the end of the semester. Am enjoying being here The social life in Kennesaw is so friendly. Everyone has a place",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}