{
    "relation": [
        [
            "Theme",
            "1. Assessing Ecosystem Condition and Trend Program 1 — Historical and current condition of the Great Barrier Reef, Dr John Pandolfi, University of Queensland Program 2 — Natural Resources of the Torres Strait land and sea, Professor Helene Marsh, James Cook University Program 3 — Condition and trends of North Queensland rainforests, Professor Steve Williams, James Cook University",
            "2. Understanding Ecosystem Function and Cumulative Pressures Program 4 — Water quality of the Great Barrier Reef and Torres Strait — Dr Britta Schaffelke, Australian Institute of Marine Science Program 5 — Cumulative impacts on benthic biodiversity, Dr Katharina Fabricius, Australian Institute of Marine Science Program 6 — Movements and habitat use by marine apex predators, Dr Colin Simpfendorfer, James Cook University Program 7 — Threats to rainforest health, Dr Dan Metcalfe, CSIRO",
            "3. Managing for Resilient Tropical Systems Program 8 — Effectiveness of spatial management on the GBR — Dr Hugh Sweatman, Australian Institute of Marine Science Program 9 — Decision support systems for GBR managers — Prof Bob Pressey, James Cook University Program 10 — Socio-economic value of GBR goods and services — Dr Marcus Lane, CSIRO Program 11 — Resilient Torres Strait communities — Dr James Butler, CSIRO Program 12 — Managing for resilience in rainforests — Dr Ro Hill, CSIRO Program 13 — Australia's Tropical Land and Seas (e-ATLAS) — Dr Eric Lawrey, AIMS"
        ],
        [
            "Description",
            "A clear understanding of the ecological condition and trends of environmental assets of the Great Barrier Reef, the Torres Strait, and the Wet Tropics rainforest is fundamental to ecologically sustainable use of those assets by industry and communities, as well as appropriate management. Theme 1 is comprised of three Programs, which concentrate on specific components of Queensland's natural and cultural heritage, and will deliver reports on the condition and trends of key ecosystems and resources.",
            "Theme 2 includes four Programs and builds on research that has identified many of the primary risks and threats to the environmental assets of Queensland. These pressures do not occur in isolation and it is clear that a greater understanding of the cumulative and synergistic impact of these pressures is required for improved management. Changing climate, extreme natural events, changes in natural resource use and population growth are some of the pressures facing these ecosystems. Understanding these pressures is essential in developing effective management responses that promote ecosystem resilience.",
            "Research undertaken within Theme 3 will provide knowledge and options to assist key decision makers in government, industry and the community in managing the complex ecosystems of the Great Barrier Reef, the Wet Tropics rainforests (including the World Heritage Area) and the Torres Strait. Theme 3 draws on the assessment of ecological condition and trends undertaken in Theme 1 and the improved understanding of ecosystem function and cumulative pressures from Theme 2. Theme 3 will provide tools and information for evidence-based decision making that address the pressures and sustains resilient ecological, social and economic systems."
        ],
        [
            "Examples of expected benefits",
            "The expected outcomes of this research are highly relevant to the following elements of the portfolio's work: EPBC Act referrals and assessments, species recovery planning, marine environment reporting, State of the Environment reporting, threat abatement planning (including the Australian Pest Animal Strategy), and the Great Barrier Reef Outlook Report (particularly in relation to identified key issues and risks in climate change & water quality, protected species, fisheries impacts and coastal development). Early warning of Crown of Thorns Starfish outbreaks will also allow localised management options to be considered in a timely manner.",
            "The expected outcomes of this research are highly relevant to the following elements of the portfolio's work: EPBC Act referrals and assessments, species recovery planning, strategic assessment of commercial fisheries, and threat abatement planning including informing the Australian Pest Animal Strategy. The proposed outcomes are also highly relevant to the Great Barrier Reef Outlook Report's identified key issues and risks: water quality, climate change, coastal development & fisheries impacts, and protected species.",
            "The expected outcomes of this research are highly relevant to the Great Barrier Reef Outlook Report's identified key issues and risks: fisheries impacts and the zoning plan. This research will also feed directly into management effectiveness and ecosystem resilience chapters of the Great Barrier Reef Outlook report; sustainable development in the Torres Strait; management of invasive species in the Wet Tropics World Heritage Area; and biosecurity planning to protect Australian ecosystems from species moving through the Torres Strait."
        ]
    ],
    "pageTitle": "National Environmental Research Program - Research Hubs",
    "title": "",
    "url": "http://www.environment.gov.au/science/nerp/research-hubs",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434737547,
    "recordOffset": 434709112,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10566=On 13 September 2011 the Minister approved the research plans for the five research hubs funded by this Department under the National Environmental Research Program (NERP). Funding of $68.5 million over the next 4 years has been allocated to provide first-class science that is essential for sustainably managing Australia's environment.}",
    "TableContextTimeStampAfterTable": "{76357=National Environmental Research Program Department of the Environment GPO Box 787 Canberra ACT 2601 Phone: 02 6274 2589 Email: nerp@environment.gov.au}",
    "lastModified": "Sat, 01 Aug 2015 11:53:22 GMT",
    "textBeforeTable": "(all figures are exclusive of GST) Funding Other collaborators: Parks Victoria, Department of Sustainability and Environment (Victoria), Department of Environment and Climate Change, New South Wales, CSIRO. Research partners: The University of Melbourne, RMIT University, The Australian National University, The University of Western Australia. Governance arrangements: A Hub Steering Committee led by an independent chair (currently Dr Simon Ferrier, CSIRO) will provide overall governance. The Committee will be responsible for ensuring the Hub research plan addresses stated NERP priorities and stakeholder requirements and monitoring progress against milestones. In addition, a Management Executive for the hub will be convened. Host organisation/administrator: The University of Queensland Hub Leader: Professor Hugh Possingham NERP Environmental Decisions Hub - Leader Professor Hugh Possingham Show all Hide all The investments are as follows: A key feature of the NERP is that the researchers have been funded on the basis that their research teams will provide a capacity to inform the short, medium and long term research needs of the environment and sustainability portfolio. On 13 September 2011 the Minister approved the research plans for the five research hubs funded by this Department under the National Environmental Research Program (NERP). Funding of $68.5 million over the next 4 years has been allocated to",
    "textAfterTable": "Theme Description Examples of expected benefits 1. Values: Understanding major Drivers for Maintaining Biodiversity. Dr Michael McCarthy, University of Melbourne (UoM) and Dr Kerrie Wilson, University of Queensland (UQ) This theme is examining how different values of ecosystems, species, and potentially antagonistic or synergistic environmental, social and economic benefits interact to influence conservation outcomes and how these should be addressed in conservation planning. The research from this theme will assist and improve the department's biodiversity on ground management challenges, including within the National Reserve System and on island ecosystems. 2. Understand function / monitoring of ecosystem health. Professor David Lindenmayer and Dr Don Driscoll, both from the Australian National University (ANU) Projects under this theme will address key questions associated with the relationships between ecosystem-based management and vegetation condition, and species responses, with a focus on the development of datasets and models that will enable cost-effective monitoring and adaptive management. The research under this theme will focus on ecosystem modelling and monitoring case studies at locations around Australia building on existing collaborative relationships: Box-Gum Woodlands, Central Highlands, Cumberland Plain and Central Victorian woodlands, Basalt Plains grasslands of Victoria, Booderee National Park in Jervis Bay Territory, Brigalow forests in Queensland, the wheat belt of Western Australia, and Otway National Park. The research from this theme will assist and improve on-ground outcomes in managing the National Parks, monitoring the effectiveness of the Stewardship Programs and Recovery Planning under the EPBC",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}