{
    "relation": [
        [
            "First Name",
            "Courtney",
            "Joseph"
        ],
        [
            "Last Name",
            "Watson",
            "Zummo"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=31439359-92F6-4C18-8B4D-A1856C06C6DD&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224237262,
    "recordOffset": 224229060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34596=National Defense Authorization Act for Fiscal Year 2013 (H.R. 4310, S. 3254); Department of Defense Appropriations Act, 2013 (H.R. 5856); and Continuing Appropriations Resolution, 2013 ( H.J.Res. 117); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions & artillery, advanced technology programs, (continues) naval shipbuilding and systems, and cooperative threat reduction; provisions on export control reform related to satellites and components., 43155=Issues associated with Congressional notifications of proposed foreign military and direct commercial sales; Export control reform; U.S. defense cooperation with countries in Asia, Europe, the Middle East, Africa, and South America; and Safeguarding United States Satellite Leadership and Security Act (H.R. 3288 and S. 3211) and National Defense Authorization Act for FY 2013 (H.R. 4310, S. 3254), provisions related to satellite export control reform., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 56169=Commerce, Justice, Science Appropriations Act, 2013 (H.R. 5326, S. 2323) and Continuing Appropriations Resolution, 2013 (H.J.Res. 117), provisions relating to Joint Polar Satellite System, NASA space exploration, earth science, and remote sensing. General outreach on science, technology, engineering, and math programs (STEM)., 24502=Transportation, HUD, and Related Agencies Appropriations Act, 2013 (H.R. 5972, S. 2322); Commerce, Justice, Science Appropriations Act, 2013 (H.R. 5326, S. 2323); & Continuing Appropriations Resolution, 2013( H.J.Res. 117), provisions relating to the funding of the Administration's budget request for air traffic control modernization, Air Traffic Controller Optimum Training Solution program, NASA space exploration, earth science, remote sensing, (continues) earth observing systems, and Joint Polar Satellite System. Department of Homeland Security Appropriations Act, 2013 (H.R. 5855, S. 3216), provisions for aviation, maritime, border, and cyber security. National Defense Authorization Act for Fiscal Year 2013 (H.R. 4310, S. 3254); Department of Defense Appropriations Act, 2013 (H.R. 5856); Intelligence Authorization Act for FY 2013 (H.R. 5743, S. 3454); and Continuing Appropriations Resolution, 2013(H.J.Res. 117); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions and artillery, advanced technology programs, naval shipbuilding and systems and cooperative threat reduction; provisions on export control reform related to satellites and components., 12172=Transportation, HUD, and Related Agencies Appropriations Act, 2013 (H.R. 5972, S. 2322) and Continuing Appropriations Resolution, 2013 (H.J.Res. 117), provisions relating to the funding of the Administration's budget request for air traffic control and modernization, Air Traffic Controller Optimum Training Solution program, and Wide Area Augmentation System., 65339=Export control reform; Safeguarding United States Satellite Leadership and Security Act (H.R. 3288 and S. 3211) and National Defense Authorization Act for FY 2013 (H.R. 4310, S. 3254), provisions related to satellite export control reform., 62105=Greater Research Opportunities with Tax Help Act (S. 1577) and American Research and Competitiveness Act, 2011 (H.R. 942), all provisions; To amend the Internal Revenue Code of 1986 to extend the allowance for certain business assets (S. 2240 and H.R. 4196); the Small Business Jobs and Tax Relief Act (S. 2237), provisions relating to bonus depreciation; the Mobile Workforce State Income Tax Simplification Act of 2012, all provisions. American Taxpayer Relief Act of 2012(H.R. 8), provisions (continues) related to business tax extenders. Issues pertaining to comprehensive tax reform., 50355=Department of Homeland Security Appropriations Act, 2013 (H.R. 5855, S. 3216) and Continuing Appropriations Resolution, 2013 (H.J. Res 117), provisions relating to aviation, maritime, border, and cyber security., 16364=National Defense Authorization Act for Fiscal Year 2013 (H.R. 4310, S. 3254); Department of Defense Appropriations Act, 2013 (H.R. 5856); and Continuing Appropriations Resolution, 2013 (H.J.Res. 117); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, (continues) simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions and artillery, advanced technology programs, naval shipbuilding and systems and cooperative threat reduction; provisions on export control reform related to satellites and components.}",
    "textBeforeTable": "",
    "textAfterTable": "City WALTHAM State MA Zip Code 02451 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  MARK T. ESPER  7038415754  mark.t.esper@raytheon.com 5. Senate ID#  32828-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}