{
    "relation": [
        [
            "Box",
            "21",
            "21",
            "21",
            "21"
        ],
        [
            "Folder",
            "41-50",
            "51-52",
            "53-54",
            "55-56"
        ],
        [
            "",
            "A, 1963-1973 (10 folders)",
            "A.P.F., 1968-1969 (2 folders)",
            "Accurate Messenger Service, 1968-1969 (2 folders)",
            "Acme Van Company, 1968-1972 (2 folders)"
        ]
    ],
    "pageTitle": "Detailed description of the Fischbach Gallery records, 1937-1977, bulk 1963-1977 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/fischbach-gallery-records-8173/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 282199675,
    "recordOffset": 282176325,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10633=The gallery also had an active exhibition schedule and organized and hosted group exhibitions of modern art including \"According to the Letter\" (1963), \"Hard Center\" (1963), and \"Direct Representation\" (1969). Additionally, the Fishbach Gallery hosted \"Eccentric Abstraction\" in 1966, an exhibition organized by Lucy Lippard., 3746=Gallery founder Marilyn C. Fischbach and director A. Aladar Marberger donated the majority of the Fischbach Gallery records in 1978. Additional records were donated in 2001 by Maureen Dawley on behalf of the Carnegie Mellon University., 11386=The Fischbach Gallery was founded in 1960 by Marilyn Cole Fischbach at 799 Madison Avenue in New York City. The gallery was noted for its stable of minimalist young artists in the 1960s, and the work of the painterly realists in the 1970s. The gallery remains open today., 2450=The Fischbach Gallery records, 1937-1977, bulk 1963-1977. Archives of American Art, Smithsonian Institution., 3447=The records donated in 1978 were minimally arranged shortly after receipt. In 2009, the two accessions were merged and fully processed by Jayna Hanson with funds provided by the Terra Foundation for American Art., 9476=The records of New York City Fischbach Gallery measure 24.9 linear feet and date from 1937 to 1977 with the bulk of materials dating from 1963 to 1977. The majority of the collection consists of artists files containing a wide variety of materials documenting the gallery's relationship with its stable of modern and avant garde artists, as well as gallery exhibitions. Files include biographical materials, correspondence, printed materials, and photographs. Gallery records also include general business correspondence, access-restricted financial records; and additional printed materials.}",
    "TableContextTimeStampAfterTable": "{225118=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 217914=This small series consists of miscellaneous business cards, clippings, non-Fischbach exhibition announcements, and a guide to New York art galleries by Ron Williams dated 1972.}",
    "textBeforeTable": "Materials relating to financial transactions including sales and payment are found in Series 4: Financial Records, which are access restrited. Artists Files are arranged alphabetically by artist and further divided by types of materials. Correspondence is in rough chronological order due to previous arrangements made by the Fischbach Gallery. Also included are files pertaining to group exhibitions either organized or hosted by the gallery, including \"According to the Letter\" (1963), \"Hard Center\" (1963), \"Six Women\" (1965), \"Game Without Rules\" (1966), \"Direct Representation\" (1969), and \"Eccentric Abstraction\" (1966) which was organized by Lucy Lippard. Artists and exhibitions files are found for over one hundred artists either represented by the gallery or exhibiting with the gallery. Files contain a wide variety of materials, and the extent and type vary for each artist. Typically files contain biographical information; correspondence between the artist, museums, and other galleries; scattered consignment and loan information; printed materials including articles, clippings, exhibition announcements and catalogs, and press releases; photographs of the artist, installations, constructions, and works of art; and negatives, slides, and transparencies. Substantial artist files are found for John Altoon, Anne Arnold, Ronald Bladen, George Brecht, Wynn Chamberlain, Allan D'Arcangelo, Gene Davis, Robert Grosvenor, Ira Joel Haber, Eva Hesse, Yvonne Jacquette, Alex Katz, Les Levine, Robert Mangold, Doug Ohlson, Ray Parker, Anne Ryan, Robert Ryman, Tony Smith, and George Sugarman. Of special note are photos of portraits by Alex Katz depicting his friends including Richard Bellamy, Edwin Denby, Al Held, Elaine de Kooning, and Neil Welliver.",
    "textAfterTable": "Photos of the Artist, circa 1966 1 6 Photos of Installations, 1966 1 7 Photos of Works of Art, 1966 1 Anthony, William 1 8 Biographical Information, circa 1971 1 9 Photos of Works of Art, 1969-1972 1 Antonakos, Stephen 1 10 Biographical Information, 1965-1970 1 11 Artist's Copy of Correspondence, 1969-1970 1 12 Brocton Art Center Correspondence, 1970-1971 1 13-16 General Correspondence, 1968-1971 (4 folders) 1 17 Heath and Company Correspondence, 1968-1969 1 18-21 Museum and Gallery Correspondence, 1968-1971 (4 folders) 1 22 Consignment and Loan Information, 1967-1971 1 23-24 Articles and Clippings, 1966-1971 (2 folders) 1 25-27 Exhibition Announcements and Catalogs, 1967-1971 (3",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}