{
    "relation": [
        [
            "First Name",
            "Misty",
            "Conrad",
            "Conrad"
        ],
        [
            "Last Name",
            "McGowen",
            "Lass",
            "Lass"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "Spc. Asst./COS, BLM 8/01-4/04",
            "LA, S. Thomas, 93-97; Asst., S. Simpson 1-5/93"
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=872725AD-323D-4ECD-AFB7-6CA727E9AB79&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 228631082,
    "recordOffset": 228614688,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34717=Whole Bills: S. 2996, Continuing Chemical Facilities Antiterrorism Security Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 17040=Whole Bills: S. 3464, Practical Energy and Climate Plan Act; H.R. 5088, America's Commitment to Clean Water Act; S. 3072, Stationary Source Regulations Delay Act; S. 3735, A bill to amend the Federal Insecticide, Fungicide, and Rodenticide Act to improve the use of certain registered pesticides. 74 Fed. Reg. 56260, Mandatory Reporting of Greenhouse Gases, Final Rule; 75 Fed. Reg. 31895, National Emissions Standards for Hazardous Air Pollutants for Area Sources: Industries, Commercial, and Institutional Boilers, Proposed Rule; 75 Fed. Reg. 2938, National Ambient Air Quality Standards for Ozone, Proposed Rule., 59011=H.R. 4173, Wall Street Reform and Consumer Protection Act, Title VII, provisions relating to authority of the SEC to oversee activities and entities associated with the national securities exchanges, Section 1504, Disclosure of Payments by Resource Extraction Issuers., 22831=S. 1462, American Clean Energy Leadership Act, provisions related to Section 526 of EISA 2007; H.R. 5136, National Defense Authorization Act for FY 2011, provisions relating to Section 526 of EISA 2007.Whole Bills: S. 3813, Renewable Electricity Promotion Act, H.R. ___, Domestic Manufacturing and Energy Jobs Act; S. ___, American Power Act., 12204=H.R. 3081, Department of State, Foreign Operations, and Related Programs Appropriations Act, provisions relating to the oil and natural gas industry. Whole Bill: H.R. 3619, Coast Guard Authorization Act for Fiscal Years 2010 and 2011. Presidential FY 2011 budget proposal, provisions relating to oil and gas revenue provisions, the Superfund Act and associated excise taxes., 39081=Whole Bills: S. 3516, Outer Continental Shelf Reform Act; H.R. 3534, Consolidated Land, Energy, and Aquatic Resources Act; S. 3305, Big Oil Bailout Prevention Liability Act; S. 3306, Big Oil Bailout Prevention Trust Fund Act; S. 3763, Restoring Ecosystem Sustainability and Protection on the Delta Act; S. 3643, Oil Spill Response Improvement Act; H.R. 2693, Oil Pollution Research and Development Reauthorization Act; S. 3614, Oil Spill Response Act; S. 3597, Securing Health for Ocean Resources and Environment (SHORE) Act; S. 3600, Fairness in Admiralty and Maritime Law Act; H.R. 5716, Safer Oil and Natural Gas Drilling Technology Research and Development Act; S. 3643, Oil Spill Response Improvement Act; H.R. 5629, Oil Spill Accountability and Environmental Protection Act; H.R. 5626, Blowout Prevention Act; H.R. 5503, Securing Protections for the Injured from Limitations on Liability Act; S. 3588, A bill to limit the moratorium on certain permitting and drilling activities issues by the Secretary of the Interior, and for other purposes; S. 3580, Resources for Oil Spill Research and Prevention Act; H.R. 5772, To limit the moratorium on certain permitting and drilling activities issued by the Secretary of the Interior, and for other purposes; H.R. 5851, Offshore Oil and Gas Worker Whistleblower Protection Act; S. 685, Oil Spill Prevention Act of 2009; S. 3663, Clean Energy Jobs and Oil Company Accountability Act. S. 3815, Promoting Natural Gas and Electric Vehicles Act, Title III, Section 3001 (a)(B), relating to the Oil Spill Liability Trust Fund. Legislative and regulatory efforts concerning a moratorium on offshore oil and gas drilling in the Gulf of Mexico., 49294=H.R. 5905, To amend the Internal Revenue Code of 1986 to deny a deduction for removal costs and damages for which taxpayers are liable under the Oil Pollution Act of 1990, Section 1, provisions relating to oil spill liability; H.R. 5893, Investing in American Jobs and Closing Tax Loopholes Act, Titles III and IV and Amends. 772 and 774 relating to the oil industry; S. 3793, Job Creation and Tax Cuts Act, Title II, Subtitles A, B and C, and Title IV, provisions relating to the oil industry; H.R. 5297, Small Buisness Jobs and Credit Act, Title II, provisions relating to small business credit initiatives and S. Amend. 4594 and 4595; S. 3307, Healthy, Hunger-Free Kids Act, Subtitle C. Whole Bills: H.R. 4213, American Jobs and Closing Tax Loopholes Act; S. 3816, Creating American Jobs and Ending Offshoring Act; H.R. 3962, Affordable Health Care for America Act., 27526=Whole Bills: S. 1666, A bill to require the Administrator of EPA to satisfy certain conditions before issuing to producers of mid-level ethanol blends a waiver from certain requirements under the Clean Air Act, and other for other purposes. S. 3547, Price Gouging Act; H.R. 6243, American Fuel Protection Act; H.R. 6239, Prevention of Frivilous Ethanol Lawsuits Act; S. 3916, A bill to require the Consumer Product Safety Commission to study and report on the impact on consumers of permitting an increase in the amount of ethanol blended with gasoline; S. 737, A bill to amend the Energy Independence and Security Act of 2007 to authorize the Secretary of Energy to conduct research, development, and demonstration to make biofuels more compatible with small nonroad engines, and for other purposes; S. 3736, A bill to amend the Clean Air Act to allow States to opt out of the corn ethanol provisions of the renewable fuel standard; H.R. 6008, Coroporate Liability and Emergency Accident Notification (CLEAN) Act. 74 Fed. Reg. 24904, Notice of Proposed Rulemaking on Renewable Fuel Standard; 75 Fed. Reg. 14670, Regulation of Fuels and Fuels Additives: Changes to Renewable Fuel Standard Program. Regulatory efforts concerning EPA E-15 waiver request; Legislative efforts concerning renewable fuel standards and renewable fuel standards waiver requirements; Legislative efforts concerning refinery and drilling workplace safety; Legislative efforts concerning low carbon fuel standard.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  STACY LINDEN  2026828229  lindens@api.org 5. Senate ID#  3060-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}