{
    "relation": [
        [
            "",
            "Strongly Agree",
            "Agree",
            "Undecided",
            "Disagree",
            "Strongly Disagree",
            "No Response",
            "Total"
        ],
        [
            "Frequency",
            "489",
            "370",
            "68",
            "17",
            "2",
            "21",
            "967"
        ],
        [
            "Percent",
            "50.6",
            "38.3",
            "7.0",
            "1.8",
            "0.1",
            "2.2",
            "100.0"
        ]
    ],
    "pageTitle": "Report to/Rapport au:",
    "title": "",
    "url": "http://www.ottawa.ca/calendar/ottawa/citycouncil/ttc/2002/12-04/ACS2002-TUP-TRN-0012.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 627400284,
    "recordOffset": 627334912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Ref N°:   ACS2002-TUP-TRN-0012}",
    "TableContextTimeStampAfterTable": "{151373=Appendix A – O-Train User Survey - October 2002, 11529=Following a yearlong study, which proceeded in concert with the Environmental Assessment process, Regional Council approved the Light Rail Pilot Project (LRPP) in September 1999.  The objectives of the pilot project, as set out in the report, were as follows:, 24778=Overall, the Light Rail Pilot Project can be considered a success.  The pilot project has demonstrated that a single-person operator passenger railway using diesel light rail vehicles can operate successfully on a lightly used freight line.  All necessary approvals were gained from Transport Canada to allow the non-standard system to run.  The pilot project has comfortably achieved the original ridership objectives of 5,100 to 6,400 total riders per weekday despite a reduced service frequency.  In fact, when adjusted for 20-minute service, ridership has exceeded expectations by 33%.  The objectives for new riders have also been met.  The October 2002 average total weekday ridership was 6,350 and new riders are estimated to be 1,135., 114316=The total operating costs for May 2003 to April 2004 are projected to be $4,344,038 compared with $4,147,636 for the previous year.  However, in view of the need to negotiate with Bombardier and put in place new contracts for other sub-contractors, it is proposed that a 5% contingency of $217,200 be added for a total of $4,561,238., 116476=The customs duties on the trains were deferred for 30 months from January 2001, when the trains arrived in Canada.  These taxes amount to $1.624 million and, although it is expected that they can be deferred for another 24 months, currently are payable in July 2003., 102700=While no specific objectives were set for schedule adherence and service availability, the assumptions in the 1999 report were that these would be high, based on the reserved right-of-way and the availability of a back-up train., 134870=The 2003 Draft Capital Budget of the City of Ottawa includes funding to allow the LRPP to be continued beyond 2003 as well as funding for improvements to the O-Train such as continuous welded rails.  As indicated in the financial analysis, funding is necessary for the capital portion of the extension.  Although not specifically identified as such, should Council not approve the continuation of the pilot, a portion of the capital funding proposed for the continuation and expansion could be used to shut down the O-Train.  As is indicated in the Draft Budget, final commitment to these expenditures is contingent upon Council decisions regarding the extension of the LRPP and the Rapid Transit Expansion Study, expected in early 2003. , 57961=Extensive training was provided for the selected group of bus operators and the success rate surpassed all expectations (28 of 30 successfully completed the training).  There were six weeks of in-class rules training as well as on-train training provided by CANAC, which is the CN consulting firm that deals with training.  There was also a mentoring program put in place for the months following the beginning of operation in order to provide the LROs with a resource should they have any concerns/questions regarding operating the trains.  All but one of the qualified LROs has continued in this role.  In October 2002, a program of refresher training was delivered to the 27 remaining LROs., 107678=The performance of the pilot project has been fairly successful in comparison with the objectives implicit in the 1999 report., 100763=The operating costs for the year of normal operation from May 2002 to April 2003 at $4,147,900 are very close to the original budget of $3,940,000.  In fact, were annual inflation of 2.5% to be applied to the original budget for three years, it would become $4,240,000.  The fact that the vehicle maintenance costs were significantly less than anticipated offset additional costs from insurance operations and rail traffic control., 18424=In addition to the review undertaken by staff of the Transit Services Branch, the City Auditor’s Assurance Work Plan for 2002-2003, as approved by Council in June 2002, includes an audit of the O-Train pilot project, to be conducted in collaboration with the Department.  The audit’s purpose was to support the Department in evaluating the pilot project and providing a fair, complete and objective assessment of the results of the pilot.  Accordingly, all information relating to the project has been made available to the City Auditor and her comments are included in this report., 151833=Following approval of these recommendations, staff will conclude negotiations with the O-Train subcontractors to continue the pilot project for up to two years from May 1, 2003.  The Department of Transportation, Utilities and Public Works will implement the Council direction on the recommendations.  Should the extension of the pilot project be confirmed, staff will also develop a short-term improvement plan, consistent with the direction recommended by the Rapid Transit Expansion Project, for presentation to the Transportation and Transit Committee in March 2003., 130362=The cost data presented in the report for the first year of normal operations, while projected to the end of the year in April 2003, is based on a year of passenger service and is consistent with the analysis conducted by ACS., 140831=The use of Light Rail Transit in Ottawa is supported in the Transportation Master Plan.  The Plan calls for the implementation, in the short-term, of a pilot rail project to evaluate the potential for rail in the city.  The project initiated in 1999 responds to this direction., 122346=The City Auditor’s Assurance Work Plan for 2002-2003, as approved by Council in June 2002, included an audit of the O-Train pilot project, to be conducted in collaboration with the Department.  Given that the existing agreements between the City and Bombardier and the City and CPR are due to expire in April 2003, there is the need at this time to bring forward to Council an evaluation report of the Light Rail Pilot Project in order to determine if these agreements, and the LRPP, should be extended.  As such, Audit & Consulting Services (ACS) has reviewed the preceding report in order to provide Council some assurances as to the completeness and objectivity of this evaluation., 136526=Should Council decide that the current LRPP be extended, it is proposed that ACS include in its 2003-2004 work plan, a further audit of the extended pilot in greater detail to examine the results after two years of normal operations., 25997=The project has improved access to Carleton University, with 2,129 trips destined there on the O-Train each weekday in October 2002.  The light rail service has also removed approximately 2,200 unnecessary trips from the central area per day., 81932=The O-Train has saved users large amounts of time, on average 24 minutes and, from the results of the October 2002 survey, is clearly valued by its customers., 120886=It should also be noted that the O-Train has made it possible to serve Carleton University in spite of a 17% growth in student numbers over the last two years, without increasing the amount of bus service.  In fact, a small decrease has been possible.  If the O-Train were removed there would be a need for additional buses to accommodate the more than 6,000 passengers a day using the train.  This would take up most of the resources for growth planned in the 2003 budget., 87755=The over expenditures were discussed in detail in both the July 4, 2001 progress report to Transportation and Transit Committee and the February 19, 2002 financial report presented to the Transportation and Transit and Economic Development and Corporate Services Committees.  Council approved an additional $4,950,000 in capital spending authority for the project in February 2002 to cover:  unanticipated costs arising because of requirements identified through the public consultation and the detailed implementation process; additional set-up contingencies; the construction of a noise barrier behind Traverse Drive; and, if necessary, the payment of PST and GST on the trains., 99680=In fact, a 30-month deferral of the import duty was permitted but attempts to avoid paying the GST and PST have been unsuccessful.  The import duty deferral lasts until June 30, 2003, but it is expected that this could be extended should the pilot project be prolonged.  The total cost of vehicle acquisition was $5.369 million., 74801=The two other objectives outlined in the September 1999 report were to improve transit access to Carleton University and divert transit from the Central Area.  The 2,158 daily boardings at Carleton University (Exhibit 4) show that the service has attracted a significant number of trips by students and staff. From the survey results, it is estimated that 2,200, or 35%, of weekday O-Train trips have been diverted from the Central Area., 105820=The cost per new rider depends on how much it would have cost to supply bus service for those trips that have switched from bus to rail.  From the October 2002 passenger survey, respondents indicated that 81.7% of their trips would have been made by bus if the O-Train did not exist.  Therefore, the number of annual O-Train unlinked trips that would otherwise have been made by bus is 1.279 M (1.565 M x 0.817).  The average transit system operating cost per unlinked trip is $1.48.  Hence, the additional cost to provide transit service if there were no O-Train service would have been about $1.89 M per year.  This means that the cost per new passenger trip is $9.55 if only the new O-Train trips are considered., 111887=For the O-Train pilot project to be continued beyond April 30, 2003 would require extensions of the contracts with Bombardier and CPR and new contracts to be put in place for track maintenance, rail traffic control and signals maintenance.  The contract extension for Bombardier would be subject to negotiation with the City and, although confirmation has yet to be received, is expected to be about 15% higher than it is currently.  This is based on experience to date, as well as the effect of the end of the vehicle warranty period., 104034=Annual ridership for the O-Train has been estimated from May 2002 to April 2003, based on ridership measured to the end of October and projected ridership for November 2002 to April 2003.  The total ridership in this period is projected to be 1,565,500.  Based on the annual operating cost of $4.1479 million, the cost per rider for the O-Train is $2.65.  This compares to the objective of $2.50 to $3.02 for the O-Train and $1.48 on the total transit system., 87232=The total capital costs for the pilot project will amount to $20,740,100.  The actual costs are compared with the budget from the September 1999 report in Exhibit 5.  A brief explanation for the variances is provided for each line item., 73343=New ridership was estimated through the customer survey.  Six percent of O-Train passengers had not used the bus in the past six months and, by the measure generally used in OC Transpo’s Attitude Survey, can be considered to be new riders on public transit.  When customers were asked whether they would have made the trip if the O-Train did not exist, just under 82% said they would have made the trip by bus, 10% would have made it by another mode and 3% would not have made the trip at all.  This suggests that about 18% of all O-Train passenger trips are new public transit trips, which is close to the projection in the original light rail proposal.  This is equivalent to 1,162 trips per day by new riders on weekdays in October, or 286,000 trips per year.  From the survey it is evident that, in addition to these trips by new riders, the O-Train has generated new ridership across the entire transit system.  Fifty-seven percent of O-Train users said they use transit more because of the O-Train., 16184=A $16 million capital budget was approved to cover the use of the trains for two years, the construction of the stations, upgrades to the CPR railway line and the maintenance facility, the installation of a signalling system, operator training and project management.  In addition, Regional Council approved approximately $4 million for each of the two years of the pilot project to operate the system. The 1999 report directed that, at the end of the two-year pilot project, a decision would be made for the project to be cancelled, rendered permanent or extended by up to two years, 71539=The Automated Passenger Counting system has provided a steady stream of ridership information.  The average number of boarding passengers by day-type and by month is shown in Exhibit 2.  With the initial free fare promotion from October 15 to December 31, 2001, ridership on weekdays, Saturdays and Sundays was very strong.  On average, over 6,000 passenger trips were made on weekdays with over 5,000 and 4,000 trips on Saturdays and Sundays respectively.  It was evident from observations that families were trying out the O-Train on Saturdays and Sundays while it was free.  Once fares were introduced, there was a dramatic drop in weekend ridership.  During the summer period, weekday ridership fell as it does with the regular transit system.  The reduced summer program at Carleton further reduced ridership levels.  Since September, weekday ridership has grown to surpass the levels achieved during the period of free fares prior to January 2002 while weekend ridership is the highest it has been, apart from the free fare period.  In October 2002, average weekday ridership was 6,352, which is at the top end of the planning estimates, despite the adjusted service level., 123951=Our review was conducted between November 1 and November 20, 2002.  During this period, ACS met with a number of the Transportation, Utilities and Public Works and contract staff involved in the LRPP to gain a better understanding of the pilot objectives and how the pilot has proceeded.  ACS reviewed existing supporting and operational documentation and the various Council reports relating to the establishment and management of the LRPP.  Feedback was provided to the department on an ongoing basis throughout the period and was reflected in the revised report drafts., 42883=During the summer of 2002, the residents of a complex of row houses on Breezehill Avenue complained of excessive noise in the Bayview Station area.  They expressed concerns that the ringing of the bell (as the train arrives and departs from the station) and squealing noise caused by the train negatively impacted their comfort.  Noise measurements indicated that the sound caused by the train was low (an increase of 0.3 decibels over ambient).  However, because the human ear can differentiate between sounds in a different manner than a machine can measure, it was acknowledged that the bell and squealing sounds could be easily perceived.  Ringing of the bell is required by federal rules and is necessary to ensure safety for the commuters at stations.  However, the distance in advance of the station the bell was rung was reduced.  Efforts were also made to reduce the squealing noise.  The squealing is caused by the flange of the wheels touching the inside of the rail as they begin negotiating a slight curve in the track leading to Bayview Station.  A program consisting of greasing the inside part of the rails was put in place for the summer with positive results., 79127=Another source of information that bears on the impact of the service on residents is the OC Transpo client service line.  There were 147 customer contacts received up to October 2002 concerning the O-Train compared to 12,664 received about the regular transit system.  Of the O-Train contacts, 43% were complaint related.  This compares to over 75% for the regular transit system.  The remaining 57% of O-Train contacts were to comment in general about the service, express a compliment, request information or make a suggestion about the O-Train.  This compares with a ratio of 80% to 20% for complaints to compliments for the overall system., 23849=The objectives of the pilot project have been met through the planning, implementation and operation of the pilot project.  With experience gained since the start of the implementation phase of the project in late 1999, staff has acquired significant knowledge, experience and data to provide Council with some preliminary information and analysis on each of the study components., 141741=Current and anticipated future operating and capital costs of the pilot project are documented in the body of the report, and in Exhibits 5 through 8.   The 2003-2007 Draft Budget submission comprehends the anticipated requirements arising from extension of the pilot program as follows:, 258622=October 2002, 132535=The department’s report speaks to the deferral of $1.6 million in customs duties.  Although these duties are currently payable in July of 2003, the department expects a further deferral to 2005 is likely.  The continued deferral is based on approval by Canada Customs and Revenue Agency and relies on the continued acceptance that the trains meet the requirements for temporary importation.  Ultimately, the City must cover these costs within the next three years unless the trains are exported., 52795=The decision to use diesel light rail vehicles was taken in 1998, since the costs to electrify the 8 km line would have been too high to make a $16 million pilot project possible.  The Bombardier Talent trains were available in the timeframe required and, although a new model, were already in operation in Europe., 30548=To operate a rail service on the railway network, it was necessary for the Region to become a railway. The light rail pilot project was incorporated as a Federal Railway with the trademark ‘Capital Railway’ in early 2000.  A simpler application, to become a provincial short line, could have been made but the federal designation will permit the railway to cross the provincial boundary into Quebec in the future., 113895=An operations budget for May 2003 to April 2004 is shown in Exhibit 8.  The budget is shown alongside the May 2002 to April 2003 operating budget and the differences are briefly described., 17000=The City took delivery of the trains in January 2001 and commenced use of the CPR lines in April 2001.  The first six months of the operational phase involved the commissioning of the equipment and the training of operators of the service. After two years of planning, designing, retrofitting and training, the O-Train commenced operation on October 15, 2001., 76720=The latest passenger survey carried out in October 2002 indicates that 75% of O-Train passengers pay their fare with an OC Transpo pass, 14% use a bus transfer and only 10% use an O-Train ticket purchased from the vending machines, indicating that integration with the overall transit network is being achieved., 63437=Experience gained through the pilot project indicates that simply applying conventional railway wisdom to determine the minimum track condition required was not successful.  Although Class 3 track would allow trains to operate above the current speed of 40 mph, the condition of the track is not conducive to a comfortable operation for the passengers and noise and vibrations would be increased.  Installation of continuous welded rail (CWR), which consists of lengths of rails up to 2000 ft. long instead of the current 39 ft., would reduce noise and vibration and increase ride quality.  A beneficial side effect would be a reduction in required track and equipment maintenance., 115153=If the extension of the pilot project is approved, there will be capital costs associated with the lease of the line from CP Rail and the use of the vehicles.  The contract with CP Rail allows an automatic extension after the first two years for up to another two years, with the lease price being increased at the level of CPI.  This means that the lease price for the year from May 2003 to April 2004 would be about $275,000., 41534=Interim measures were put in place to reduce the noise of the trains for Traverse Drive residents while the fences were being designed and installed.  The train speed behind the houses was reduced to 48 kph and, for trips late at night was reduced to 7 kph.  After completion of the four-metre high sound barrier, the speeds were returned to normal.  The City has received further complaints regarding noise and vibration from residents of the area although the noise levels are within the City By-Law standards and the vibrations are not sufficient to cause structural damage.  The noise and vibration is not caused by the train used but by the interaction between the wheels and the joints in the rails.  In order to mitigate the effects of the service on residents, the speed was reduced for the last trips (at night) and the speed of operations behind Traverse Drive was reduced to 48 kph in order to reduce the noise level after 23:00., 352073=Operating Costs – Start-up to April 2002, 47746=The shared ownership of the two diamonds, between CN and CP, called for CN to hand over control of the two diamonds to CP by July 2000.  The lease agreement between CPR and the City called for the CP to hand over control of the two diamonds in July 2001.  Given these provisions, during the early phases of the project, it was decided that the most efficient method for the City to ensure consistent control over the two diamonds would be to render the signal system automatic.  With an automatic signal control in place at the diamond shared between the O-Train and VIA trains, the first train to arrive would receive a permissive signal indication, effectively minimizing delays to trains of either railway.  At the Walkley diamond, shared by the O-Train and freight trains from the Ottawa Central Railway (OCR), the signals would be automatic for the O-Train and controlled for the freight trains.  This installation was more complicated given that the OCR yard abuts the Walkley diamond and it was not desirable to maintain the O-Train to priority over freight trains.  Some of the field equipment necessary to render the control automatic was purchased and installed at the diamonds with the overall signalling system.  , 133352=The report indicates that the current agreement with CPR regarding additional rental fees or incentive payments is being re-negotiated.  The current provisions call for the City to make payments to the CPR if/when the base ridership exceeds 5,100.  Based on current ridership levels, the incentive payments to the end of the extended pilot are estimated to total $380,000.  We understand that under the revised terms, a portion of the incentive payments will be deferred until the end of the lease and would be waived should the City purchase the line for $11,000,000 as set out in the original agreement.  Should the City discontinue the O-Train operations the deferred amount would become payable.  However, as the revised agreement has not been executed we have not been able to fully analyze the terms.  The incentives are currently structured as a revenue sharing arrangement as described in the 1999 report.  The continued appropriateness of this treatment should be reviewed once the revised agreement is executed., 21444=The original objectives of the light rail pilot project as set out in 1999 were to:, 102066=The cost per rider for the Light Rail Pilot Project in the 1999 report was expected to be between $2.50 and $3.02, based on the annual operating cost estimate of $3.94 million and daily ridership of 5,100 to 6,400.  Based on the average transit system transfer rate, this would translate into a revenue/cost objective of 27% to 32%., 109899=There are currently sufficient funds in place to continue the O-Train operation for the initial pilot period, which ends on April 30, 2003.  A decision is needed from Council to govern arrangements for at least the short-term future of the system.  Possibilities range from closing down the system to making the system permanent., 123311=The objective of ACS’ review was to ensure the accuracy and completeness of this evaluation report in order to facilitate Council’s deliberations on the future of the LRPP.   ACS’ comments made herein have been based upon a review of a draft of the LRPP evaluation report as provided by Transportation, Utilities and Public Works on November 19, 2002. , 10780=In August 1998, Council of the former Region directed staff to proceed with the development and implementation of a pilot project for light rail with capital costs not to exceed $16 million.  At that time, the preferred route and the technology were identified, and the Terms of Reference for the Environmental Assessment were also approved.  The initial concept was to proceed with the project as a public private partnership between the Region and CP Rail, among others., 19284=The evaluation of the pilot project is also timely as the City is currently updating its Official Plan and Transportation Master Plan.  As a part of this process, a Rapid Transit Expansion Study (RTES) was approved by Council in November 2001.  The objective of this study is to develop priorities for expansion of Ottawa’s rapid transit network for the next twenty years or more.  Preliminary recommendations from this study will be presented at the Transportation and Transit Committee meeting of December 4, 2002, prior to their release for public consultation.  A final report is expected in February 2003., 137792=During the implementation phase, the public Sounding Board that was formed for the planning study was maintained.  This included members of community associations in the vicinity of the track as well as special interest groups such as Transport 2000 and the former Regional Cycling and Transit Advisory Committees.  Sounding Board input has been sought on key issues such as customer security and accessibility at Bayview Station, with results that enhanced the project., 89474=The operating costs for the period until the end of the currently approved project in May 1, 2001 to April 30, 2003 are expected to be close to  the budget estimate and are projected to be $8,037,500. The operating costs for the first year of operation, from May 1, 2001 when the City took responsibility for the line, which amount to $3,889,600, are summarized in Exhibit 6.  However, the ongoing operating costs are more realistically represented by the annual cost estimate from May 1, 2002 to April 30, 2003.  These costs are compared with the original budget in Exhibit 7.  This shows the cost of a year’s operation to be $4,147,900, which is $207,900 more than the annual budget of $3,940,000.  From Exhibit 7 it can be seen that, while train maintenance costs are $497,100 less than the budget of $1,305,000, other costs are higher.  The three most significant extra costs are for insurance, operator wages and rail traffic control., 115880=The trains were purchased from Bombardier with an agreed buy-back price after two years, which will occur on April 30, 2003.  This buy-back price reduces at a rate of $118,750 monthly until April 30, 2005.  Therefore, the annual cost of train ownership for the period from May 2003 to April 2005 is fixed at $1,425,000., 383917=Operating Costs – May 2002 to April 2003, 118416=There is also the unlikely possibility that the customs taxes of $1.624 million could become payable on the trains in July 2003., 80446=The pilot project has comfortably achieved the ridership objectives of 5,100 to 6,400 total riders per weekday and 1,000 to 1,300 new riders in spite of the 20-minute headway.  In fact, when adjusted for 20-minute service ridership has exceeded expectations by 33%.   The October 2002 average total weekday ridership was 6,350 and new riders are estimated to be 1,135.  While only 27% of these new riders claimed that they would otherwise have used cars, the pilot project generated new ridership that was not anticipated in the planning estimates by the 57% of O-Train riders who responded in the survey that they use transit more because of the train., 127792=The report discusses the technical issues and how they were addressed during the pilot.  In several areas the report identifies the need for further improvements or possible enhancement to the operation.  However, no specific action has been recommended at this time.  The Department will address these issues at a later date, as in most cases they are dependent on the outcome of the Rapid Transit Expansion Study due in 2003., 59837=The lease contract between the City and CP Rail contains provisions for freight trains to use the tracks during the hours when the O-Train is not being operated (between 01:00 and 05:00).  Since the beginning of operations, no freight trains have been operated toward the city of Gatineau.  However, occasional freight movements have been made by the Ottawa Central Railway between the Walkley yard and the National Research Council property.  These movements require lifting the platform extenders to allow the train to go by the Greenboro station., 17593=Although the service has only been operational a little more than one year, the original agreements for the lease of the trains from Bombardier, and the rail line from CPR took effect on May 1, 2001 and will expire on April 30, 2003.  Both agreements provide for an extension of up to two more years.}",
    "lastModified": "Mon, 25 Sep 2006 16:45:44 GMT",
    "textBeforeTable": "  Exhibit 7 – Frequency of O-Train usage mso-bidi-language:AR-SA\"> \"Times New Roman\";mso-ansi-language:EN-CA;mso-fareast-language:EN-US; mso-bidi-font-size:10.0pt;font-family:\"Times New Roman\";mso-fareast-font-family: 100.0 967 Total 2.1 20 No Response 23.9 231 No 74.0 716 Yes 12.0pt\"> Percent Frequency  ",
    "textAfterTable": "      Exhibit 8a – If used the bus in the past 6 months     Frequency Percent Yes 891 92.1 No 57 5.9 No Response 19 2.0 Total",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}