{
    "relation": [
        [
            "Recipient",
            "Mark Croshier",
            "Timothy L Cox",
            "Louis M Rohl",
            "Michael A Sennett",
            "AnnMarie Vosburgh",
            "Julie E Jackson",
            "Mike Conaton",
            "Daniel E Ross",
            "John T O'Brien",
            "Hank Klein",
            "Timothy J Sharpe",
            "Kerry Deputy",
            "Kathleen Perry",
            "Deanne C Joshua",
            "David B Harr",
            "Elliot A Dimant",
            "Allan J Connell",
            "Marie Mittmann",
            "Joanna C Choy",
            "Gina Graves",
            "Bruce Kocsis",
            "Charles A Ladley",
            "Simon J Lamar",
            "Scott R Morrison",
            "Holly A Braddock"
        ],
        [
            "LMSC / Club",
            "San Diego - Imperial LMSC, San Diego Swim Masters",
            "Southern Pacific LMSC, Lancaster Oasis Masters",
            "Southern Pacific LMSC, Unattached",
            "New England LMSC, New England Masters Swim Club",
            "Adirondack LMSC, Unattached",
            "Southern Pacific LMSC, UCLA Bruin Masters",
            "Metropolitan LMSC, Unattached",
            "Potomac Valley LMSC, Curl Burke Masters Swimming, Inc.",
            "Southern LMSC, Southern Masters Swimmers",
            "San Diego - Imperial LMSC, Unattached",
            "Southern Pacific LMSC, Unattached",
            "Southern Pacific LMSC, Novaquatics Masters",
            "Metropolitan LMSC, AquaFit Masters",
            "Pacific LMSC, San Mateo Masters",
            "Arizona LMSC, Unattached",
            "Metropolitan LMSC, NYC Hydras",
            "Maryland LMSC, Arena Club Masters",
            "Pacific LMSC, Modesto Area Aquatic Club",
            "Southern Pacific LMSC, South Bay Swim Team",
            "Minnesota LMSC, Unattached",
            "Southern Pacific LMSC, Manhattan Magnum Masters",
            "Hawaii LMSC, Maui Masters Swim Club",
            "Southern Pacific LMSC, Fullerton FAST Masters Team",
            "Florida LMSC, S W I M Florida Masters Inc",
            "Southeastern LMSC, Unattached"
        ]
    ],
    "pageTitle": "Member Rewards Program",
    "title": "",
    "url": "http://www.usms.org/reg/rewards.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 818866233,
    "recordOffset": 818850258,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16439=Our 2011 Member Reward Program runs from March 18 to July 29. This program was created to show our appreciation for our members. Each Friday during the duration of the program, we will randomly select names from our membership database. All USMS members registered at least 24 hours prior to each weekly selection are automatically enrolled for a chance to win. Winners will be contacted by USMS and mailed a prize. This page will be updated each week to show the current winners, as well as list the prizes to be awarded in the upcoming week.}",
    "textBeforeTable": "(hide recipients) Colorado Time Systems digital pace clock (1 recipient) Jul 29, 2011 Past Rewards Our 2011 Member Reward Program runs from March 18 to July 29. This program was created to show our appreciation for our members. Each Friday during the duration of the program, we will randomly select names from our membership database. All USMS members registered at least 24 hours prior to each weekly selection are automatically enrolled for a chance to win. Winners will be contacted by USMS and mailed a prize. This page will be updated each week to show the current winners, as well as list the prizes to be awarded in the upcoming week. Member Rewards Program MembershipHome Member Rewards Program googletag.cmd.push(function() { googletag.display('div-gpt-ad-1354284884256-0'); });",
    "textAfterTable": "Michael Nelson Southern LMSC, Red River Masters (hide recipients) Jul 8, 2011 TYR Alliance backpacks (5 recipients) (hide recipients) Recipient LMSC / Club Paul Van Zuyle Southern Pacific LMSC, South Coast Aquatics Siphiwe K Baleka Indiana LMSC, Unattached Gary A Girolimon New England LMSC, Unattached Sean Hagerty Potomac Valley LMSC, Fort Belvoir Masters Rachel Hilgeford Arizona LMSC, Arizona Masters Swim Club Inc (hide recipients) Jul 1, 2011 TRISWIM Shots - 2 oz bottles of the TRISWIM Shampoo, Conditioner, Lotion and Body Wash (30 recipients) (hide recipients) Recipient LMSC / Club Miley T Wise Southern LMSC, Shockwave Masters Kelly D Moore Colorado LMSC, Colorado Masters Swimming Kristine M Harper Gulf LMSC, First Colony Masters Swimming June M Harry Pacific LMSC, Olde Durham Dolphins Simone F Lee Illinois LMSC, Naperville Waves Swim Club Judy S Morris Southern Pacific LMSC, Riverside Aquatics Association Beth A McKenna Delaware Valley LMSC, Unattached Chuck Worley Pacific LMSC, Santa Clara Swim Club Masters Daniel F Lew Minnesota",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}