{
    "relation": [
        [
            "API",
            "Method",
            "Input:",
            "Output",
            "Exceptions"
        ],
        [
            "Details",
            "Public Void requestQueryCancel(SessionKey aSessionKey, QueryKey){ }",
            "SessionKey",
            "Void",
            "java.rmi.RemoteException"
        ]
    ],
    "pageTitle": "Discoverer Web Services API Reference",
    "title": "",
    "url": "http://docs.oracle.com/cd/E15523_01/bi.1111/e10412/ref.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73416871,
    "recordOffset": 73403686,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 13 May 2015 05:15:10 GMT",
    "textBeforeTable": "This API call obtains a list of connections. It accepts SessionKey and returns the Connection list object. In single sign-on mode the list of public connections and private connections is returned. The connection can be of type Relational, OLAP, or APPS. 2.1 getConnectionList \"submitWorksheetQuery\" \"requestQueryCancel\" \"logout\" \"login\" \"isSessionValid\" \"getWorkSheetList\" \"getWorksheetData\" \"getViewerURL\" \"getVersion\" \"getQueryStatus\" \"getCascadeParameterValueList\" \"getParameterValueList\" \"getParameterMetaData\" \"getLayoutMetaData\" \"getFolderEntryList\" \"getConnectionList\" This chapter provides detailed reference information for the following Discoverer Web Services API. 2 Discoverer Web Services API Reference 5/6 Skip Headers-->",
    "textAfterTable": "The following table lists the fields of the structures. Structure Fields ConnectionList Array of Connection objects Connection ConnectionName ConnectionKey ConnectionDescription ConnectionEUL ConnectionDBIdentifier ConnectionAccessType ConnectionName String name ConnectionKey String key ConnectionDescription String description ConnectionEUL String eulname ConnectionDBIdentifier String database name ConnectionAccessType String accesstype 2.2 getFolderEntryList This API call uses a connection to obtain the list of non-scheduled workbooks and FolderEntries. It accepts SessionKey, ConnectionKey, and FolderEntrypath and provides a list of non-scheduled workbooks and FolderEntries data that is accessible from the connection for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}