{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Never really hear of many issues on the campus. Very rare that anything violent happens. There are people that volunteer to walk students at night if they feel they need an escort.",
            "Many sororities and fraternities. Everyone in them enjoy the activities that they have going on.",
            "There seems to be a club for about every major and minor at USD. All the clubs have their own goals they like to accomplish every year. There are also some other clubs outside of the education clubs.",
            "Great for every type of student.",
            "We have D-Days (Dakota Days) which is the homecoming that happens usually the 1st weekend of October. Everyone gets very excited and there's a lot of school spirit the week before the football game. Also, the day of the game there is a parade downtown.",
            "It's a very affordable college and they really help to keep it affordable for everyone with their financial aid office.",
            "There's always movies being shown on campus on weekends. Games are definitely a huge part of the campus's life. There also are frats and sororities that people can join.",
            "There are quite a few options. Some areas you can have buffet styled meals and other food areas are more like a small restaurant style.",
            "The dorms are small but everyone in the halls that you live in are very welcoming and they become your family.",
            "Some classes are definitely harder than others but they push you to really achieve your full potential.",
            "If you need help just ask your professor because they are all willing to help you.",
            "A great college that's big enough yet small enough to get around easily. There are wonderful staff and great professors that are all willing to help you in anyway needed. Definitely a college that has all a student could need."
        ]
    ],
    "pageTitle": "University of South Dakota (The U) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Dakota/reviews?_escaped_fragment_=/show/98048",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904609319,
    "recordOffset": 904563487,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{89671=In October, there is Dakota Days (D-Days)...which is the college's homecoming. There is a huge parade followed by a home football game...which is inside of the Dakota Dome., 207662=© 2015, Cappex.com, LLC, 100949=We have D-Days (Dakota Days) which is the homecoming that happens usually the 1st weekend of October. Everyone gets very excited and there's a lot of school spirit the week before the football game. Also, the day of the game there is a parade downtown.}",
    "textBeforeTable": "01/01/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 52 Anne Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot Because USD is a smaller university than most, I am able to have direct contact with all of my professors, instead of having to go through a Teacher's Assistant when I have questions. All of the professors are very willing to help a student with any problems or questions they may have, even in the large lecture classes. Also, there are numerous research opportunities for undergraduates that just aren't available at other universities. Overall, the level of education I am receiving here is highly above average. Login to rate or flag the reviews Cassandra 05/01/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 52 Categories Comments Great for these types of students trying to raise GPA, wanting to stay close to home Tips for prospective students Talk and engage with your professors from the first day. Professors may seem intimidating, but they love talking to their students and they will have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}