{
    "relation": [
        [
            "Air Conditioned",
            "Gas Connection",
            "Telivision"
        ],
        [
            "Mountain view",
            "Bed",
            "Car Parking"
        ],
        [
            "Balcony",
            "Sofa",
            "2 wheeler parking"
        ],
        [
            "Full Furnished",
            "Fridge",
            ""
        ]
    ],
    "pageTitle": "RentSellMyHouse.com | Properties for rent, sell in Bangalore, Pune, Chennai, Hyderabad, Noida, Mumbai and all over India",
    "title": "",
    "url": "http://rentsellmyhouse.com/node?page=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 200114663,
    "recordOffset": 200088090,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{8700=FOR SALE - ABOUT 1900 SQ.FEET RESIDENTIAL PLOT AT GUDUVANCHERY,SUNDARAPURAM VILLAGE,KALIYAVANTHAPATTU,MARAIMALAINAGAR TOWNSHIP.ITS A DTCP APPROVED,PATTA LAND,CORNER SITE OF EB POWERGRID AND THE PLOT NO IS 22.EXPECTED RATE IS 600 PERSQ.FEET.INTERESTED PL.CALL PH NO:9543372061., 12292=612 SQ.FEET 2BHK WITH PAKKA VASTHU COMPLAINT + 50 SQ.FEET OF INDIVIDUAL CARPARKING+LIFT FACILITY AVAILABLE.THE FLAT IS AT 2ND FLOOR LOCATED AT LIC NAGAR 5TH STREET PALLIKARANAI(BACKSIDE OF KAMACTHI MEMORIAL HOSPITAL).THE HOUSE IS IN HDFC LOAN.INTERESTED PL.CALL:8122431704., 20961=MARAIMALAI NAGAR Dtcp approved prime property in Maraimalai nagar with a great advantage of living and investing for near future. The plots are 1.2 acres in total, ranging from 1000 to 1500 sqft. Its features includes 30 & 24ft Wide Black Top Roads, Avenue trees, Sweet ground water at 20 feet. Here in maraimalai nagar project you can live a fortune life and also you can access all the places in chennai within a 30 minutes travel. It has the close Proximity with sipcot Industrial Hub, IT companies & various reputed companies, The plots are situated just 4.2Km access GST Road., 16848=Oragadam Approved Plots in prime location spread over 11.61 acres and divided into 375 plots, ranging from 600 sqft to 1500 sqft located at Oragadam, the plots are just behind the residential project Temple Green by Arun excello and very close to leading schools, colleges and the Industrial Hub Sipcot. , kindly call and get the full detail, 29728=Tambaram Sriram Avenue is a CMDA approved prime property in Tambaram with a great advantage of living and investing for near future. The plots are 0.55 acres in total, ranging from 1187 to 1263 sqft. Its features includes 30 & 24ft Wide Black Top Roads, Avenue trees, Sweet ground water at 20 feet. Here in Sriram Avenue you can live a fortune life and also you can access all the places in chennai within a 10 minutes travel. It has the close Proximity with town & Industrial Hub, IT companies & various reputed companies, The plots are situated just 400 mts from 400 ft Outer Ring Road.}",
    "lastModified": "Sun, 02 Aug 2015 16:19:37 GMT",
    "textBeforeTable": "General Amenities Bedrooms: 2 Year Built: 2014 Price: 3000000.00 Apartment/Flat For Sale LID #:2362 Property Details 612 SQ.FEET 2BHK WITH PAKKA VASTHU COMPLAINT + 50 SQ.FEET OF INDIVIDUAL CARPARKING+LIFT FACILITY AVAILABLE.THE FLAT IS AT 2ND FLOOR LOCATED AT LIC NAGAR 5TH STREET PALLIKARANAI(BACKSIDE OF KAMACTHI MEMORIAL HOSPITAL).THE HOUSE IS IN HDFC LOAN.INTERESTED PL.CALL:8122431704. LIC NAGAR 5TH STREET PALLIKARANAI chennai, 600061 (PALLIKARANAI) User Properties Contact User Beds: 2 Baths: 0 LID #: 2362 Rs. 3,000,000.00 FOR SALE 2BHK-AT PALLIKARANAI send to friend Add to Favourites Free Listing Active Year Built: 2009 Price: 1140000.00 Residential Plot For Sale",
    "textAfterTable": "Add to Favourites send to friend Active oragadam residential plots sale arun excello back side Rs. 650.00 Beds: 0 Baths: 0 LID #: 2361 Contact User User Properties oragadam chennai, 603109 (india) Oragadam Approved Plots in prime location spread over 11.61 acres and divided into 375 plots, ranging from 600 sqft to 1500 sqft located at Oragadam, the plots are just behind the residential project Temple Green by Arun excello and very close to leading schools, colleges and the Industrial Hub Sipcot. , kindly call and get the full detail Property Details LID #:2361 Residential Plot For Sale Price: 650.00 Year Built: 2015",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}