{
    "relation": [
        [
            "Team",
            "La Piazza",
            "Hitmen",
            "Outsiders",
            "Freedom Rocks",
            "Abatangelos Zombies",
            "NY NY Shockers",
            "Blue Diamonds",
            "Id Hit It",
            "Jager Bombers",
            "Scared Hitless",
            "Home Preservation",
            "Brown Guys"
        ],
        [
            "W",
            "12",
            "12",
            "12",
            "11",
            "7",
            "6",
            "6",
            "5",
            "4",
            "3",
            "3",
            "3"
        ],
        [
            "L",
            "2",
            "2",
            "2",
            "3",
            "7",
            "8",
            "8",
            "9",
            "10",
            "11",
            "11",
            "11"
        ],
        [
            "PCT",
            "0.857",
            "0.857",
            "0.857",
            "0.786",
            "0.500",
            "0.429",
            "0.429",
            "0.357",
            "0.286",
            "0.214",
            "0.214",
            "0.214"
        ],
        [
            "PF",
            "259",
            "253",
            "223",
            "245",
            "186",
            "190",
            "156",
            "168",
            "174",
            "148",
            "137",
            "136"
        ],
        [
            "PA",
            "104",
            "126",
            "129",
            "150",
            "224",
            "219",
            "205",
            "216",
            "240",
            "235",
            "216",
            "211"
        ]
    ],
    "pageTitle": "Community Sports - 9/22/10 | Las Vegas Review-Journal",
    "title": "",
    "url": "http://www.reviewjournal.com/sports/community-sports-92210",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 680240095,
    "recordOffset": 680211207,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102731=SIGNUPS BASEBALL BIG LEAGUE DREAMS SOFTBALL AND SOCCER The new sports park is forming softball and indoor soccer leagues at its location on the east side of Freedom Park. Teams pay $100 per team, plus $25 per player, which includes regular season, postseason, softballs and umpires. The facility is also registering indoor soccer teams. The cost is $100 per team, plus $25 per player, which includes nine games, playoffs and referees. For more information, call 642-4448, ext. 102. BASKETBALL Basketball Officials Wanted The Southern Nevada High School Basketball Officials Association will be accepting registrations for new and returning officials on Sept. 26 and Oct. 3 at Del Sol High School. The SNHSBOA will be taking registrations from 4 to 6 p.m. on Sept. 26 and beginning at 4:30 p.m. on Oct. 3. Instructional classes for new officials and those with just one year of experience will begin at 4:30 p.m. on Sept. 26 and 5 p.m. on Oct. 3. For more information, call instructional chairman Tom Sawyer at 289-4226 or send an e-mail to snoa.instructionalchair@gmail.com. Southern Nevada Basketball Association The SNBA is accepting registrations for its upcoming adult basketball leagues. The leagues are open to men, women, and high school-aged players. You may register as an individual or as part of a team. There are morning leagues on Saturdays and evening leagues on Tuesdays and Thursdays. Leagues are starting now and registration is ongoing. For more information, call Hank at 521-4638. FOOTBALL Wild West Football League Adult Tackle Football Several teams in the WWFL are looking for players. The league is an adult tackle football league that plays games at Fountain Park. For more information on the Cobras, call Coach Mike at 624-9004. For more information on the Henderson Wolverines, call Coach Kelly at 834-2025. TRACK AND FIELD Southwest Stallions The youth track and field club is looking for participants to join its cross country team. Runners should be between 11 and 18 years old. Practices are held at 6 p.m. at Desert Breeze Park on Tuesdays and Thursdays. For more information, call Coach O’Neal at 683-5085.}",
    "lastModified": "Sun, 02 Aug 2015 16:37:39 GMT",
    "textBeforeTable": "Las Vegas Adult Baseball League Standings American Division BASEBALL Community Sports - 9/22/10 Posted September 22, 2010 - 5:06pm CLARK TOPS WESTERN IN GIRLS... Today at Santa Anita   Print           Sports Home » You are here   App Best of LV Nifty Nickel Shopping Holiday directory Service Directory Deals Coupons Legals Classifieds Homes Autos Marketplace Job Fairs",
    "textAfterTable": "2 Mayas (Angel) 2 3 Breakdown (Larry) 0 2 Bulldogs (Howard) 0 6 Scores And-1 58, Mayas 45 Alma Latina 55, And-1 37 Primetime 55, Mayas 53 Alma Latina 51, Bulldogs 43 Hoopla 72, Bulldogs 28 Individual Scores And-1 58, Mayas 45 AND-1 (58) W. Green 10, S. Kelly 2, D. Moody 8, K. Johnson 5, C. Hartney 9, P.Thomas 15, K. Smith 9. MAYAS (45) JR Quals 18, G. Sealey 9, A. Ortez 7, T. Meyesr 0, R. Ligons 0, J. Bryant 11. Alma Latina 55, And-1 37 ALMA LATINA (55) J. Thomas 14, M, Thomas 4, M. Centeno 0, L. Lopez 0, A. Paredes 14, B. Abrica 0, F. Paco 7, R. Morgan 16. AND-1 (37) W. Green 11, S. Kelly 5, D. Moody 0, K. Johnson 3, C. Hartney 4, P.Thomas 12, K. Smith 2. Primetime 55, Mayas 53 PRIMETIME (55) Q. Faber 1, R. Faber 0, R. Jones 19, K. Ly 12, W. Anderson 17, R. Wilson 4, S. Prescott 2. MAYAS (35) JR Quals 19, G. Sealey 7, A. Ortez 2, R. Ligons 0, M. Thompson 17, J. Serrano 0, J. Bryant 8. Alma",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}