{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe, few issues. The campus safety officers are usually more of a nuisance than a help.",
            "As a state college it is much more affordable than private options.",
            "Take a train or a bus to go to NYC or Hoboken to go out. Local bars are not that exciting. There is a reservation down the road within walking distance which is great for running and hiking.",
            "The food is decent, but could be much better.",
            "I never lived on campus but often stayed with friends who do. Some buildings are more outdated while others are brand new and beautiful.",
            "Some classes are a breeze while others are extremely challenging. It depends on the subject and the professor.",
            "Even if you decide to eventually commute, I'd suggest living on campus for a semester or your first year to make good friends.",
            "Beautiful, suburban campus, however there are few places to go out nearby. Quality education with excellent faculty."
        ]
    ],
    "pageTitle": "Ramapo College of New Jersey Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ramapo-College-of-New-Jersey/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892076031,
    "recordOffset": 892026629,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21908=Tuition, Room and Board, and other related fees make Ramapo a very affordable institution in comparison to other colleges and universities. Even though it's a public campus, it has a very private feel. Most of the amenities are state of the art including the gym located in the Bradley Center as well as the residence halls that make you feel as if you're living in luxury. I feel as though the amount of money I have invested into Ramapo will truly pay off when I graduate in May of 2013. More importantly, many former students love this place so much that they end up working as full time faculty and administrators within the college., 192159=© 2015, Cappex.com, LLC, 175826=The campus's many Greek organizations not only include social fraternities and sororities, but many professional fraternities as well. Alpha Kappa Psi Business Fraternity was introduced at Ramapo in 2012-13 and has quickly become a favorite among those who want a co-ed Greek experience at Ramapo. For those who stick to social Greek life, the many fraternities and sororities have something for every student to enjoy.}",
    "textBeforeTable": "12/25/2009 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 person found this inaccurate. 1 of 39 Kristenelle from Saddle Brook, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Great for these types of students - Laid back but hard-working students - Students who like to have fun but can do work all at the same time - Students who don't want to be in a big school, but want to be in a school where everyone knows everyone Tips for prospective students 1. Don't be afraid to ask questions about different things or help. There is always someone there to help you. 2. Take advantage of the on campus events and the free stuff. 3. GET ENOUGH SLEEP!!!! 4. Enjoy your college experience to the fullest. Bang for the buck YOU DO GET YOUR MONEY'S WORTH WHEN ATTENDING RAMAPO! There are always things on campus happening so students can attend. There is almost an event everyday of the week. Even with the academics, you get your money's worth because you learn so much. You also see where your money goes with dorming. You have wonderful student lounges, different events happening in the dorm halls, and even free laundry. In my opinion, we get the bang for the buck. Am enjoying being here I enjoy being at Ramapo. You meet people from all over. Ramapo is like one big family. If you need help, they are not",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}