{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very friendly students/staff...and overall great security.",
            "what isn't there to do at TSTC...explore and you'll always find something enjoyable to do on campus.",
            "Go to college to learn and obtain skills needed for the real world...don't let personal life interfere with school/studies.",
            "Texas State Technical College in my opinion is environmental friendly and has an overall good vibe. TSTC is without a doubt a great college, and I am ecstatic to start my classes this upcoming fall."
        ]
    ],
    "pageTitle": "Texas State Technical College-Harlingen Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Texas-State-Technical-College-Harlingen/reviews?_escaped_fragment_=/show/64267",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902934139,
    "recordOffset": 902901258,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{107779=I rate this college admission process, slow as hell and very unhelpful staff. Will not notify perspective students in advance, if any problems arise with financial aid, admissions process. Students must take/pay for an 1101 course, to orient the student with college success. After taking an orientation to college all day presentation., 123454=If you are planning on taking the Wind Turbine Technician course at the Ingleside campus I would definitely recommend it. George Lister is a perfect teacher for learning all you need to know about the subject. Mrs. Trish is a great reference and teacher for the 1101 course. Everybody else that comes from the Harlingen campus and that you need to talk to on the phone are nice people., 9931=I am currently taking my basics here. I will be finished in May 2012, and from there I plan on transferring to a university that offers a major in business management., 107376=Stay on alert on your admissions process, financial aid and the 1101 course. Ask questions and continue to ask questions. Things function very slow and will not get done, unless you are pressuring lazy employees/staff., 132493=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/07/2010 Reviewer is A past student here. 4 out of 4 people found this review useful. 1 of 36 Monica from Raymondville, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Did learn a lot The food managerial and food certification instructor at T.S.T.C. was always ready to guide us through the text-book materials. He would answer all of our questions or concerns, and make sure we were practicing well. Our instructor also made us take practice exercises, showed us training videos, and wrote on the chalk board about the new law requirements. Even so, I got licensed to handle food and was able to manage food guidelines for working at a restaurant, or become a small business owner. Login to rate or flag the reviews Raul from San Benito, TX 11/23/2009 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 36 Categories Comments Great for these types of students This is a great campus for hands on learners, for those who want a small teacher- student ration, and for those who believe you can get a great education for a fraction of the cost. You can also take transferable core classes! Tips",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}