{
    "relation": [
        [
            "Beneficial Owner",
            "Michael L. Ainslie (c)",
            "John F. Akers (d)",
            "Roger S. Berlind (e)",
            "Thomas H. Cruikshank",
            "Marsha Johnson Evans",
            "Richard S. Fuld, Jr. (f)",
            "Sir Christopher Gent",
            "Joseph M. Gregory (g)",
            "Jerry A. Grundhofer",
            "Roland A. Hernandez (h)",
            "Ian T. Lowitt",
            "Henry Kaufman (i)",
            "John D. Macomber",
            "Christopher M. O'Meara",
            "Thomas A. Russo (j)",
            "All current Directors and executive officers as a group (15 individuals) (k)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Number of Shares of Common Stock (a)",
            "70,023",
            "30,749",
            "605,884",
            "76,013",
            "17,130",
            "10,851,590",
            "23,270",
            "6,188,903",
            "0",
            "7,872",
            "248,056",
            "23,286",
            "163,139",
            "259,791",
            "1,454,814",
            "20,300,245"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Number of Shares of Common Stock that may be acquired within 60 days of January 31, 2008",
            "71,788",
            "43,400",
            "71,788",
            "0",
            "0",
            "1,800,000",
            "0",
            "700,000",
            "0",
            "0",
            "63,206",
            "43,400",
            "40,720",
            "79,954",
            "150,000",
            "3,053,022"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Percent of Outstanding Common Stock (b)",
            "*",
            "*",
            "*",
            "*",
            "*",
            "2.41",
            "*",
            "1.31",
            "*",
            "*",
            "*",
            "*",
            "*",
            "*",
            "*",
            "4.43"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/806085/000104746908002261/a2183244zdef14a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 707124911,
    "recordOffset": 707012106,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Narrative Discussion Relating to the Summary Compensation Table and 2007 Grants of Plan-Based Awards Table}",
    "TableContextTimeStampAfterTable": "{212646=Determination of 2007 Executive Compensation, 86207=Chairman Emeritus and Retired Chief Executive Officer of U.S. Bancorp.    Mr. Grundhofer is the Chairman Emeritus and retired Chief Executive Officer of U.S. Bancorp. Mr. Grundhofer served as the Chairman of U.S. Bancorp from December 2002 until December 2007. Mr. Grundhofer also served as President and Chief Executive Officer of U.S. Bancorp from February 2001 until October 2004 and December 2006, respectively. From 1993 until February 2001, he served as Chairman, President and Chief Executive Officer of U.S. Bancorp predecessors Firstar Corporation and Star Banc Corporation. Mr. Grundhofer is a director of Ecolab, Inc. and The Midland Company, Inc., 40905=The enclosed proxy indicates on its face the number of shares of common stock registered in the name of each Stockholder as of the close of business on February 15, 2008 (the \"Record Date\"). Proxies furnished to any Firm employee also indicate the following amounts, as applicable:, 476582=Administration; Types of Awards; Eligible Participants.    The 2005 SIP is administered by the Compensation Committee, which is comprised exclusively of independent Directors. The 2005 SIP provides for the granting of incentive and non-qualified stock options, stock appreciation rights (\"SARs\"), and other stock-based awards, including restricted stock, RSUs, and PSUs (collectively or individually, \"Awards\"). Awards may be issued to any employee, prospective employee, Director or consultant of the Company or any of its subsidiaries who are selected by the Compensation Committee to participate in the 2005 SIP. Substantially all of the Company's employees, Directors and consultants are eligible to participate in the 2005 SIP. The Compensation Committee has discretion to select the employees to whom Awards will be granted and to determine the type, size and terms of each Award and the authority to administer, construe and interpret the 2005 SIP; provided, however, that the Compensation Committee shall not have such power and authority to accelerate or otherwise provide for the times at which shares of, 200177=As a result of this re-attribution, the Performance-Based RSUs granted in December 2006 are now considered by the Compensation Committee to have been part of Fiscal 2006 total annual compensation for Messrs. Fuld, Gregory and Russo. Accordingly, these awards were not considered by the Compensation Committee to be compensation for Fiscal 2007. However, because the grant of the Performance-Based RSUs occurred during Fiscal 2007, the grants are included in the 2007 Grants of Plan-Based Awards table below in the amount of $7,500,139 to Mr. Fuld, $6,000,098 to Mr. Gregory and $2,500,009 to Mr. Russo, and their terms are described in the narrative following the table., 162843=Chief Legal Officer. Mr. Russo has been Chief Legal Officer of the Company since 1993 and is an Executive Vice President of the Company and a member of and counsel to the Firm's Executive Committee. He has been a Vice Chairman of LBI since July 1999. Mr. Russo joined the Firm in 1993; prior to that, Mr. Russo was a partner at the Wall Street law firm of Cadwalader, Wickersham & Taft and a member of its Management Committee. Mr. Russo is the Treasurer and a member of the Executive Committee of the National Board of Trustees of the March of Dimes and Vice Chairman of the Board of Trustees of The Institute for Financial Markets. He is the Chairman of the Executive Committee of the Board of Trustees of the Institute of International Education, as well as a founder of the Institute of International Education's Scholar Rescue Fund and a member of its Board. Mr. Russo is also a member of the Regulatory Policy Committee of the Board of Governors of the Financial Industry Regulatory Authority (FINRA). In addition, Mr. Russo is a member of the Federal Reserve Bank of New York's International Advisory Committee and the Committee on Capital Markets Regulation., 408242=Voluntary Termination.    In the event of a resignation, named executive officers retain their vested equity awards, and if eligible for \"full career\" treatment, retain the entire award, provided that they do not engage in activity that is deemed either competitive or detrimental to the Company. If on November 30, 2007 Messrs. Fuld, Gregory, Russo, O'Meara or Lowitt had resigned, the value of equity awards subject to accelerated vesting and/or delivery would have been $241,089,827, $174,116,262, $32,469,268, $4,295,714 and $3,444,485, respectively., 160487=he was Co-Head of the Firm's Fixed Income Division. From 1980 to 1991, he held various management positions in the Fixed Income Division, including Head of the Firm's mortgage business. Mr. Gregory joined the Firm in 1974 as a commercial paper trader. Mr. Gregory is a member of the National Advisory Board of The Posse Foundation, Inc. and the Board of Trustees of Harlem Children's Zone. He is Vice Chair of the Trustees of Hofstra University and serves on the Finance, Endowment and Investment Committees of the University., 279538=The following table contains information concerning grants of plan-based awards made during Fiscal 2007 to the named executive officers., 566959=Important Notice Regarding the Availability of Proxy Materials for the Stockholders Meeting to be held on April 15, 2008., 494078=Additional Information.    Unless otherwise provided in an employee's Award agreement, an employee's rights under the 2005 SIP may not be assigned or otherwise transferred. An employee to whom an Award is made has no rights as a stockholder with respect to any Common Stock issuable pursuant to the Award until the date of issuance of the stock certificate for such shares upon payment of the Award. In the case of payments of Awards in the form of Common Stock, unless the Compensation Committee specifies otherwise, a 2005 SIP participant may elect to pay to the Company the minimum amount of any taxes required to be withheld with respect to the exercise, grant, vesting of, or payment pursuant to, an Award by the delivery of shares of Common Stock or having shares of Common Stock withheld by the Company, in each case that have a fair market value equal to the amount required to be withheld., 545900=Moreover, the discrediting of the hockey stick graph occurred long before Lehman issued its February 2007 report., 605232=LEHMAN BROTHERS HOLDINGS INC. 2005 STOCK INCENTIVE PLAN (AS PROPOSED), 204531=Perquisites.    The Company does not generally offer perquisites or other personal benefits to executive officers other than benefits that are generally available on a non-discriminatory basis to all employees. The Company, however, has a policy of paying expatriate expenses for employees generally, and consistent with SEC disclosure requirements, payments to Mr. Lowitt for expenses associated with his expatriate status for the month of December 2006 are included in the Summary Compensation Table. The Company generally requires reimbursement by employees for any other expenditures that are personal in nature., 523345=Descriptions of the 1994 Plan, the 1996 Plan, the 2005 SIP, the EIP, the Neuberger LTIP and the Neuberger DSIP are contained in Note 12 to the Consolidated Financial Statements included in the Company's 2007 Annual Report on Form 10-K and are incorporated herein by reference., 507101=YOUR VOTE IS IMPORTANT. In order for the Plan Amendment to be approved, the NYSE rules require that a majority of the outstanding shares of Common Stock are voted on the proposal and that the majority of the shares of Common Stock voting on the proposal vote to approve the Plan Amendment. If you fail to vote, your shares will not be considered \"shares present\" for voting purposes, which may cause less than the requisite majority of the outstanding shares of Common Stock to be voted on the matter. If you hold your shares through a broker, your broker will not be permitted to vote your shares on this matter without your voting instructions. If the Plan Amendment is not approved, only 28 million shares will remain available for issuance under the 2005 SIP as of February 15, 2008, subject to increases as previously described., 150910=For Fiscal 2007, upon the recommendation of the Compensation Committee, the Board of Directors gave non-management Directors the choice to receive an option to purchase 10,200 shares of Common Stock instead of the annual RSU grant. The options granted have an exercise price per share equal to the closing price of the Common Stock on the NYSE on the date of the annual stockholder meeting. Such options have a ten-year term, are not forfeitable, and become exercisable in one-third installments on each of the first three anniversaries of the award date, or sooner upon termination of service., 495502=Term of 2005 SIP; Amendment and Termination of 2005 SIP.    No Awards may be granted on or after May 1, 2015, the tenth anniversary of the effective date of the 2005 SIP. The Board of Directors may amend, suspend or terminate the 2005 SIP or any portion thereof at any time, subject to the following restrictions: (a) no amendment may be made without approval of the stockholders that would (1) increase the total number of shares reserved for issuance pursuant to the 2005 SIP or increase the maximum number of shares for which Awards may be granted to any participant, (2) change the class of persons eligible to be participants in the 2005 SIP, or (3) extend the date after which Awards cannot be granted under the 2005 SIP; and (b) no amendment may be made without the consent of a participant if the amendment would diminish the rights of the participant under any Award previously granted to that participant. However, the Compensation Committee may amend the 2005 SIP as it deems necessary to permit the 2005 SIP and/or Awards to satisfy requirements of applicable laws., 196923=Stock Options.    Stock options were not granted to executive officers in Fiscal 2007. In prior years, the Compensation Committee made annual grants of stock options at the beginning of the fiscal year to motivate executives to strive for long-term stockholder value creation., 74077=Retired Chairman of International Business Machines Corporation.    Mr. Akers, a private investor, is the retired Chairman of the Board of Directors of International Business Machines Corporation. Mr. Akers served as Chairman of the Board of Directors and Chief Executive Officer of IBM from 1985 until his retirement in 1993, completing a 33-year career with IBM. Mr. Akers is a Director of W. R. Grace & Co. He is a former member of the Board of Trustees of the California Institute of Technology and The Metropolitan Museum of Art, as well as the former Chairman of the Board of Governors of United Way of America. Mr. Akers was also a member of former President George Bush's Education Policy Advisory Committee. Mr. Akers serves as the Chairman of the Compensation and Benefits Committee and as a member of the Finance and Risk Committee., 449395=The table below sets forth the aggregate fees (including related expenses) for audit, audit-related, tax and other services provided by Ernst & Young LLP to the Firm related to Fiscal 2007 and Fiscal 2006., 115586=Each Director is expected to attend the Company's Annual Meeting of Stockholders. Each Director attended the Company's 2007 Annual Meeting of Stockholders., 463935=Based upon the Audit Committee's discussions with management and the independent registered public accounting firm and the Audit Committee's review of the representations of management and the reports and letter of the independent registered public accounting firm provided to the Audit Committee, the Audit Committee recommended to the Board of Directors that the audited consolidated financial statements be included in the Company's Annual Report on Form 10-K for the year ended November 30, 2007 for filing with the Securities and Exchange Commission., 92528=Principal of JDM Investment Group.    Mr. Macomber has been a Principal of JDM Investment Group, a private investment firm, since 1992. He was Chairman and President of the Export-Import Bank of the United States from 1989 to 1992, Chairman and Chief Executive Officer of Celanese Corporation from 1973 to 1986 and a Senior Partner at McKinsey & Company from 1954 to 1973. Mr. Macomber is a Director of Collexis Holdings, Inc. and Stewart & Stevenson LLC. He is Chairman of the Council for Excellence in Government and Vice Chairman of the Atlantic Council. He is a Trustee of the Carnegie Institution of Washington and the Folger Library. Mr. Macomber serves as a member of the Compensation and Benefits Committee, the Executive Committee and the Nominating and Corporate Governance Committee., 193218=Elements of 2007 Compensation Program, 13598=The 2008 Annual Meeting of Stockholders of Lehman Brothers Holdings Inc. will be held on Tuesday, April 15, 2008, at 10:30 a.m. (New York time) at our global headquarters, 745 Seventh Avenue, New York, New York 10019, on the Concourse Level in the Allan S. Kaplan Auditorium. A notice of the meeting, a proxy card and a proxy statement containing information about the matters to be acted upon are enclosed. You are cordially invited to attend., 83904=Non-Executive Chairman of GlaxoSmithKline plc.    Sir Christopher Gent has been Non-Executive Chairman of GlaxoSmithKline plc since January 2005. He was Non-Executive Deputy Chairman of GlaxoSmithKline plc from June 2004 to January 2005. Prior to his retirement in July 2003, he had been a member of the Board of Directors of Vodafone Group Plc since August 1985 and its Chief Executive Officer since January 1997. Sir Christopher joined Vodafone as Managing Director of Vodafone Limited in January 1985 when the mobile phone service was first launched, and held that position until December 1996. Prior to joining Vodafone, Sir Christopher was Director of Network Services for ICL. In this role, he was Managing Director of Baric, a computer services company owned jointly by Barclays and ICL, and was responsible for ICL's computer bureau services worldwide. Sir Christopher was Knighted for his services to the mobile telecommunications industry in 2001. He is a Director of Ferrari SpA, a Senior Advisor to Bain & Company, Inc. and a member of the Advisory Board of Reform. He served as the National Chairman of the Young Conservatives from 1977 to 1979, and was Vice President of the Computer Services Association Council at the time he left ICL. Sir Christopher serves as a member of the Audit Committee and the Compensation and Benefits Committee., 39304=This proxy statement (the \"Proxy Statement\") is furnished in connection with the solicitation of proxies by the Board of Directors of Lehman Brothers Holdings Inc. (the \"Company\" and, together with its subsidiaries, the \"Firm\") for use at the 2008 Annual Meeting of Stockholders of the Company, to be held on Tuesday, April 15, 2008 at 10:30 a.m. (New York time), or any adjournment or postponement thereof (the \"Annual Meeting\"). The Company expects to mail this Proxy Statement and the accompanying proxy card on or about March 6, 2008 to the Company's common stockholders of record as of the close of business on February 15, 2008 (the \"Stockholders\")., 263683=Stock Units are discussed in Notes 1 and 12 of the Company's Fiscal 2007 Consolidated Financial Statements., 555775=Stockholders of the Company who intend to present proposals for inclusion in the proxy material to be distributed by the Company in connection with the Company's 2009 Annual Meeting of Stockholders must submit their proposals on or before November 6, 2008 to the Corporate Secretary of the Company by mail at Corporate Secretary, Lehman Brothers Holdings Inc., 1271 Avenue of the Americas, New York, New York 10020, or by facsimile at 1-646-834-1052., 447654=The Board of Directors recommends to the Stockholders that they ratify the selection by the Audit Committee of Ernst & Young LLP, independent registered public accounting firm, to audit the accounts of the Firm for the fiscal year ending November 30, 2008., 206383=Tax Deductibility of Compensation.    Section 162(m) of the Code limits the Company's tax deduction to $1 million per year per executive for certain compensation paid to each of its Chief Executive Officer and the three highest compensated executive officers other than the Chief Executive Officer and Chief Financial Officer. In general, the regulations under Section 162(m) exclude from this limitation compensation that is, among other things, calculated based on objective performance criteria and awarded under a plan that has received stockholder approval within the past five years. Performance-based incentive awards to executive officers are based on compensation formulas established under the EICP and are intended to qualify for the Section 162(m) exclusion. See \"Proposal 4\u0097Approval of the Executive Incentive Compensation Plan (Formerly Named the Short-Term Executive Compensation Plan), as Amended\" below. The Committee establishes objective compensation formulas at the beginning of the year that determine the maximum amount of annual incentive that may be paid based on the financial performance of the Company, as described under \"Determination of 2007 Compensation\" below., 161667=Co-Chief Administrative Officer. Mr. Lowitt has been the Co-Chief Administrative Officer of the Company since October 2006 and is an Executive Vice President of the Company. Mr. Lowitt was Chief Administrative Officer for Lehman Brothers Europe from July 2005 until October 2006. Prior to that, Mr. Lowitt served as Treasurer and Global Head of Tax from 2000 until 2005. Mr. Lowitt joined the Firm in 1994 as Head of Corporate Development and was named a managing director in June 2000., 422073=Directors and qualifying employees and consultants of the Firm who are accredited investors have been provided with the opportunity to invest as limited partners in various investment partnerships that generally qualify as \"employees' securities companies\" for purposes of the Investment Company Act of 1940. The investment partnerships provide the participants with an opportunity to make investments in a portfolio of investment opportunities, often together with the Firm's merchant banking, venture capital, real estate, credit-related and other funds that are offered to third-party investors, on terms that are generally more favorable than those offered to third-party investors. Beginning in 2002, non-management Directors were no longer permitted to invest in these partnerships., 14123=All holders of record of the Company's outstanding shares of Common Stock as of the close of business on February 15, 2008 will be entitled to vote at the Annual Meeting. It is important that your shares be represented at the meeting. You will be asked to (1) elect eleven Directors for one-year terms; (2) ratify the selection by the Audit Committee of the Board of Directors of Ernst & Young LLP as the Company's independent registered public accounting firm for the 2008 fiscal year; (3) approve an amendment to the Company's 2005 Stock Incentive Plan; (4) approve the Executive Incentive Compensation Plan (formerly named the Short-Term Executive Compensation Plan), as amended; and (5) consider two stockholder proposals. Accordingly, we request that you promptly sign, date and return the enclosed proxy card, or register your vote online or by telephone according to the instructions on the proxy card, regardless of the number of shares you hold., 554003=If you will need special assistance at the Annual Meeting because of a disability, please contact the Corporate Secretary of the Company at 1-212-526-0858 or by facsimile at 1-646-834-1052., 194670=As described below under \"Determination of 2007 Compensation,\" the terms, conditions and amount of the equity component of the Annual Incentive were determined by the Compensation Committee at its first meeting following the end of the fiscal year. The grant date of the equity award is the date of the Compensation Committee's meeting. In considering the form and amount of equity award to be granted to each executive officer, the Compensation Committee considers a variety of factors, including the performance of the Company and each executive officer in the prior year, means to incent performance and encourage retention of each executive officer, the mix of cash and equity being awarded to other senior executives, each executive officer's current equity holdings, trends in executive compensation best practices, and the market environment generally. In December 2007, the Compensation Committee awarded RSUs to the executive officers as the equity component of the Annual Incentive for Fiscal 2007., 528215=The EICP allows the Compensation Committee (or, in certain situations, its delegate) to grant to certain employees of the Firm annual awards of two types: \"Standard Bonuses\" and \"Performance Bonuses\" (each, a \"Bonus\"). Bonuses may be granted to members of the Firm's Executive Committee or other Managing Directors of the Firm. As of February 15, 2008, approximately 1,500 individuals were eligible to participate in the EICP., 458097=The Audit Committee is informed on a timely basis, and in any event by the next scheduled meeting, of all services rendered by the independent registered public accounting firm and the related fees. The Audit Committee has delegated its pre-approval authority to its Chairman. In the event the Chairman pre-approves any service, he reports such pre-approval to the Audit Committee at its next scheduled meeting. None of the services described above under \"Fees for Fiscal 2007 and Fiscal 2006\" was approved by the Audit Committee after the fact in reliance upon the de minimis exception to the SEC's rules requiring pre-approval of such services., 420118=To the extent permitted by the Sarbanes-Oxley Act of 2002, Directors and executive officers of the Company and their associates, including family members, from time to time may be or may have been indebted to the Company or its subsidiaries under lending arrangements offered by those companies to the public. For example, such persons may be or may have been indebted to LBI as customers, in connection, 468858=The Firm's stockholders approved an increase in the shares available for issuance under the 2005 SIP from 20 million shares to 95 million shares in April 2007. Under the terms of the 2005 SIP, 33.5 million shares of Common Stock that remained unawarded upon the expiration of the Company's 1996 Plan and EIP in 2006 also became available for Awards under the 2005 SIP. In addition, any shares of Common Stock subject to repurchase or forfeiture rights under an award that has been granted under the 2005 SIP, the 1996 Plan or the EIP that are reacquired by the Company, any shares of Common Stock that are withheld or delivered pursuant to the terms of the 2005 SIP in payment of any applicable exercise price or tax withholding obligation, and any award relating to shares of Common Stock under any of such plans that is canceled, terminates or expires or, for any other reason is not payable, become available for new Awards. At the time, the Company expected the April 2007 increase to cover stock-based awards until 2009, including awards for fiscal years 2007 and 2008. As of February 15, 2008, the Company had only 28 million shares available for future Awards under the 2005 SIP (subject to increases as described above), which is not expected to be sufficient for fiscal 2008., 213948=Annual Incentive Formulas.    For the Fiscal 2007 performance-based Annual Incentives payable under the EICP, the Compensation Committee established formulas at the beginning of the fiscal year based on percentages of the Company's income before taxes, the cumulative effect of accounting changes, and extraordinary items (collectively, \"Pre-tax Income\"). The Compensation Committee chose to use the Company's Pre-tax Income as the basis for the formulas because it is a stable measure of the Company's financial performance. The formula assigned to each executive officer was based on his role and responsibilities but did not specify a target award. These incentive formulas were principally established in order to qualify the Annual Incentives as performance-based compensation for purposes under Section 162(m) of the Code., 376259=All U.S. employees of the Company or a designated subsidiary who have attained the age of 21 and completed one year of service are generally eligible to participate in the U.S. Pension Plan. The U.S. Pension Plan formula provides for an annual retirement benefit payable at age 65, calculated as a straight life annuity. Pensionable earnings are total Form W-2 earnings (plus elective deferrals under the Lehman Brothers Savings Plan and certain other health plan deferral amounts) up to the applicable Internal Revenue Service maximum. For each year of plan participation prior to 1989, the annual accrual was based on percentages of pensionable earnings up to and in excess of the Social Security taxable wage base. After 1988 the annual accrual is equal to 1% of pensionable earnings up to the average Social Security taxable wage base plus 1.65% of pensionable earnings in excess of the average Social Security taxable wage base. Generally, participants have a nonforfeitable right to their accrued benefits upon completing five years of vesting service. As of November 30, 2007, the estimated annual projected benefits payable upon retirement at a normal retirement age of 65 for Messrs. Fuld, Gregory, Russo, O'Meara and Lowitt are approximately $103,265, $116,686, $39,873, $87,689 and $94,559, respectively. Messrs. Fuld, Gregory and Russo are also eligible for early retirement under the plan, which is based on attaining age 55 with five years of service, that would provide an estimated annual projected benefit as of November 30, 2007 in the amounts of $66,260, $37,446 and $33,086, respectively., 20038=A copy of the Company's 2007 Annual Report to Stockholders is enclosed herewith for all stockholders., 215612=percentage is fixed). The incentive formula is expected to yield a bonus payment, except in the event of a loss. These formulas set the maximum Annual Incentive for Messrs. Fuld, Gregory, Russo and the other executive officers equal to 0.75%, 0.57%, 0.50%, and 0.25% of Pre-tax Income, respectively, based on the Company's Fiscal 2007 Pre-tax Income of $6.0 billion, which was associated with a Return on Tangible Shareholder's Equity of 25.7%. In December 2007, the Compensation Committee adjusted the formula applicable to Mr. Gregory for Fiscal 2008 to provide itself greater flexibility in providing him with enhanced incentive opportunity., 279740=2007 GRANTS OF PLAN-BASED AWARDS, 76257=Theatrical Producer.    Mr. Berlind, who is also a private investor, has been a theatrical producer and principal of Berlind Productions since 1981. Mr. Berlind is also a Governor of the Broadway League and has served as a Trustee of Princeton University, the Eugene O'Neill Theater Center, the MacDowell Colony and the American Academy of Dramatic Arts. Mr. Berlind serves as a member of the Audit Committee and the Finance and Risk Committee., 542929=The Free Enterprise Action Fund, represented by Action Fund Management, LLC, 12309 Briarbush Lane, Potomac, MD 20854, the holder of approximately 452 shares of Common Stock, has proposed the adoption of the following resolution and has furnished the following statement in support of its proposal:, 492657=However, with respect to any Award granted after November 8, 2007, a \"Change in Control\" is deemed to occur when: (1) 70% or more of the combined voting power of the Company's voting securities is acquired in certain instances (whether through a tender offer, merger, or otherwise); (2) a merger, consolidation, recapitalization or reorganization involving the Company occurs, whereby the stockholders immediately prior to such transaction cease to hold at least 30% of the combined voting power of the outstanding voting securities of the corporation resulting from such transaction, the individuals who were members of the Board of Directors immediately prior to the execution of the agreement providing for such transaction cease to constitute at least 50% of the board of directors of the resulting corporation, or a person or entity becomes the beneficial owner of 70% or more of the combined voting power of the resulting corporation; (3) within a consecutive twelve month period, a majority of the individuals who are members of the Board of Directors are replaced with individuals who do not receive endorsement by a majority of the Board of Directors before the date of the appointment or election of such individuals; or (4) a sale or other disposition of all or substantially all of the assets of the Company., 522318=As of November 30, 2007, there were available for future issuance:, 484297=Other Stock-Based Awards.    Other Awards of Common Stock and Awards that are valued in whole or in part by reference to, or otherwise based on, the fair market value of Common Stock (all such Awards being referred to herein as \"Other Stock-based Awards\"), may be granted under the 2005 SIP in the discretion of the Compensation Committee. Other Stock-based Awards will be in such form as the Compensation Committee will determine, including without limitation, (1) the right to purchase shares of Common Stock, (2) shares of Common Stock subject to restrictions on transfer until the completion of a specified period of service, the occurrence of an event or the attainment of performance objectives, each as specified by the Compensation Committee, (3) shares of Common Stock issuable upon the completion of a specified period of service, the occurrence of an event, or the attainment of performance objectives, each as specified by the Compensation Committee and (4) dividend equivalent rights with respect to Common Stock subject to any Award. Any Other Stock-based Awards that are granted subject to the completion of a specified period of service by the Award recipient that are (1) not in lieu of cash compensation to employees generally, (2) not paid to recruit a new employee in an amount less than 5% of the total Awards available for grant under the 2005 SIP or (3) not subject to the attainment of performance objectives, will provide that vesting, restrictions on transfer, or some other comparable restriction that encourages continued performance of the Award recipient, will in any such case be for a period of not less than three years (although vesting or lapsing of restrictions may occur in installments over such period), unless there is a Change in Control (as such term is defined in \"Change of Control\" below) or the Award recipient retires, becomes disabled or dies. Other Stock-based Awards may be granted alone or in addition to any other Awards made under the 2005 SIP. With respect to any RSUs or PSUs granted under the 2005 SIP, the obligations of the Company or any subsidiary of the Company are limited solely to the delivery of shares of Common Stock on the date when such shares of Common Stock are due to be delivered under each Award agreement, and in no event will the Company or any subsidiary of the Company become obligated to pay cash in respect of such obligation (except that the Company or any subsidiary of the Company may pay to the Award recipient amounts in cash in respect of a RSU or PSU equal to cash dividends paid to a holder of the same number of shares of Common Stock that are subject to the RSU or PSU)., 424258=The table below sets forth for each of the limited partners listed (1) the amount of distributions of profits from all of the existing investment partnerships during Fiscal 2007, (2) the outstanding balance, as of November 30, 2007, of the aggregate preferred capital contributions made by the general partner of these investment partnerships as a result of investments made by such limited partners and (3) the aggregate, 479071=Shares Available for Awards.    As amended, a total of 178.5 million shares of Common Stock may be subject to Awards under the 2005 SIP (including 33.5 million shares of Common Stock authorized for issuance under the Company's 1996 Plan and EIP that remained unawarded upon the expiration of those plans in 2006). In addition, if any shares of Common Stock subject to repurchase or forfeiture rights under an award that has been granted under the 2005 SIP, the 1996 Plan or the EIP are reacquired by the Company, or if any shares of Common Stock are withheld or delivered pursuant to the terms of the 2005 SIP in payment of any applicable exercise price or tax withholding obligation, or if any award relating to shares of Common Stock under any of such plans is canceled, terminates or expires or, for any other reason is not payable, such shares will become available for new Awards. No 2005 SIP participant may receive options, SARs or other stock-based Awards during any fiscal year attributable to more than four million shares of Common Stock, subject to adjustment in accordance with the terms of the 2005 SIP. The shares of Common Stock issuable under the 2005 SIP may be either authorized but unissued shares or treasury shares, or any combination thereof., 496724=Awards to be Granted Under the 2005 SIP.    The number or type of Awards that will be granted under the 2005 SIP to any participants will be determined at the discretion of the Compensation Committee and therefore cannot be calculated at this time., 518245=Awards with respect to 52.5 million shares of Common Stock have been made under the 2005 SIP as of November 30, 2007. The number of shares remaining available for future issuance under the 2005 SIP as of November 30, 2007, is calculated as follows:, 227608=Compensation Committee's Determination of Fiscal 2007 Compensation, 225105=After considering the information described above, the Compensation Committee exercised discretion for each executive officer on an individual basis to provide Annual Incentive awards that were below the maximum amounts provided for under the pre-established incentive formulas described above. In its determination of the Annual Incentive for each of the executive officers other than Mr. Fuld, the Compensation Committee was most strongly influenced by the performance evaluations and compensation recommendations presented by Mr. Fuld and Mr. Gregory, and by the Company's Fiscal 2007 financial performance., 242223=The Compensation and Benefits Committee reviewed and discussed the Compensation Discussion and Analysis with management and, based on such review and discussions, the Committee recommended to the Board of Directors that the Compensation Discussion and Analysis be included in the Proxy Statement on Schedule 14A for filing with the Securities and Exchange Commission and incorporated by reference in the Company's 2007 Annual Report on Form 10-K., 201047=Supplemental Retirement Plan.    Messrs. Fuld, Gregory and Russo participate in the Lehman Brothers Supplemental Retirement Plan (the \"SRP\"), a nonqualified, noncontributory, defined benefit plan. See \"Pension Benefits\" below. The SRP was established to provide selected executives an additional fixed annual retirement benefit above the amount limited by qualified plan restrictions. The Compensation Committee, which adopted the plan in 1998, has not increased the annual benefit amounts since the plan's inception. The Compensation Committee determines the participants in the SRP and generally bases this determination on an executive's tenure and his or her historical performance at the Company., 50334=Amendment of the 2005 Stock Incentive Plan.    The affirmative vote of the majority of the shares of common stock present in person or by proxy at the Annual Meeting is required to amend the 2005 SIP, provided that a majority of the outstanding shares of common stock are voted on the proposal. In determining whether the proposal has received the requisite number of affirmative votes, abstentions will be counted and will have the same effect as a vote against the proposal. Broker non-votes are not considered \"shares present\" for voting purposes, but may affect the voting to the extent that the broker non-votes cause less than a majority of the outstanding shares of common stock to be voted on the matter., 536439=Mrs. Evelyn Y. Davis, with an office at the Watergate Office Building, 2600 Virginia Avenue, N.W., Washington, D.C. 20037, the holder of 200 shares of Common Stock, has proposed the adoption of the following resolution and has furnished the following statement in support of her proposal:, 211103=In November 2007 the Compensation Committee also amended the SRP primarily to avoid potential adverse tax consequences under Section 409A. Among other technical changes, the definition of a change in control under the SRP was amended principally to provide that a change in control would occur upon, among other things, the acquisition of at least 50% of the combined voting power of the outstanding voting securities or of at least 30% of the combined voting power of the outstanding voting securities within a 12-month period. Prior to the amendment, a change in control would have been triggered by the acquisition of at least 20% of the combined voting power of the outstanding voting securities. The Compensation Committee made the minimum changes to the SRP that are required by the new provisions of Section 409A because, unlike prospective equity awards, an amendment made to the SRP affects benefits already accrued under the SRP by the participants. At that time, the Compensation Committee also amended outstanding equity awards to employees generally to comply with the minimum standards of Section 409A., 641234=immediately prior to the applicable date of expiration of each of the Lehman Brothers Holdings Inc. Employee Incentive Plan and the Lehman Brothers Holdings Inc. 1996 Management Ownership Plan (each, a \"Prior Plan\"), are available for issuance and not otherwise subject to outstanding Awards granted under the Prior Plans, increased by the number of Shares that, as of each such applicable expiration date, were subject to Awards granted and outstanding under the Prior Plans (the \"Prior Awards\") but which are subsequently not payable or distributable under the Prior Awards under any of the circumstances described in paragraph (ii), (iii) or (iv) of subsection (b) above., 480461=Stock Options.    A stock option, which may be a non-qualified or an incentive stock option (each, an \"Option\"), is the right to purchase a specified number of shares of Common Stock at a price (the \"Option Price\") fixed by the Compensation Committee (any holder of an Option is called an \"Optionee\"). The maximum number of shares of Common Stock that may be subject to incentive stock options (\"ISOs\") granted pursuant to the 2005 SIP is 20 million, subject to adjustment in accordance with the terms of the 2005 SIP. The Option Price of an Option may be no less than the fair market value of the underlying Common Stock on the date of grant. Unless otherwise provided in the Optionee's Award agreement, Options are not transferable during the Optionee's lifetime and will expire no later than ten years after the date on which they are granted. Options become exercisable at such times and in such installments as the Compensation Committee will determine. The Compensation Committee may also accelerate the period for exercise of any or all Options held by an Optionee. Payment of the Option Price must be made in full at the time of exercise of the Option by any of the following methods: (1) in cash; (2) by tendering to the Company shares of Common Stock having a fair market value equal to the Option Price, which shares have been held by the Optionee for at least six months and which meet such other requirements as may be imposed by the Compensation Committee; (3) by certain withholding methods that constitute a cashless exercise through the delivery of irrevocable instructions by the Optionee to a broker to sell the Common Stock received upon exercise of the Option and to deliver promptly to the Company an amount out of the proceeds equal to the aggregate Option Price, or (4) by other means that the Compensation Committee deems appropriate., 13431=March 5, 2008, 303191=The 2006 Performance-Based RSUs, granted on December 8, 2006, were contingent on achieving a threshold level of return on equity (\"ROE\") for Fiscal 2007 of 10%, which was achieved. The 2006 Performance-Based RSUs will vest at the end of five years, with accelerated vesting if and when the Company's stock price achieves specified targets for five consecutive trading days. The target prices, which are set at $100, $108, and $116, will, if achieved, accelerate vesting but to no earlier than one-third per year beginning on November 30, 2007. See \"Elements of Compensation in Prior Years\u0097Performance-Based RSU Grants\" in the Compensation Discussion and Analysis section., 554350=In accordance with a notice sent previously to certain beneficial owners holding shares in street name (for example, through a bank, broker or other holder of record) and who share a single address with other similar holders, only one annual report and proxy statement is being sent to that address unless contrary instructions were received from any stockholder at that address. This practice, known as \"householding,\" is designed to reduce printing and postage costs. Any of such beneficial owners may discontinue householding by writing to the address or calling the telephone number provided for such purpose by their holder of record. Any such stockholder may also request prompt delivery of a copy of the annual report or proxy statement by contacting the Company at 1-212-526-0858 or by writing to the Corporate Secretary, Lehman Brothers Holdings Inc., 1271 Avenue of the Americas, New York, New York 10020., 407335=Involuntary Termination Without Cause.    Most equity awards to named executive officers include provisions that are designed to provide some protection of their awards in the event of involuntary termination without cause. If on November 30, 2007 Messrs. Fuld, Gregory, Russo, O'Meara or Lowitt had been involuntary terminated without cause, the value of equity awards subject to accelerated vesting and/or delivery would have been $241,089,827, $174,116,262, $32,469,268, $4,295,714 and $5,290,029, respectively. In the event of an involuntary termination with cause, these awards are forfeited and cancelled. The definition of \"cause\" is defined in the equity award agreements, forms of which are filed as exhibits to the Company's 2007 Annual Report on Form 10-K., 157736=Co-Chief Administrative Officer. Mr. Freidheim has been the Co-Chief Administrative Officer of the Company since October 2006 and is an Executive Vice President of the Company. Mr. Freidheim also has been the Chief of Staff to the Chairman and Chief Executive Officer since 1996. He was Global Head of Strategy from 2005 to 2007 and Global Head of Corporate Communications, Advertising, Marketing and Brand Strategy from 2003 to 2007. Mr. Freidheim joined the Company in 1991. He is actively involved with the Institute of International Education (\"IIE\"), where he is a member of the Board of Trustees, a member of IIE's Scholar Rescue Fund Board of Directors and Selection Committee, and co-founder and chairman of IIE's New Leaders Group. Additionally, Mr. Freidheim is a member of The Forum of Young Global Leaders of the World Economic Forum, a member of the Executive Advisory Board of Sponsors for Educational Opportunity, a member of Young Presidents' Organization and a member of The Economic Club of New York., 851=Proxy Statement Pursuant to Section 14(a) of the Securities Exchange Act of 1934 (Amendment No.          ), 238381=All of the RSUs awarded to the executive officers for Fiscal 2007 are subject to forfeiture restrictions and cannot be sold or transferred until they convert to Common Stock at the end of five years. The RSU awards to Messrs. Fuld, Gregory and Russo vest over three years while awards to Messrs. O'Meara and Lowitt vest over two years. Factors which influenced the terms and conditions of the RSU awards awarded to each executive officer, including the vesting provisions, included: the role and responsibilities of each executive officer; the vesting schedules of equity awards to other senior executives; executive retention; and accounting expense. In particular, the vesting provisions of the RSUs awarded to the executive officers were influenced by the fact that these awards did not include a \"full career\" or retirement vesting feature, which had been included in Annual Incentive equity awards in prior years that vested over five-year periods. See the discussion of this feature in the narrative following the Outstanding Equity Awards at Fiscal 2007 Year-End table below., 196181=Performance Stock Units.    The Compensation Committee previously granted Performance Stock Units periodically to selected executives, including Messrs. Fuld, Gregory and Russo, under four separate programs established in 1995, 1996, 1997 and 2000. The Performance Stock Unit grants provided long-term incentive opportunities based on the then financial goals of the Company and have been attributed by the Compensation Committee to compensation earned for prior years, even though some Performance Stock Unit awards converted to Common Stock in Fiscal 2007, and other Performance Stock Unit awards have not yet converted., 508289=The following table sets forth certain information as of November 30, 2007 regarding shares of Common Stock authorized for issuance under the Firm's equity compensation plans. The table does not reflect (1) approximately 49.7 million of RSUs which were granted to employees on December 7, 2007 and (2) approximately 1.7 million of RSUs and 1.2 million of stock options which were granted to employees on February 9, 2008. As of February 15, 2008, there were approximately 28 million shares available for future Awards under the 2005 SIP, subject to increases as previously described., 189913=The overall objective in determining total compensation levels across the Company is to balance competitive pressures in the market for professional talent with cost considerations. Since the securities industry is fundamentally a human capital intensive business, compensation and benefits are a significant and critical expense. Among the firms within our industry, these expenses typically account for between 45% and 50% of net revenues, and in 2007, compensation and benefits expenses among some firms approached 60% of net revenues. In Fiscal 2007, the Company's compensation and benefits expense was 49.3% of net revenues., 186271=Lehman Brothers' human capital strategy is to attract and retain the most talented employees and to strongly align their interests with maximizing Company performance and stockholder return. Our strategy regarding our employees has remained consistent since becoming a public company in 1994 and, we believe, has been instrumental in helping the Company achieve its goals over time., 19265=The Company will admit to the Annual Meeting (1) all stockholders of record as of the close of business on February 15, 2008, (2) persons holding proof of beneficial ownership as of such date, such as a letter or account statement from the person's broker, (3) persons who have been granted proxies, and (4) such other persons that the Company, in its sole discretion, may elect to admit. All persons wishing to be admitted must present photo identification. If you plan to attend the Annual Meeting, please check the appropriate box on your proxy card or register your intention when voting online or by telephone according to the instructions provided., 468232=NYSE rules require that the Company obtain stockholder approval of the Plan Amendment in order for it to be effective. Stockholder approval of the Plan Amendment also will permit the Company to continue to grant tax-deductible performance-based awards under the 2005 SIP to the Chief Executive Officer and certain other executive officers. The 2005 SIP has been designed to permit it to be administered to grant performance-based awards to executive officers, which would qualify for full tax deductibility by the Company under Section 162(m) of the Code., 303958=The 2006 Year-end RSUs, granted on December 8, 2006, are subject to vesting and forfeiture restrictions and cannot be sold or transferred until they convert to Common Stock on November 30, 2011, approximately five years after the grant date. 35% of the RSUs will vest on November 30, 2009 and the balance will vest on November 30, 2011., 216337=Performance Evaluation.    At the beginning of Fiscal 2007, performance objectives for each executive officer were established for the upcoming year by Mr. Fuld and Mr. Gregory, with input from the Compensation Committee and the other executive officers and consistent with the Firm's strategy, and included:, 227369=The table below provides the dollar value of the salary and Annual Incentive approved by the Compensation Committee for each of the named executive officers for Fiscal 2007., 205369=Liquidity Limits.    The Compensation Committee approves an annual \"liquidity limit\" for certain executives, including Messrs. Fuld, Gregory and Russo. In determining whether an executive will be subject to the liquidity limits, the Compensation Committee considers factors such as the executive's role and responsibilities at the Company, and the executive's existing individual equity holdings in the Company. Expressed as a maximum percentage of an executive's total equity holdings in the Company (including outstanding equity awards) that may be sold in any given year, the effect of these liquidity limits has been to promote a high level of stock ownership by the Company's senior management team. For Fiscal 2007, the liquidity limit percentage was 20%. Executive officers are prohibited from hedging their equity holdings in the Company (including outstanding equity awards)., 19012=Common stockholders of record as of the close of business on February 15, 2008 are entitled to notice of and to vote at the Annual Meeting or any adjournment or postponement thereof., 459851=Ernst & Young LLP also provided audit and tax services to certain registered funds for which the Firm acted as an investment adviser during Fiscal 2007 and 2006. The fees (including related expenses) for these services provided by Ernst & Young LLP related to Fiscal 2007 and 2006 were approximately $1,437,000 and $1,345,000 for audit services and $359,000 and $346,000 for tax services, respectively, which consisted of the preparation and/or review of, and consultations with respect to, tax filings. All of these fees were paid by the registered funds. The registered funds have audit committees comprised solely of directors who are independent of the Company and are not on the Company's Board of Directors, which committees are responsible for the selection of the registered funds' audit firms and the approval of any fees paid to such firms., 497223=United States federal income tax consequences to Optionees and the Company of Options granted under the 2005 SIP should generally be as set forth in the following summary:, 218279=Following the end of Fiscal 2007, Mr. Fuld and Mr. Gregory presented their evaluations of the performance of each executive officer, other than themselves, to the Compensation Committee based upon the objectives and goals discussed at the beginning of the fiscal year and made recommendations to the Compensation Committee with respect to the Annual Incentives to be awarded to such executive officers. Mr. Fuld made a similar presentation with respect to Mr. Gregory in the latter's absence. During these presentations, Mr. Fuld and Mr. Gregory highlighted specific examples of the Company's and executive officers' achievements, including the following:, 476093=An amended version of the 2005 SIP, reflecting the Plan Amendment, is attached hereto as Appendix B., 56864=The Incentive Plans Trust holds shares of Common Stock (\"Trust Shares\") issuable to future, current and former employees of the Company in connection with the granting to such employees of RSUs under the Neuberger LTIP, the Company's Employee Incentive Plan (the \"EIP\"), the Company's 1994 Management Ownership Plan (the \"1994 Plan\"), the Company's 1996 Management Ownership Plan (the \"1996 Plan\") and the 2005 SIP (together with the Neuberger LTIP, EIP, 1994 Plan and 1996 Plan, the \"Incentive Plans\"). The Incentive Plans Trustee will vote or abstain from voting all Trust Shares in the same proportions as the RSUs in respect of which it has received voting instructions from current employees who have received RSU awards that may be paid from the Incentive Plans Trust (\"Current Participants\"). As of the Record Date, 100,333,686 Trust Shares (representing 18.2% of the votes entitled to be cast at the Annual Meeting) were held by the Incentive Plans Trust and 145,343,551 of such RSUs were held by Current Participants., 21244=New York, New York March 5, 2008, 685174=The Plan shall be administered by the Compensation and Benefits Committee of the Board of Directors (the \"Committee\"), as such committee is from time to time constituted. The Committee may delegate its duties and powers in whole or in part (i) to any subcommittee thereof consisting solely of at least two \"outside directors,\" as defined under Section 162(m) of the Internal Revenue Code of 1986, as amended (the \"Code\"), or (ii) to the extent consistent with Section 162(m) of the Code, to any other individual or individuals., 389585=The Firm previously established deferred compensation plans that allowed certain employees to voluntarily defer a portion of their cash compensation. Messrs. Fuld and Gregory participated in the Executive and Select Employees Plan (\"ESEP\"), which was established in 1985, and Mr. Fuld participated in the Lehman Brothers Kuhn Loeb Deferred Compensation Plans (\"KLDCP\"), which were established in 1977 and 1980. These plans were frozen as to future deferrals in the mid-1980's., 45865=FOR the ratification of the selection by the Audit Committee of the Board of Directors of Ernst & Young LLP as the Company's independent registered public accounting firm for the 2008 fiscal year;, 243893=The following tables show, for the year ended November 30, 2007, the compensation of the Chairman and Chief Executive Officer, the Chief Financial Officer, and the Company's three other most highly compensated executive officers in Fiscal 2007., 226532=The Compensation Committee's evaluation of the performance of Mr. Fuld included a review of the materials described above in addition to analyses of historic and projected CEO compensation at peer firms prepared and presented by Johnson Associates and Mr. Fuld's historical compensation levels. In evaluating the performance of Mr. Fuld, the Compensation Committee was strongly influenced by the Company's financial performance in Fiscal 2007, his role in leading the Company through the challenging market environment, and orchestrating the Company's strategic direction and objectives including the continued diversification of the Company across businesses, regions and products which was important to the Company's financial performance in Fiscal 2007., 16637=The 2008 Annual Meeting of Stockholders of Lehman Brothers Holdings Inc. (the \"Company\") will be held on Tuesday, April 15, 2008, at 10:30 a.m. (New York time) at the Company's global headquarters, 745 Seventh Avenue, New York, New York 10019, on the Concourse Level in the Allan S. Kaplan Auditorium, to:, 503713=The American Jobs Creation Act of 2004 introduced a new section of the Code (Section 409A) covering certain nonqualified deferred compensation arrangements. Section 409A generally establishes new rules that must be followed with respect to covered deferred compensation arrangements in order to avoid the imposition of an additional 20% tax (plus interest) upon the service provider who is entitled to receive the deferred compensation. Certain Awards that may be granted under the 2005 SIP may constitute \"deferred compensation\" within the meaning of and subject to Section 409A. While the Compensation Committee intends to administer and operate the 2005 SIP and establish terms (or make required amendments) with respect to Awards subject to Section 409A in a manner that will avoid the imposition of additional taxation under Section 409A upon a participant, there can be no assurance that additional taxation under Section 409A will be avoided in all cases. In the event the Company is required to delay delivery of shares or any other payment under an Award in order to avoid the imposition of an additional tax under Section 409A, the Company will deliver such shares (or make such payment) on the first day that would not result in the participant incurring any tax liability under Section 409A. The Compensation Committee may amend the 2005 SIP and outstanding Awards to preserve the intended benefits of Awards granted under the 2005 SIP and to avoid the imposition of an additional tax under Section 409A of the Code., 46170=FOR the amendment of the Company's 2005 Stock Incentive Plan (the \"2005 SIP\");, 112236=The Nominating Committee held five meetings during Fiscal 2007., 240848=As discussed above, the Compensation Committee made its decisions concerning stock-based Fiscal 2007 compensation based on the grant date value of the awards for the fiscal year for which they are awarded, as shown in the table above, and not based on accounting expense for the fiscal year as required to be shown in the Summary Compensation Table. The table above has been included so that readers can understand more precisely the Compensation Committee's analysis, but it is not a substitute for the information provided in the compensation tables required by the SEC's disclosure rules and included below., 16380=Notice of 2008 Annual Meeting of Stockholders, 419197=In addition, in the ordinary course of business, the Firm from time to time engages in transactions on an arm's-length basis with persons and the affiliated entities of persons that may be deemed to own more than 5% of our Common Stock. During Fiscal 2007, Fidelity Management Trust Company (\"FMTC\") served as trustee of the Savings Plan and Fidelity Employer Services Company LLC (\"FESC\") provided services in connection with the U.S. Pension Plan. In addition, we generally require our employees in the U.S. to maintain their brokerage accounts with LBI or Fidelity Brokerage. FMTC, certain of the entities affiliated with FMTC, FESC and Fidelity Brokerage are subsidiaries of, or may be considered to be affiliated with, FMR, which became the beneficial owner of more than 5% of the Company's Common Stock during calendar 2007., 551790=Based on a review of such reports, and on written representations from reporting persons, the Company believes that all Section 16(a) filing requirements applicable to its Directors and executive officers were complied with during Fiscal 2007, except that a transfer of shares between two trusts, of which Mr. Fuld, 411897=Mr. Russo would also be entitled to full benefits under the SRP if he were terminated without cause or resigned for good reason within three years following a change in control. In that case, the total amount of Mr. Russo's equity awards subject to accelerated vesting and/or delivery would be $47,293,361, which is the amount in the preceding paragraph for termination without cause following a change in control plus his pension enhancements discussed under \"Pension Benefits\u0097Supplemental Retirement Plan\" above. The definition of \"change in control\" is included in the forms of equity award agreements and the SRP, which are incorporated by reference in the Company's 2007 Annual Report on Form 10-K., 47227=The Company's 2007 Annual Report to Stockholders is being distributed to Stockholders in connection with this solicitation. A paper copy (exclusive of exhibits) of the Company's 2007 Annual Report on Form 10-K as filed with the Securities and Exchange Commission (the \"SEC\") may be obtained without charge by writing to: Lehman Brothers Holdings Inc., 1271 Avenue of the Americas, New York, New York 10020, Attention: Corporate Secretary, or by contacting the Company through its web site at http://www.lehman.com/contactus/. The Company's 2007 Annual Report and 2007 Annual Report on Form 10-K are also accessible through the Lehman Brothers web site at http://www.lehman.com., 545203=Management uses the so-called \"hockey-stick\" chart to support the notion that \"the Earth's mean temperature has risen sharply in recent decades.\" [see Lehman's \"The Business of Climate Change: Challenges and Opportunities,\" p.6 (February 2007).], 566138=The 2008 Annual Meeting of Stockholders will be held at the Company's global headquarters, 745 Seventh Avenue, New York, New York 10019, on the Concourse Level in the Allan S. Kaplan Auditorium, between 49th and 50th Streets. The building is in the vicinity of several subway lines, and is also readily accessed by bus, taxicab or automobile. All persons wishing to be admitted must present photo identification., 476454=Description of the 2005 SIP (as Proposed to be Amended), 449279=Fees for Fiscal 2007 and Fiscal 2006, 444905=Certain types of transactions are deemed to be pre-approved in the Policy, to the extent such transactions are permitted by the Sarbanes-Oxley Act of 2002, Federal Reserve Board Regulation O and other applicable laws or regulations, including transactions in the ordinary course of business involving loans and other financial products and services provided by the Firm. Such products and services must be provided on substantially the same terms as those prevailing at the time for comparable financial products and services provided to unaffiliated third parties who are not employees of the Firm, provided that financial products and services provided to executive officers or their immediate family members may be provided on substantially the same terms as those extended to employees of the Firm generally. In addition, executive officers may invest in partnerships or other investment opportunities sponsored, or otherwise made available, by the Firm if the investment opportunity is offered to all qualified employees who are Vice Presidents or above at the Firm on the same terms as, or better than, those offered to the executive officers. Products and services provided to the Firm in the ordinary course of the Firm's business and on arm's-length terms by any person that is a beneficial owner of more than 5% of our Common Stock or an immediate family member of such person, and any transaction involving products and services provided to the Firm by a person pursuant to a contract in existence prior to the time it becomes known to the Firm that such person is a beneficial owner of more than 5% of our Common Stock or an immediate family member of such person, are also deemed to be pre-approved in the Policy., 415534=Directors determined that these investments do not constitute material relationships that would impair a Director's independence because no Director has made any commitment to any of such investment partnerships since August 2001 and none of the rights of Directors as limited partners in these investment partnerships are contingent in any way on their continued service as Directors., 111297=In May 2006, the Nominating Committee engaged Ridgeway Partners LLC, a third-party search firm to conduct a search to identify and attract potential director candidates. In the course of its engagement, Ridgeway Partners LLC has identified and provided background information about Mr. Grundhofer and other potential director candidates and continues to do so., 154014=Prior to May 1994, the Company maintained the Retirement Plan for Non-Management Directors which was a nonqualified retirement plan providing a limited annual retirement benefit for non-management Directors who had earned five or more years of service as defined in the plan. Participation in this plan was frozen on May 31, 1994. Any non-management Director who had, on such date, completed at least five years of service as a Director (determined in accordance with the plan) has vested benefits under the plan. Any individual who was a non-management Director on such date, but had not completed five years of service as of such date, acquired vested benefits under this plan at the time such individual completed such five years of service as a Director. Any individual who became a non-management Director after such date was ineligible to participate in this plan. Vested benefits under this plan are paid after a participant ceases to be a Director. Based upon years of service prior to May 1994, Mr. Berlind is entitled to $20,000 annually in equal quarterly payments, for seven years following retirement under this plan. Any such payments would cease upon death., 467387=The 2005 SIP is administered by the Compensation Committee, which is comprised of four independent Directors. The 2005 SIP provides for the granting of incentive and non-qualified stock options, stock appreciation rights and other stock-based awards, including restricted stock, RSUs and PSUs (collectively, \"Awards\"). The Compensation Committee has discretion to select the individuals to whom Awards will be granted and to determine the type, size and terms of each Award and has the authority to administer, construe and interpret the 2005 SIP. The 2005 SIP is primarily intended to provide broad-based equity compensation awards across all levels of the Firm. Approximately 20,000 employees were granted equity awards as a portion of their Fiscal 2007 compensation., 487127=The Compensation Committee may establish the performance objectives that must be attained in order for the Company to grant Other Stock-based Awards. Accordingly, unless the Compensation Committee determines at the time of grant not to qualify such an award as performance-based compensation under Section 162(m) of the Code, the performance objectives for such Other Stock-based Awards made under the 2005 SIP will be based upon one or more of the following criteria: (1) pre-tax income or net income; (2) earnings per share; (3) book value per share; (4) stock price; (5) return on equity; (6) expense management; (7) return on investment; (8) improvements in capitalization; (9) profitability of an identifiable business unit or product; (10) profit margins; (11) budget comparisons; (12) total return to stockholders; (13) net revenue; and (14) economic value added. The Compensation Committee must certify as to the attainment of the applicable performance goals prior to payment of any Other Stock-based Award, and may reduce the amount of any Other Stock-based Award. Subject to the provisions of the 2005 SIP, the Compensation Committee will have sole and absolute discretion to determine to whom and when such Other Stock-based Awards will be made, the number of shares of Common Stock to be awarded under (or otherwise related to) such Other Stock-based Awards, and all other terms and conditions of such Awards. The Compensation Committee will determine whether Other Stock-based Awards will be settled in cash, Common Stock or a combination of cash and Common Stock. The maximum amount of Other Stock-based Awards that may be granted during any fiscal year to any participant in the 2005 SIP will be (1) with respect to Other Stock-based Awards that are denominated or payable in Common Stock, four million shares of Common Stock, and (2) with respect to Other Stock-based Awards that are not denominated or payable in Common Stock, $50.0 million., 114968=The Board of Directors held eight meetings and acted by unanimous written consent two times during Fiscal 2007. During Fiscal 2007, each Director attended 75% or more of the aggregate of (a) the total number of meetings of the Board of Directors held and (b) the total number of meetings held by all Committees of the Board of Directors on which he or she served. Overall Director attendance at Board and Board Committee meetings during Fiscal 2007 was 96%. The number of meetings held by each Committee during Fiscal 2007 is set forth above., 466723=Upon the recommendation of the Compensation Committee, the Board of Directors has adopted an amendment (the \"Plan Amendment\") to the Company's 2005 SIP to increase the number of shares of Common Stock with respect to which awards may be granted under the plan by 50 million shares, subject to approval by the Stockholders at the Annual Meeting. The Board of Directors unanimously recommends that the Stockholders approve the Plan Amendment in order to permit the Company to continue to compensate employees, directors and consultants in part with stock-based awards rather than cash., 364088=The Outstanding Equity Awards at Fiscal 2007 Year-End table above excludes RSUs that are earned and vested, which include those awards for which the employee has completed any service required to be performed in exchange for the award, rather than the vesting schedule specified within the respective award agreements. Reporting awards in this manner is consistent with the treatment of the related compensation expense for financial statement reporting purposes under FAS 123R. Certain RSUs earned under the Company's Performance Stock Unit programs established in 1995, 1996, 1997 and 2000 are considered to have vested as a result of their performance conditions having been met. Awards that are earned and vested also include those awards that include a \"full career\" vesting feature. The Company's equity award programs include a definition of \"full career\" treatment, which allows eligible employees to receive awards with a \"full career\" vesting feature on the originally scheduled delivery date following voluntary termination or involuntary termination without cause, provided that they do not engage in competitive or detrimental activity. Accordingly, (1) any performance-based awards are reported in this Proxy Statement as vesting at the time the performance conditions have been met and (2) any awards for which the recipient is eligible for \"full career\" treatment under the terms of the award are reported in this Proxy Statement as vesting at the time of the award or, if later, the time when the recipient becomes eligible for \"full career\" treatment, even though any such awards may not be payable for some period of time and may be forfeitable if the recipient engages in competitive or detrimental activity or is involuntarily terminated with cause. Messrs. Fuld, Gregory and Russo are eligible for \"full career\" treatment, and Mr. O'Meara became eligible for \"full career\" treatment in 2006. In addition, certain RSU grants to Mr. O'Meara and Mr. Lowitt were not performance-based awards or subject to \"full career\" treatment, but have vested under the terms of these awards. The number of RSUs that are earned and vested and held by Messrs. Fuld, Gregory, Russo, O'Meara and Lowitt at November 30, 2007 are 4,605,884, 3,363,060, 785,467, 66,297 and 18,449, respectively., 473113=Broad-Based Equity Compensation Program.    The Company has one of the most broad-based equity programs among our competitors. In Fiscal 2007, close to 20,000 employees received equity awards as part of their annual total compensation. The Company believes that stock-based awards foster an employee-ownership culture that aligns the interests of its employees directly with those of its stockholders and encourages employees to be prudent risk managers and to work together to ensure the Firm's continued financial success over time., 116061=The following table shows, for the year ended November 30, 2007, the cash and other compensation of the non-management members of the Board of Directors for services in all capacities., 565826=DIRECTIONS TO THE LEHMAN BROTHERS HOLDINGS INC. 2008 ANNUAL MEETING OF STOCKHOLDERS, 212763=As noted above, the elements of compensation considered by the Compensation Committee as part of each executive officer's total annual compensation for Fiscal 2007 consisted of base salary and an Annual Incentive. Differences in total annual compensation levels among the executive officers are based on their individual roles and responsibilities within the Company and their individual performance. The amount of the Annual Incentive granted to each executive officer was determined by the Compensation Committee, limited by the Annual Incentive performance formulas established by the Compensation Committee at the beginning of the fiscal year, and influenced by performance evaluations for the executive officers which took place following the end of the fiscal year., 490993=In general, with respect to any Award granted on or prior to November 8, 2007, a \"Change in Control\" is deemed to occur when: (1) 20% or more of the combined voting power of the Company's voting securities is acquired in certain instances (whether through a tender offer, merger, or otherwise); (2) individuals who, as of the effective date of the 2005 SIP, are members of the Board of Directors or whose election or nomination is approved by a vote of at least two-thirds of such initial directors (the \"Incumbent Board\") cease, subject to certain exceptions, to constitute at least a majority of the Board of Directors; (3) a merger, consolidation, recapitalization or reorganization involving the Company occurs, whereby the stockholders immediately prior to such transaction cease to hold at least 50% of the combined voting power of the outstanding voting securities of the corporation resulting from such transaction, members of the Incumbent Board immediately prior to the execution of the agreement providing for such transaction cease to constitute at least a 50% of the board of directors of the resulting corporation, or a person or entity becomes the beneficial owner of 20% or more of the combined voting power of the resulting corporation; (4) a liquidation of the Company or a sale or other disposition of all or substantially all of the assets of the Company; or (5) any event occurs that would constitute a \"Change in Control\" within the meaning of such term with respect to any Award granted after November 8, 2007., 116316=2007 DIRECTOR COMPENSATION, 556301=In addition, in accordance with Article II, Section 9 of the Company's By-Laws, in order to be properly brought before the 2009 Annual Meeting by a stockholder, notice of a matter that is not included in the Company's proxy material must be received by the Company no earlier than December 16, 2008 and no later than January 15, 2009. The notice must set forth as to each matter that the stockholder proposes (1) a brief description of the business desired to be brought forth and the reasons for conducting such business at the Annual Meeting, (2) the name and address, as they appear on the Company's books, of the stockholder, (3) the number of shares of Common Stock beneficially owned by the stockholder, (4) any material interest of the stockholder in such business and (5) any other information relating to the stockholder or the proposal that is required to be disclosed pursuant to Regulation 14A under the Exchange Act., 408931=Death or Disability.    The terms and conditions of equity grants to the named executive officers provide for immediate vesting and delivery of awards in the event of death or disability. If Messrs. Fuld, Gregory, Russo, O'Meara or Lowitt were to have died or become disabled on November 30, 2007, the value of equity awards subject to accelerated vesting and/or delivery would have been $434,728,638, $311,932,271, $76,605,150, $9,301,020 and $7,984,047, respectively., 72237=Private Investor and Former President and Chief Executive Officer of Sotheby's Holdings.    Mr. Ainslie, a private investor, is the former President, Chief Executive Officer and a Director of Sotheby's Holdings. He was Chief Executive Officer of Sotheby's from 1984 to 1994. From 1980 to 1984, he was President and Chief Executive Officer of the National Trust for Historic Preservation. From 1975 to 1980, he was Chief Operating Officer of N-Ren Corp., a Cincinnati-based chemical manufacturer. From 1971 to 1975, he was President of Palmas Del Mar, a real estate development company. He began his career as an associate with McKinsey & Company. Mr. Ainslie is a Director of The St. Joe Company and Lehman Brothers Bank, FSB. He is a Trustee of Vanderbilt University and a member (and the Chairman Emeritus) of the Board of Directors of The Posse Foundation, Inc. Mr. Ainslie serves as a member of the Audit Committee., 458967=In addition to the services provided to the Firm described above, Ernst & Young LLP provided audit and tax services to certain private investment funds managed by the Firm. The aggregate fees (including related expenses) for these services provided by Ernst & Young LLP related to Fiscal 2007 and Fiscal 2006 were $9,316,000 and $7,166,000 for audit services and $6,621,000 and $5,340,000 for tax services, respectively, which consisted of the preparation and/or review of, and consultations with respect to, tax filings. Of such fees, $421,000 has been or is expected to be paid by the Firm related to Fiscal 2007 ($90,000 for audit services and $331,000 for tax services) and $435,000 was paid by the Firm related to Fiscal 2006 ($93,000 for audit services and $342,000 for tax services)., 415985=Mr. Hernandez's son was employed by the Firm as a 2007 summer analyst and is expected to return as a summer analyst in 2008. The Firm compensated Mr. Hernandez's son in line with his position and with respect to market standards. Based on the facts and circumstances, the Board of Directors determined that this is not a material relationship that would impair Mr. Hernandez's independence., 306547=OUTSTANDING EQUITY AWARDS AT FISCAL 2007 YEAR-END, 239549=The stock-based compensation values provided in the table above differ substantially from those shown in the Summary Compensation Table, which is prepared under the SEC's proxy statement disclosure rules. In the Summary Compensation Table, values reported for option awards and stock awards, including RSUs, are based on expense recognition for financial reporting purposes under FAS 123R. Under these accounting rules, the grant date fair value of equity awards is typically expensed over the required service period, which is usually the vesting period. For awards subject to \"full career\" treatment, however, the entire grant date fair value is expensed in the fiscal year for which it was earned. Since the Fiscal 2007 RSU awards to the executive officers were granted after the end of the fiscal year and require future service, no accounting expense for the awards was recognized during Fiscal 2007 and the values disclosed in the Summary Compensation Table do not reflect any portion of such awards. The values in the Summary Compensation Table reflect expense recognized in Fiscal 2007 for equity awards granted in prior fiscal years, including a portion of the Performance-Based RSUs granted in December 2006., 425191=amount of unreturned limited partner capital in all of the existing investment partnerships as of November 30, 2007., 214906=The Fiscal 2007 incentive formula for each executive officer was based on percentages of Pre-tax Income, which percentages decline as the amount of Pre-tax Income increases up to $5.3 billion (beyond which the, 94085=The Executive Committee consists of Mr. Fuld, who chairs the Executive Committee, and Mr. Macomber. The Executive Committee has the authority, in the intervals between meetings of the Board of Directors, to exercise all the authority of the Board of Directors, except for those matters that the Delaware General Corporation Law or the Company's Restated Certificate of Incorporation reserves to the full Board of Directors. The Executive Committee acted by unanimous written consent 16 times during the fiscal year ended November 30, 2007 (\"Fiscal 2007\")., 366686=The following table sets forth information concerning the exercise of options and vesting of RSUs vesting during Fiscal 2007 by each of the named executive officers., 409935=Change in Control.    Most awards to the named executive officers include change in control provisions, as described in the Compensation Discussion and Analysis section. In addition, most equity awards contain termination provisions that separately would affect the treatment of such awards in the event that an executive officer is terminated without cause following a change in control. The following values of equity awards subject to accelerated vesting and/or delivery upon a change in control event are based upon the closing market price of the Common Stock as of November 30, 2007., 79261=Rear Admiral, U.S. Navy (Retired).    Ms. Evans served as President and Chief Executive Officer of the American Red Cross from August 2002 to December 2005. She previously served as National Executive Director of Girl Scouts of the USA from January 1998 until July 2002. Ms. Evans was a career officer in the United States Navy, retiring as a Rear Admiral in January 1998. She served as superintendent of the Naval Postgraduate School in Monterey, California from 1995 to 1998 and headed the Navy's worldwide recruiting organization from 1993 to 1995. She is a director of Weight Watchers International, Inc., Huntsman Corporation and Office Depot, Inc. She also serves on the Advisory Boards for the Ladies Professional Golf Association and the Pew Partnership for Civic Change, a project of the Pew Charitable Trusts, and is a director of the Naval Academy Foundation and America's Development Foundation. Ms. Evans serves as the Chairman of the Nominating and Corporate Governance Committee and as a member of the Compensation and Benefits Committee and the Finance and Risk Committee., 547636=In February 2007 the Firm established the Council on Climate Change, which brings together clients, policy-makers, academics and non-governmental officials to facilitate constructive dialogue on policies that might be implemented to address climate change. In addition, in February 2007 the Firm published a report, The Business of Climate Change: Challenges and Opportunities, authored by the Firm's senior economic policy advisor, which was followed by a sequel in September 2007, The Business of Climate Change II. Among other things, these reports (both of which are publicly available at http://www.lehman.com/who/intcapital) examine how actions that have been or may be taken by regulators and others to address climate change are likely to impact businesses in various sectors and discuss some of the challenges and opportunities presented by such actions to businesses and investors. It is the Firm's view that legislative and other actions being taken by policy makers are altering the risk profile of some businesses and impacting the outlook for certain investments, and that both businesses and investors must take these legislative and other actions into account in their decision-making., 381540=2007 PENSION BENEFITS, 94826=The Audit Committee consists of Mr. Cruikshank, who chairs the Audit Committee, Mr. Ainslie, Mr. Berlind and Sir Christopher Gent, all of whom have been determined by the Board of Directors to be independent directors under NYSE corporate governance rules and SEC rules. The Board of Directors has determined that Mr. Cruikshank is an \"audit committee financial expert\" as defined under SEC rules. The Audit Committee operates under a written charter adopted by the Board of Directors, which is accessible through the Lehman Brothers web site at http://www.lehman.com/shareholder/corpgov. The Audit Committee assists the Board of Directors in fulfilling its oversight of the quality and integrity of the Company's financial statements and the Company's compliance with legal and regulatory requirements. The Audit Committee is responsible for retaining (subject to stockholder ratification) and, as necessary, terminating, the independent registered public accounting firm. The Audit Committee annually reviews the qualifications, performance and independence of the independent registered public accounting firm and the audit plan, fees and audit results, and pre-approves audit and non-audit services to be performed by the independent registered public accounting firm and related fees. The Audit Committee also oversees the performance of the Company's corporate audit and compliance functions. The Audit Committee held 11 meetings during Fiscal 2007., 366917=2007 OPTION EXERCISES AND STOCK VESTED, 489653=Adjustments Upon Certain Events.    Under the 2005 SIP, if there is any change in the outstanding shares of Common Stock by reason of any stock split, stock dividend, combination, subdivision or exchange of shares, recapitalization, merger, consolidation, reorganization or other extraordinary or unusual event, the Compensation Committee will direct that appropriate changes be made in the number or kind of securities that may be issued under the 2005 SIP and in the terms of outstanding Awards., 209054=In November 2007, the Compensation Committee amended the definition of a change in control for prospective equity awards to provide that a change in control would be deemed to occur upon the acquisition of at least 70% of the combined voting power of the then outstanding voting securities. Prior to this amendment, a change in control would have been deemed to occur upon the acquisition of 20% of the Company's voting securities. This amendment was made to enhance the strategic flexibility of the Company as well as to comply with the provisions of the new Section 409A of the Code. In addition, the, 567164=The Proxy Statement and Annual Report to Stockholders are available at http://www.lehman.com/ annual/2007., 156443=Chief Financial Officer. Ms. Callan has been the Chief Financial Officer and Global Controller of the Company since December 2007 and is an Executive Vice President of the Company and a member of the Firm's Executive Committee. From May 2006 through November 2007, Ms. Callan was responsible for heading Global Hedge Fund Coverage within the Firm's Investment Banking Division. Prior to that, she led the Firm's Global Finance Solutions Group and Global Finance Analytics Group within Investment Banking from 2003 to 2006. Ms. Callan joined the Firm in 1995 and was named a managing director in June 2000., 100963=The Compensation Committee held seven meetings and acted by unanimous written consent two times during Fiscal 2007., 81268=Chairman and Chief Executive Officer.    Mr. Fuld has been Chairman of the Board of Directors of the Company and LBI since April 1994 and Chief Executive Officer of the Company and LBI since November 1993. Mr. Fuld serves as the Chairman of the Executive Committee. Mr. Fuld was President and Chief Operating Officer of the Company and LBI from March 1993 to April 1994 and was Co-President and Co-Chief Operating Officer of both corporations from January 1993 to March 1993. He was President and Co-Chief Executive Officer of the Lehman Brothers Division of Shearson Lehman Brothers Inc. from August 1990 to March 1993. Mr. Fuld was a Vice Chairman of Shearson Lehman Brothers from August 1984 until 1990 and has been a Director of LBI since 1984. Mr. Fuld joined Lehman Brothers in 1969. Mr. Fuld serves on the Board of Directors of the Federal Reserve Bank of New York and is a member of the Executive Committee of the Board of Directors of The Partnership for New York City. He is a member of the International Business Council of the World Economic Forum and The Business Council. In addition, he serves on the Board of Trustees of Middlebury College and NewYork-Presbyterian Hospital, as well as on the Board of Directors of the Robin Hood Foundation., 549005=In the supporting statement for the Proposal, the Proponent states that the Firm's February 2007 The Business of Climate Change report is based on \"erroneous information.. . to support the notion that 'the Earth's mean temperature has risen sharply in recent decades,\"' and concludes that management should not \"undertak[e] action with corporate assets\" based on that information. The Board of Directors does not believe that it is either appropriate or desirable to permit the Proponent to police the content of the Firm's advice to its clients, or the analysis underlying management of the Firm's business generally., 763476=Approve an amendment to Lehman Brothers Holdings Inc. 2005 Stock Incentive Plan., 96901=The Compensation and Benefits Committee (the \"Compensation Committee\") consists of Mr. Akers, who chairs the Compensation Committee, Ms. Evans, Sir Christopher Gent and Mr. Macomber, all of whom are independent under NYSE corporate governance rules. Each of such directors is a \"non-employee director\" within the meaning of Rule 16b-3 under the Securities and Exchange Act of 1934, as amended (the \"Exchange Act\") and an \"outside director\" within the meaning of Section 162(m) of the Internal Revenue Code of 1986, as amended (the \"Code\"). The Compensation Committee operates under a written charter adopted by the Board of Directors which is accessible through the Lehman Brothers web site at http://www.lehman.com/shareholder/corpgov. The Compensation Committee has general oversight responsibility with respect to compensation and benefits programs and compensation of the Company's executives, including reviewing and approving compensation policies and practices, such as salary, cash incentive, RSUs, long-term incentive compensation and other programs, and grants under such plans. The Compensation Committee evaluates the performance of the Chief Executive Officer of the Company and other members of senior management and, based on such evaluation, reviews and approves the annual salary, bonus, share and option awards, other long-term incentives and other benefits to be paid to the Chief Executive Officer and such other members of senior management. The Compensation Committee also reviews and discusses the Compensation Discussion and Analysis with management and, if appropriate, recommends to the full Board of Directors that it be included in the Company's filings with the SEC. The Compensation Committee may delegate any or all of its responsibilities to a subcommittee of the Compensation Committee., 89743=President of Henry Kaufman & Company, Inc.    Dr. Kaufman has been President of Henry Kaufman & Company, Inc., an investment management and economic and financial consulting firm, since 1988. For the previous 26 years, he was with Salomon Brothers Inc., where he was a Managing Director, Member of the Executive Committee, and in charge of Salomon's four research departments. He was also a Vice Chairman of the parent company, Salomon Inc. Before joining Salomon Brothers, Dr. Kaufman was in commercial banking and served as an economist at the Federal Reserve Bank of New York. He is a Member (and the Chairman Emeritus) of the Board of Trustees of the Institute of International Education, a Member of the Board of Trustees of New York University, a Member (and the Chairman Emeritus) of the Board of Overseers of the Stern School of Business of New York University and a Member of the Board of Trustees of the Animal Medical Center. Dr. Kaufman is a Member of the International Advisory Committee of the Federal Reserve Bank of New York, a Member of the Advisory, 193335=The Company's 2007 compensation program was composed of the following elements:, 422937=The Company, either directly or through a subsidiary, is the general partner of these investment partnerships. After returns of capital to the partners, profits are generally distributed 90% (or more) to the limited partners and 10% (or less) to the general partner. In one of these investment partnerships, the general partner has made a preferred capital contribution equal to a multiple of the amount of capital contributed by the limited partners. In such partnership, after the amount of the general partner's preferred capital contribution, together with a fixed return thereon (which return varies from month to month and averaged 5.8% for Fiscal 2007), is distributed to the general partner, the limited partners' respective capital contributions are returned and then profits are generally distributed 90% to the limited partners and 10% to the general partner, which essentially provides \"leverage\" to the limited partners. Beginning in 2002, executive officers were no longer permitted to invest in such partnerships. Instead, the executive officers must invest in separate partnerships that invest on a parallel basis with, and have substantially the same terms as, the employee partnerships but do not include this leverage feature., 405720=The terms and conditions of certain equity awards to the named executive officers provide for accelerated vesting and/or delivery in the event of involuntary termination without cause, voluntary termination, change in control, death or disability. The values provided below reflect the value of currently outstanding equity awards held by the named executive officers in which either vesting or delivery would be accelerated if any such events had occurred on November 30, 2007, the last business day of the fiscal year, based on an assumed stock price of $62.63, the closing market price of our common stock on that date. Actual values can only be determined upon the occurrence of the event., 557924=In accordance with Article II, Section 10 of the Company's By-Laws, Stockholders of the Company who intend to nominate persons for election to the Board of Directors at the Company's 2009 Annual Meeting of Stockholders must give written notice to the Corporate Secretary of the Company at Corporate Secretary, Lehman Brothers Holdings Inc., 1271 Avenue of the Americas, New York, New York 10020 no earlier than December 16, 2008 and no later than January 15, 2009. The notice must set forth, as to each nominee, (1) the name, age, business address and residence address of the person, (2) the principal occupation or employment of the person, (3) the class and number of shares of capital stock of the Company, if any, which are beneficially owned by the person and (4) any other information relating to the person that is required to be disclosed in solicitations for proxies in election of directors pursuant to Regulation 14A under the Exchange Act, and as to such stockholder, (A) the name and record address of the stockholder and (B) the class and number of shares of capital stock of the Company which are beneficially owned by the stockholder., 197314=Performance-Based RSU Grants.    The Compensation Committee granted Performance-Based RSUs to, among others, Messrs. Fuld, Gregory and Russo in December 2006. Receipt of the Performance-Based RSUs was contingent on achieving a ten percent return on equity for Fiscal 2007 and also was subject to additional vesting requirements which are described in the narrative following the 2007 Grants of Plan-Based Awards table. The Performance-Based RSUs were designed as a long-term incentive opportunity, in addition to the Annual Incentive, to align the interests of the most senior executives with the financial goals of the Company and replaced grants of stock options as part of these executives' total annual compensation. The value of the Performance-Based RSUs granted to the executives was, 516672=The 2005 SIP, as amended, authorized the issuance of up to the total of:, 101948=The Finance and Risk Committee (the \"Finance Committee\") consists of Dr. Kaufman, who chairs the Finance Committee, Mr. Akers, Mr. Berlind, Ms. Evans and Mr. Hernandez. The Finance Committee reviews and advises the Board of Directors on the financial policies and practices of the Company, including risk management. The Finance Committee also periodically reviews, among other things, budget, capital and funding plans and recommends a dividend policy and Common Stock repurchase plan to the Board of Directors. The Finance Committee held two meetings during Fiscal 2007., 87830=Retired Chairman and Chief Executive Officer of Telemundo Group, Inc.    Mr. Hernandez is the retired Chairman and Chief Executive Officer of Telemundo Group, Inc., a Spanish-language television station company, where he served from August 1998 to December 2000. From March 1995 to August 1998, he served as President and Chief Executive Officer of Telemundo Group, Inc. Prior to that position, Mr. Hernandez was founder and President of Interspan Communications, a company engaged in a variety of services related to Spanish-language media. Mr. Hernandez is also a Director of MGM Mirage, The Ryland Group, Inc., Vail Resorts, Inc. and Wal-Mart Stores, Inc. In addition, Mr. Hernandez serves on advisory boards for Harvard University's David Rockefeller Center for Latin American Studies and Harvard Law School, as well as the board of Yale University's President's Council on International Activities. Mr. Hernandez serves as a member of the Finance and Risk Committee., 466547=PROPOSAL 3\u0097AMENDMENT TO THE 2005 STOCK INCENTIVE PLAN, 681446=Absent express provisions to the contrary, an Award under this Plan shall not be deemed compensation for purposes of computing benefits or contributions under any retirement plan of the Company or its Affiliates and shall not affect any benefits under any other benefit plan of any kind now or subsequently in effect under which the availability or amount of benefits is related to level of compensation. This Plan is not a \"Pension Plan\" or \"Welfare Plan\" under the Employee Retirement Income Security Act of 1974, as amended., 782527=Joseph Polizzotto, Thomas A. Russo and Jeffrey A. Welikson or each of them (with full power to act without the others and with full power of substitution) are hereby appointed attorneys and proxies to attend the Annual Meeting of Stockholders to be held on April 15, 2008, and any adjournment thereof, and to vote and act for the undersigned on the matters listed on the reverse side hereof, which are set forth in detail in the accompanying Proxy Statement., 761875=Ratify the selection by the Audit Committee of the Board of Directors of Ernst & Young LLP as the Company\u0092s independent registered public accounting firm for the 2008 fiscal year., 112617=The Board of Directors has adopted a policy of regularly scheduled executive sessions where non-management Directors will meet independent of management. The non-management Directors held five executive sessions during Fiscal 2007. The presiding Director at the executive sessions is Mr. Macomber., 406484=As discussed above, RSU awards that are eligible for \"full career\" treatment and certain RSUs earned under the Company's Performance Stock Unit programs established in 1995, 1996, 1997 and 2000 are considered to be vested for purposes of reporting in this Proxy Statement. The value of these RSUs as well as other vested RSUs that remain undelivered, are incorporated in the values below if their delivery would be accelerated. The values also incorporate the intrinsic value of stock options as of November 30, 2007 (that is, the (1) difference between the closing market price of our common stock on that date and the exercise price of the stock option times (2) the number of shares underlying the stock option) if their exercisability would be accelerated., 77652=Retired Chairman and Chief Executive Officer of Halliburton Company.    Mr. Cruikshank was the Chairman and Chief Executive Officer of Halliburton Company, a major petroleum industry service company, from 1989 to 1995, was President and Chief Executive Officer of Halliburton from 1983 to 1989, and served as a Director of Halliburton from 1977 to 1996. He joined Halliburton in 1969, and served in various senior accounting and finance positions before being named Chief Executive Officer. Mr. Cruikshank is a Director of LBI. Mr. Cruikshank serves as the Chairman of the Audit Committee and as a member of the Nominating and Corporate Governance Committee., 377958=Supplemental Retirement Plan.    The Company has adopted a nonqualified, noncontributory Supplemental Retirement Plan (the \"SRP\"), which is a defined benefit plan, covering Messrs. Fuld, Gregory, Russo and certain other executives. For Messrs. Fuld and Gregory, full benefits are payable if, upon retirement, they are at least age 60 and have completed at least five years of service, or if their age plus years of service equals or exceeds the sum of 85. For these individuals, the SRP provides for the payment beginning at age 60 of reduced benefits payable if, upon retirement, they have not satisfied the requirements for full benefits but are above age 45 and have completed five years of service. For Mr. Russo, who became an executive officer in Fiscal 2002, full benefits are payable if upon retirement he is at least age 65, and reduced benefits if he retires prior to age 65, payable beginning at age 65. Benefits are not payable in cases of termination by the Company for cause or if the participant engages in competitive or detrimental activity. The annual benefits payable in each of the 25 years following retirement at age 60 (age 65 in the case of Mr. Russo) or older are $1.25 million for Mr. Fuld, and $700,000 for each of Messrs. Gregory and Russo. As of November 30, 2007, Messrs. Fuld and Gregory have satisfied the requirements for full benefits. If Mr. Russo had retired on November 30, 2007, his reduced annual benefit payable in each of the 25 years following his reaching age 65 would be $655,789. In the event of a change in control, participants are considered to have met the eligibility for full benefits if the participant is terminated without cause or resigns for good reason within three years following a change in control. For Mr. Russo, if such a termination occurred on November 30, 2007 following a change in control, the present value of the increase in his accrued benefit to the full benefit would be equal to $1,091,728., 474891=Stockholder approval of the Plan Amendment is unanimously recommended by the Board in order to permit the Firm to continue to provide compensation using stock-based awards. The Board believes that approval of the Plan Amendment will allow the Company to continue recruiting, retaining, and motivating employees and Directors of the Company and its subsidiaries whose performance is critical to the continued financial success of the Firm. If the Plan Amendment is approved, the Company expects to have sufficient shares under the 2005 SIP to cover stock-based awards until 2009, including awards for fiscal year 2008. The Company expects to seek authorization for additional shares from stockholders annually., 225796=The Compensation Committee determined the Annual Incentive award for Mr. Fuld in two separate private sessions, and in consultation with the other non-management Directors. The equity portion of his Annual Incentive was determined at the Compensation Committee's December 2007 meeting, to provide the same grant date stock price for all equity awards to executive officers. The cash portion of his Annual Incentive was determined at the Compensation Committee's January 2008 meeting, so that the Compensation Committee would have the benefit of additional information regarding year-end performance of the Company and its performance relative to the peer companies., 213600=Base Salary.    While reviewed periodically, the base salaries of the executive officers were not increased in Fiscal 2007. At the Company, base salaries are determined by guidelines that are tied to an employee's function and title., 159456=President and Chief Operating Officer. Mr. Gregory has been President and Chief Operating Officer of the Company since May 2004 and is a member of the Firm's Executive Committee. From May 2002 until May 2004, Mr. Gregory was the Firm's Co-Chief Operating Officer. From April 2000 until May 2002, Mr. Gregory was the Firm's Chief Administrative Officer, and from 1996 to April 2000, Mr. Gregory was Head of the Firm's Global Equities Division, in charge of the overall equities business. From 1991 to 1996,, 237704=RSUs representing the equity award portion of the Annual Incentives were granted on December 7, 2007, after the end of Fiscal 2007. Messrs. Fuld, Gregory, Russo, O'Meara and Lowitt were granted 551,441.63, 456,908.78, 141,799.28, 104,661.37 and 104,661.37 RSUs, respectively. Since these grants occurred during Fiscal 2008, they will not be reflected in the Grants of Plan-Based Awards table until next year. The cash portions of the Annual Incentives were paid in January 2008 and are reported in the Summary Compensation Table in the column headed \"Non-Equity Incentive Plan Compensation.\", 543297=\"RESOLVED: The shareholders request that the Board of Directors prepare by October 2008, at reasonable expense and omitting proprietary information, an Environmental Sustainability Report. The report may include:, 38817=Proxy Statement March 5, 2008, 524643=The Board of Directors originally adopted the 1996 Short-Term Executive Compensation Plan (the \"1996 STEP\") on January 30, 1996, subject to approval by the Stockholders. The Stockholders approved the 1996 STEP on April 10, 1996 and re-approved it on April 8, 2003 and the Compensation Committee has granted bonuses to the Firm's employees thereunder. However, in order to meet the requirements for the continuing deductibility of payments under Section 162(m) of the Code, the Compensation Committee has determined that it is in the best interest of the Firm to resubmit the plan to Stockholders of the Company for their approval. The terms of the plan, as amended (the \"Executive Incentive Compensation Plan\", or \"EICP\"), are outlined below, but the outline is qualified in its entirety by reference to the full text of the EICP itself, which is attached hereto as Appendix C. We have also separately described the amendments to the plan that the Compensation Committee has approved., 390157=2007 NONQUALIFIED DEFERRED COMPENSATION, 164844=The following table sets forth beneficial ownership information as of January 31, 2008 with respect to the Common Stock for each current Director and nominee for Director, each executive officer named in the tables set forth under \"Compensation of Executive Officers\" below and all current Directors and executive officers as a group. Except as described below, each of the persons listed below has sole voting and investment power with respect to the shares shown. None of the Directors or executive officers beneficially owned any of the Company's other outstanding equity securities as of January 31, 2008.}",
    "lastModified": "Wed, 05 Mar 2008 21:44:14 GMT",
    "textBeforeTable": "The following table sets forth beneficial ownership information as of January 31, 2008 with respect to the Common Stock for each current Director and nominee for Director, each executive officer named in the tables set forth under \"Compensation of Executive Officers\" below and all current Directors and executive officers as a group. Except as described below, each of the persons listed below has sole voting and investment power with respect to the shares shown. None of the Directors or executive officers beneficially owned any of the Company's other outstanding equity securities as of January 31, 2008. SECURITY OWNERSHIP OF DIRECTORS AND EXECUTIVE OFFICERS 17 Chief Legal Officer. Mr. Russo has been Chief Legal Officer of the Company since 1993 and is an Executive Vice President of the Company and a member of and counsel to the Firm's Executive Committee. He has been a Vice Chairman of LBI since July 1999. Mr. Russo joined the Firm in 1993; prior to that, Mr. Russo was a partner at the Wall Street law firm of Cadwalader, Wickersham & Taft and a member of its Management Committee. Mr. Russo is the Treasurer and a member of the Executive Committee of the National Board of Trustees of the March of Dimes and Vice",
    "textAfterTable": "* Less than one percent. (a) Amounts include vested and unvested RSUs. RSUs are convertible on a one-for-one basis into shares of Common Stock, but cannot be sold or transferred until converted to Common Stock and, with respect to each person identified in the table, are not convertible within 60 days following January 31, 2008. A portion of the vested RSUs held by the executive officers are subject to forfeiture for detrimental or competitive activity. Nonetheless, an executive officer who holds RSUs will be entitled to direct the Incentive Plans Trustee to vote a number of Trust Shares that is proportionate to the number of RSUs held irrespective of vesting; such number of Trust Shares will be calculated prior to the Annual Meeting and will be determined by the number of Trust Shares held by the Incentive Plans Trust on the Record Date and the extent to which Current Participants under the Incentive Plans return voting instructions to the Incentive Plans Trustee. See \"Introduction\u0097The Voting Stock.\" (b) Percentages are calculated in accordance with applicable SEC rules and are based on the number of shares issued and outstanding on January 31, 2008. (c) Includes 15,788 shares held in a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}