{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "CPCLO Order No."
        ],
        [
            "regulations.gov",
            "2015-06938",
            "",
            "004-2014"
        ]
    ],
    "pageTitle": "28 CFR 0.55 - General functions. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/28/0.55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 929912963,
    "recordOffset": 929868623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{238410=Title 28 published on 2014-07-01, 263152=The United States Parole Commission proposes to revise its rules for determining whether a prisoner who was sentenced under the D.C. Code and committed their offense before March 3, 1985 is suitable for release on parole. For these cases, the Commission will apply the regulations of the former District of Columbia Board of Parole that were effective before March 1985. Prisoners who are serving D.C. Code sentences and who committed their offense before March 3, 1985 would be considered under the proposed regulation at their next regularly scheduled hearing or, if they have not yet received a parole hearing, at their initial parole hearing., 173724=The Department of Justice (DOJ or Department), Federal Bureau of Prisons (BOP), is issuing a final rule for the modified system of records notice entitled “Inmate Central Records System” (ICRS) (JUSTICE/BOP-005). This system is being exempted from certain subsections of the Privacy Act of 1974 listed below for the reasons set forth in the following text., 225695=In this document, the Bureau of Prisons (Bureau) finalizes an interim rule published April 23, 2010, regarding inmate contact with the community which deleted two previous Bureau regulations that prohibited inmates from publishing under a byline, due to a recent court ruling invalidating Bureau regulation language containing this prohibition., 202740=The Department of Justice (Department) is issuing a final rule adopting national standards to prevent, detect, and respond to prison rape, as required by the Prison Rape Elimination Act of 2003 (PREA). In addition, the Department is requesting comment on one issue relating to staffing in juvenile facilities. Further discussion of the final rule is found in the Executive Summary., 207583=This final rule revises the Department of Justice regulations implementing the Americans with Disabilities Act to extend until January 31, 2013, the compliance date for the application of sections 242 and 1009 of the 2010 Americans with Disabilities Act (ADA) Standards for Accessible Design for existing pools and spas., 164978=The Department of Justice (DOJ or Department), Drug Enforcement Administration (DEA) is issuing a final rule for the recently modified system of records titled “Investigative Reporting and Filing System” (IRFS), JUSTICE/DEA-008. This system, which has already been exempted from particular subsections of the Privacy Act of 1974, is now being exempted further. Information in this system relates to law enforcement and intelligence matters, and for the reasons set forth in the rule these exemptions are necessary to avoid interference with the law enforcement, counterterrorism, and national security functions and responsibilities of the DEA., 89382=In accordance with section 4 of the Federal Civil Penalties Inflation Adjustment Act of 1990, as amended by the Debt Collection Improvement Act of 1996, the Department of Justice is adjusting for inflation the civil monetary penalties assessed or enforced by the Civil Rights Division., 58699=This joint interim final rule implements for all Federal award-making agencies the final guidance Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards (Uniform Guidance) published by the Office of Management and Budget (OMB) on December 26, 2013. This rule is necessary in order to incorporate into regulation and thus bring into effect the Uniform Guidance as required by OMB. Implementation of this guidance will reduce administrative burden and risk of waste, fraud, and abuse for the approximately $600 billion per year awarded in Federal financial assistance. The result will be more Federal dollars reprogrammed to support the mission, new entities able to compete and win awards, and ultimately a stronger framework to provide key services to American citizens and support the basic research that underpins the United States economy., 285534=The Department of Justice (the Department or DOJ) published a proposed rule in the Federal Register on March 26, 2015 (80 FR 15951), which added a new section to the Department's Privacy Act exemption regulations to exempt a DOJ-wide system of records from certain subsections of the Privacy Act. The heading of the document referenced “CPCLO Order No. 004-2014” when the Chief Privacy and Civil Liberties Order (CPCLO) number should read 004-2015. This document corrects the CPCLO number., 360810=The Department of Justice, through its component, EOUST, is issuing this notice of proposed rulemaking (Rule) pursuant to Section 602 of the Bankruptcy Abuse Prevention and Consumer Protection Act of 2005 (BAPCPA). The BAPCPA requires the Department to issue rules requiring uniform periodic reports (Periodic Reports) by debtors in possession or trustees in cases under chapter 11 of title 11. The BAPCPA requires the Rule to strike the best achievable practical balance between the reasonable needs of the public for information about the operational results of the Federal bankruptcy system, undue burden, and appropriate privacy concerns and safeguards., 158932=This final rule (“rule”) sets forth procedures and criteria United States Trustees shall use when determining whether applicants seeking to become and remain approved providers of a personal financial management instructional course (“providers”) satisfy all prerequisites of the United States Code, as implemented under this rule. Under the current law, individual debtors must participate in an instructional course concerning personal financial management (“instructional course” or “debtor education”) before receiving a discharge of debts. The current law enumerates mandatory prerequisites and minimum standards applicants seeking to become approved providers must meet. Under this rule, United States Trustees will approve applicants for inclusion on publicly available provider lists in one or more federal judicial districts if an applicant establishes it meets all the requirements of the United States Code, as implemented under this rule. After obtaining such approval, a provider shall be authorized to provide an instructional course in a federal judicial district during the time the provider remains approved. EOUST intends to add to its regulations governing debtor education providers, two new provisions not previously included in the proposed rule. The first provision will amend section 58.30(c)(5) to require providers to notify the United States Trustee of certain actions pursuant to 11 U.S.C. 111(g)(2) or other consumer protection statutes, such as an entry of judgment or mediation award, or the provider's entry into a settlement order, consent decree, or assurance of voluntary compliance. The second provision will amend section 58.33( i ) to require a provider to assist an individual with limited English proficiency by expeditiously directing the individual to a provider that can provide instruction in the language of the individual's choice. Because these provisions were not discussed in the proposed rule published on November 14, 2008, EOUST will publish another Notice of Proposed Rulemaking requesting public comment with respect to these two provisions., 79846=The United States Parole Commission is revising its rules describing the conditions of release set for persons on supervision and the procedures used to impose and modify the conditions. The revision is part of our ongoing effort to make our rules easier to understand for those persons affected by the rules and other interested persons and organizations. We are also adding new procedures for imposing special conditions for sex offenders, and filling a gap left by an earlier rule change in 2003 regarding the administrative appeals that may be filed by District of Columbia offenders on supervised release., 16050=This final rule amends Civil Directive 1-10, which sets forth the redelegation of authority by the Assistant Attorney General of the Civil Division to deputy assistant attorneys general, branch directors, heads of offices, and United States Attorneys. On May 21, 2015, the Attorney General signed Order No. 3532-2015 increasing the monetary thresholds for the authority of Assistant Attorneys General to compromise or close civil claims, and increasing the redelegation authority to the United States Attorneys with respect to accepting offers of compromise for affirmative claims. Pursuant to the Attorney General's order, the new rule increases the redelegated authority to Branch Directors, heads of offices, and United States Attorneys to close or compromise affirmative claims. Additionally, the new rule redelegates to United States Attorneys, directors, and attorneys-in-charge the authority to issue compulsory process, and makes a few “housekeeping” revisions., 97961=The Department of Justice is amending its regulations to extend the trial period during which the Director of the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) may exercise, for an additional one-year period following the effective date of this rule, the authority under the United States Code to seize and administratively forfeit property involved in controlled substance offenses. The Attorney General has determined that the trial period that ends on February 25, 2014, should be extended for another year to give ATF more time to refine its processes, fully hire and train all necessary staff, and further demonstrate the effectiveness of the delegation in the investigation of violent crimes involving firearms., 111706=The Department of Justice (the Department or DOJ) published a final rule in the Federal Register on November 21, 2013, which added a new section to the Department's Privacy Act exemption regulations to exempt two OCDETF systems of records from certain subsections of the Privacy Act. The final text of the rule incorrectly referred to exempted “subsections” of the Privacy Act as “paragraphs” of the new section. This document corrects the final rule by revising the new section., 235034=By this rule, the Department of Justice is extending the date for compliance with certain requirements in the 2010 Americans with Disabilities Act (ADA) Standards for Accessible Design (2010 Standards) that relate to provision of accessible entry and exit for swimming pools, wading pools, and spas. This final rule, based on a finding of good cause, changes the date for compliance from March 15, 2012, to May 21, 2012 in order to allow additional time to address misunderstandings regarding compliance with these ADA requirements. Some pool owners and operators believed that taking certain steps would always satisfy their obligations under the ADA when in fact those steps would not necessarily result in compliance with the ADA regulations., 120920=The Department of Justice (the Department or DOJ) amends its Privacy Act regulations for two Privacy Act systems of records previously entitled the “Drug Enforcement Task Force Evaluation and Reporting System,” JUSTICE/DAG-003, and the “Organized Crime Drug Enforcement Task Force Fusion Center and International Organized Crime Intelligence and Operations Center System,” JUSTICE/CRM-028. These amendments reflect a recent reorganization of the Department establishing the Executive Office for OCDETF as a separate DOJ component, and transferring responsibility for these systems from the Office of the Deputy Attorney General (ODAG) and the Criminal Division to this component. In light of this departmental reorganization, JUSTICE/DAG-003 has been renumbered to JUSTICE/OCDETF-001 and renamed as the “Organized Crime Drug Enforcement Task Forces Management Information System (OCDETF MIS),” and JUSTICE/CRM-028 has been renumbered to JUSTICE/OCDETF-002 while retaining the same name. When under the responsibility of ODAG and the Criminal Division, these systems were exempted from certain provisions of the Privacy Act of 1974 by exemptions placed in the Code of Federal Regulations (CFR) sections containing exemptions for ODAG's and the Criminal Division's Privacy Act systems. These amendments remove references to these systems from the CFR sections for ODAG and Criminal Division exemptions and add a new section for OCDETF exemptions, which continues comparable exemptions for these systems in order to avoid interference with the law enforcement functions and responsibilities of the Executive office for OCDETF., 152997=This final rule (“rule”) sets forth procedures and criteria United States Trustees shall use when determining whether applicants seeking to become and remain approved nonprofit budget and credit counseling agencies (“credit counseling agencies” or “agencies”) satisfy all prerequisites of the United States Code, as implemented under this rule. Under the current law, an individual may not be a debtor under title 11 of the United States Code, unless during the 180-day period preceding the date of filing a bankruptcy petition, the individual receives adequate counseling from a credit counseling agency that is approved by the United States Trustee. The current law enumerates mandatory prerequisites and minimum standards applicants seeking to become approved credit counseling agencies must meet. Under this rule, United States Trustees will approve applicants for inclusion on publicly available agency lists in one or more federal judicial districts if an applicant establishes it meets all the requirements of the United States Code, as implemented under this rule. After obtaining such approval, a credit counseling agency shall be authorized to provide credit counseling in a federal judicial district during the time the agency remains approved. EOUST intends to add to its regulations governing credit counseling agencies, two new provisions not previously included in the proposed rule on this subject. A new section 58.17(c)(11) will require agencies to notify the United States Trustee of certain actions pursuant to 11 U.S.C. 111(g)(2) or other consumer protection statutes, such as an entry of judgment or mediation award, or the agency's entry into a settlement order, consent decree, or assurance of voluntary compliance. The second provision will amend section 58.20(j) to require an agency to assist an individual with limited English proficiency by expeditiously directing the individual to an agency that can provide counseling in the language of the individual's choice. Because these provisions were not discussed in the proposed rule published on February 1, 2008, EOUST will publish another Notice of Proposed Rulemaking requesting public comment with respect to these two provisions., 323077=In this document, the Bureau of Prisons (Bureau) proposes to amend its rules on Good Conduct Time (GCT) and Literacy. The purpose of this proposed rule is to provide effective literacy programming alternatives to the General Educational Development (GED) program that more effectively meet the specialized needs of inmates. This will also have the added benefit of reducing lengthy waiting lists for the GED program. This proposed rule will exempt inmates from the “satisfactory progress” provision of the Violent Crime Control and Law Enforcement Act of 1994 (VCCLEA) and/or the Prison Litigation Reform Act of 1995 (PLRA) if they participate in an “authorized alternative adult literacy program.” The Bureau's Literacy Program rules, which currently contemplate only GED attainment, would also be revised to allow for “authorized alternative adult literacy programs.” This change means that inmates participating in “authorized alternative adult literacy programs” will not need to demonstrate satisfactory progress toward earning a GED credential to be considered for the full benefits of GCT. Other than the change regarding inmates in “authorized alternative adult literacy programs,” we propose no further substantive changes., 370513=On August 1, 2014, the Department of Justice published a Notice of Proposed Rulemaking (NPRM) in the Federal Register in order to propose amendments to its Americans with Disabilities Act title III regulation to require the provision of closed movie captioning and audio description to give persons with hearing and vision disabilities access to movies. The comment period is scheduled to close on September 30, 2014. The Department of Justice is extending the comment period until December 1, 2014 in order to provide additional time for the public to prepare comments., 242187=In this document, the Court Services and Offender Supervision Agency for the District of Columbia (CSOSA) is correcting the authority citation in a proposed rule published May 22, 2015, regarding amendments to its current rule regarding the conditions of release requirements for offenders under CSOSA supervision., 29669=This rule amends the Department's regulations under the Freedom of Information Act (“FOIA”). The regulations have been revised to update and streamline the language of several procedural provisions and to incorporate changes brought about by the amendments to the FOIA under the OPEN Government Act of 2007. Additionally, the regulations have been updated to reflect developments in the case law and to include current cost figures to be used in calculating and charging fees., 130920=This rule revises the United States Marshals Service fees to reflect current costs to the United States Marshals Service for service of process in federal court proceedings. A proposed rule with invitation to comment was published in the Federal Register on April 12,2013, at 78 FR 21862. Only one comment was received within the 60-day comment period and that comment supported adoption of the rule. Accordingly, the proposed rule is finalized without change., 187434=Consistent with Executive Order 13563, by this rule the Department of Justice (the Department) revises, consolidates, and updates its regulations regarding the seizure, forfeiture, and remission of assets. The rule recognizes that as of 2002 the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) is now part of the Department, and consolidates the regulations governing the seizure and administrative forfeiture of property by ATF with those of the Drug Enforcement Administration (DEA) and the Federal Bureau of Investigation (FBI). The rule also conforms the seizure and forfeiture regulations of ATF, DEA, FBI, and the Department's Criminal Division to address procedural changes necessitated by the Civil Asset Forfeiture Reform Act (CAFRA) of 2000. The rule allows ATF, DEA, and FBI to publish administrative forfeiture notices on an official Internet government Web site instead of in newspapers. Lastly, the rule updates the regulations to reflect current forfeiture practice and clarifies the existing regulations pertaining to the return of assets to victims through the remission process.}",
    "lastModified": "Mon, 13 Jul 2015 09:44:24 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38620 - Transfer of Offenders to Foreign Countries 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 * Only displaying the most recent 50 entries for Title 28. Please, view a Part for the full list of changes within that Part. For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 28. Title 28 published on . www.fdsys.gov. 0.55, see the List of CFR Sections Affected, which appears in the Finding Aids section of the printed volume and at Federal Register citations affecting § For Editorial Note: [Order No. 423-69, 34 FR 20388, Dec. 31, 1969] Upon request, certification under 18 U.S.C. 249, relating to hate crimes, in cases involving extraterritorial",
    "textAfterTable": "DEPARTMENT OF JUSTICE, Bureau of Prisons Final rule. This rule is effective on August 6, 2015. 28 CFR Part 527 Summary In this document, the Bureau of Prisons (Bureau) streamlines regulations on transferring offenders to foreign countries by eliminating language that constitutes agency guidance to staff. Guidance language will be retained in the relevant Bureau policy. 80 FR 38622 - Commutation of Sentence: Technical Change GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-16635 RIN 1120-AB54 BOP-1154-F DEPARTMENT OF JUSTICE, Bureau of Prisons Final rule. This rule is effective on August 6, 2015. 28 CFR Part 571 Summary This document finalizes a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}