{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "it's impossible to get into any building without a student id. guests are checked in and out strictly.",
            "i believe there's one sorority and one fraternity. they don't share housing, and i've heard they're mostly for networking with alumni .",
            "there are so many clubs and activities it's mind-boggling. i'll point out that despite the emerson stage shows be exclusive to theatre majors, there are a myriad of student performance groups.",
            "students who already know what they want to do. emerson has limited program options, but the depth of each program and the access to specific resources are unequaled.",
            "emerson is very generous with their financial aid, so don't get scared off by the sticker price. it's not uncommon for the emerson grant alone to cover half of that sticker price.",
            "emerson college is located in the middle of boston. the possibilities are endless: hang out in the common, check out the parks in jamaica plain, go ice skating at harvard, look at adorable seals at the aquarium, go to the rare book room in the boston public library and gawk at letters edgar allen poe wrote.",
            "the dining hall is open long hours and caters to vegans and people with allergies. emerson also has several other popular cafes that are covered by the meal plan.",
            "the dorms are very clean and spacious. i haven't had any problems with drugs on my floor.",
            "grade inflation is a problem, but my experience has been that i get out of each class what i put into it.",
            "there are no undecided students at emerson. the majors (writing literature and publishing, visual media arts, theatre studies, journalism, etc.) are pretty specific and focused, so they attract students who know what they want to do. emerson provides extensive training and awesome resources for a few specific things. if you're someone who wants a well-rounded liberal arts education, emerson probably isn't right for you.",
            "emerson provides unique, specific training in the arts of performance, writing, and film-making as well as communications. it's something of an art school and a vocational school, while still providing ba and bfa programs."
        ]
    ],
    "pageTitle": "Emerson College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Emerson-College/reviews?_escaped_fragment_=/show/55416",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888059515,
    "recordOffset": 887989846,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41462=It's all about the essay! Write a meaningful essay, an honest essay, and be careful with spelling and grammar., 209039=I visited Emerson on junior day 2013 and loved it. I am definitely going to apply, as should anybody else interested in film, writing, or communications. The location is great as well, basically touching the Boston Commons., 48955=Depending on the building and the individual, dorm life can be great. If you're trying to decide which building to live in, here's a breakdown of them: Little Building: Mostly freshman. Consists of most double, triple, and quad rooms. I believe there's one 6-person sing suite on every floor. Communal bathrooms. Older building; not the cleanest but livable. Also houses the dinning hall, C-Store (convenient store), gym, Cabaret, and many other Emerson offices. I believe there's either a laundry room on every floor or every other floor. (Don't quote me on that though). There's also a Dunkin Donuts downstairs that sometimes sets a bagel on fire, triggering fire alarms for the entire building. This building really is good for socializing as a first-year. There are lots of activities and friendly people. Piano Row: (My current building of living) Mostly freshmen and sophomores. All suite-style living (4 and 6 person). Common rooms (consisting of tv, sitting area, sink, stovetop and microwave) on every other floor. Holds the Max (150 Cafe), laundry room, gymnasium, a large multipurpose room, various meeting spaces for student orgs, and the student service center. Very clean building. I believe it opened as a dorm building in 2006. Colonial: Known as the 21+ dorm building. Holds mostly upperclassmen but is known to also house freshmen and sophomores on occasion. Only building with full kitchens (stove tops and ovens) in their common rooms. Very upscale and nice building. Hasn't been open very long, which makes it very clean. Only place where alcohol is allowed in dorm rooms (ONLY IF YOU'RE OVER 21 THOUGH!). Has laundry room and mail room. Paramount: Houses mostly performing arts students. Smallest dorm building on campus. Also the furthest away from the main Emerson campus. (far away means two blocks - yeah, we're spoiled). Paramount holds a theatre, multiple practice rooms and studios, classrooms, the Paramount Cafe (get the onion rings, they're delicious!), and Emstage's shop and paint studio. This building is recommended for performing arts students and people who don't mind a little extra walk to their classes. The building is very clean and well decorated. Their common rooms have nice kitchen areas as well as flat screen TVs and foosball tables., 276490=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 40 out of 40 people found this review useful. 1 of 54 Erika from Trainer, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Emerson College Reviews Emerson College › Massachusetts › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here College is going to be fun, no matter where you go. You're free for the first time. The advantage that Emerson College has over many other colleges is that it is right in the heart of Boston. There is always something to do. Although Emerson College is not a huge party school, there is Boston University, Boston College, Northeastern University and many others right around the area. Newbury St. is right around the corner; there is a movie theater right next to us; and there are lots of concerts! Am learning a lot Emerson College is filled with motivated and talented young individuals who strive for success. I never expected to learn as much as I did my first semester at college. As a broadcast journalism major, I have had the opportunity to get involved in my schools broadcasting organizations. These award-winning student run organizations include EIV news and The Emerson Channel. Both of these organizations have taught me how to work with cameras and gave me a better learning on how to report news. Login to rate or flag the reviews Girl from PA 06/29/2011 Reviewer is A current",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}