{
    "relation": [
        [
            "Patent application number",
            "20130137100",
            "20140051088"
        ],
        [
            "Description",
            "GENETICALLY MODIFIED BACTERIUM OF THE SPECIES LISTERIA MONOCYTOGENES - The present invention relates to a genetically modified bacterium of the species",
            "METHOD FOR LYSING CELLS - The present invention relates to a method for the lysis of cells, especially bacterial cells and the isolation of nucleic acids. The sample is treated with lysis solution that comprises at least one liquid that is not miscible with water and heated. Afterwards the mixture is cooled down and water is added so that after cooling a two phase system is generated. The nucleic acids can be found in the aqueous phase."
        ],
        [
            "Published",
            "05-30-2013",
            "02-20-2014"
        ]
    ],
    "pageTitle": "Fuchs, AT - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/fuchs-at-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437603815,
    "recordOffset": 437586850,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sabine Fuchs, Kirchstetten AT 11-10-2011 DEVICE FOR HOLDING WAFER SHAPED ARTICLES - A spin chuck for holding semiconductor wafers includes one or more damping mechanisms to limit the force with which chuck pins impact the wafer edge following wafer shift. The damping mechanism may be a linear or rotary dashpot. The dashpot or dashpots are mounted on a surface of the chuck body and include a control arm that contacts a common gear ring that in turn drives the chuck pins during radially inward and outward movement. 20110272874 Published Description Patent application number Roman Fuchs, Villach AT 09-19-2013 GROUP OF EXTERIOR MIRRORS - A system of exterior mirrors having a mirror head and a mirror foot, the system including a first mirror which is configured to rotate about and also move vertically along a first axis defined by a first drive for the first mirror, and a second mirror which is configured to rotate about a second axis defined by a second drive for the second mirror. 20130242423 Published Description Patent application number Reinhard Fuchs, Pischelsdorf AT //]]> BarDraw('2697262',['Patent applications by Paul Fuchs, Schalchen AT'],[[1,2,1]],['2008','2009','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2697262\" align=\"center\"></div> </div> <canvas id=\"bg2697262\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Paul Fuchs, Schalchen AT</p> <div class=\"bar2697262\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-13-2011</td>",
    "textAfterTable": "Thomas Fuchs, Graz AT Patent application number Description Published 20140094588 PROGNOSTIC AND THERAPEUTIC SIGNATURE FOR MALIGNANT MELANOMA - The present invention relates to a method of predicting the course of disease in a patient having a malignant melanoma, the method comprising determining in melanoma cells comprised in a sample obtained from said malignant melanoma the presence or amount of at least five biomarkers selected from the group comprising or consisting of MTAP, PTEN, Bax, Bcl-X, β-Catenin, CD20, Cox-2, CD49d and MLH1, wherein the absence or decreased amount of MTAP and β-Catenin and/or the presence or increased amount of PTEN, Bax, Bcl-X, CD20, Cox-2, CD49d and MLH1, is associated with a disadvantageous course of disease. 04-03-2014 Thomas Fuchs, Sinabelkirchen AT Patent application number Description Published 20090194195 Fuel Tank For Motor Vehicles With Filling Level Limiting Device - A fuel tank for vehicles has a filler tube and a filling level limiting device, with the filler tube comprising, in the interior of the fuel tank, a closing device which interacts with an actuating device which is composed of: 08-06-2009 20100224282 Filler head for a fuel tank having a protective device - In a tank system, a venting line ( 09-09-2010 Werner Fuchs, Assling AT Patent application number Description Published 20090198474 Method and apparatus for analysis and assessment",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}