{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Boston!",
            "MIT is unique in that it has a widespread cook for yourself culture. While many students have a meal plan, the majority do not.",
            "Every dorm at MIT has its own culture and identity. From the party dorm to the dorm for introverts to the dorm for hardcore engineer types, MIT has it all.",
            "MIT is arguably the hardest school academically in the country. Fortunately, for this reason, the first semester is taken on Pass/No record.",
            "Work as hard as you can at academics in high school, but also have fun: you can't write compelling essays without having experiences worth writing about.",
            "MIT is not only an amazing school for academics, it is also an amazing community. MIT is the place to go if you want to change the world. MIT has it all: strong academics, a strong community, an excellent city, amazing professors and resources, a helpful reputation, and a beautiful campus."
        ]
    ],
    "pageTitle": "Massachusetts Institute of Technology Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Massachusetts-Institute-of-Technology/reviews?_escaped_fragment_=/show/101779",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914961375,
    "recordOffset": 914900485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54176=mit is a school that takes 1000 of the best students of the world and combines them in a place that glows with creativity. this is easily the number one or at least one of the best universities when it comes to a career in engineering or science. the staff and students are both a tremendous intellectual, cooperative community that has an extreme passion for whatever they choose to study here., 226436=For Campus Preview Weekend in April, East Campus hosts an annual piano drop. They basically drop a grand piano from the roof of EC for no other reason than because it's cool. Also, see if you can find the hacker's lair. It's in the bowels of the MIT tunnels and rather difficult to find., 268886=© 2015, Cappex.com, LLC, 112420=We have campus police that patrol the campus but it is overall pretty safe. Also, we have shuttles running up to 3:30 am around campus so that students don't have to walk around in he dark., 42162=The Wall Street Journal places MIT as number one in the rankings for best return on investment in 2010: http://blogs.wsj.com/economics/2010/06/30/top-20-colleges-that-offer-best-return-on-investment/ In addition, MIT has recently been ranked #1 worldwide in terms of an overall university by QS: http://www.topuniversities.com/university-rankings/world-university-rankings/2012 MIT has a pretty good financial aid system; however, I have heard of some not being able to afford to attend MIT and that they were offered better packages at other schools. IMO, the MIT degree is well worth the price. MIT students can be found with jobs from top companies with a good starting salary right out of graduation, and generally have high placement rates for graduate or medical schools., 134315=I studied 6.002x taught by Professor Agarwal in the Spring of 2012. This pilot course, exclusively online, opened up a world of challenging and rewarding coursework for me through MIT's OpenCourseware and other online platforms for higher education, namely Coursera.org and Udacity offering many courses from Physics to Finance from a dozen reputable intitutions across the country. My study with MIT was the most difficult and rewarding of my academic achievmenets., 131933=MIT is offering this course for free and is repeating this course again this September., 2139=From day one MIT will feel like home. Orientation acquaints Freshman with MIT and eases qualms. For the majority of September, Freshmen are exalted to celebrity status. After follows hundreds of hours of work yet because the student body is overrun with brilliance, the standard is perfection. Despite cryptic Math problems and accursed Physics tests, MIT draws one in like light to a fly. Making it through the fire on Graduation, you will have inevitably made lasting memories and friendships., 40281=There are over 25 fraternities and 6 sororities on campus; about half of the guys and 1/3 of the girls participate in Greek life at MIT. It's pretty different here than most other colleges - while some fraternities and sororities may be seen as the more stereotypical frat or sorority than others, MIT Greek life is definitely NOT what you might see on that show Greek or in Animal House. Definitely not. It's more than just a social group - it's a support system and a second home away from home. http://www.bestcollegesonline.com/blog/2012/09/04/10-colleges-that-get-greek-life-right/}",
    "textBeforeTable": "08/19/2009 Reviewer is A current student here. 88 out of 88 people found this review useful. 1 of 67 Aaron from Farmington Hills, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Naomi from Jonesboro, GA 07/11/2009 Reviewer is A current student here. 75 out of 85 people found this review useful. 2 of 67 Categories Comments Great for these types of students Competitive, Focused, Technology-driven. Tips for prospective students Focus on being a well-rounded student, along with good standardized test scores and a decent GPA. MIT does not focus solely on SAT/ACT scores; being involved in extra-curricular activities and volunteering in your community also play a large part in the application process. Also, remember to take your SAT Subject Tests early in Math and Science in order to apply to MIT. SAT Subject Tests are required to apply to MIT. Login to rate or flag the reviews Hannah from CT 08/24/2009 Reviewer is A current student here. 43 out of 43 people found this review useful. 3 of 67",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}