{
    "relation": [
        [
            "Household income",
            "100-150 percent of FPL",
            "150-200 percent of FPL",
            "200-250 percent of FPL"
        ],
        [
            "Silver plan variation AV",
            "Plan Variation 94 percent",
            "Plan Variation 87 percent",
            "Plan Variation 73 percent"
        ],
        [
            "Desired metal tier",
            "Platinum.",
            "Gold.",
            "Silver."
        ]
    ],
    "pageTitle": "Federal Register | Patient Protection and Affordable Care Act; HHS Notice of Benefit and Payment Parameters for 2014",
    "title": "Table 22—Desired Metal Tier for Silver Plan Variation AV Back to Top",
    "url": "https://www.federalregister.gov/articles/2013/03/11/2013-04902/patient-protection-and-affordable-care-act-hhs-notice-of-benefit-and-payment-parameters-for-2014",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913009327,
    "recordOffset": 912794138,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27194=A Notice by the Reclamation Bureau on 07/31/2015, 8537=The Draft Environmental Impact Statement implementing the 2008 U.S. Fish and Wildlife Service Biological Opinion and the 2009 National Marine Fisheries Service Biological Opinion is ready for public review and comment.}",
    "TableContextTimeStampAfterTable": "{160218=Because of the unique timing issues for approving a State-operated risk adjustment program, we proposed a transitional policy for benefit year 2014. We proposed not to require that a State-operated risk adjustment program receive approval for benefit year 2014. Instead, we proposed a transitional, consultative process that would commence shortly after the provisions of this final rule are effective. We are finalizing these provisions as proposed., 592967=Response: We determined HHS's total costs for administering reinsurance on behalf of States by examining HHS's contract costs of operating reinsurance. These contracts cover collections, payments, account management, data collection, program integrity, operational and fraud analytics, stakeholder training, and operational support. We did not include the cost of Federal personnel. We divided HHS's projected total costs for administering reinsurance on behalf of States by the expected enrollment in health insurance plans and self-insured group health plans. We anticipate that the total cost for HHS to operate reinsurance on behalf of States for the 2014 benefit year will be $20.3 million, or $0.11 per capita per year., 832741=However, we proposed in § 156.440(a) that the provisions not apply to catastrophic plans because section 36B(c)(3)(A) of the Code defines a QHP to exclude catastrophic plans—a definition that also applies to section 1402 of the Affordable Care Act, by means of section 1402(f)(1) of the Affordable Care Act. Further, eligibility for cost-sharing reductions is tied to a “coverage month with respect to which a premium tax credit is paid,” which would exclude months during which the individual is enrolled in a catastrophic health plan. Therefore, we proposed that enrollment in a catastrophic plan precludes eligibility for cost-sharing reductions., 142034=A proposed regulation relating to the health insurance premium tax credit was published by the Department of the Treasury in the Federal Register on August 17, 2011 (76 FR 50931). A final rule relating to the health insurance premium tax credit was published by the Department of the Treasury in the Federal Register on May 23, 2012 (77 FR 30377, to be codified at 26 CFR parts 1 and 602)., 177708=In the proposed rule, we proposed to use the authority in section 1343(b) of the Affordable Care Act to “establish criteria and methods to be used in carrying out * * * risk adjustment activities” for plans not subject to insurance market reforms at § 147.102 (fair health insurance premiums), § 147.104 (guaranteed availability of coverage, subject to the student health insurance provisions at § 147.145), § 147.106 (guaranteed renewability of coverage, subject to the student health insurance provisions at § 147.145), § 156.80 (single risk pool), and subpart B of part 156 (essential health benefits package). We stated that because plans not subject to these market reform rules are able to effectively minimize actuarial risk, we believe these plans would have uniform and virtually zero actuarial risk. We proposed to treat these plans separately, such that these plans would not be subject to risk adjustment charges and would not receive risk adjustment payments. Also, these plans would not be subject to the issuer requirements described in subparts G and H of part 153. We noted that plans offering coverage through policies issued in 2013 and subject to these requirements upon renewal would become subject to risk adjustment upon renewal, and would comply with the requirements established in subparts G and H of part 153 at that time., 584674=Response: We interpret section 1341(b)(3)(B)(ii) of the Affordable Care Act to authorize the collection of additional amounts for administrative expenses, including for HHS when HHS operates reinsurance on behalf of a State. We agree with the commenters on the need to keep these administrative expenses at a minimum, and intend to operate the program efficiently. We note that our estimate of administrative expenses—$20.3 million—represents approximately 0.2 percent of the reinsurance amounts to be collected for 2014, and the costs of Federal employees are not included in the national contribution rate., 404117== 0.108698 + 0 + (4.203378 + 1.093277 + 4.025404)/0.742262, 176002=Plans not subject to market reforms: Certain types of plans offering non-grandfathered health insurance coverage in the individual and small group markets would not be subject to the insurance market reforms in the Market Reform Rule and the EHB/AV Rule. In addition, plans providing benefits through health insurance policies that begin in 2013, with renewal dates in 2014, would not be subject to these requirements until renewal in 2014. The statute specifies that the risk adjustment program is to assess charges on non-grandfathered health insurance coverage in the individual and small group markets with less than average actuarial risk and to make payments to non-grandfathered health insurance coverage in these markets with higher than average actuarial risk. We stated that we interpret actuarial risk to mean predictable risk that the issuer has not been able to compensate for through exclusion or pricing. In the current market, plans are generally not subject to the insurance market reforms that begin in 2014 described at § 147.102 (fair health insurance premiums), § 147.104 (guaranteed availability of coverage, subject to the student health insurance provisions at § 147.145), § 147.106 (guaranteed renewability of coverage, subject to the student health insurance provisions at § 147.145), § 156.80 (single risk pool), and subpart B of part 156 (essential health benefits), and so are generally able to minimize actuarial risk by excluding certain conditions (for example, maternity coverage for women of child-bearing age) and denying coverage to those with certain high-risk conditions., 526897=Comment: One commenter requested that HHS permit a State to obtain a waiver from the reinsurance program set forth in section 1341 of the Affordable Care Act., 945391=Response: We conclude that, for purposes relating to the Exchange regulations, the definition of “full-time employee” and the definitions of “small employer” and “large employer” and their associated counting methods using a full-time equivalent (FTE) methodology should be effective for plan years beginning on or after January 1, 2016. During 2014 and 2015, when states have the discretion to choose whether the upper limit of small employer size is 50 or 100, we will exercise enforcement discretion, relying on State methods of determining group size and status as a full-time employee. However, in operating the FF-SHOPs, we do not have the same discretion; for plan years beginning on or after January 1, 2014 and in connection with open enrollment activities beginning October 1, 2013, we will use definitions of full-time employee, small employer, and large employer based on the FTE method of determining group size. Thus, prior to 2016, an FF-SHOP will use the State's choice of 50 or 100 employees, but will count those employees using the full-time equivalent method referenced in the definitions., 765706=As described in the proposed rule, for the 2014 benefit year, we analyzed the impact on the actuarial values of three model silver level QHPs of the reductions described in the Affordable Care Act to the estimated maximum annual limitation on cost sharing for self-only coverage for 2014 ($6,400). These model plans were meant to represent the broad sets of plan designs that we expect issuers to offer at the silver level of coverage through an Exchange. All three model plans meet the actuarial value requirements for silver health plans, and start with an annual limitation on cost sharing equal to the estimated maximum annual limitation on cost sharing ($6,400). The plan design features of the model QHPs were entered into the AV calculator developed by HHS., 139862=A proposed regulation was published in the Federal Register on July 15, 2011 (76 FR 41930) to implement health insurance premium stabilization policies in the Affordable Care Act. The Premium Stabilization Rule implementing the health insurance premium stabilization programs (that is, risk adjustment, reinsurance, and risk corridors) (Premium Stabilization Rule) (77 FR 17220) was published in the Federal Register on March 23, 2012. A white paper on risk adjustment concepts was published on September 12, 2011 (Risk Adjustment White Paper). A bulletin was published on May 1, 2012, outlining our intended approach to implementing risk adjustment when we are operating risk adjustment on behalf of a State (Risk Adjustment Bulletin). On May 7 and 8, 2012, we hosted a public meeting in which we discussed that approach (Risk Adjustment Spring Meeting)., 526076=Response: We interpret the definition of an applicable reinsurance entity in section 1341(c)(1) of the Affordable Care Act as a “not-for-profit organization,” the purpose of which is to stabilize premiums in the first three years of Exchange operation and the duties of which are to carry out the reinsurance program, to be broad enough to include a governmental entity. Accordingly, we believe that an applicable reinsurance entity is a not-for-profit organization that is exempt from taxation under Chapter 1 of the Internal Revenue Code of 1986, including a governmental entity and a quasi-governmental entity that was not created for and does not operate to make a profit, and carries out reinsurance functions under this part on behalf of the State., 619839=Response: We intend that the number of covered lives will be determined based on the first nine months of each of the 2014, 2015, and 2016 benefit years., 848414=The assignments to the plan variations would be subject to § 155.305(g)(3), which governs plan variation placement decisions when a single policy covers two or more individuals who are eligible for different levels of cost-sharing reductions. In the preamble, we also discussed an alternative approach to the provision of cost-sharing reductions for Indians. Rather than requiring QHP issuers to assign Indians to zero and limited cost sharing plan variations, QHP issuers would simply assign Indians to the standard plan (or as appropriate, silver plan variation), and waive the cost-sharing requirements, as appropriate. We proposed the approach first described above, but sought comments on which approach HHS should adopt beginning January 1, 2016. For the reasons described in the proposed rule, and considering the comments we received, we are finalizing the policy as proposed, though we continue to welcome comments on what approach HHS should adopt for benefit year beginning on or after January 1, 2016., 52574=Posted by Ben Jordi on June 22, 2015, 949713=In the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187), we proposed to modify the definition of premium revenue in § 158.130, the formula in § 158.221(c) for calculating an issuer's MLR, and the formula in § 158.240(c) for calculating an issuer's rebate if the MLR standard is not met, in the current MLR regulation to account for payments and receipts related to the premium stabilization programs. Specifically, we proposed to account for all premium stabilization amounts in a way that would not have a net impact on the adjusted earned premium used in calculating the MLR denominator and rebates. Additionally, we proposed to amend § 158.140(b) to include all premium stabilization amounts (positive or negative) as adjustments to incurred claims in calculating the MLR numerator as provided in § 158.221. We invited comment on this approach. We also indicated in the proposed rule that we considered adopting a methodology under which premium stabilization amounts would have a net impact on the MLR denominator, and invited public comment on that approach as well., 586766=Response: As described in the proposed rule, HHS developed the Affordable Care Act Health Insurance Model (ACAHIM), which estimates market enrollment in a manner that incorporates the effects of State and Federal policy choices and accounts for the behavior of individuals and employers. We used the ACAHIM, which was developed with reference to existing models such as those of the Congressional Budget Office and the Office of the Actuary, to characterize medical expenditures and enrollment choices across the 2014 marketplace. The ACAHIM is made up of integrated modules which predict the number and characteristics of market entrants and medical spending. The outputs of the ACAHIM, especially the estimated enrollment and expenditure distributions, were used to analyze estimated enrollment in the 2014 marketplace., 870630=In § 156.430(a)(2), we proposed the process for estimating the value of cost-sharing reductions to be provided under the limited cost sharing plan variation open to Indians regardless of household income. We proposed that QHP issuers have the option to forgo submitting an estimate of the value of these cost-sharing reductions if they believe the operational cost of developing the estimate is not worth the value of the advance payment. If a QHP issuer chooses to not submit an estimate, the issuer would provide the cost-sharing reductions as required, and would be reimbursed by HHS after the close of the benefit year, as proposed in § 156.430(c). If a QHP issuer does seek advance payments for the these cost-sharing reductions, the issuer would provide to the Exchange annually prior to the benefit year, for approval by HHS, an estimate and supporting documentation validating the estimate, of the per member per month dollar value of the cost-sharing reductions to be provided under the limited cost sharing plan variation of the QHP. Under our proposal, the estimate would be developed using the methodology specified by HHS in the applicable annual HHS notice of benefit and payment parameters. For the 2014 benefit year, we simply proposed that issuers submit a reasonable estimate of the value of the reductions, developed by a member of the American Academy of Actuaries in accordance with generally accepted actuarial principles and methodologies, and that the estimate should be no higher than the corresponding estimate for the zero cost sharing plan variation. We did not propose a standardized methodology because, unlike other plan variations, these cost-sharing reductions are to be provided for only a specific subset of providers, and the Affordable Care Act does not prescribe an AV for these reductions. As noted above, because the actuarial value calculator is based on a standard population, it will not have the functionality to generate an accurate AV for these plan variations., 161207=Response: We proposed the transitional policy based on the unique circumstances of 2014, and we do not anticipate extending it to future years. Although we are mindful of concerns that States may not be fully ready to operate a complex risk adjustment program for benefit year 2014, we note that each aspect of a State's operations (including data collection) must be performed in line with one of the Federally certified risk adjustment methodologies published in this final rule. Finally, we note that any State that begins operation of risk adjustment under this transitional process must obtain formal certification for benefit year 2015. We believe this process is sufficiently robust to ensure any State operating risk adjustment in 2014 will be prepared to do so., 431142=CHIA is an experienced custodian of protected health information. Since 1982, CHIA (as DHCFP) has served as the repository for the State's Hospital Discharge Data, Emergency Room Data and Outpatient Observation Data. CHIA has extensive claims processing experience as the operator of the State's Health Safety Net program. CHIA has passed two independent third party security audits—a HIPAA security audit and a SAS-70 Type 2 audit. In addition, PCI security audits are done quarterly on CHIA's web portal., 172376=Response: The Affordable Care Act establishes a risk adjustment program, and permits the Secretary to base this program on the criteria and methods used in Medicare Parts C and D. While we used criteria and methods from Medicare when appropriate, we also customized this methodology to best mitigate adverse selection based on our projections of the 2014 marketplace. Though we anticipate making future adjustments to the model, we seek to balance stakeholders' desire for a stable model in the initial years with introducing model improvements as additional data becomes available. We look forward to engaging with stakeholders throughout this process. We believe that this program, along with the other 2014 market reforms, will help ensure a stable risk pool., 588945=Response: The Department of Labor advised HHS upon its review of this final rule that paying reinsurance contributions would constitute a permissible expense of the plan for purposes of Title I of the ERISA because the payment is required by the plan under the Affordable Care Act (see, 77 FR 73198, fn 56). Questions seeking clarification regarding particular situations should be directed to the Department of Labor. See generally Advisory Opinion 2001-01A to Mr. Carl Stoney, Jr., available at www.dol.gov/ebsa (discussing settlor versus plan expenses). For a discussion regarding the tax status of reinsurance contributions pursuant to the Affordable Care Act, see the FAQ issued by the IRS (http://www.irs.gov/uac/Newsroom/ACA-Section-1341-Transitional-Reinsurance-Program-FAQs)., 583441=Response: Section 1341 of the Affordable Care Act directs health insurance issuers and self-insured group health plans to make reinsurance contributions. HHS has set forth a national per capita contribution rate for the 2014 benefit year which applies to all contributing entities, including self-insured group health plans., 138118=Starting in 2014, individuals and small businesses will be able to purchase qualified health plans—private health insurance that has been certified as meeting certain standards—through competitive marketplaces, called Exchanges. The Department of Health and Human Services, the Department of Labor, and the Department of the Treasury have been working in close coordination to release guidance related to qualified health plans and Exchanges in several phases. The Patient Protection and Affordable Care Act (Pub. L. 111-148) was enacted on March 23, 2010. The Health Care and Education Reconciliation Act (Pub. L. 111-152) was enacted on March 30, 2010. We refer to the two statutes collectively as the Affordable Care Act in this final rule. HHS published detail and parameters related to the risk adjustment, reinsurance, and risk corridors programs; cost-sharing reductions; user fees for Federally-facilitated Exchanges; advance payments of the premium tax credit; the Federally-facilitated Small Business Health Option Program; and the medical loss ratio program, in a December 7, 2012 Federal Register proposed rule entitled “Patient Protection and Affordable Care Act; HHS Notice of Benefit and Payment Parameters for 2014” (77 FR 73118)., 762873=Maximum Annual Limitation on Cost Sharing for Benefit Year 2014: As discussed in § 156.130(a) of the final EHB/AV Rule, the maximum annual limitation on cost sharing for 2014 is the dollar limit on cost sharing for high deductible health plans set by the IRS under section 223(c)(2)(A)(ii) of the Code for 2014. The IRS will publish this dollar limit in the spring of 2013. However, to allow time for HHS to analyze the impact of the reductions in the maximum annual limitation on cost sharing on health plan AV levels, and to allow issuers adequate time to develop the cost-sharing structures of their silver plan variations for submission during the QHP certification process, we proposed to estimate the dollar limit for 2014. Based on the proposed methodology, we estimated that the maximum annual limitation on cost sharing for self-only coverage for 2014 will be approximately $6,400 (the maximum annual limitation on cost sharing for other than self-only coverage for 2014 would be twice that amount, or $12,800). [26] This estimate was developed and proposed for purposes of setting the reduced maximum annual limitation on cost sharing for silver plan variations. Under section 1302(c)(1)(A) of the Affordable Care Act, cost sharing incurred under plans offering EHB packages, as defined in § 156.20, in 2014 cannot exceed the limit set by the IRS under section 223(c)(2)(A)(ii)(I) and (II) of the Code for the 2014 plan year. For a benefit year beginning after 2014, the maximum annual limitation on cost sharing will equal the dollar limit for 2014 benefit year adjusted by a premium adjustment percentage determined by HHS, under section 1302(c)(4) of the Affordable Care Act. We plan to propose the premium adjustment percentage applicable to the 2015 benefit year in the next HHS notice of benefit and payment parameters., 160714=Comment: One commenter supported the transitional process but urged that the transitional process not be applied to future years. Another commenter requested that HHS require approval in 2014, but make the approval determination on the basis of the proposed consultative process. Other commenters suggested that HHS not allow States to conduct risk adjustment until the agency could formally approve States, beginning in 2015., 662898=Response: The purpose of the reinsurance program is to stabilize premiums in the individual market beginning in 2014. If any funds remain after all requests for reinsurance payments are made for any benefit year, as required by the statute, HHS plans to use those funds for reinsurance payments in subsequent benefit years, furthering the goal of section 1341 of the Affordable Care Act., 596779=In § 153.405(c)(1), we proposed that within 15 days of submission of the annual enrollment count or by December 15, whichever is later, HHS would notify each contributing entity of the reinsurance contribution amounts to be paid based on the submitted annual enrollment count. We specified in § 153.405(c)(2) that a contributing entity remit contributions to HHS within 30 days after the date of the notification of contributions due for the applicable benefit year. The amount to be paid by the contributing entity would be based upon the notification received under § 153.405(c)(1)., 576403=As specified in § 153.220(c) of the Premium Stabilization Rule, HHS plans to publish in the annual HHS notice of benefit and payment parameters the national per capita reinsurance contribution rate for the upcoming benefit year. Section 1341(b)(3)(B)(iii) of the Affordable Care Act specifies the total contribution amounts to be collected from contributing entities (reinsurance pool) as $10 billion for 2014, $6 billion for 2015, and $4 billion for 2016, and sections 1341(b)(3)(B)(iv) and 1341(b)(4) of the Affordable Care Act direct the collection of funds for contribution to the U.S. Treasury in the amounts of $2 billion for 2014, $2 billion for 2015, and $1 billion for 2016. We sought comments on whether deferring the collection of the $2 billion in funds payable to the U.S. Treasury for 2014 until 2016 would be consistent with the statutory requirements described above, and whether there are other steps that could be taken to reduce the burden of these collections on contributing entities. Finally, section 1341(b)(3)(B)(ii) of the Affordable Care Act allows for the collection of additional amounts for administrative expenses. Taken together, these three components make up the total dollar amount to be collected from contributing entities for each of the three years of the reinsurance program under the national per capita contribution rate., 109513=Affordable Care ActThe Affordable Care Act of 2010 (which is the collective term for the Patient Protection and Affordable Care Act (Pub. L. 111-148) and the Health Care and Education Reconciliation Act (Pub. L. 111-152)), 964651=In the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187), we proposed to correct three errors in the December 1, 2010 interim final rule (75 FR 74864, as amended): the date by which issuers must define the formula they use for the blended rate adjustment, described in § 158.140(b)(5)(i); the date after which partially-credible issuers that consistently fail to meet the MLR standard will not be allowed to use a credibility adjustment, described in § 158.232(d); and the calculation of the per-person deductible described in § 158.232(c)(1)(i)., 805582=In this formula, the monthly expected allowed claims cost for a silver plan variation would equal one-twelfth of the annual expected allowed claims costs allocated to EHB, other than services described in § 156.280(d)(1), [28] for the standard silver plan, multiplied by a factor to account for the increased utilization that may occur under the specific plan variation due to the reduced cost-sharing requirements. As proposed in § 156.470, the QHP issuer would submit the expected allowed claims cost information to the Exchange annually. The Exchange would then review this estimate, and submit the approved information to HHS, as described in § 155.1030(b)(2) above, for use in the advance payment calculation. HHS would then multiply the monthly expected allowed claims cost by one of the following induced utilization factors, to arrive at the monthly expected allowed claims cost for the particular plan variation. We proposed the following induced utilization factors based on our analysis of the expected difference in expenditures for enrollees in QHPs of different actuarial values. For this analysis, we used the Actuarial Value Calculator, developed by HHS using the Health Intelligence Company, LLC (HIC) database from calendar year 2010. [29], 192326=Response: We believe that the commercial data set used for calibration is a reasonable approximation of the population that will be risk adjusted in 2014. The calibration data set was restricted to individuals with prescription drug coverage, mental health coverage, and medical coverage, which are part of the essential health benefits package that issuers will offer starting in 2014., 135509=Provisions addressing advance payments of the premium tax credit and cost-sharing reductions will help provide financial assistance for certain eligible individuals enrolled in QHPs through the Exchanges. This assistance will help many low-and moderate-income individuals and families obtain health insurance. For many people, cost sharing is a significant barrier to obtaining needed health care. [7] The availability of premium tax credits and cost-sharing reductions through Exchanges starting in 2014 will result in lower net premium rates for many people currently purchasing coverage in the individual market, and will encourage younger and healthier enrollees to enter the market, leading to a healthier risk pool and to reductions in premium rates for current policyholders. [8], 881485=We proposed to revise § 156.50(b) so that it would apply only to user fees to support State-based Exchanges. In § 156.50(c), we proposed that a participating issuer offering a plan through a FFE remit a user fee to HHS each month, in the time and manner established by HHS, equal to the product of the billable members enrolled through the Exchange in the plan offered by the issuer, and the monthly user fee rate specified in the annual HHS notice of benefit and payment parameters for the applicable benefit year. For the 2014 benefit year, we proposed a monthly user fee rate equal to 3.5 percent of the monthly premium charged by the issuer for a particular policy under the plan. We note that this user fee would apply to plans offered through FF-SHOPs, as well as individual market FFEs. We noted that additional guidance on user fee collection processes would be provided in the future. We anticipate collecting user fees by deducting the user fee from Federally-administered Exchange-related program payments. If a QHP issuer does not receive any Exchange-related program payments, the issuer would be invoiced for the user fee on a monthly basis., 582458=Response: Section 1341 of the Affordable Care Act states that the total contribution amounts to be collected from contributing entities for 2014 is $12 billion plus administrative expenses. We estimate that the $63 annual ($5.25 monthly) per capita contribution rate for benefit year 2014 will lead to collections in the statutory amount (plus administrative expenses) which we have concluded we have no regulatory authority to change., 958954=Response: We appreciate the comments regarding the proposed deadlines. As noted in the proposed rule, we recognize both consumers' and policyholders' interests in maintaining the dates for MLR reporting and rebates as close to the June 1 and August 1 dates as possible, as well as issuers' interests in having the necessary data to submit their annual MLR reports and having sufficient time to disburse any rebates. We believe that the proposed deadlines strike a balance between these competing interests. Therefore, this final rule extends the MLR and rebate deadlines in § 158.110(b), § 158.240(d), and § 158.241(a)(2) as proposed in the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187)., 743224=Under § 156.400, we proposed definitions for terms that are used throughout subpart E of part 156. These terms apply only to subpart E. Some of these definitions cross-reference definitions elsewhere in parts 155 or 156, including some definitions set forth in the final EHB/AV Rule; the terms “advance payments of the premium tax credit” and “Affordable Care Act” were proposed as defined by reference to § 155.20, and the term “maximum annual limitation on cost sharing” was proposed as defined by reference to § 156.130 of the final EHB/AV Rule. The terms “Federal poverty level or FPL” and “Indian” were proposed to be defined by reference to § 155.300(a). The term “de minimis variation” was proposed to be defined by reference to § 156.140(c)(1) of the final EHB/AV Rule. We also proposed to define “stand-alone dental plan” as a plan offered through an Exchange under § 155.1065., 748784=We proposed to define the “annual limitation on cost sharing” as the annual dollar limit on cost sharing required to be paid by an enrollee that is established by a particular QHP. We noted that this definition refers to the plan-specific cost-sharing parameters, while the defined term “maximum annual limitation on cost sharing” was proposed to refer to the uniform maximum that would apply to all QHPs (other than QHPs with cost-sharing reductions) for a particular year under standards at § 156.130. Finally, we proposed to define the “reduced maximum annual limitation on cost sharing” as the dollar value of the maximum annual limitation on cost sharing for a silver plan variation that remains after applying the reduction in the maximum annual limitation on cost sharing required by section 1402 of the Affordable Care Act, as announced in the annual HHS notice of benefit and payment parameters. The reduced maximum annual limitation on cost sharing for each silver plan variation for 2014 was proposed in the preamble for § 156.420 of this Payment Notice. The reduced maximum annual limitation applies, as does the maximum annual limitation, only with respect to cost sharing on EHB, and does not apply to cost sharing on services provided by out-of-network providers. See§ 156.20 (defining cost sharing) and § 156.130(c)., 761398=Response: As noted in the proposed rule, a reduction in the maximum annual limitation on cost sharing could require corresponding increases in other forms of cost sharing to maintain the statutorily required AV levels for individuals between 250-400 percent of FPL. Since we anticipate that most individuals would not be expected to reach the annual limitation on cost sharing, most individuals would be required to pay more up-front costs under such a cost-sharing structure. Furthermore, given the additional administrative burden required in designing and operating additional silver plan variations, we do not modify the proposed policy in this final rule. In addition, we do not believe we have the authority to provide individuals in this income range with an additional tax credit (beyond that provided for in sections 1401 and 1411 of the Affordable Care Act and section 36B of the Code)., 850624=A number of commenters recommended a different approach to address the potential increase in costs to be paid by Indian and non-Indian members who elect to enroll in different plans in order to take full advantage of the cost-sharing reductions available to them. These commenters recommended that if family members are enrolled in separate plan variations, the combination of the premiums be required to be no greater than the premium the family would pay if all members were enrolled in the same plan variation. They also recommended that the maximum out-of-pocket liability for the plan variation in which the non-Indians enrolled be set at a proportion of the maximum liability of a single family plan. These commenters also suggested that HHS should implement the alternative approach sooner than 2016., 676164=Response: An issuer of a risk adjustment covered plan or reinsurance eligible plan in a State in which HHS is operating the risk adjustment or reinsurance program would submit data for a benefit year by April 30 of the year following the applicable benefit year. For example, claims incurred in the 2014 benefit year must be submitted to HHS by April 30, 2015. The submission deadline (the latest date by which data can be provided for the applicable benefit year) will allow issuers the time necessary to process claims and submit data to their distributed data systems for HHS evaluation. The submission deadline of April 30 of the year following the applicable benefit year also permits HHS an appropriate timeline for payment calculations. However, as described in section III.G. of this final rule, claims submitted for the reinsurance program and encounter data submitted for the risk adjustment program must be for claims and encounters with discharge dates within the applicable benefit year. Use of the discharge date best ensures that services provided across benefit years will be considered in their entirety rather than being partially or fully excluded from consideration as a result of the data submission timing requirements., 140887=A bulletin was published on May 31, 2012, outlining our intended approach to making reinsurance payments to issuers when we are operating the reinsurance program on behalf of a State (Reinsurance Bulletin). HHS solicited comment on proposed operations for both reinsurance and risk adjustment when we are operating the program on behalf of a State., 805006=Methodology for Developing Estimate of Value of Cost-Sharing Reductions for Silver Plan Variations for 2014 Benefit Year., 918176=We have also concluded that effective implementation of employee choice in the federally-facilitated SHOP will not be possible in 2014 because of operational challenges noted by the commenters. Therefore, we are proposing in the Small Business Health Options Program proposed rule issued simultaneously with this final rule and published elsewhere in this issue of the Federal Register that: (1) The effective date of the employee choice requirements (§ 155.705(b)(2)) and the premium aggregation requirements (§ 155.705(b)(4)) will be January 1, 2015; (2) SHOP Exchanges may offer employee choice and perform premium aggregation for plan years beginning on or after January 1, 2014; and (3) an FF-SHOP will not offer employee choice and premium aggregation until plan years beginning on or after January 1, 2015., 959895=In the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187), we proposed to amend § 158.162(b)(1)(vii) to allow an issuer exempt from Federal income tax to deduct both State premium taxes and community benefit expenditures from earned premium in MLR and rebate calculations. The proposal limited the community benefit expenditure deduction available to a tax exempt issuer to the higher of (1) the highest premium tax rate in the State; or (2) 3 percent of premium, ensuring a level playing field. The proposed amendment would not change the treatment of State premium taxes and community benefit expenditures for those issuers that are not exempt from paying Federal income tax., 126800=Risk Corridors: The temporary risk corridors program permits the Federal government and QHPs to share in profits or losses resulting from inaccurate rate setting from 2014 through 2016. We are finalizing a change to the risk corridors calculation in which reinsurance contributions will be treated as a regulatory fee instead of an adjustment to allowable costs, and are replacing the term “taxes” in our proposed definition of taxes with the term “taxes and regulatory fees.” We are also finalizing provisions governing the treatment of profits and taxes and regulatory fees within the risk corridors calculation. This provision aligns the risk corridors calculation with the MLR calculation. We are also finalizing an annual schedule for the program and standards for data submissions., 985094=In sections § 153.210 through § 153.240 and § 153.310 of the proposed rule, we estimated the cost of collecting data for State-operated reinsurance and risk adjustment. Fewer than 10 States have told HHS that they will operate reinsurance or risk adjustment for the 2014 benefit year. Since collections from fewer than 10 persons are exempt from the PRA under 44 U.S.C. 3502(3)(A)(i), we are not seeking PRA approval for these information collection requirements. However, if more than nine States elect to operate risk adjustment in the future, we will seek PRA approval for these information collections., 152051=Response: We believe that States should have the flexibility to operate risk adjustment and reinsurance. Because of the publication date of this final rule, it is clear that a State will not have the notice necessary to publish a State notice of benefit and payment parameters by the deadline specified in the regulation—that is, March 1, 2013 for the 2014 benefit year. Thus, as described above, although we are not finalizing our proposal to amend the regulation, we are setting the deadline for 2014 only as the 30th day after publication of this final rule., 199394=Response: The HHS risk adjustment models were calibrated using age as of the last month of enrollment due to data limitations. To align with model calibration, an enrollee's age for risk score calculation will be the age as of the enrollee's last day of enrollment in a risk adjustment covered plan in the applicable benefit year will be used for enrollees in program operation. We are clarifying our approach to calculating the age of infants who are born in a benefit year but are not discharged until the following year. In such a case, the infant will be defined as age 0 for both benefit years. For example, if an infant is born in December of 2014 but has a discharge date of January 2015, the infant would be assigned age 0 for purposes of risk score calculation in benefit year 2014 and for the entire 2015 benefit year., 112252=PRAPaperwork Reduction Act of 1985, 430598=For background, the APCD data is hosted on servers located at the offices of the Commonwealth of Massachusetts Executive Office of Health and Human Services Center for Health Information and Analysis at Two Boylston Street, Boston, Massachusetts 02116. CMS has approved CHIA's application to receive and hold Medicare data under the newly created APCD category. In fact, CHIA was the first APCD to apply and be approved. CHIA is fully compliant with the CMS Data Use Agreement (See CMS DUA #20937)., 770920=We proposed specifications in § 156.420(a)(1) through (3) for the three silver plan variations, and proposed that they may deviate from the required AV levels by the de minimis variation for silver plan variations that is, 1 percentage point. We further proposed that issuers submit these silver plan variations annually to the Exchange for certification, prior to the benefit year. Under our proposal, silver plan variations would be approved annually even if the standard silver plan does not change, since the reduced maximum annual limitation on cost sharing may change annually due to the premium adjustment percentage. For the reasons described in the proposed rule and considering the comments received and discussed below, we are finalizing these provisions, including the reductions in the maximum limitation on cost sharing for silver plan variations offered in the 2014, as proposed with certain clarifications., 864727=In § 156.430(a)(1)(ii), we proposed that for each metal level QHP that an issuer offers, or intends to offer in the individual market on the Exchange, the issuer must provide to the Exchange annually prior to the benefit year, for approval by HHS, estimates, and supporting documentation validating the estimates, of the per member per month dollar value of cost-sharing reductions to be provided under the zero cost sharing plan variation. These estimates must be developed using the methodology specified by HHS in the applicable annual HHS notice of benefit and payment parameters. We proposed that issuers use the same methodology described above for estimating advance payments for the cost-sharing reductions provided under silver plan variations for estimating advance payments for the cost-sharing reductions provided under the zero cost sharing plan variation. This methodology would utilize data that QHP issuers submit for other requirements, such as § 156.420 and § 156.470. As a result, QHP issuers would not be required under the proposal to submit separate estimates or supporting documentation to receive advance payments in benefit year 2014 for the value of the cost-sharing reductions that would be provided under the zero cost sharing plan variation., 189351=Response: In 2014, 2013 diagnostic data for individuals enrolled in risk adjustment covered plans will not be available. We also anticipate that enrollees may move between plans, or between programs. A concurrent model is better able to handle changes in enrollment than a prospective model because individuals newly enrolling in health plans may not have prior data available that can be used in risk adjustment. We are therefore finalizing our approach to use a concurrent model. We plan to investigate the feasibility of transitioning to a prospective approach in the future., 127654=Advance Payments of the Premium Tax Credit: Sections 1401 and 1411 of the Affordable Care Act provide for advance payments of the premium tax credit for low- and moderate-income enrollees in a QHP through an Exchange. In this final rule, we are finalizing a number of standards governing the administration of this program, including:, 162110=In the proposed rule, we noted that, if a State is not approved to operate or chooses to forgo operating its own risk adjustment program, HHS would operate risk adjustment on the State's behalf. Our authority to operate risk adjustment on the State's behalf arises from sections 1321(c)(1) and 1343 of the Affordable Care Act. In States where HHS is operating risk adjustment, we proposed that issuers of risk adjustment covered plans remit a user fee to fund HHS's operation of a Federally operated risk adjustment program. The authority to charge this user fee can be found under sections 1343, 1311(d)(5), and 1321(c)(1) of the statute, and under 31 U.S.C. 9701, which permits a Federal agency to establish a charge for a service provided by the agency. OMB Circular No. A-25R, which establishes Federal policy regarding user fees, specifies that a user charge will be assessed against each identifiable recipient of special benefits derived from Federal activities beyond those received by the general public. The risk adjustment program will provide special benefits as defined in section 6(a)(1)(b) of OMB Circular No. A-25R to an issuer of a risk adjustment covered plan because it will mitigate the financial instability associated with adverse selection as other market reforms go into effect. The risk adjustment program will also contribute to consumer confidence in the insurance industry by helping to stabilize premiums across the individual and small group health insurance markets., 692020=We proposed to add paragraph (d) to § 153.510, which would specify the due date for QHP issuers to remit risk corridors charges to HHS. Under this provision, an issuer would be required to remit charges within 30 days after notification of the charges. By June 30 of the year following an applicable benefit year, under § 153.310(e), QHP issuers will have been notified of risk adjustment payments and charges for the applicable benefit year. By that same date, under § 153.240(b)(1), QHP issuers also will have been notified of all reinsurance payments to be made for the applicable benefit year. As such, we proposed in § 153.530(d) that the due date for QHP issuers to submit all information required under § 153.530 of the Premium Stabilization Rule is July 31 of the year following the applicable benefit year. We also proposed that the MLR reporting deadline be revised to align with this schedule. We are finalizing this provision as proposed., 1004938=In paragraph (b)(1) and (2), we established that the Exchange collect, review, and submit the rate or expected premium allocation, the expected allowed claims cost allocation, and the actuarial memorandum that a metal level health plan or stand-alone dental plan issuer submits under § 156.470. This collection will allow for the calculation of the advance payments of cost-sharing reductions and the premium tax credit. The Exchange must ensure that such allocations meet the standards set forth in § 156.470(c) and (d). This allocation information must be collected and approved before a health plan or stand-alone dental plan can be certified for participation in the Exchange. We expect that the Exchange will collect the allocation information in conjunction with the rate and benefit information that the issuer submits under § 156.210 or the rate information that the QHP issuers submits through the Effective Rate Review program. Therefore, we believe that the cost for Partnership Exchanges or State-based Exchanges to submit to HHS this information collected from QHPs is generally part of the cost that is accounted for in the PRA approved under OMB Control Number 0938-1141 or the cost that is accounted for in the supporting statement published under CMS form number 10433, which is pending OMB approval. We estimate that Partnership and State-based Exchanges will incur additional cost to submit allocation information to HHS for stand-alone dental plans. We estimate that it will take each Exchange 30 minutes to submit this information for each stand-alone dental plan, and assume that this submission will be performed at the hourly wage rate of $38.49 for an insurance analyst. Assuming 20 stand-alone dental plans across the market, we estimate an aggregate cost of approximately $385 for all Partnership or State-based Exchanges to submit this information to HHS. We plan to revise the supporting statement published under CMS form number 10433, which is pending OMB approval, to account for this additional burden., 923440=Response: The choice of contribution method offered in each FF-SHOP reflects a meaningful choice available to employers in 2014, absent a provision in State law to the contrary. We note that the premium differential effect on older employees is limited by the maximum 3:1 ratio for adults. As noted in the proposal, we believe the decision about whether to use a calculated composite premium is best made by the employer so long as that choice is consistent with applicable State law., 183791=Response: Provisions related to the single risk pool provision were finalized in the Market Reform Rule, which was made available for public inspection at the Office of the Federal Register on February 22, 2013. Non-grandfathered student health insurance coverage is exempt from the single risk pool requirement., 894275=Response: HHS has provided a list of required data for the HHS-operated distributed data approach in the PRA package approved under OMB Control Number 0938-1155. HHS will make available the data formats, definitions, and technical standards applicable to the HHS-operated distributed data approach in future guidance, including standards relating to data from chart reviews., 671648=Response: Under § 153.240(b), HHS would notify issuers of reinsurance payments to be made under the uniform payment parameters by June 30 of the year following the applicable benefit year. We will make every effort to issue payments as quickly as possible. We anticipate issuing further guidance regarding reinsurance payments., 585981=Response: As set forth in the regulatory impact analysis to this final rule, HHS estimates that reinsurance payments to issuers will reduce premiums in the individual market by between 10 to 15 percent. This is an HHS estimate for the 2014 benefit year, based in part on a 2009 analysis of health insurance premiums by the Congressional Budget Office., 584027=Response: We considered the commenters' statutory interpretations for how such a deferral may be permissible under section 1341 of the Affordable Care Act and would support such a deferral, but concluded that we have no statutory authority to defer the collection., 946568=We are finalizing the effective dates of the definitions of “full-time employee,” “small employer,” and “large employer” as proposed, with a minor modification to clarify that the definitions will apply to plan years beginning on or after January 1, 2014 and in connection with open enrollment activities beginning October 1, 2013. As the SHOP, including FF-SHOPs, will not provide access to coverage until January 1, 2014, we believe the proposed text may have been subject to unintended ambiguity and are finalizing revised text to eliminate that concern., 657579=Response: One of HHS's goals is to provide the greatest amount of flexibility to States while ensuring consistency with the policy goals of the reinsurance program. Therefore, under these final rules, we have provided States with the flexibility to increase the coinsurance rate on reinsurance-eligible claims, which would have the effect of increasing payouts under the uniform parameters. Additionally, nothing in these final rules prevents a State from establishing a separate program that would operate alongside the reinsurance program established under section 1341 of the Affordable Care Act. A State establishing such a program is free to implement the collections methodology and payment formula of its own choosing., 962045=Response: We agree that, because an issuer that is exempt from Federal income taxes must make community benefit expenditures, such an issuer should be allowed to deduct community benefit expenditures and State premium taxes. This final rule allows a Federal income tax exempt issuer to deduct its community benefit expenditures in the same manner that another issuer is allowed to deduct its Federal income taxes. This rule does not alter the community benefit expenditure deduction currently available to an issuer that is not exempt from Federal income taxes. Such issuers are allowed to deduct the higher of (1) their State premium taxes or (2) their community benefit expenditures limited to the highest premium tax rate charged to an issuer in the State. This final rule accordingly amends § 158.162(b)(1)(vii) as proposed in the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187). We note that the amount of community benefit expenditures deducted is not allowed to exceed the amount of actual community benefit expenditures in the reporting year., 117650=Under sections 1401, 1411, and 1412 of the Affordable Care Act and 45 CFR part 155 subpart D, an Exchange makes an advance determination of tax credit eligibility for individuals who enroll in QHP coverage through the Exchange and seek financial assistance. Using information available at the time of enrollment, the Exchange determines whether the individual meets the income and other requirements for advance payments and the amount of the advance payments that can be used to pay premiums. Advance payments are made periodically under section 1412 of the Affordable Care Act to the issuer of the QHP in which the individual enrolls., 600288=Response: Due to operational time constraints surrounding the collection of reinsurance contributions, HHS must receive annual enrollment counts by November 15 of the applicable benefit year in order to invoice and collect contributions in time to aggregate payment requests and make payments. We do not believe the earlier submission will significantly impair the accuracy of the enrollment count., 592038=Response: The 2014 allocation for Federal administrative expenses for operating reinsurance totals $20.3 million. HHS will keep 50 percent to cover the administrative expense of collecting reinsurance contributions from health insurance issuers and self-insured group health plans. The 50 percent allocated for reinsurance payment activities will be distributed in proportion to the State-by-State total requests for reinsurance payments (by total dollars) made under the uniform payment parameters. States operating reinsurance will receive that allocation; HHS will retain the allocation for States not operating reinsurance., 645120=Response: As described in the proposed rule and earlier in this preamble, we used the ACAHIM, which estimates market enrollment incorporating the effects of State and Federal policy choices and accounting for the behavior of individuals and employers. These assumptions and projections led to our estimate of the 2014 individual and employer-sponsored insurance markets and expenditures, and permitted us to estimate uniform payment parameters that will lead to requests for reinsurance payments of approximately $10 billion., 582130=Comment: Several commenters expressed concern about the annual per capita national contribution rate of $63.00 for benefit year 2014, and suggested lowering the rate. Many commenters were concerned with the expense of the reinsurance contribution for employees., 173459=Response: As noted in the proposed rule, risk adjustment transfers depend not only on a plan's average risk score, but also on its cost factors compared to the average of these factors within a risk pool within a market within a State. HHS does not currently have the data necessary to calculate the State average risk score to provide to issuers in time for the development of 2014 premiums. HHS contemplates providing technical assistance to States and issuers who are interested in this information., 574359=Response: While we recognize the unique nature of these plans, and their important role in providing coverage to collectively bargained employees and covered dependents, we do not have authority under the statute to exclude them from reinsurance contributions. As clarified in the Premium Stabilization Rule and in this final rule, we do not interpret the application of section 1341 of the Affordable Care Act to be limited to issuers and TPAs on behalf of group health plans. We view the plans' coverage as employment-based, and as a result subject to reinsurance contributions (unless another exclusion applies)., 345618=As set forth in the proposed § 153.730, claims to be used in the risk score calculation must be made available to HHS by April 30 of the year following the benefit year. We believe this date provides for ample claims run-out to ensure that diagnoses for the benefit year are captured, while providing HHS sufficient time to run enrollee risk score, plan average risk, and payments and charges calculations and meet the June 30 deadline described at the redesignated § 153.310(e). Comments in response to the proposed § 153.730 are addressed in section III.G of this final rule., 119902=HHS published a bulletin [2] outlining an intended regulatory approach to calculating actuarial value and implementing cost-sharing reductions on February 24, 2012 (AV/CSR Bulletin). The AV/CSR Bulletin outlined an intended regulatory approach governing the calculation of AV, de minimis variation standards, silver plan variations for individuals eligible for cost-sharing reductions, and advance payments of cost-sharing reductions to issuers, among other topics. In the Exchange Establishment Rule, [3] we set forth eligibility standards for these cost-sharing reductions. In this final rule, we make minor revisions to the eligibility standards for families and establish standards governing the administration of cost-sharing reductions and provide specific payment parameters for the program., 343919=We also proposed to modify § 153.340(b)(3) by adding the additional restriction that “Use and disclosure of personally identifiable information is limited to those purposes for which the personally identifiable information was collected (including for purposes of data validation).” “Personally identifiable information” is a broadly used term across Federal agencies, and has been defined in the Office of Management and Budget Memorandum M-07-16 (May 22, 2007). [12] This addition will further ensure the privacy and security of potentially sensitive data by limiting the use or disclosure of any personally identifiable information collected as a part of this program. We received no comments on the proposed modification and are finalizing the provision as proposed., 772357=Response: We are finalizing the proposal to permit QHP issuers to rely on the reduced maximum annual limitations on cost sharing published in the final HHS notice of benefit and payment parameters to develop their silver plan variations for the 2014 benefit year. We plan to provide separate guidance on the maximum annual limitation on cost sharing for standard plans to QHP issuers seeking to participate in a Federally-facilitated Exchange consistent with the approach finalized in this Payment Notice., 53213=Posted by Ben Jordi on June 4, 2015, 53273=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 598595=Response: Under the Affordable Care Act, the total contribution amounts to be collected from contributing entities for reinsurance payments and payments to the U.S. Treasury for 2014 are $12 billion. We estimate that the $63.00 ($5.25 monthly) annual per capita contribution rate for benefit year 2014 will lead to collections in that amount, including the $20.3 million in administrative expenses. We recognize the possibility that reinsurance payment requests for 2014 may be less than contributions collected for 2014, but section 1341(b)(3)(B)(4)(A) of the Affordable Care Act provides that unused funds after making the 2014 reinsurance payments may be used to stabilize premiums for the three years of the reinsurance program. As set forth in § 153.235(b), any unused funds will be used for reinsurance payments under the uniform reinsurance payment parameters for subsequent benefit years., 746625=We proposed these definitions to administer and implement the cost-sharing reductions established under section 1402 of the Affordable Care Act. Although an issuer will only offer one actual QHP (for example, a standard silver plan) with one standard cost-sharing structure, we proposed the concept of plan variations to describe how certain eligible individuals will pay only a portion of the total cost sharing required under that QHP, with the Federal government bearing the remaining cost-sharing obligations under section 1402 of the Affordable Care Act., 766516=As described in the preamble to the proposed rule, we determined that a reduction in the maximum annual limitation on cost sharing specified in the Affordable Care Act for enrollees with household incomes between 100 and 150 percent of the FPL (2/3reduction), and 150 and 200 percent of the FPL (2/3reduction), would not cause the AVs of any of the model QHPs to exceed the statutorily specified AV levels (94 and 87, respectively). In contrast, the reduction in the maximum annual limitation on cost sharing specified in the Affordable Care Act for enrollees with household incomes between 200 and 250 percent of FPL (1/2reduction), did cause the AVs of the model QHPs to exceed the specified AV level of 73 percent. As a result, we proposed that QHP issuers only be required to reduce their annual limitation on cost sharing for enrollees in the 2014 benefit year with household incomes between 200 and 250 percent of FPL by approximately1/5, rather than1/2. We further proposed to moderate the reductions in the maximum annual limitation on cost sharing for all three income categories, as shown in Table 21, to account for any potential inaccuracies in our estimate of the maximum annual limitation on cost sharing for 2014, and unique plan designs that may not be captured by our three model QHPs. Based on this analysis, in Table 21, we proposed the following reduced maximum annual limitations on cost sharing for benefit year 2014:, 747230=To reflect how the Affordable Care Act creates different eligibility categories with different associated cost-sharing reductions, we proposed that each plan variation would reflect the enrollee's portion of the cost sharing requirements for the QHP. We referred to “assigning” enrollees to the applicable plan variation to describe how the enrollees will receive the benefits described in section 1402 of the Affordable Care Act. We reiterated that these variations are not different QHPs and that a change in eligibility for cost-sharing reductions simply changes the enrollee's responsibility for part of the total cost sharing under the same QHP., 133723=The provisions of this final rule, combined with other provisions in the Affordable Care Act, will improve the functioning of both the individual and the small group markets while stabilizing premiums. The transitional reinsurance program will help to stabilize premiums in the individual market. Reinsurance will attenuate individual market rate increases that might otherwise occur because of the immediate enrollment of higher risk individuals, potentially including those currently in State high-risk pools. In 2014, it is anticipated that reinsurance payments will result in premium decreases in the individual market of between 10 and 15 percent relative to the expected cost of premiums without reinsurance., 597424=We are finalizing these provisions as proposed, with technical corrections to § 153.400, where we clarify that each contributing entity must make reinsurance contributions annually at the national contribution rate; to § 153.405(c), where we clarify that HHS will notify a contributing entity of reinsurance contributions amounts to be paid for a benefit year by the later of December 15 or 30 days after the submission of the annual enrollment count; and § 153.405(a)(1), § 153.405(b) and § 153.405(d), where we delete “average” to clarify that reinsurance contributions are calculated by multiplying the number of covered lives of reinsurance contribution enrollees during the applicable benefit year for all contributing entities by the national contribution rate, pursuant to § 153.405(a)., 851478=Response: We will consider adopting the approach recommended by commenters for future benefit years; however, given the current timeframe and operational concerns, we believe that for the 2014 benefit year it is infeasible to require issuers to submit plan variations that take into account cost-sharing obligations for Indian and non-Indian family members covered under a single QHP policy. Therefore, in accordance with the policy in the proposed rule that we are finalizing here, the assignment of Indians to plan variations would be subject to § 155.305(g)(3). If we propose to change the policy for years beginning in 2016, we will provide issuers with sufficient notice and opportunity to comment to effectuate the required operational change., 861213=Response: We recognize that there is no practical need to ensure that eligible Indians have access to higher metal level plans if a lower metal level plan offers identical benefits and networks, at a lower premium and with no cost sharing. We also recognize the burden on QHP issuers of developing plan variations that provide no additional benefit to enrollees. Finally, we do not wish to unnecessarily task Exchanges with certifying such plan variations. Therefore, we clarify that HHS will deem an Exchange to be adequately enforcing the requirements of § 156.420(b)(1) if, within a set of standard plans offered by an issuer that differ only by the cost sharing or premium (that is, the benefits, networks, and all other aspects of the standard plans are exactly the same), the Exchange allows the issuer to submit one zero cost sharing plan variation for only the standard plan within the set with the lowest premium. If an issuer offers standard plans with different benefits or networks, each set of standard plans must have a zero cost sharing plan variation. We do not propose to extend this interpretation to the submission of limited cost sharing plan variations because these variations may still have cost sharing, which could vary among standard plans. We note that for 2014, for operational reasons, the FFE will still require QHP issuers to submit a zero cost sharing plan variation for any level of coverage that the QHP issuer seeks certification. While this operational limitation for 2014 does present additional data inputs, we do not expect it to require additional analysis by issuers because the content of the submissions would be identical except for cost sharing, which would be eliminated for the zero cost sharing plan variation. We will consider changing this approach in later benefit years through future rulemaking., 963584=Response: In its MLR model rule, the National Association of Insurance Commissioners (NAIC) adopted and limited the community benefit deduction to the State premium tax rate. We adopted the NAIC methodology in the December 1, 2010 interim final rule (75 FR 74864, as amended), and comments in response to it noted that some States do not subject every type of issuer to State premium taxes and the community benefit deduction might not be available to those tax exempt issuers. In balancing the availability of the deduction and the potential for abuse, this final rule implements the community benefit expenditure deduction cap of the highest of (1) 3 percent of premium, or (2) the highest premium tax rate charged in the State, as proposed in the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187)., 191974=Comment: We received one comment that data used to calibrate the HHS risk adjustment models will not reflect the risk adjustment population beginning in 2014. Several commenters suggested that the calibration data set did not reflect benefits that issuers will offer beginning in 2014., 419331=Allowable rating factors (ARF i for plan i) will include the State-defined uniform age rating curve. Pending final State decision on all rating factors applicable to 2014, Massachusetts will provide additional specifications as needed on additional adjustment steps to ensure the accuracy of risk adjustment., 143755=A proposed rule which, among other things, reflects new statutory eligibility provisions, titled “Medicaid, Children's Health Insurance Programs, and Exchanges: Essential Health Benefits in Alternative Benefit Plans, Eligibility Notices, Fair Hearing and Appeal Processes for Medicaid and Exchange Eligibility Appeals and Other Provisions Related to Eligibility and Enrollment for Exchanges, Medicaid and CHIP, and Medicaid Premiums and Cost Sharing” was published in the January 22, 2013 Federal Register (78 FR 4594) (Medicaid and Exchange Eligibility Appeals and Notices)., 548151=Response: We reiterate that for purposes of the reinsurance program only, our view is that major medical coverage is health coverage, which may be subject to reasonable enrollee cost sharing, for a broad range of services and treatments including diagnostic and preventive services, as well as medical and surgical conditions provided in various settings, including inpatient, outpatient, and emergency room settings. Coverage that is limited in scope (for example, dread disease coverage, hospital indemnity coverage, or stand-alone vision coverage or stand-alone dental coverage), or extent (for example, coverage that is not subject to section 2711 of the PHS Act and its implementing regulations) would not be major medical coverage. [17], 141345=The AV/CSR Bulletin was published on February 24, 2012 outlining an intended regulatory approach to calculating actuarial value and implementing cost-sharing reductions. In that bulletin, we outlined an intended regulatory approach for the design of plan variations for individuals eligible for cost-sharing reductions and advance payments and reimbursement of cost-sharing reductions to issuers, among other topics. We reviewed and considered comments to the AV/CSR Bulletin in developing the provisions relating to cost-sharing reductions in this final rule., 586399=Comment: Several commenters asked HHS to explain the methodology used to develop the national contribution rate and the assumptions behind the enrollment estimates that were used to calculate the national contribution rate for 2014., 772929=Comment: One commenter recommended that the maximum annual limitation on cost sharing should be published no later than July 1 of the year prior to open enrollment, with a 45-day comment period., 426414=There are data elements required to calculate risk adjustment funds transfer that the APCD currently does not collect, such as monthly premium, employer zip code, household income level, Indian status, and AV or inputs used to calculate AV using the Federal AV calculator. Massachusetts is currently working with CHIA, other State agencies, and the issuers in Massachusetts to add these data elements as part of APCD data collection and is working with plans to have them submitted by June 1, 2013. Some data elements—Indian status and household income—will be submitted to the APCD via the Exchange., 115993=Advance payments of the premium tax credit and cost-sharing reductions: This final rule establishes standards for advance payments of the premium tax credit and for cost-sharing reductions. These programs assist eligible low- and moderate-income Americans in affording health insurance on an Exchange. Section 1401 of the Affordable Care Act amended the Internal Revenue Code (26 U.S.C.) to add section 36B, allowing an advance, refundable premium tax credit to help individuals and families afford health insurance coverage. Section 36B of the Code was subsequently amended by the Medicare and Medicaid Extenders Act of 2010 (Pub. L. 111-309) (124 Stat. 3285 (2010)); the Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act of 2011 (Pub. L. 112-9) (125 Stat. 36 (2011)); and the Department of Defense and Full-Year Continuing Appropriations Act, 2011 (Pub. L. 112-10) (125 Stat. 38 (2011)). The section 36B credit is designed to make a qualified health plan (QHP) purchased on an Exchange affordable by reducing an eligible taxpayer's out-of-pocket premium cost., 940331=Response: We believe that the Affordable Care Act requires the use of a counting method that takes part time employees into account, and that the full-time equivalent method used in section 4980H(c)(2)(e) of the IRC is a reasonable method to apply with regard to Exchanges. We have changed the IRC reference from section 4980H(c)(2)(e) to 4980H(c)(2) in response to the comment. We believe that the broader cross-reference is appropriate because it brings here the limit in § 49080H(c)(2)(B) on how certain seasonal employees are counted. We believe that excluding certain seasonal employees when determining whether an employer has more than 50 employees would be closer to counting provisions used in many states and that employers should be able to use the same method to determine SHOP eligibility that they will use to determine whether they will be subject to section 4980H. This method of determining SHOP eligibility will be reevaluated before 2016, when the small group market in all states will consist of employers with from 1 to 100 employees rather than 1 to 50 employees., 693290=Response: We are finalizing § 153.530(d) as proposed, so that the due date for QHP issuers to submit all risk corridors information is July 31 of the year following the applicable benefit year. In section III.I.1. of this final rule, we also finalize our proposal to align the MLR reporting deadline with this schedule., 130255=SHOP: Beginning in 2014, SHOP Exchanges will allow small employers to offer employees a variety of QHPs. In this final rule, we establish a number of standards and processes for implementing SHOP Exchanges, including:, 438989=The risk adjustment models and the additional adjustment factors proposed will need to be calibrated and recalibrated periodically to be reflective of current market conditions, the evolving insured population, medical technology and other secular trends in Massachusetts. Massachusetts will evaluate the goodness of fit of the risk adjustment models and the appropriateness of the additional adjustment factors on an ongoing basis and recalibrate every three years if the evaluation justifies. On October 1, 2014, the entire country is expected to transition to ICD-10-CM coding. Massachusetts expects to update the current clinical classification system such that it can group ICD-10-CM diagnosis codes into the existing HCCs in 2014. However, it does not plan to recalibrate the risk factors in the models due to the lack of claims experience under the new coding system., 540640=Comment: Several commenters requested that we permit State high-risk pools to be eligible for reinsurance payments for their high-risk enrollees. Commenters stated that the sudden termination of high-risk pools in 2014 would result in high-risk pool enrollees flooding the individual market, potentially resulting in premium increases for all individual market enrollees and a loss of access to providers currently administering care for high-risk pool enrollees., 912688=We proposed in § 153.730 that an issuer of a risk adjustment covered plan or reinsurance-eligible plan in a State in which HHS operates risk adjustment or reinsurance, as applicable, submit data to be considered for risk adjustment payments and charges and reinsurance payments for the applicable benefit year by April 30 of the year following the end of the applicable benefit year. In order for HHS to provide periodic reports on data functions performed in each issuer's distributed data environment, HHS recommends issuers submit data at least quarterly throughout the benefit year to support the calculation of reinsurance payments and risk adjustment payments and charges., 562750=(b) Private Medicare, Medicaid, CHIP, State high-risk pools, and Basic Health Plans: Both Medicare and Medicaid have fee-for-service or traditional components, as well as managed care components in which private health insurance issuers, under contract with HHS, deliver the requisite benefits. As discussed in the preamble to the Premium Stabilization Rule, these private Medicare or Medicaid plans are excluded from reinsurance contributions because they are not part of a commercial book of business. We also clarified in the proposed rule that for purposes of reinsurance contributions, programs under the CHIP, Federal and State high-risk pools (including the Pre-Existing Condition Insurance Plan Program under section 1101 of the Affordable Care Act), and Basic Health Plans described in section 1331 of the Affordable Care Act are similarly excluded from reinsurance contributions because they are not part of a commercial book of business., 952732=Response: We recognize commenters' concerns regarding inclusion of risk adjustment amounts in the MLR numerator. However, as noted in the proposed rule, while PHS Act section 2718 provides that premium revenue should “account for” collections or receipts for the premium stabilization programs, section 1342(c) of the Affordable Care Act requires that risk corridors calculations treat reinsurance and risk adjustment payments as adjustments to allowable cost. Because the MLR and the risk corridors programs are closely related and rely on the same definitions, there should be consistency between these two programs. Proper functioning of the MLR and premium stabilization programs will be especially important in 2014-2016, the initial years the health insurance market will undergo significant changes. Thus, with respect to premium stabilization amounts other than reinsurance contributions (that is, risk adjustment amounts, risk corridors amounts, and reinsurance payments), we are adopting our proposed approach that these adjustments have a net impact on the MLR numerator. However, we agree with those commenters that stated that reinsurance contributions could reasonably be characterized as fees or assessments deductible from premium in MLR and rebate calculations, and this final rule amends § 158.161(a) accordingly. Additionally, we are making clarifying changes to the rebate calculation example in § 158.240(c)(2) in response to comments., 930154=Adoption of a tying standard that applies only to issuers with more than a threshold market share will serve the goal of assuring that QHPs are available in each FF-SHOP in 2014 without unduly burdening issuers. We examined small group market share data based on earned premiums reported to HHS in conjunction with evaluations of issuer minimum loss ratios and have concluded that using a 20 percent market share to determine whether a small group market issuer is subject to the tying provision will result in sufficient competition and the ability to offer a robust set of QHPs in the FF-SHOPs, while minimizing the burden on small issuers. We are finalizing the rule accordingly., 944750=Under our proposal, however, each FF-SHOP would use a counting method that takes part-time employees into account. We proposed that these definitions will be effective October 1, 2013 for each FF-SHOP. We requested comments on the proposed definitions and on the proposed transition policies., 542830=Section 1341 of the Affordable Care Act provides that health insurance issuers and third party administrators on behalf of group health plans must make payments to an applicable reinsurance entity. In the proposed rule, we stated that, with respect to insured coverage, issuers are responsible for making reinsurance contributions. With respect to a self-insured group health plan, the plan is responsible, although a third party administrator (TPA) or administrative services only (ASO) contractor may be utilized to transfer reinsurance contributions on behalf of a plan. A self-insured, self-administered group health plan without a TPA or ASO contractor would make its reinsurance contributions directly. For the reasons described above and in the preamble of the proposed rule, we are modifying the definition of “contributing entity” in § 153.20 to clarify that a “contributing entity” is a health insurance issuer or a self-insured group health plan., 53881=Posted by Ben Jordi on June 1, 2015, 648095=Response: We developed the national contribution rate and uniform reinsurance payment parameters using enrollment and expenditure estimates for 2014, based on the ACAHIM. We recognize that requests for reinsurance payments may be greater than predicted, or that collections may be lower than predicted. However, we believe that a uniform adjustment to payments is the most equitable approach in these situations., 910291=We proposed in § 153.720(a) that an issuer of a risk adjustment covered plan or reinsurance-eligible plan in a State in which HHS operates risk adjustment or reinsurance, as applicable, must establish a unique masked enrollee identification number for each enrollee, in accordance with HHS-defined requirements as described in this section, and maintain the same masked enrollee identification number for an enrollee across enrollments or plans within the issuer, within the State, during a benefit year. In § 153.720(b), we proposed that an issuer of a risk adjustment covered plan or reinsurance-eligible plan in a State in which HHS is operating the risk adjustment or reinsurance program, as applicable, may not include an enrollee's personally identifiable information in the masked enrollee identification number or use the same masked enrollee identification number for different enrollees enrolled with the issuer. As discussed in OMB Memorandum M-07-16, the term “personally identifiable information” is a broadly used term across Federal agencies, and has been defined in the Office of Management and Budget Memorandum M-07-16 (May 22, 2007). [31], 517407=The Affordable Care Act directs the establishment of a transitional reinsurance program in each State to help stabilize premiums for coverage in the individual market from 2014 through 2016. The reinsurance program is designed to alleviate the need to build into premiums the risk of enrolling individuals with significant unmet medical needs. By equitably stabilizing premiums in the individual market throughout the United States, the reinsurance program is intended to help millions of Americans purchase affordable health insurance, reduce unreimbursed usage of hospital and other medical facilities by the uninsured, and thereby lower medical expenses and premiums for all people with private health insurance., 689415=Response: The risk corridors program is not statutorily required to be budget neutral. Regardless of the balance of payments and receipts, HHS will remit payments as required under section 1342 of the Affordable Care Act., 734360=We are also adding paragraph (c) to § 155.1030 and paragraph (f) to § 156.470 to clarify the application of these provisions to multi-State plans. Section 1334 of the Affordable Care Act directs OPM to enter into contracts with issuers to offer multi-State plans. Accordingly, OPM is responsible for ensuring that multi-State plans and their issuers comply with various Exchange standards, including standards relating to cost-sharing reductions and advance payments of the premium tax credit., 914177=Response: An issuer of a risk adjustment covered plan or reinsurance eligible plan in a State in which HHS operates risk adjustment or reinsurance should submit data by April 30 of the year following the applicable benefit year. For example, claims incurred in the 2014 benefit year must be submitted to HHS by April 30, 2015. The submission deadline will allow issuers time to process claims and submit data to their distributed data systems for HHS evaluation, and will provide HHS adequate time to calculate payments and charges., 735840=Comment: We received one comment in support of the provisions at § 155.1030 that all QHP issuers provide the plan variations as part of the certification process. We also received a comment requesting that HHS provide to issuers a good-faith compliance safe harbor on the new cost-sharing reductions standards and suggesting that this safe harbor could be revisited prior to the 2016 plan year., 523610=Section 1341 of the Affordable Care Act provides that States may elect to operate reinsurance. Based on HHS's communications with States, as of February 25, 2013, Maryland and Connecticut are the only States electing to operate reinsurance for 2014. Pursuant to § 153.100, a State that wishes to collect additional reinsurance funds pursuant to § 153.220(d) must publish the supplemental contribution rate and supplemental State reinsurance payment parameters in a State notice of benefit and payment parameters, which for 2014 must be published by the 30th day following the publication of this final rule., 899017=Response: The proposed rule stated that data should be submitted for the applicable benefit year by April 30 of the year following the end of the applicable benefit year. The discharge date would be used to date claims, because we believe that the discharge date best ensures that services provided across benefit years will be considered in their entirety rather than being partially or fully excluded from consideration as a result of the data submission timing requirements. For example, if an individual is admitted to a hospital in December 2014 and is discharged in January 2015, the incurred costs that occurred in both December 2014 and January 2015 would be considered in the 2015 benefit year for both reinsurance payments and calculation of enrollee risk scores for risk adjustment when HHS operates either of those programs., 956351=Comment: Three commenters recommended that HHS include the Federally-facilitated Exchange user fees and user fees assessed on issuers participating in the HHS-operated risk adjustment programs as regulatory fees deductible from premium in MLR and rebate calculations. Two commenters recommended that issuer costs associated with operating risk adjustment data validation systems also be deducted for MLR purposes, either as an addition or offset to the payments or receipts related to the premium stabilization programs, or as regulatory fees or assessments deducted from premium. Three commenters further suggested that fees and/or operational costs related to the premium stabilization programs and Exchanges, that are priced into premium for policy years spanning 2013-2014, and consequently will be partially reflected in 2013 premium, be either deducted or excluded from 2013 premium., 996030=Response: We believe that our proposed estimate is reasonable for first year operations. The estimate reflects average labor and capital costs associated with standing up a dedicated data environment, as well as average claims volume. Some issuers will have appropriate staff and infrastructure in place to support the data collection and other issuers will need to acquire resources. While we anticipate an initial concentrated effort for set-up of the dedicated data environment, we believe that three full-time equivalents would cover the number of hours needed (on average) for set-up and maintenance in the first year of operations. The average hourly rate of $59.39 is based on the Bureau of Labor Statistics, U.S. Department of Labor, National Compensation Survey: Occupational Earnings in the United States, 2011. We note that it approximates the lower range of hourly wages, $60, estimated by respondents to a recent industry survey, [35] and that industry respondents' cost estimates ranged widely to reflect different pricing and conditions. Our aggregate cost estimate also includes costs associated with capital purchases, overhead, and fringe benefits., 428287=Massachusetts General Laws (M. G. L.) Chapter 118G§ 6 authorized the Division of Health Care Finance and Policy (DHCFP) to collect uniform information from public and private health care payers and to operate the Commonwealth's APCD. The Commonwealth's authority to collect, analyze and report health care cost and utilization was further expanded with the passage and subsequent enactment of Chapter 224 of the Acts of 2012. Section 19 of this law established CHIA with broad responsibility for health care data collection, analysis and reporting, including the APCD. CHIA assumes all of the data collection, management and analysis tasks previously performed by DHCFP. In addition, the statute enables CHIA to provide government agencies and other parties access to data for the purpose of lowering total medical expenses, coordinating care, benchmarking, quality analysis and other research, for administrative or planning purposes. CHIA may also provide information to and work with other State agencies to “collect and disseminate data concerning the cost, price and functioning of the health care system in the Commonwealth and the health status of individuals.”, 917470=Response: Each SHOP has the option to allow employers to offer employees a single QHP. We have concluded for the reasons identified by the commenters that, as a transition to broader employer adoption of employee choice models, each FF-SHOP should exercise this option, providing employers the option of offering a single QHP to employees, as the small group market customarily does today. This employer option will allow employers who prefer to offer employees a single QHP to participate in an FF-SHOP and retain potential eligibility for the small business tax credit, which is only available through a SHOP Exchange beginning in 2014., 951007=In addition, as discussed in the proposed rule, we proposed to amend § 158.110(b), § 158.240(d), and § 158.241(a)(2) to change the MLR reporting and rebate deadlines, beginning with the 2014 MLR reporting year, to coordinate them with the reporting cycles of the premium stabilization programs. Comments on the proposed timeline were welcomed., 152787=The risk adjustment program is a permanent program created by Section 1343 of the Affordable Care Act that transfers funds from lower risk, non-grandfathered plans to higher risk, non-grandfathered plans in the individual and small group markets, inside and outside the Exchanges. In subparts D and G of the Premium Stabilization Rule, we established standards for the administration of the risk adjustment program. A State approved or conditionally approved by the Secretary to operate an Exchange may establish a risk adjustment program, or have HHS do so on its behalf. Section 1343 of the Affordable Care Act requires each State to operate a risk adjustment program. In States that have elected not to operate their own risk adjustment program, HHS will operate a program on their behalf. Our authority to operate risk adjustment on the State's behalf arises from sections 1321(c)(1) and 1343 of the Affordable Care Act. Based on HHS's communications with States, as of February 25, 2013, Massachusetts is the only State electing to operate a risk adjustment program for the 2014 benefit year., 672047=Comment: One commenter requested that, if a State is operates reinsurance in the 2014 benefit year, the deadline for issuers to file rates be moved to April 30 because State supplemental reinsurance payment parameters will affect premium rate setting. The commenter also requested that for the 2015 and 2016 benefit years, HHS require States to publish the State notice of benefit and payments parameters no later than January 31 of the prior year to provide issuers with ample time to calculate and submit rates for filing approval by March 28., 163898=We further proposed to determine the total amount needed to fund HHS risk adjustment operations by examining the contract costs of operating the program, including development of the model and methodology, collections, payments, account management, data collection, program integrity and audit functions, operational and fraud analytics, stakeholder training, and operational support (not including Federal personnel costs). We proposed to develop a per capita user fee rate by dividing the amount we intend to collect over the course of the benefit year by the expected annual enrollment in risk adjustment covered plans (other than plans not subject to market reforms and student health plans) for that benefit year. We also proposed a standardized schedule for assessment and collection of risk adjustment user fees. Although the user fees would be assessed on a per-enrollee-per-month basis to account for fluctuations in monthly enrollment, we proposed to collect them only once, in June of the year following the benefit year, in order to synchronize user fee collection with risk adjustment payments and charges., 642802=Response: We believe that these uniform payment parameters best meet the reinsurance program's goals to promote premium stabilization and market stability in all States while providing plans incentives to continue effective management of enrollee costs. We aim to administer the transitional reinsurance program in an efficient, fair, and accurate manner so that reinsurance funds are allocated equitably and can maximize downward pressure on premiums. To maximize the program's impact on premiums, uniform reinsurance payment parameters would allow the allocation of reinsurance contributions where they are most needed, to reimburse issuers with high costs in the individual market in 2014, 2015 and 2016. This policy is consistent with the statutory goals of the reinsurance program—to stabilize premiums in the initial years of Exchange implementation and market reform. Additionally, as set forth in § 153.240(b)(2), a State, or HHS on behalf of the State, will provide each reinsurance-eligible plan the expected requests for reinsurance payments made under the national payment parameters and State supplemental parameters, if applicable. These reports can provide the information necessary for issuers to set rates in subsequent benefit years., 957308=Response: We have previously addressed the deductibility of State and Federal Exchange user fees in sub-regulatory guidance issued on April 20, 2012. [33] We agree with the commenters' suggestion regarding the deductibility of the risk adjustment user fees, and we interpret § 158.161(a) as allowing these user fees to be deducted from premium in MLR and rebate calculations. However, we do not agree with commenters that issuer expenditures on risk adjustment data validation systems, or any other operational costs related to the premium stabilization programs, constitute a regulatory fee or assessment or a transfer under the premium stabilization programs. We do not think that these types of expenditures can be distinguished from issuers' other administrative costs involved in compliance with laws and regulations. We also do not agree with comments suggesting that it would be appropriate to reduce rebates to 2013 enrollees by applying estimated 2014 regulatory fees priced into 2013 premium to 2013 MLR and rebate calculations. PHS Act section 2718 does not provide for estimated regulatory fees for future years to be deducted from premium used in MLR and rebate calculations for the reporting year., 983488=Under the Paperwork Reduction Act of 1995 (PRA), we are required to provide 30-day notice in the Federal Register and solicit public comment before a collection of information requirement is submitted to the Office of Management and Budget (OMB) for review and approval. To fairly evaluate whether an information collection should be approved by OMB, section 3506(c)(2)(A) of the Paperwork Reduction Act of 1995 requires that we solicit comment on the following issues:, 602322=(2) Snapshot Count Method: Under the PCORTF Rule, a health insurance issuer may use the “snapshot count method” generally by adding the total number of lives covered on a certain date during the same corresponding month in each quarter, or an equal number of dates for each quarter, and dividing the total by the number of dates on which a count was made. For reinsurance contributions purposes, an issuer would add the totals of lives covered on a date (or more dates, if an equal number of dates are used for each quarter) during the same corresponding month in each of the first three quarters of the benefit year (provided that the dates used for the second and third quarters must be within the same week of the quarter as the date used for the first quarter), and divide that total by the number of dates on which a count was made. For this purpose, the same months must be used for each quarter (for example, January, April and July)., 128392=Cost-Sharing Reductions: Sections 1402 and 1412 of the Affordable Care Act provide for reductions in cost sharing on essential health benefits for low- and moderate-income enrollees in silver level health plans offered in the individual market on Exchanges. It also provides for reductions in cost sharing for Indians enrolled in QHPs at any metal level. In this final rule, we establish a number of standards governing the cost-sharing reduction program, including:, 635884=We believe that providing reinsurance payments only to those reinsurance-eligible plans that are subject to the 2014 market reform rules better reflects the reinsurance program's purpose of mitigating premium adjustments to account for risk from newly insured individuals. We also proposed that State-operated reinsurance programs similarly limit eligibility for reinsurance payments, although we recognize that this policy contrasts with the approach proposed for State-operated risk adjustment programs, under which States are permitted to choose to risk-adjust plans not subject to the 2014 market reform rules. Because some States may have enacted State-specific rating and market reforms that they believe would justify the inclusion of these plans in risk adjustment before their renewal dates, permitting State flexibility on the applicability of risk adjustment to plans not subject to the 2014 market reform rules furthers the goals of the risk adjustment program. However, we believe that State flexibility for eligibility for reinsurance payments does not further the goal of the reinsurance program. Last, we proposed to operate the reinsurance program on a calendar year basis, which we believe to be most feasible from policy and administrative standpoints. For the reasons described in the proposed rule and considering the comments received, we are finalizing the provisions proposed in § 153.234., 595703=In § 153.405(b), we proposed that a contributing entity must submit to HHS an annual enrollment count of the average number of covered lives of reinsurance contribution enrollees no later than November 15 of benefit year 2014, 2015, and 2016, as applicable. The count must be determined as specified in proposed § 153.405(d), (e), (f), or (g), as applicable. We proposed to amend § 153.400(a) so that each contributing entity would make annual reinsurance contributions at the national contribution rate, and under any additional applicable State supplemental contribution rate, if a State elects to collect additional contributions for administrative expenses or supplemental reinsurance payments under § 153.220(d). We believe that this annual collection schedule will ensure a more accurate count of a contributing entity's average covered lives, and will avoid the need for any initial estimates and subsequent reconciliation to account for fluctuations in enrollment during the course of the benefit year., 662034=Response: To maximize the reinsurance program's impact on premium rates, an allocation of reinsurance payments under uniform payment parameters allows for HHS to disburse reinsurance contributions where they are most needed, to reimburse issuers with high cost claims in the individual market in 2014, 2015 and 2016. This policy is consistent with the statutory goals of the reinsurance program—to stabilize premiums in the initial years of Exchange implementation and market reform. Considering the comments received, we are finalizing these provisions as proposed., 577816=Each year, the national per capita contribution rate will be calculated by dividing the sum of the three amounts (the national reinsurance pool, the U.S. Treasury contribution, and administrative costs) by the estimated number of enrollees in plans that must make reinsurance contributions. As an illustration, under the Affordable Care Act, the 2014 national reinsurance pool is $10 billion, and the contribution to the U.S. Treasury is $2 billion. The amount to be collected for administrative expenses for benefit year 2014 is $20.3 million (or 0.2 percent of the $10 billion dispersed), as discussed in greater detail below. The HHS estimate of the number of enrollees in plans that must make reinsurance contributions that total the $12.02 billion described above yields an annual per capita contribution rate of $63.00 in benefit year 2014 or $5.25 per month., 833510=We proposed in § 156.440(b) that the provisions of subpart E, to the extent related to cost-sharing reductions, not apply to stand-alone dental plans. Section 1311(d)(2)(B)(ii) of the Affordable Care Act provides that an Exchange must allow a stand-alone dental plan that provides pediatric dental benefits that are EHB to be offered separately from or in conjunction with a QHP. The Exchange Establishment Rule, at § 155.1065, implements these provisions. However, section 1402(c)(5) of the Affordable Care Act states if an individual enrolls in both a QHP and a stand-alone dental plan, the provisions on cost-sharing reductions under sections 1402(a) and (c) of the Affordable Care Act do not apply to that portion of the cost-sharing reductions properly allocable to pediatric dental EHB. Thus, if an individual enrolls in both a QHP and a stand-alone dental plan offered on an Exchange, cost-sharing reductions are not payable with respect to pediatric dental benefits offered by the stand-alone dental plan., 101015=This final rule is effective on April 30, 2013., 125531=Reinsurance: The Affordable Care Act directs that a transitional reinsurance program be established in each State to help stabilize premiums for coverage in the individual market from 2014 through 2016. In this final rule, we establish a number of standards and parameters for implementing the reinsurance program, including:, 351802=In the proposed § 153.330(b)(2), we would consider whether the alternate methodology complies with the requirements of subpart D, especially § 153.310(e) (as proposed to be renumbered) and § 153.340. Section 153.310(e) requires alternate methodologies to have a schedule that provides annual notification to issuers of risk adjustment covered plans of payments and charges by June 30 of the year following the benefit year. Section 153.340(b)(1) sets forth a number of minimum requirements for data collection under risk adjustment, including standards relating to data privacy and security. While the Federal approach will not directly collect data from issuers, but instead will use a distributed approach that will not include personally identifiable information, the Premium Stabilization Rule gave States the flexibility to design their own data collection approach, provided privacy and security standards are met. The privacy and security of enrollees' data is of paramount importance to HHS, and the data collection approach in an alternate methodology must protect personally identifiable information, if any, that is stored, transmitted, or analyzed, to be certified. The application for certification of the alternate methodology should identify which data elements contain personally identifiable information, and should specify how the State would meet these data and privacy security requirements., 942891=Comment: Only one commenter addressed the definition of full time employee, suggested that full-time employee be defined as an employee working more than 1300 hours in the past year., 670272=We proposed to add § 153.240(b)(1), which would direct a State, or HHS on behalf of the State, to notify issuers of the total amount of reinsurance payments that will be made no later than June 30 of the year following the applicable benefit year. This corresponds with the date on which a State or HHS must notify issuers of risk adjustment payments and charges. As such, by June 30 of the year following the applicable benefit year, issuers would be notified of reinsurance payments and risk adjustment payments and charges, allowing issuers to account for their total reinsurance payments and risk adjustment payments and charges when submitting data for the risk corridors and MLR programs. To provide issuers in the individual market with information to assist in development of premiums and rates in subsequent benefit years, we also proposed in § 153.240(b)(2) that a State provide quarterly notifications of estimates to each reinsurance-eligible plan of the expected requests for reinsurance payments. HHS intends to collaborate with issuers and States to develop these early notifications. We are finalizing these provisions as proposed., 733421=We are finalizing the provisions in § 155.1030 as proposed, with technical corrections to § 155.1030(a) and (b)(2). We replace the phrase, “The Exchange” in the beginning of proposed § 155.1030(a) with “An Exchange,” to align with other provisions in part 155. We also replace the phrase “[an issuer] offers or seeks to offer” from the proposed rule with the phrase “[an issuer] offers, or intends to offer” in the final rule, to align with the language in § 156.430(a) requiring issuers to submit information for the advance payment of cost-sharing reductions; the scope of these regulatory requirements is intended to be the same. Similarly, we are making technical corrections to § 156.470(a), (b) and (e) to standardize the phrase describing the issuers who must comply with the rule as those issuers with plans “offered, or intended to be offered” on an Exchange., 606998=(3) Form 5500 Method: Under the PCORTF Rule, a plan sponsor may use the “Annual Return/Report of Employee Benefit Plan” filed with the Department of Labor (Form 5500) by using data from the Form 5500 for the last applicable plan year. We proposed that, for purposes of reinsurance contributions, a self-insured group health plan may also rely upon such data, even though the data may reflect enrollment in a previous benefit year. Our modeling of the 2014 health insurance marketplace, discussed in section III.C.6. of this final rule, suggests that enrollment in self-insured group health plans is less likely to fluctuate than enrollment in the individual market. Thus, we proposed that a self-insured group health plan may calculate the number of lives covered for a plan that offers only self-only coverage by adding the total participants covered at the beginning and end of the benefit year, as reported on the Form 5500, and dividing by two. Additionally, a self-insured group plan that offers self-only coverage and coverage other than self-only coverage may calculate the number of lives covered by adding the total participants covered at the beginning and the end of the benefit year, as reported on the Form 5500., 781467=In § 156.420(c) and (e), we proposed additional coverage standards for silver plan variations as part of implementing section 1402. In § 156.420(c), we proposed that silver plan variations cover the same benefits and include the same providers as the standard silver plan. We further proposed that silver plan variations must require the same out-of-pocket spending for benefits other than EHB. Lastly, we proposed that silver plan variations be subject to all requirements applicable to the standard silver plan (except for the requirement that the plan have an AV as set forth in § 156.140(b)(2) of the final EHB/AV Rule). This means, for example, that silver plan variations must meet standards relating to marketing and benefit design of QHPs, network adequacy standards, and essential community providers. Although these requirements are implicit because a plan variation is not a separate plan, we proposed these requirements explicitly as regulatory standards to ensure that QHP issuers develop appropriate plan variations., 435238=Massachusetts plans to provide quarterly funds transfer calculation summaries to each issuer that is subject to risk adjustment and will be working with the issuers to determine the appropriate content and level of detail for the quarterly report summaries. The proposed timeline for processing and analyzing APCD data for Calendar Year 2014 for the purpose of risk adjustment is illustrated below. Massachusetts is in discussions with CHIA and the issuers regarding the timeline and also plan to conduct test runs to ensure the feasibility of the timeline and quality of the data collection process., 379438=Comment: A number of commenters supported not altering payments and charges based on 2014 and 2015 data validation results. Numerous other commenters requested that HHS apply error rates to payment transfers from the outset of the program, while another commenter supported a one-year observation period before effecting data validation payment transfers., 945089=Comment: Most commenters supported using State methods, either long term or as a transitional method in 2014-2015. Two commenters supported an immediate move to a federal standard counting method that takes all employees into account., 122646=Medical loss ratio (MLR) program: Section 2718 of the Public Health Service Act (PHS Act) generally requires health insurance issuers to submit an annual MLR report to HHS and provide rebates of premium if they do not achieve specified MLRs. On December 1, 2010, we published an interim final rule entitled “Health Insurance Issuers Implementing Medical Loss Ratio (MLR) Requirements under the Patient Protection and Affordable Care Act” (75 FR 74864) which established standards for the MLR program. Since then, we have made several revisions and technical corrections to those rules. This final rule amends the regulations to specify how issuers are to account for payments or receipts from the risk adjustment, reinsurance, and risk corridors programs, and to change the timing of the annual MLR report and distribution of rebates required of issuers to account for the premium stabilization programs. This final rule also amends the regulations to revise the treatment of community benefit expenditures in the MLR calculation for issuers exempt from Federal income tax to promote a level playing field., 194012=Response: We have provided this information for the proposed HHS risk adjustment models on our Web site at: http://cciio.cms.gov/resources/files/ra_instructions_proposed_1_2013.pdf and http://cciio.cms.gov/resources/files/ra_tables_proposed_1_2013.xlsx. We intend to provide a final version of these documents to reflect the HHS risk adjustment models in the future., 583832=Comment: Several commenters asked HHS to defer the collection of the $2 billion payable to the U.S. Treasury in 2014 until 2016., 997990=We estimate that 1,800 issuers will be required to pay risk adjustment user fees, and the additional cost associated with this requirement is the time and effort for an issuer to provide monthly enrollment data and remit fees. Because HHS will utilize existing data collection and payments and charges processing, we do not anticipate that this provision will alter the collection cost that is already approved in the Premium Stabilization Rule Supporting Statement under OMB control number 0938-1155 with an October 31, 2015 expiration date., 886525=Response: We are clarifying that an issuer's monthly user fee amount is equal to the product of the monthly user fee rate specified in the annual HHS notice of benefit and payment parameters for the applicable benefit year—which for 2014 is 3.5 percent—and the monthly premium charged by the issuer for each policy offered through a Federally-facilitated Exchange., 741457=Under HHS's rulemaking authority under sections 1311(c)(1), 1321(a)(1), 1402 and 1412 of the Affordable Care Act, we proposed to add § 156.215. This section would amend the QHP minimum certification standards and specify that an issuer seeking to offer a health plan on the individual market in the Exchange meet the requirements described in subpart E of part 156 related to the administration of advance payments of the premium tax credit and cost-sharing reductions. We proposed to add this section to clarify that compliance with part 156 subpart E, including the standards and submission requirements proposed at § 156.420 and § 156.470, is a requirement of QHP certification, and therefore, is included in the standard described at § 155.1000(b), under which an Exchange must offer only health plans that meet the minimum certification requirements. Under our proposal, continuing compliance with subpart E requirements by QHPs and QHP issuers is a condition of certification; failure to comply with the requirements could result in decertification of the QHP as well as other enforcement actions. This corresponds to the proposed addition of § 155.1030, which sets forth the Exchange responsibilities on certification with respect to advance payments of the premium tax credit and cost-sharing reductions (described previously). We received no comments on this provision. For the reasons described in the proposed rule, we are finalizing these provisions as proposed., 887337=Response: We are clarifying that we are establishing the FFE user fee rate for 2014 only, with the intent of keeping the user fee as low as possible. Independent of final SBE user fee rates, we clarify that we are not considering raising the FFE user fee beyond our operating costs in the future., 605775=(2) Snapshot Factor Method: Under the PCORTF Rule, a plan sponsor generally may use the “snapshot factor method” by adding the total number of lives covered on any date (or more dates if an equal number of dates are used for each quarter) during the same corresponding month in each quarter, and dividing that total by the number of dates on which a count was made, except that the number of lives covered on a date is calculated by adding the number of participants with self-only coverage on the date to the product of the number of participants with coverage other than self-only coverage on the date and a factor of 2.35. [20] For this purpose, the same months must be used for each quarter (for example, January, April, July, and October). For reinsurance contributions purposes, a self-insured group health plan would use this PCORTF counting method over the first three quarters of the benefit year, provided that the corresponding dates for the second and third quarters of the benefit year must be within the same week of the quarter as the date selected for the first quarter., 520649=Response: Section 1341 of the Affordable Care Act mandates that the transitional reinsurance program operate in the three year period beginning January 1, 2014, which we interpret to mean that the program will operate in benefit years 2014, 2015 and 2016. As a result, we have no statutory authority to extend the program. We note that, under this final rule, reinsurance payments for benefit year 2016 will be made in 2017, and section 1341(a)(4)(B) provides that amounts remaining unexpended as of December 2016 may be used to make payments under any reinsurance program of a State in the individual market in effect in the two-year period beginning on January 1, 2017., 111388=HIPAAHealth Insurance Portability and Accountability Act of 1996 (Pub. L. 104-191), 859248=Response: We are working to ensure that referrals through the contract health services program are processed in accordance with the standards in this final rule in a manner that is clear to providers and QHP issuers. In addition, we note that “contract health services” is defined under 25 U.S.C. section 1603, and we do not propose to codify this definition in the final rule., 377507=We proposed that issuers of risk adjustment covered plans adhere to the data validation process beginning with data for the 2014 benefit year. However, due to the complexity of the risk adjustment program and the data validation process, and the uncertainty in the market that will exist in 2014, we are concerned that adjusting payments and charges without first gathering information on the prevalence of error could lead to a costly and potentially ineffective audit program. Therefore, we proposed that issuers conduct an initial validation audit and that we conduct a second validation audit for benefit years 2014 and 2015, but that we would not adjust payments and charges based on validation findings during these first two years of the program. Although we proposed not to adjust payments and charges based on error estimates discovered, we noted that other remedies, such as prosecution under the False Claims Act, may be applicable to issuers not in compliance with the risk adjustment program requirements., 997470=Under § 153.610(f), we establish a user fee to support Federal operation of risk adjustment. This per capita monthly fee will be charged to issuers of risk adjustment covered plans based on enrollment estimates provided to HHS in the distributed data environment. HHS will calculate user fees owed, and issuers will remit the fee owed only once, in June of the year following the benefit year, in connection with processing of payments and charges for risk adjustment., 921427=We are finalizing the rule for the FF-SHOPs with some modifications from the proposal. Under § 155.705(b)(3) as finalized, each FF-SHOP will allow qualified employers the choice of offering employees either all QHPs at a single level of coverage selected by the employer or a single QHP selected by the employer. However, we are proposing elsewhere in this issue of the Federal Register that, as a matter of transition, each SHOP have the option to choose whether to implement employee choice and premium aggregation beginning January 1, 2014 or January 1, 2015, with each FF-SHOP exercising the January 1, 2015 implementation option., 694190=Response: Under section 1342(c)(1)(B) of the Affordable Care Act, allowable costs are to be reduced by any risk adjustment and reinsurance payments received under sections 1341 and 1343. Supplemental reinsurance payments made under State supplemental reinsurance payment parameters are reinsurance payments received under sections 1341 of the Affordable Care Act; thus, allowable costs in the risk corridors formula are to be reduced by the reinsurance payments received both under the uniform payment parameters and any State supplemental reinsurance payment parameters., 808536=We are finalizing the methodology for determining advance payments for the 2014 benefit year as proposed. As noted above, we are also adding paragraph (4) to § 156.430(a), clarifying that issuers of multi-State plans must provide the estimates described in paragraphs (1) and (2) of § 156.430(a) to OPM, in the time and manner established by OPM., 151764=Comment: A number of commenters supported the proposed deadline extension for benefit year 2014, while others opposed such an extension. Some suggested that HHS not allow States to operate risk adjustment or reinsurance., 536767=Response: Although § 153.220(d) provides that a State may elect to collect additional reinsurance contributions for administrative expenses or reinsurance payments, we do not interpret section 1341 of the Affordable Care Act or 45 CFR part 153 of this final rule as giving States any additional authority to collect from contributing entities. Any such authority must come from other State or Federal law., 592732=Comment: Several commenters sought clarification on the methodology used to develop the Federal administrative expenses of implementing the reinsurance program in 2014., 967208=Comment: We received several comments suggesting that HHS clarify the MLR treatment of State high-risk pool assessments, events occurring after MLR reporting deadlines, and cost-sharing reductions. We also received one comment suggesting a larger adjustment for fraud prevention activities, an extension of allowable ICD-10 costs to the 2013 reporting year, and inclusion of all-payer claims databases in quality improving activities., 112492=The CodeInternal Revenue Code of 1986, 665590=Comment: Several commenters asked HHS how excess reinsurance funds would be distributed after 2016., 419751=Massachusetts proposes to calculate geographic cost factors consistent with the HHS methodology, except that it plans to use gold plans as the benchmark for the calculations because gold plans are expected to attract the most enrollment in the Massachusetts merged market after 2014, whereas silver plans will likely have relatively low enrollment based on the product market in Massachusetts today. Having a data sample with sufficient enrollment is necessary in order to credibly measure regional cost differences. Massachusetts has not yet made a final decision on the number of rating areas, permissible range of the rates by area, or the schedule for implementing the changes. However, regardless of the specific decisions that determine the actual factors, the calculations will follow the formula shown by HHS., 144986=A notice of proposed rulemaking relating to essential health benefits and actuarial value was published in the Federal Register on November 26, 2012 (77 FR 70644). The final rule was published in the Federal Register on February 25, 2013 (78 FR 12834) (EHB/AV Rule)., 765566=Reduced Maximum Annual Limitation on Cost Sharing for Benefit Year 2014., 709442=Under our authority to administer the payment of cost-sharing reductions and advance payments of the premium tax credits conferred in section 1412 and the rulemaking authority conferred in section 1321(a) of the Affordable Care Act, we proposed to add two paragraphs to § 155.340. First, we proposed to add paragraph (e) to § 155.340, which would provide that if one or more individuals in a tax household who are eligible for advance payments of the premium tax credit collectively enroll in more than one policy through the Exchange (whether by enrolling in more than one policy under a QHP, enrolling in more than one QHP, or enrolling in one or more QHPs and one or more stand-alone dental plans) for any month in a benefit year, the Exchange would allocate the advance payment of the premium tax credit(s) in accordance with the methodology proposed in § 155.340(e)(1) and (2). Under that methodology, the Exchange must first allocate the portion of the advance payment of the premium tax credit(s) that is less than or equal to the aggregate adjusted monthly premiums for the QHP policies, as defined under 26 CFR 1.36B-3(e), properly allocated to EHB, among the QHP policies in proportion to the respective portions of the premiums for the policies properly allocated to EHB. Any remaining advance payment of the premium tax credit(s) must be allocated among the stand-alone dental policies in proportion to the respective portions of the adjusted monthly premiums for the stand-alone dental policies properly allocated to the pediatric dental EHB. We provided additional detail on the allocation methodology in the proposed rule and welcomed comments on this proposal., 411080=The proposed Market Reform Rule and the proposed HHS notice of benefit and payment parameters for 2014 contemplate separate risk pools for individual and small group policies and modified community rating to be applied separately within each risk pool. The Commonwealth has had a merged small and non-group market since its landmark reform in 2006, where small groups and non-group plans are subject to the same index rate and pricing methodology., 603329=(3) Member Months Method or State Form Method: Under the PCORTF Rule, a health insurance issuer may use the “Member Months Method” or “State Form Method” by using data from the NAIC Supplemental Health Exhibit or similar data from other State forms. However, data from these forms may be out of date at the time of the annual enrollment count submission, and we believe that it is important that health insurance issuers achieve an accurate count of covered lives, particularly for individual market plans. We expect that the individual market will be subject to large increases in enrollment between 2014 and 2016. Therefore, we proposed a modified counting method based upon the ratio of covered lives per policy in the NAIC or State form. Specifically, we proposed that health insurance issuers using this method multiply the average number of policies for the first nine months of the applicable benefit year by the ratio of covered lives per policy calculated from the NAIC Supplemental Health Care Exhibit (or from a form filed with the issuer's State of domicile for the most recent time period). Issuers would count the number of policies in the first nine months of the applicable benefit year by adding the total number of policies on one date in each quarter, or an equal number of dates for each quarter (or all dates for each quarter), and dividing the total by the number of dates on which a count was made. [19], 144497=A notice of proposed rulemaking relating to market reforms and effective rate review was published in the Federal Register on November 26, 2012 (77 FR 70584). The final rule was made available for public inspection at the Office of the Federal Register on February 22, 2013 (Market Reform Rule)., 872694=We are finalizing both our proposal for annual rulemaking in the notice of benefits and payment provisions to establish a methodology for advance payments for cost-sharing reductions under the limited cost sharing plan variation, and our proposal of a specific methodology for the 2014 benefit year. As in the case of the other plan variations, we plan to review the methodology for calculating the advance payments once more data is available, and future notices of benefits and payment parameters may include different methodologies. We welcome comments to consider as part of this process. We are also clarifying the language at § 156.430(a)(2) by replacing the phrase “[an issuer] offers or seeks to offer” from the proposed rule with the phrase “[an issuer] offers, or intends to offer” in the final rule, to align with the language in § 156.430(a)(1)., 553184=Response: We have no statutory authority to make the requested change under section 1341 of the Affordable Care Act. We clarify that employer-provided retiree coverage is subject to reinsurance contributions unless one of the general exceptions applies (for example, the coverage is not major medical coverage)., 805196=For the 2014 benefit year, we proposed that advance payments be estimated on a per enrollee per month basis using the following formula:, 930883=Comment: One commenter objected because OPM does not require multi-State plans to offer SHOP products until 2017, and CO-OPs are not subject to a similar provision., 535947=Response: We reiterate that nothing in section 1341 of the Affordable Care Act or 45 CFR part 153 of this final rule gives a State the authority to collect any funds—whether under the national contribution rate or under an additional State contribution rate—from self- insured group health plans covered by ERISA., 693041=Comment: We received several supportive comments on our proposal to require issuers to submit risk corridors information by July 31 of the year following the applicable benefit year., 852300=In § 156.420(b), we proposed that QHP issuers submit to the Exchange the zero cost sharing plan variation and limited cost sharing plan variation for each of the QHPs (at any level of coverage) that it intends to offer on the Exchange. The zero cost sharing plan variation—addressing cost-sharing reductions under section 1402(d)(1) of the Affordable Care Act and available to Indians with expected household incomes that do not exceed 300 percent of the FPL, as determined under § 155.350(a)—must have all cost sharing eliminated. The limited cost sharing plan variation—addressing cost-sharing reductions under section 1402(d)(2) of the Affordable Care Act and available to all Indians as determined in § 155.350(b)—must have no cost sharing on any item or service furnished directly by the IHS, an Indian Tribe, Tribal Organization, Urban Indian Organization, or through referral under contract health services, as defined in 25 U.S.C. 1603. We noted that unlike silver plan variations, zero cost sharing plan variations and limited cost sharing plan variations must only be submitted for certification when the standard plan is submitted for QHP certification., 990340=To minimize burden on issuers, HHS intends to collect data in an identical manner for HHS-operated reinsurance programs and HHS-operated risk adjustment. Although we clarified the data elements issuers would be required to submit as part of the reinsurance payment request process, the burden associated with this requirement is already accounted for under the Premium Stabilization Rule Supporting Statement with an October 31, 2015 expiration date, and we will update it to reflect these clarified data elements., 639121=We noted in the proposed rule that the primary purpose of the transitional reinsurance program is to stabilize premiums by setting the reinsurance payment parameters to achieve the greatest impact on rate setting, and therefore, premiums, through reductions in plan risk, while complementing the current commercial reinsurance market. The reinsurance program is designed to protect against issuers' potential perceived need to raise premiums due to the implementation of the 2014 market reform rules, specifically, guaranteed availability. HHS expects that any potential new high-cost claims from newly insured individuals would be balanced out by low-cost claims from many newly insured individuals who enter the individual market as a result of the availability of premium tax credits, more affordable coverage, the minimum coverage provision, and greater transparency and competition in the market. To that end, the reinsurance program is designed to alleviate the concern of new high-cost claims from newly insured individuals., 587654=The market enrollment module of the ACAHIM predicts coverage status of individuals in 2014, incorporating the effects of State and Federal policy choices and accounting for the behavior of individuals and employers. Using recent Current Population Survey data with appropriate population adjustments, the ACAHIM assigns individuals to a single health insurance market as their baseline (pre-Affordable Care Act) insurance status. The module estimates transitions from coverage status in the baseline to individuals' projected status in 2014, taking into account factors such as Medicaid eligibility, eligibility for advance payments of the premium tax credit and cost-sharing reductions under the Exchange, and current take-up rates of insurance., 956205=The amendments made by this final rule will be effective for MLR reporting years beginning in 2014., 640198=We proposed that the 2014 uniform reinsurance payment parameters be established at: (a) An attachment point of $60,000, when reinsurance payments would begin, (b) a national reinsurance cap of $250,000, when the reinsurance program stops paying claims for a high-cost individual, and (c) a uniform coinsurance rate of 80 percent, which is the reimbursement percentage applied to the issuer's aggregated paid claims amounts on behalf of an enrollee while giving issuers an incentive to contain costs between the attachment point and reinsurance cap. These three proposed payment parameters would help offset high-cost enrollees. The parameters would not interfere with traditional commercial reinsurance, which typically has attachment points in the $250,000 range. We estimate that these uniform payment parameters will result in total requests for reinsurance payments of approximately $10 billion in the 2014 benefit year. We intend to continue to monitor individual market enrollment and claims patterns to appropriately disburse reinsurance payments throughout each of the benefit years during which the reinsurance program is in effect., 999935=Based on Truven Health Analytics 2010 MarketScan® data, we have determined that for enrollees with HCCs, the average number of HCCs to be reviewed by an auditor per enrollee is approximately two. Additionally, based on HHS audit experience, we estimate that it will cost approximately $180 ($90 per hour for two hours) for an auditor to review the medical record documentation for one enrollee with two HCCs. In the proposed rule, we did not estimate the cost of reviewing medical records for enrollees without HCCs. HHS intends to require the review of medical records for all sample enrollees in the initial validation audit. Therefore, we are revising our estimate to align with the policy finalized in this rule. We expect that it may cost approximately $60 per enrollee ($90 per hour for 40 minutes) to validate demographic information and review medical records for all enrollees in the audit sample, totaling approximately $210 per enrollee with HCCs ($90 per hour for two hours and 20 minutes) and $60 per enrollee with no HCCs. We assume that an initial validation audit will be performed on 180,000 enrollees without HCCs, and 360,000 enrollees with HCCs. Based on the information above, we estimate that the total cost per issuer to retain initial validation auditors to perform the initial validation would cost approximately $48,000. Therefore, for 1,800 issuers, the total cost of conducting initial validation audits will be $86.4 million. We will revise the information collection currently approved OMB Control Number 0938-1155 with an October 31, 2015 expiration date to account for this additional burden., 421851=The APCD collects payer data for all members living in Massachusetts. Health plan issuers and other payers submit five files each month: Member eligibility, medical claims, pharmacy claims, dental claims and provider details. Product description files from all of the payers are submitted to the APCD on a quarterly basis. Detailed data submission requirements are in place and available for review on CHIA's Web site, http://www.mass.gov/chia/researcher/health-care-delivery/hcf-data-resources/apcd/. Members of a Massachusetts employer group who live out of State are currently excluded unless the payer also holds a contract with the Commonwealth's employee health administrator to provide data for State-covered non-resident individuals. The Commonwealth is working with CHIA and the affected data submitters actively to have this resolved before 2014 to ensure the accuracy of risk adjustment. It is also working with CHIA and issuers in the Commonwealth to evaluate additional data elements needed to support risk adjustment calculations., 521565=In the proposed rule, we set forth a reinsurance contribution and payment process, and the uniform contribution rate and reinsurance payment parameters that would apply to all States in the 2014 benefit year. We proposed to amend § 153.100(a)(1) to delete the reference to State modification of data collection frequency as set forth in the Premium Stabilization Rule. That deletion would remove the ability of a State electing to operate reinsurance to modify, via a State notice of benefit and payment parameters, the data collection frequency for issuers to receive reinsurance payments. Under § 153.100(a)(1), a State establishing a reinsurance program may still modify the data requirements for health insurance issuers to receive reinsurance payments, provided that the State publishes a State notice of benefit and payment parameters that specifies those modifications., 898417=Comment: Several commenters sought clarification on whether claims will be dated by the date of admission or the date of discharge. One commentator requested clarification on how claims that straddle the benefit year would be handled. Several commenters requested that claims be dated by date of admission rather than date of discharge, to address the issue of claims that straddle multiple years. Another commenter recommended that risk adjustment scores be based on claims with dates of service from January 1 through December 31., 145481=HHS published a request for comment on section 2718 of the PHS Act in the April 14, 2010 Federal Register (75 FR 19297), and published an interim final rule with 60-day comment period relating to MLR program on December 1, 2010 (75 FR 74864). An interim final rule with 30-day comment period and a final rule with 30-day comment period were published in the Federal Register on December 7, 2011 (76 FR 76596 and 76574). A final rule was published in the Federal Register on May 16, 2012 (77 FR 28790)., 934356=As discussed the preamble to the proposed rule, we aim to minimize the potential for risk selection in the small group market and in SHOPs. In the final Market Reform Rule, we discussed this issue in connection with section 2702 of the PHS Act, which requires issuers in the individual and group markets to accept every employer and individual that applies for such coverage but permits issuers to limit enrollment in coverage to only open and special enrollment periods. That final rule implements this provision by permitting an issuer offering health insurance coverage in the small group market to limit its offering of coverage to the limited open enrollment periods described in § 147.104(b)(1) in the case of an employer that fails to meet contribution or minimum participation requirements. In connection with the SHOP, the Exchange Establishment final rule permits a SHOP to authorize minimum participation requirements for qualified employers participating in the SHOP so long as the participation is measured at the SHOP level and not based on enrollment in a single QHP., 882697=In addition, we welcomed comments on a policy that we were considering that would provide for the pooling of Exchange user fees, distribution costs, or all administrative costs across a particular market (in the case of the FFE, however, the user fee would be collected only from issuers participating in the FFE). We note that our proposed rule, “Coverage of Certain Preventive Services under the Affordable Care Act” (78 FR 8457), contemplates a proposal to reduce the amount of the FFE user fee for QHP issuers that provide coverage for contraceptive services for participants of a self-insured plan that is established or maintained by an eligible organization (or have an affiliated issuer that does so). [30] Comments are separately welcome on that proposed regulation on or before April 8, 2013., 690328=Response: Although we seek consistency with MLR where the risk corridors and MLR formulas contain similar parameters, we believe that the credibility adjustment is a unique parameter in the MLR formula. The MLR statute provides for a credibility adjustment through “methodologies * * * designed to take into account the special circumstances of smaller plans, different types of plans, and newer plans” at section 2718(c) of the Affordable Care Act. No similar reference appears in section 1342 of the Affordable Care Act., 165063=Based on comments received, we are adding § 153.610(f), finalizing our risk adjustment user fee assessment and collection approach as proposed. We clarify that enrollment data for each month will be captured by the servers used in the distributed data collection approach. We are also finalizing our intention to set a per capita user fee rate in the annual HHS notice of benefit and payment parameters using the proposed methodology. The user fee will be determined by dividing HHS's total contract costs for risk adjustment operations in the applicable benefit year by the expected annual enrollment in risk adjustment covered plans for that benefit year. Based on this methodology, for benefit year 2014, we are establishing a per capita annual user fee rate of $0.96, which we will apply as a per-enrollee-per-month risk adjusted user fee of $0.08., 634024=We proposed to add § 153.234 to clarify that, under either the uniform reinsurance payment parameters or the State supplemental reinsurance payment parameters, a reinsurance-eligible plan's covered claims costs for an enrollee incurred prior to the application of 2014 market reform rules—§ 147.102 (fair health insurance premiums), § 147.104 (guaranteed availability of coverage, subject to the student health insurance provisions at § 147.145), § 147.106 (guaranteed renewability of coverage, subject to the student health insurance provisions at § 147.145), § 156.80 (single risk pool), and subpart B of part 156 (essential health benefits package)—would not count toward either the uniform or State supplemental attachment points, reinsurance caps, or coinsurance rates. In other words, those claims would not be eligible for reinsurance payments. We noted in the preamble of the proposed rule that, unlike plans subject to the 2014 market reform rules under the Affordable Care Act, plans not subject to these 2014 market reforms rules may use several mechanisms to avoid claims costs for newly insured individuals. (We also noted that student health plan eligibility would be subject to the modified guaranteed availability and guaranteed issue requirements only, to the extent that they apply, as set forth in § 147.145, and we would require that the student health plans meet those modified requirements to be eligible for reinsurance payments.) The market reform rules will be effective for the individual market for policy years beginning on or after January 1, 2014. As a result, policies that are issued in 2013 will be subject to these rules at the time of renewal in 2014, and therefore, become eligible for reinsurance payments at the time of renewal in 2014., 804279=We further proposed that issuers develop the estimates using the methodology specified by HHS in the applicable annual HHS notice of benefit and payment parameters. In § 156.430(a)(3), we proposed that HHS approve estimates that follow this methodology. For the 2014 benefit year, we proposed that issuers use a methodology that utilizes the data that issuers submit under § 156.420 and § 156.470. As a result, issuers would not be required under this proposal to submit any additional data or supporting documentation to receive advance payments in benefit year 2014 for the value of the cost-sharing reductions that would be provided under silver plan variations., 520487=Comment: One commenter requested that HHS consider extending the reinsurance program past 2016., 939174=We proposed to amend the definitions of “small employer” and “large employer” in § 155.20 to specify the method for determining employer size for Exchange purposes and to add the definition of large employer to § 157.20. In determining whether an employer is a small employer for purposes related to the SHOP, we proposed that the full-time equivalent method used in section 4980H(c)(2)(e) of the Code, as added by section 1513 of the Affordable Care Act, be used. We sought comments on the proposed definition., 880770=Circular No. A-25R states that user charges should generally be set at a level so that they are sufficient to recover the full cost to the Federal government of providing the service when the government is acting in its capacity as sovereign (as is the case when HHS operates a FFE). However, Circular No. A-25R also allows for exceptions to this policy, if approved by OMB. Because we wish to encourage issuers to offer plans on FFEs and to align with the administrative cost structure of State-based Exchanges, and because we believe that growing enrollment is likely to increase user fee receipts in future years, we are seeking an exception to the policy for 2014., 873608=As described above, the Exchange will collect the estimate and supporting documentation, and submit the estimate and supporting documentation to HHS for review, as finalized under § 155.1030. If HHS finds the estimate to be reasonable, HHS will make advance payments to a QHP issuer following the same procedure as for the other plan variations, under § 156.430(b), as finalized in this rule., 740137=Response: We agree that stand-alone dental plans, as defined at § 155.1065, are “excepted benefits” under section 2791(c) of the PHS Act, and clarify that issuers of stand-alone dental plans are not required to follow the rating standards set forth in the final Market Reform Rule for purposes of pricing stand-alone dental coverage. In addition, to allow greater flexibility in the implementation of the provisions in § 156.470 related to stand-alone dental plans, we are not finalizing the allocation standards proposed in paragraphs (d)(2), (3), and (4) of § 156.470. We believe the allocation standard proposed at § 156.470(d)(1), which requires that the allocation be performed by a member of the American Academy of Actuaries in accordance with generally accepted actuarial principles and methodologies, is a sufficient standard for ensuring that issuers allocate the premium accordingly, so we are finalizing that provision in this final rule. We intend to provide further details on the reporting process for stand-alone dental plan premium allocations for the FFE., 651741=To provide issuers with greater certainty for premium rate setting purposes, we proposed that a State must ensure that any additional funds for reinsurance payments it collects under § 153.220(d)(1)(ii) or State funds under § 153.220(d)(2) (proposed as (d)(3) in the proposed rule), as applicable, are reasonably calculated to cover additional reinsurance payments projected to be made under the State's supplemental reinsurance payment parameters for a given benefit year. In § 153.232(b), we proposed that contributions collected under § 153.220(d)(1)(ii) or additional funds collected under § 153.220(d)(2) (proposed as (d)(3) in the proposed rule), as applicable, must be applied toward requests for reinsurance payments made under the State supplemental reinsurance payments parameters for each benefit year commencing in 2014 and ending in 2016., 993664=In addition, we discussed in the proposed rule an updating amendment to the Premium Stabilization Rule Supporting Statement that was approved with an October 31, 2015 expiration date reflecting updated cost estimates for implementing the distributed data approach. We are making a slight modification to the labor estimate we assumed in our proposed rule by assuming Federal holidays and two weeks of vacation time for full time employees. In this final rule, we estimate that this data submission requirement will affect 1,800 issuers, and will cost each issuer approximately $342,086 in total labor costs. This cost reflects an estimate of three full-time equivalent employees (5,760 hours per year) at an average hourly rate of $59.39 per hour. We anticipate that approximately 400 data processing servers will be established across the market in 2014 (at an average cost of $15,000), and these servers will process approximately 9 billion claims and enrollment files. Therefore, we estimate an aggregate cost that includes labor and capital of $621,754,800 for all issuers as a result of these provisions. Although we had previously accounted for this estimate as a new administrative cost to issuers in the proposed rule, we are not doing so in this final rule because it is not an incremental cost that issuers will incur as a result of the provisions in this final rule. We had previously estimated the costs associated with these risk adjustment and reinsurance enrollment data submission requirements in the Premium Stabilization Rule Supporting Statement that was approved with an October 31, 2015 expiration date. We will revise that supporting statement to reflect our updated estimate. We are also amending the tables in the Collection of Information section and Regulatory Impact Analysis section of this final rule so that the tables reflect only those incremental costs that result from provisions of this final rule., 966872=This final rule therefore implements the technical corrections to § 158.140(b)(5)(i), § 158.232(d), and § 158.232(c)(1)(i) as proposed in the December 2012 HHS Notice of Benefit and Payment Parameters for 2014 proposed rule (77 FR 73187)., 173205=Comment: We received one comment that HHS should provide issuers information to assess their risk scores and State average risk scores as part of the premium development process for 2014., 134483=The risk corridors program will protect QHP issuers in the individual and small group market against inaccurate rate setting and will permit issuers to lower rates by not adding a risk premium to account for perceived uncertainties in the 2014 through 2016 markets., 943550=With our proposed definitions of large and small employer and full-time employee, for purposes of Exchange and SHOP administration, we proposed policies to provide for a transition from different, existing State law. With respect to State-operated SHOPs for 2014 and 2015 only, we proposed that HHS will not take any enforcement actions against a State-operated SHOP for including a group in the small group market based on a State definition that does not include part-time employees when the group should have been classified as part of the large group market based on the Federal definition. Our proposal did not address application of State-specific definitions or counting rules that would exclude a small group health plan from protections provided under federal law. Similarly, during 2014 and 2015, an employer and a State-operated SHOP may adopt a reasonable basis for their determination of whether they have met the SHOP requirement to offer coverage to all full-time employees, such as the definition of full-time employee from the State's small group market definition or the Federal definition from section 4980H of Chapter 43 of the Code., 648947=Response: As described in § 153.235, HHS plans to allocate and disburse to each State operating reinsurance (and will distribute directly to issuers if HHS is operating reinsurance on behalf of a State), reinsurance contributions collected from contributing entities under the national contribution rate for reinsurance payments. The disbursed funds would be based on the total requests for reinsurance payments made under the national reinsurance payment parameters by all States and submitted under § 153.410, net of any adjustment under § 153.230(d). Thus, prior to the disbursement, HHS would uniformly adjust reinsurance payments, if applicable, following the collection of contributions and after the receipt of all claims for reinsurance payments, which must be submitted by April 30 of the year following the applicable benefit year. Following that adjustment, HHS will make reinsurance payments in States where HHS is operating reinsurance on behalf of the State, and will distribute funds to States operating reinsurance., 317272=We are finalizing the payment transfer formula as proposed, with several technical corrections. We clarify that IDF stands for induced demand factor in the equations, and modify the denominator of the plan average premium formula within the State average premium and geographic cost factor calculations to reflect the billable member calculation. Therefore, the 2014 HHS risk adjustment payment transfer formula is:, 908662=Response: HHS initially considered a claims submission deadline of March 31 but extended the deadline to April 30 to allow issuers more time to submit the necessary enrollment and claim data. The claims submission deadline of April 30 of the year following the applicable benefit year is the latest possible date for HHS to meet our payment processing and reporting obligations codified in the Premium Stabilization Rule. Reinsurance and risk adjustment payment reporting obligations must be completed before the calculations for the risk corridors and MLR programs, and consequently require claims to be submitted by April 30., 780810=Response: We clarify that for each silver health plan that an issuer offers, or intends to offer in the individual market on an Exchange, the issuer must submit the three silver plan variations. This policy will ensure that low-income individuals can receive cost-sharing reductions while enrolled in any silver level QHP offered through the Exchange, consistent with section 1402 of the Affordable Care Act., 527745=Response: Unlike the risk adjustment program, there will be no formal approval process for State-operated reinsurance programs. However, HHS will establish a consultative pre-implementation process to ensure that each State operating reinsurance is ready to operate beginning in 2014. HHS intends to work closely with States throughout the duration of the reinsurance program to ensure States' operational readiness., 359596=We proposed to add a new subsection, § 153.630, which set forth risk adjustment data validation standards applicable to all issuers of risk adjustment covered plans when HHS is operating risk adjustment. We proposed that, beginning in 2014, HHS will conduct a six-stage data validation program when operating risk adjustment on behalf of a State: (1) Sample selection; (2) initial validation audit; (3) second validation audit; (4) error estimation; (5) appeals; and (6) payment adjustments. We noted that States are not required to adopt this HHS data validation methodology. We are finalizing these provisions as proposed., 623638=Response: Under the “snapshot count method,” a health insurance issuer or self-insured group health plan would add the totals of covered lives on a date (or more dates if an equal number of dates are used for each quarter) during the same corresponding month in each of the first three quarters of the benefit year (provided that the dates used for the second and third quarters must fall within the same week of the quarter as the date used for the first quarter), and divide that total by the number of dates on which a count was made. For this purpose, the same months must be used for each quarter (for example, January, April and July). Under the “snapshot factor method,” a self-insured group health plan would use this PCORTF counting method over the first three quarters of the benefit year, provided that for this purpose, the corresponding dates for the second and third quarters of the benefit year must fall within the same week of the quarter as the date selected for the first quarter. We believe that those counting methods provide sufficient flexibility, and intend to keep these methods consistent with the PCORTF Rule., 137287=Issuers may incur some one-time fixed costs to comply with the provisions of the final rule, including administrative and hardware costs. However, issuer revenues and expenditures are also expected to increase substantially as a result of the expected increase in the number of people purchasing individual market coverage. In addition, States may incur administrative and operating costs if they choose to establish their own programs. In accordance with Executive Orders 12866 and 13563, we believe that the benefits of this regulatory action would justify the costs., 798840=We are finalizing our payment approach as proposed with five specific modifications. The first two modifications relate to reimbursement for cost-sharing reductions for Indians, which are discussed in section III.E.4.i. of this final rule. The third modification is the addition of paragraph § 156.430(a)(4), clarifying that issuers of multi-State plans must provide the estimates described in paragraphs (1) and (2) of § 156.430(a) to OPM, rather than the Exchange, in the time and manner established by OPM. The fourth modification authorizes HHS to adjust the advance payments for cost-sharing reductions during the benefit year. As we acknowledged in the proposed rule, QHP issuers will have access to limited data on its expected enrollees prior to 2014, which could reduce the accuracy of the estimates used to develop the advance payment amounts. Because we wish to use the advance payment process to protect QHP issuers from being required to bear the entire financial burden of providing cost-sharing reductions over the benefit year, we are finalizing a change from the proposed rule to authorize HHS to adjust the advance payments if the QHP issuer provides evidence, certified by a member of the American Academy of Actuaries in accordance with generally accepted actuarial principles and methodologies, that the advance payments for a particular QHP are likely to be substantially different than the cost-sharing reduction amounts provided by the issuer that will be reimbursed by HHS after the end of the year during the reconciliation process. We discuss this policy further below in relation to § 156.430(b)., 721752=We proposed to add § 155.1030 to set forth standards for Exchanges to ensure that QHPs in the individual market on the Exchange meet the requirements related to advance payments of the premium tax credit and cost-sharing reductions, as proposed in § 156.215 and described below. We proposed these standards under section 1311(c) of the Affordable Care Act, which provides for the Secretary to establish criteria for the certification of health plans as QHPs, as well as section 1321(a)(1), which provides general rulemaking authority for title I of the Affordable Care Act, including the establishment of programs for the provision of advance payments of the premium tax credit and cost-sharing reductions., 344880=Under § 153.610(a), issuers of risk adjustment covered plans will provide HHS with risk adjustment data in the form and manner specified by HHS. Under the HHS-operated risk adjustment program, issuers will not send, but must make available to HHS, anonymized claims and enrollment data, as specified in section III.G. of this final rule, for benefit year 2014 beginning January 1, 2014. Enrollee risk scores will be calculated based on enrollee enrollment periods and claims dates of discharge that occur between January 1, 2014 and December 31, 2014. Enrollee risk scores for subsequent benefit years will be calculated based on claims and enrollment periods for that same benefit year., 132992=These limitations of the individual market are made evident by how few people actually purchase coverage in the individual market. In 2011, approximately 48.6 million people were uninsured in the United States, [5] while only around 10.8 million were enrolled in the individual market. [6] The relatively small fraction of the target market that actually purchases coverage in the individual market in part reflects people's resources, how expensive the product is relative to its value, and how difficult it is for many people to access coverage., 142715=A Request for Comment relating to Exchanges was published in the Federal Register on August 3, 2010 (75 FR 45584). An Initial Guidance to States on Exchanges was issued on November 18, 2010. A proposed regulation was published in the Federal Register on July 15, 2011 (76 FR 41866) to implement components of the Exchange. A proposed regulation regarding Exchange functions in the individual market, eligibility determinations, and Exchange standards for employers was published in the Federal Register on August 17, 2011 (76 FR 51202). A final rule implementing components of the Exchanges and setting forth standards for eligibility for Exchanges (Exchange Establishment Rule) was published in the March 27, 2012 Federal Register (77 FR 18310)., 769486=We proposed that QHP issuers may rely on the reduced maximum annual limitations on cost sharing published in the final HHS notice of benefit and payment parameters to develop their silver plan variations for the 2014 benefit year., 936726=(2) A governmental program such as Medicare, Medicaid, or TRICARE. The preamble, and the proposed regulation text, also acknowledged that imposition of any minimum participation rate would have to be subject to the exception to the guaranteed issue requirements of section 2702 of the PHS Act and the then-pending proposed rule implementing guaranteed issue., 598293=Comment: Several commenters asked HHS to collect contributions after all reinsurance payment requests are submitted and aggregated, emphasizing that the reinsurance contributions should equal the 2014 requests for reinsurance payments., 590163=In the proposed rule, we estimated the Federal administrative expenses of operating reinsurance for the 2014 benefit year to be approximately $20.3 million, or 0.2 percent of the $10 billion in reinsurance funds to be distributed for the 2014 benefit year. This figure reflects the Federal government's significant economies of scale in operating the program, and results in a national per capita contribution rate of $0.11 annually for HHS administrative expenses., 112935=Beginning in 2014, individuals and small businesses will be able to purchase private health insurance through competitive marketplaces called Affordable Insurance Exchanges, “Exchanges,” or “Marketplaces.” Individuals who enroll in qualified health plans through Exchanges may receive premium tax credits that make health insurance more affordable and financial assistance to cover some or all cost sharing for essential health benefits. We expect that the premium tax credits, combined with the new insurance reforms, will significantly increase the number of individuals with health insurance coverage, particularly in the individual market. Premium stabilization programs—risk adjustment, reinsurance, and risk corridors—are expected to protect against the effects of adverse selection. These programs, in combination with the medical loss ratio program and market reforms extending guaranteed availability (also known as guaranteed issue), and prohibiting the use of factors such as health status, medical history, gender, and industry of employment to set premium rates, will help to ensure that every American has access to high-quality, affordable health care., 926042=We proposed at § 155.705(b)(11)(ii)(D) to permit a qualified employer participating in an FF-SHOP to establish, to the extent allowed by Federal and State law, different contribution percentages for different employee categories. We have concluded that this provision is inconsistent with the uniformity provisions established in Internal Revenue Service Notice 2010-82, which require employers to contribute a uniform percentage to all employees in order to claim a small business tax credit for health insurance premiums paid. Although the provisions in Notice 2010-82 apply only to employers claiming the tax credit in tax years through December 31, 2013, the use of a uniform percentage for all employees helps assure that the employer contributions do not violate other anti-discrimination provisions. We therefore are not finalizing the proposal at § 155.705(b)(11)(ii)(D) and the final rule redesignates the proposed paragraphs (b)(11)(ii)(E) and (F) as paragraphs (b)(11)(ii)(D) and (E). We are otherwise finalizing the rule as proposed., 866501=In this formula, the monthly expected allowed claims cost for the zero cost sharing plan variation would equal one-twelfth of the expected allowed claims costs allocated to EHB, other than services described in § 156.280(d)(1), for the standard plan, multiplied by a factor to account for the increased utilization that may occur under the zero cost sharing plan variation due to the elimination of the cost-sharing requirements. As proposed at § 156.470, the QHP issuer would submit the expected allowed claims cost information to the Exchange annually. The Exchange would then review this allocation, and submit the approved allocation to HHS, as described in § 155.1030(b)(2), for use in the advance payment calculation. HHS would then multiply the monthly expected allowed claims cost by the induced utilization factor, to arrive at the monthly expected allowed claims cost for the zero cost sharing plan variation. We proposed the following induced utilization factors for the zero cost sharing plan variation, based on our analysis of the HIC database from calendar year 2010., 118406=Section 1402 of the Affordable Care Act provides for the reduction of cost sharing for certain individuals enrolled in a QHP through an Exchange, and section 1412 of the Affordable Care Act provides for the advance payment of these reductions to issuers. This assistance will help eligible low- and moderate-income qualified individuals and families afford the out-of-pocket spending associated with health care services provided through Exchange-based QHP coverage. The statute directs issuers to reduce cost sharing for essential health benefits for individuals with household incomes between 100 and 400 percent of the Federal poverty level (FPL) who are enrolled in a silver level QHP through an individual market Exchange and are eligible for advance payments of the premium tax credit. The statute also directs issuers to eliminate cost sharing for Indians (as defined in section 4(d) of the Indian Self-Determination and Education Assistance Act) with a household income at or below 300 percent of the FPL who are enrolled in a QHP of any “metal” level (that is, bronze, silver, gold, or platinum) through the individual market in the Exchange, and prohibits issuers of QHPs from requiring cost sharing for Indians, regardless of household income, for items or services furnished directly by the Indian Health Service, an Indian Tribe, a Tribal Organization, or an Urban Indian Organization, or through referral under contract health services., 165966=Comment: One commenter expressed support for the proposal to collect user fees to fund HHS risk adjustment operations. Other commenters, though not commenting on risk adjustment user fees specifically, urged HHS to minimize or eliminate the fees it collects from issuers in order to maintain affordable coverage in the post-2014 health insurance market., 675093=We proposed in § 153.420(a) that an issuer of a reinsurance-eligible plan seeking reinsurance payments submit or make accessible data, in accordance with the reinsurance data collection approach established by the State, or HHS on behalf of the State. In § 153.420(b), we proposed that an issuer of a reinsurance-eligible plan submit data to be considered for reinsurance payments for the applicable benefit year by April 30 of the year following the end of the applicable benefit year. The April 30 deadline would apply to all issuers of reinsurance-eligible plans, regardless of whether HHS or the State is operating reinsurance. Further details surrounding the data collection process when HHS is operating reinsurance on behalf of a State is set forth in subpart H of part 153 and section III.G. of this final rule. We are finalizing these provisions as proposed., 390961=Commonwealth Care is a subsidized insurance program created as part of the 2006 Massachusetts health care reform law. It is administered by the Health Connector, and serves individuals with income up to 300 percent FPL who are not eligible for Medicaid and generally do not have access to employer-sponsored health insurance. As of December 2012, there are close to 198,000 members enrolled in the program. Massachusetts anticipates that, effective January 1, 2014, a portion of the current Commonwealth Care members will enroll in the expanded Medicaid program, and the remainder will access QHPs with tax credits through the Exchange., 150941=In § 153.100(c), we proposed to require that, for benefit year 2014 only, a State must publish a State notice by March 1, 2013, or by the 30th day following publication of the final HHS notice of benefit and payment parameters for 2014, whichever is later. Because the effective date of this rule will be 60 days after its publication, we will not finalize the proposed change to § 153.100(c). Nevertheless, consistent with our proposal, we are finalizing our policy that, for 2014 only, a State must publish a State notice of benefit and payment parameters by the 30th day following publication of this final rule by deeming the March 1 deadline specified in the existing regulation to be extended until the date that is 30 days after publication of this final rule., 159802=Comment: Commenters generally agreed with our approach to approving State risk adjustment programs beginning in benefit year 2015., 114540=The transitional reinsurance program and the temporary risk corridors program, which begin in 2014, are designed to provide issuers with greater payment stability as insurance market reforms are implemented and Exchanges facilitate increased enrollment. The reinsurance program will reduce the uncertainty of insurance risk in the individual market by partially offsetting issuers' risk associated with high-cost enrollees. The risk corridors program will protect against uncertainty in rate setting for qualified health plans by limiting the extent of issuers' financial losses and gains. On an ongoing basis, the risk adjustment program is intended to provide increased payments to health insurance issuers that attract higher-risk populations, such as those with chronic conditions, and reduce the incentives for issuers to avoid higher-risk enrollees. Under this program, funds are transferred from issuers with lower-risk enrollees to issuers with higher-risk enrollees.}",
    "textBeforeTable": "Response: We are finalizing our proposal to not adjust the HHS risk adjustment models for reinsurance payments since reinsurance is a temporary program and already offsets adverse selection. Comment: Several commenters supported our proposal to not adjust the HHS risk adjustment models for reinsurance payments. Response: We have revised the CSR adjustment to align with the CSR adjustment in section III.E. for enrollees in zero cost-sharing plan variations. Table 1 contains the final CSR adjustment factors. Comment: We received several comments that noted a typographical error in the zero cost-sharing adjustments. Response: We are finalizing the CSR adjustment factor as proposed, with the modification to the typographical error described in Table 1 below. The CSR adjustment factor for the HHS risk adjustment models is intended to account for the increased plan liability due to increased utilization of health care services by enrollees receiving CSRs. Comment: We received comments that were generally supportive of the CSR adjustment to risk scores. One commenter stated that the proposed factors do not adequately account for changes in utilization as enrollees in cost-sharing plan variations may also use more high cost services. Another commenter requested that HHS clarify whether plan liability for increased utilization due to CSR is accounted for by the CSR adjustment factor in the HHS risk adjustment models. We",
    "textAfterTable": "200-250 percent of FPL Plan Variation 73 percent 1.00 >250 percent of FPL Standard Plan 70 percent 1.00 Zero Cost-Sharing Recipients     <300 percent of FPL Platinum (90 percent) 1.00 <300 percent of FPL Gold (80 percent) 1.07 <300 percent of FPL Silver (70 percent) 1.12 <300 percent of FPL Bronze (60 percent) 1.15 >300 percent of FPL Limited Cost-Sharing Recipients 1.00 (5) Model Performance Statistics To evaluate model performance, we examined the R-squared and predictive ratios of the HHS risk adjustment models. Comment: Several commenters asked for further details on the statistical performance of the HHS risk adjustment models. Response: HHS analyzed the statistical performance of each model (adult, child, infant at each metal level). The R-squared (the percentage of individual variation explained by the model) for each model was within the range of published estimates for concurrent models. [9] These values can be found in Table 8. Additionally, the predictive ratios for the overall samples for each of the 15 models were also within the range of published estimates. (6) Summary of Models For clarity, we describe here the HHS risk adjustment models that we are finalizing. An individual's risk score will be calculated for adults",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}