{
    "relation": [
        [
            "Activity",
            "Explore the village of Chitwan on a tour by traditional ox and cart",
            "Explore the heart of the incredible Chitwan National Park on a jeep safari (alternative to the 20,000 Lake excursion)",
            "Witness the fascinating and impressive local tradition of Tharu stick dancing",
            "Canoe through the rivers of the Chitwan National Park, and explore the area on a walking safari in search of rhino and other wildlife",
            "Take a jeep safari around the stunning wetland area of 20,000 Lakes"
        ],
        [
            "Approximate Cost",
            "Included in Kitty",
            "NPR 3500",
            "Included in Kitty",
            "Included in Kitty",
            "Included in Kitty"
        ]
    ],
    "pageTitle": "Trip Notes for India Circuit between Mumbai and Kathmandu",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/india-circuit-between-mumbai-and-kathmandu?format=dossier&vid=5650&did=67081",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414931039,
    "recordOffset": 414874625,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40263=Cochin in Kerala is a town split between the mainland and a group of islands just off the coast, so a boat-trip is the best way to tour the main sights, which include the oldest church in India and Vasco de Gama's final resting place. Opposite Fort Cochin you can watch fishermen working their cantilevered Chinese fishing nets, typical to this region. Interestingly the town is also home to a dying Jewish community that has roots going back as far as 1000 AD and there is a synagogue here that was built in the sixteenth century. This is also the home of Kathakali dancing, India's most spectacular dance drama. The hundreds of different arrangements are based on stories from the Ramayan and Mahabharata - the two epic stories of Indian mythology., 59722=Chennai (previously known as Madras) was the site of the first major settlement of the East India Company in 1639, and is now the fourth largest city in India. The town grew up around the Fort St George and along Mount Road and some interesting historic buildings can be seen here. It's true that it is busy, noisy and often extremely hot, but in many ways it is a surprisingly efficient and orderly place by Indian standards. The Government Museum is worth a visit if you're interested in the history of the city, and for Motorcycle enthusiasts the Enfield Factory tour is a must - though it only runs on certain days of the week, so check days and times before you make the journey. You might prefer to just wander the streets and soak up the atmosphere, exploring the many temples and bustling local markets., 151456=United States. http://travel.state.gov/travel/travel_1744.html, 31044=The grand site of Hampi was the last capital of the last great Hindu Kingdom of Vijayanagar. Its fabulously rich princes built Dravidian temples and palaces which won the admiration of travellers between the 14th and 16th centuries. Conquered by the Deccan Muslim confederacy in 1565, the city was pillaged over a period of six months before being abandoned., 119536=Please note that this trip spends time above 2800 metres/9200 feet where it is possible for travellers to experience some adverse effects on your health due to the altitude, potentially including Acute Mountain Sickness (AMS), High Altitude Cerebral Edema (HACE) and High Altitude Pulmonary Edema (HAPE)., 53476=The united territories of Pondicherry are unmistakeably and charmingly French, complete with a Hotel de Ville, French consulate and police who wear red \"kepis\" hats and belts. Pondicherry is also the home of the famous Sri Aurobind Ashram and its offshoot Auroville. The Ashram, founded by Sri Aurobindo in 1926, is one of the most popular in India amongst Westerners, and also one of the most affluent. The town enjoys duty free status and is known for its leather goods and hand-made paper products. With its French influence, many of the shops have a distinctly European feel., 128805=Tel +91 22 2218 5608, 30548=The city of Hampi bears exceptional testimony to the vanished civilization of the kingdom of Vijayanagar, which reached its apogee under the reign of Krishna Deva Raya (1509-30). The type of structure illustrates a significant historical situation: that of the kingdoms of South India which, menaced by the Muslims, were occasionally allied with the Portuguese of Goa., 191664=These trip notes were printed on 02/08/2015, 103629=Gangtok is the capital of Sikkim, an Indian state that was an independent kingdom until 1975, and is considered to be one of the last Himalayan Shangri-Las. In recent years the region has seen ever increasing numbers of tourists, and Gangtok in particular has seen a lot of development. Fortunately though, the landscape here makes building roads quite difficult, so you don't have to go too far to get off the beaten track. In Gangtok itself, you might be interested in visiting some of the town's many temples, the monastery or the Institute of Tibetology. Also nearby is an orchid sanctuary, where some 450 species of local orchids can be observed, particularly spectacular if you happen to be there during their flowering season., 33582=Mysore is one of India's most attractive towns. Unlike some of India's biggest cities it feels quite manageable in size, and it's beautiful buildings are packed full of history, and the Maharajah’s Palace, the Lalitha Mahal (Summer Palace) and Shri Chamarajendra art gallery are all definitely worth a visit. Historically the town was the capital of the mighty Maharaja kingdom of Mysore, ruled by the same family from 1399 until 1947. There was a brief period where the throne was usurped by one of the most colourful of Indian rulers, Hyder Ali and then by his famous son Tipu Sultan. Today the city is the state capital and one of the centres of the silk trade. It's well laid out with wide streets and many gardens, making it a pleasant place to wander around. It is also one of the major incense manufacturers in India - some call it \"The Sandalwood City\" and you will find yourself enveloped by the aromas of sandalwood, jasmine, rose and musk., 63894=Tel: +91 44 28191010, 185968=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 87658=Tel - +91 33 4060 1122, 125923=As of March 2015, you will need to apply in person at your closest Indian Mission as they will no longer accept postal applications. You will need to make an appointment at the website of the Indian Embassy in your country, and turn up at the nearest mission to complete your applicaton in person. For UK residents, please go to the website - http://in.vfsglobal.co.uk – to fill in the online visa form and book an appointment to complete the application. Please follow the instructions on the website to help you obtain your visa; the instructions are very clear., 98892=Karmi Farm was originally known as Karmi Estate and is the home of the Pulger-Frame family who have been associated with the area for over 200 years. Ronald Frame was a Scottish tea planter who came to this area in 1950 and met local Deki Pulger, marrying her 10 years later. Ronald managed a tea estate in the area in Darjeeling until 1967, bringing up his young family there - but then the family left India, although they did return for family holidays over the years. Today Ronald's son Andrew has returned to Karmi, offering travellers the opportunity to visit the farm and gain a fascinating insight into the lives of the hill farmers who live here and in the surrounding area. The farm itself is spectacularly situated with amazing views and a unique atmosphere, the perfect place for a bit of rest and relaxation. Bird-watching, trekking and sometimes yoga are also all on offer he, depending on your own particular interests., 99911=Through the generations Karmi has always been a place for the local people to go for help. Before the jeepable roads reached the area it was at least a 3 hour walk to get to the nearest hospital so there was seen to be a real need for some simple health care for the local community. With help from friends in the UK the clinic started up in September 2001. Donations came from friends and guests staying at the farm with volunteer doctors and nurses coming out from the UK., 131407=As of November 2014, there is an e-visa option (visa on arrival) available to selected nationalities (including Australia, New Zealand, Germany and USA, but not including the UK, Ireland, Canada, and most EU countries). There are many restrictions, including a maximum non-extendable stay of 30 days and only being able to enter at major airports; as such we are not recommending this option until the restrictions are relaxed. It is very important that you do not use this option if you are joining the trip in Chennai, as we need a copy of your visa in advance for the Odisha region. If we do not have this in advance, we will not be able to obtain your permits (see above) or train tickets. , 129246=Eugene Pram, Pram Tours, 436 Barkat Nagar, Tonk Phatak, Jaipur, 302015, India Tel: +91 14 1259 4205, 28156=The population was roughly 200,000 by 1543. Malaria and cholera epidemics ravaged the city in the 17th century and it was largely abandoned; only having a remaining population of 1,500 in 1775. It was then that the viceroy moved to Panjim. It continued to be the de jure capital of Goa until 1843, when the capital was then shifted to Panjim.  The abandoned city came to be known as \"Velha Goa\" (in Portuguese, 'Old Goa'), to distinguish it from the new capital Nova Goa (Panjim). Velha Goa was incorporated into the Republic of India in 1961, together with the rest of Goa.}",
    "lastModified": "Sun, 02 Aug 2015 16:23:27 GMT",
    "textBeforeTable": "Tel: +91 2222185608 Mumbai 400039 Cuffe Parade, Colaba 4 Panday Road Hotel Supreme Hotel for the night: Hotel Supreme In Mumbai we stay in a good quality hotel. The following day will be a free day to explore the city. This is also an opportunity to take a tour of the Dharavi slum areas of the city. There will be an important group meeting at 6:00pm at the joining hotel in Mumbai - please look out at the reception for a note from you tour leader with further details about this meeting. Otherwise, today is free to explore the sights and sounds of Mumbai.  Border Information: If joining the trip in Mumbai, you will most likely enter India from Mumbai Chhatrapati Shivaji International Airport. ( Sun 02 Aug to Mon 03 Aug ) Day 1 to 2: Mumbai ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-02 16:23:27.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-02 16:23:27.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-08-02 16:23:27.000000 [timezone_type] => 3 [timezone] => UTC )",
    "textAfterTable": "About Mumbai: Mumbai is on the west coast of India and is probably the most cosmopolitan city in the country. It's also home to the largest film industry in the world, Bollywood. So if you've never seen an Indian movie before, this is the place for it. Full of high-drama, romance, suspense, music and dancing, Bollywood films are all-singing, all-dancing extravaganzas. It's pure, straightforward and unadulterated entertainment and escapism, so even if you can't understand the language, they still make an interesting spectacle. Combine India's version of LA with a hefty dose of traffic, busy streets, lively bazaars, briefcase clutching businessmen cutting international deals in soaring skyscrapers and some impressive colonial architecture, and there you have Mumbai. The city is a mad mixture of horrific poverty standing side-by-side with prolific consumerism; this is the financial capital of the sub-continent and it has the shopping centres, bars and restaurants to match - but more than half the inhabitants live in the slums. Mumbai can be a bit of a shock to the system and an assault on the senses. But once you get your head around it, you'll begin to appreciate all the city has to offer. There's tons to do here, wander the streets and discover some of the beautiful old colonial architecture and Art Deco buildings, treat yourself to a meal in one of the country's best restaurants, and shop until you drop in the bazaars. In the evening, you can visit Chowpatty",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}