{
    "relation": [
        [
            "Feature Name",
            "DHCP Server On-Demand Address Pool Manager for Non-MPLS VPNs",
            "DHCP ODAP Server Support",
            "DHCP Server On-Demand Address Pool Manager"
        ],
        [
            "Releases",
            "12.2(15)T 12.2(28)SB 12.2(33)SRC",
            "12.2(15)T 12.2(28)SB 12.2(33)SRC",
            "12.2(8)T 12.28(SB) 12.2(33)SRC"
        ],
        [
            "Feature Configuration Information",
            "This feature was enhanced to provide ODAP support for non-MPLS VPNs. The following command was modified by this feature: peer default ip address.",
            "This feature introduces the capability to configure a DHCP server (or router) as a subnet allocation server. This capability allows the Cisco IOS DHCP server to be configured with a pool of subnets for lease to ODAP clients. The following commands were introduced or modified by this feature: show ip dhcp binding, subnet prefix-length.",
            "The ODAP manager is used to centralize the management of large pools of addresses and simplify the configuration of large networks. ODAP provides a central management point for the allocation and assignment of IP addresses. When a Cisco IOS router is configured as an ODAP manager, pools of IP addresses are dynamically increased or reduced in size depending on the address utilization level. The following commands were introduced or modified: aaa session-id, clear ip dhcp binding, clear ip dhcp conflict, clear ip dhcp subnet, ip address-pool, ip address pool, ip dhcp aaa default username, origin, peer default ip address, show ip dhcp pool, utilization mark high, utilization mark low, vrf."
        ]
    ],
    "pageTitle": "IP Addressing: DHCP Configuration Guide, Cisco IOS Release 12.4T - Configuring the DHCP Server On-Demand Address Pool Manager [Cisco IOS Software Releases 12.4 T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipaddr_dhcp/configuration/12-4t/dhcp-12-4t-book/config-dhcp-addr-pm.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365762087,
    "recordOffset": 365724278,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{208745=RFC 1542, 69437=Router(config)# radius-server host 172.16.1.1 auth-port 1645 acct-port 1646, 209328=RFC 2685, 146358=Router(config-vrf)# route-target both 100:1, 209047=RFC 2131, 144890=Router(config-vrf)# rd 100:1}",
    "textBeforeTable": "Feature Information for the DHCP On-Demand Address Pool Manager Table 1 Use Cisco Feature Navigator to find information about platform support and Cisco software image support. To access Cisco Feature Navigator, go to www.cisco.com/go/cfn. An account on Cisco.com is not required. The following table provides release information about the feature or features described in this module. This table lists only the software release that introduced support for a given feature in a given software release train. Unless noted otherwise, subsequent releases of that software release train also support that feature. Feature Information for the DHCP Server On-Demand Address Pool Manager http://www.cisco.com/cisco/web/support/index.html The Cisco Support website provides extensive online resources, including documentation and tools for troubleshooting and resolving technical issues with Cisco products and technologies. To receive security and technical information about your products, you can subscribe to various services, such as the Product Alert Tool (accessed from Field Notices), the Cisco Technical Services Newsletter, and Really Simple Syndication (RSS) Feeds. Access to most tools on the Cisco Support website requires a",
    "textAfterTable": "Glossary AAA --authentication, authorization, and accounting. Suite of network security services that provide the primary framework through which access control can be set up on your Cisco router or access server. Cisco Access Registrar --A RADIUS server that supports service provider deployment of access services by centralizing AAA information and simplifying provisioning and management. client --A host trying to configure its interface (obtain an IP address) using DHCP or BOOTP protocols. DHCP --Dynamic Host Configuration Protocol. incremental subnet size --The desired size of the second and subsequent subnets requested for an on-demand pool. initial subnet size --The desired size of the first subnet requested for an on-demand pool. IPCP --IP Control Protocol. Protocol that establishes and configures IP over PPP. MPLS --Multiprotocol Label Switching. Emerging industry standard upon which tag switching is based. ODAP --on-demand address pool. PE router --provider edge router. PPP --Point-to-Point Protocol. RADIUS -- Remote Authentication Dial-In User Service. Database for authenticating modem and ISDN connections and for tracking connection time. relay agent --A router that forwards",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}