{
    "relation": [
        [
            "Required Hardware & Software",
            "Windows CE",
            "Operating System"
        ],
        [
            "Item",
            "CPU",
            "Windows CE"
        ],
        [
            "Specification",
            "ARM, XScale, X86 CPU",
            "Windows CE 5.0, 6.0"
        ]
    ],
    "pageTitle": "www.opctechs.com - Products",
    "title": "",
    "url": "http://www.opctechs.com/opcserver-Fatek-eth.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 635000608,
    "recordOffset": 634992406,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34136=2007-07-27}",
    "lastModified": "Tue, 21 Jul 2015 07:18:12 GMT",
    "textBeforeTable": "Windows CE   With Service Pack 1 Windows 2008 Server 64 With Service Pack 1 Windows 2008 Server 32 With Service Pack 1 Windows 7 64 bit With Service Pack 1 Windows 7 32 bit With Service Pack 1 Windows Vista Business 64 With Service Pack 1 Windows Vista Business 32 With Service Pack 1 Windows 2003 Server 64 With Service Pack 1 Windows 2003 Server 32 With Service Pack 1 Windows XP Professional 64 With Service Pack 1 Windows XP Professional 32 With Service Pack 4 Windows 2000 Professional   Windows NT 4.0 The old version should install the DCOM components Windows 98 Operating System 100 MB disk space HDD space 256 MB RAM at least Memory Pentium 133 or higher CPU IBM Compatible Computer Specification Item Required Hardware & Software",
    "textAfterTable": "    　Ethernet Communication Protocol ◎ Fatek Ethernet proprietary protocol     OvOPC Compliance   Compliance Testing is a process which verifies that an OPC product implements a specification properly by using a standard software test tool developed by the OPC Foundation. This test tool, called the Compliance Test Tool or CTT, is currently available for several specifications. Vendors can download the CTT from the OPC Foundation website and run the tests at their site. The company’s administrator or designated product manager for the OPC Foundation WEB site can then attach the encrypted file generated by the CTT to the appropriate OPC Foundation Product catalog item. The OPC Foundation Product Catalog will display the results to the public. OPC Users should",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}