{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Take the train out to the city or go by the lake!",
            "Food is bland sometimes, but the salad and sandwich bar adds a bit of variety to everyday dining.",
            "Dorms are kept clean and tidy, and many events are planned throughout the year.",
            "Academically Rigorous, especially if you are in the honors program and/or are a science major.",
            "Don't make Loyola a back up school, it is a great school to have as your first option. Try to look at professor rating websites to choose the best in the batch. Also, don't forget to apply for the honors program if you are recommended, it is a great program.",
            "Loyola is a great school. I love how it is a part of the city, and right by the beautiful Lake Michigan. The students and faculty here are very supportive and friendly."
        ]
    ],
    "pageTitle": "Loyola University Chicago Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Loyola-University-Chicago/reviews?_escaped_fragment_=/show/23582",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00254-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906990759,
    "recordOffset": 906841727,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{261396=loyola university-chicago offers students a challenging and diverse educational experience. loyola students have access to three campuses throughout the chicago metropolitan area as well as study abroad opportunities at campuses in rome and beijing. with its rich jesuit traditions, its fabulous location, and a 15:1 student/faculty ratio, students are nurtured and challenged to make a meaningful difference in the world., 571924=All of the dining here is pretty good. The best place to eat is (currently) Simpson Dining. I would advise not eating at Lakeshore Dining, except come April we won't even have Lakeshore Dining. They are opening up a brand new student center where I'm sure there will be exceptional food., 690229=Well there are the rocks by the lake that everyone loves, and the beach on warmer days to just sit and relax. An unusual tradition would be christmas on campus or the new years party that is held almost every year. The christmas on campus is self explanatory, you basically have christmas on campus! It's wonderful because everything is decorated! The new years party is in early september and its a small celebration for all the students and staff to welcome the new academic school and wish everyone good luck in their endeavors!, 801808=© 2015, Cappex.com, LLC, 102840=Wolf and Kettle day is in March every year when we celebrate the donors of our education and those who help pay for tuition. FUN, 18578=Do not take a class at 8:30 offered at the Water Tower Campus!One of the classes I would highly recommend is Human Values in Literature with Mr. Fruhauff. Overall, try to have an open mind about courses and balance out your schedule so that it fits your needs. Do not try to do too much in one semester but do try to get involved in extra curriculars. You will not regret it.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 36 out of 37 people found this review useful. 1 of 170 Zachary from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Loyola University Chicago Reviews Loyola University Chicago › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Heather 07/31/2009 Reviewer is A current student here. 21 out of 22 people found this review useful. 2 of 170 Categories Comments Great for these types of students This school is PERFECT for nursing students! Loyola's nursing program is in the 95th percentile for the NCLEX. Tips for prospective students Apply as soon as you possibly can if you think you might want to go to Loyola, this will help you get the most aid since scholarships are on a first come, first serve basis. Also, if you plan to attempt to get into the nursing program spots fill up quickly, so the sooner you apply the better. But you should keep one thought in mind academically, it is easy to get into Loyola but hard to stay. Loyola will continuously challenge you in order to bring out your best, however it will not be easy! Bang for the buck I believe that Loyola is worth going to regardless of cost because of the outstanding faculty and program for nursing. However, it is still",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}