{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "So far it seems very safe.",
            "No experience personally but it is available.",
            "Almost anything any other college can offer.",
            "Studious, laid back, down to earth,",
            "The giant 'M' is for mining. The original intent of the college. You can see forever from the hill it is on. Made out of white stones form previous students.",
            "Cheapest engineering school in Wisconsin.",
            "Walk in the woods, see the M', see Dubuque.",
            "Top notch fresh food.",
            "Clean and quiet.",
            "Challenging but doable.",
            "Come for a tour and be convinced.",
            "Platteville is a nice small sized college. Located in farm country. Great value for the dollar."
        ]
    ],
    "pageTitle": "University of Wisconsin-Platteville (UW-Platteville) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Platteville/reviews?_escaped_fragment_=/show/5385",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887794807,
    "recordOffset": 887744952,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26961=The dorms are fairly nice, and I would say they're about the same size as any other campus. The oldest hall (Porter) was just renovated, the newest hall, Rountree, just opened in Fall 2012 and is really nice, and there's another hall being built that should be done by fall 2013. All the halls are pretty much on the same side of campus (except for a few, especially Rountree), so it's a nice separation of academic life and dorm life. The dorms have a lot of activities, including a weekly Friday Night Club. There are also a lot of options. There are several traditional halls, where you share a room with one person and a bathroom with your wing. There are also apartment-style dorms (Southwest Hall) where each suite has four single bedrooms, a living room, a dining area with kitchenette, and two bathrooms. There's also suite-style, where you share a bedroom with one other person, and each suite of two shares a bathroom, fridge, and microwave with another suite of two., 12610=I love the campus atmosphere, being from a graduating class of 32, platteville is the perfect size. I guess one thing that the guys like, the guy to girl ratio is 2:3, keeping them happy! It's not too city like, it has the town and necessities, but it's also very country...we have the largest M to climb!, 16505=Many of the classes are incredibly simple. The higher level classes are much better, but anything 2000 and bellow, you are treated as if you are a freshman in high school. It's really frustrating to be taught an education that is greatly toned down and edited. The number of required survey classes for general education just makes this experience extended for all four years..., 169003=Incredible value. You rent textbooks instead of buying them for a ridiculous price. No tuition increase from 2012-2013., 230697=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 12 out of 13 people found this review useful. 1 of 49 Marissa from Oregon, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Cassandra from Oconto Falls, WI 08/30/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 4 out of 4 people found this review useful. 3 of 49 Categories Comments Campus Safety On every light post there is a blue glowing button for safety and to press of you are in danger. Authorities will be there within minutes. There are cameras for safety as well. Greek Life As an incoming freshman I have already received many invites to Greek living. They take it serious yet fun. The Greek life at Platteville is actually pretty large. Clubs and Activities Platteville has over 200 clubs and activities that you can join and you can find them all at their website under pioneer link. Great for these types of students Outgoing yet enjoys a little peace and isn't a huge",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}