{
    "relation": [
        [
            "Source",
            "Model",
            "Error",
            "C Total"
        ],
        [
            "DF",
            "24",
            "357",
            "381"
        ],
        [
            "Sum of Squares",
            "105.28649",
            "9.48238",
            "114.76887"
        ],
        [
            "Mean Square",
            "5.01364",
            "0.02634",
            ""
        ],
        [
            "F Value",
            "190.344",
            "",
            ""
        ],
        [
            "Prob>F",
            "0.0001",
            "",
            ""
        ]
    ],
    "pageTitle": "Microwave Oven Regression Model",
    "title": "",
    "url": "http://stats.bls.gov/cpi/cpimwo.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 228872895,
    "recordOffset": 228832833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39276=0.7101415, 76522=Consumer Digest\u0092s 2000 Annual Buying Guide, 4674=Effective with the CPI for July 2000, BLS has extended hedonic quality adjustments to Microwave ovens and Refrigerators, two products in the Major Appliances item stratum. The relative importance (share of weight), as of December 1999, for this stratum was 0.205 percent in the CPI for all Urban Consumers (CPI-U) and 0.236 percent in the CPI for Urban Wage Earners and Clerical Workers (CPI- W). Within Major Appliances, Microwave ovens are estimated to represent 11 percent of the weight and Refrigerators about 33 percent. In October 2000, BLS will further extend hedonic quality adjustments to Washers and Dryers, two other products in the Major Appliances item stratum. The remaining products in this stratum—those that will not be subject to hedonic quality adjustment at this time—include Freezers and Stoves and Ovens., 55592=First, the small number of microwave oven substitution price quotes that were quality adjusted may have been to few to make a (representative) impact on the Major Appliances indexes in 1999-2000. Microwave oven substitution price quotes accounted for less than two percent—on average, four of 215 prices—of the monthly CPI sample for Major Appliances from August 1999 to April 2000 and only half of these microwave substitutions had their price changes adjusted using the hedonic technique., 13537=The set of quality attributes collected for each of the 381 microwave ovens in the sample are represented on the CPI checklist for this item (see last attachment). In each of the quality characteristic categories, CPI field economists selected the specific characteristic element that best described the item they were pricing. For example, if an Amana countertop model with a (oven) capacity of 1.6 cubic feet and cooking power of 1000 watts had been selected by the field economist, this would be designated on the CPI data collection document by selecting the A1, B1, D3, and E2 specification elements—see last attachment., 53775=Attachments 1 and 5 indicate that the U.S. CPI for Major Appliances would have increased 0.6 percent instead of the official index increase of 0.8 percent if hedonic quality adjustment methods had been applied to microwave oven (substitution) price changes from August 1999 through April 2000. Given the small representation that microwave oven substitution price changes had in the Major Appliances CPI during the study period—an average of just four price quotes per month—the impact at the U.S. level was relatively large. In addition, the empirical results suggest that the official index for Major Appliances rose more rapidly than if hedonic quality adjustments had been applied to microwave oven substitution price changes during the study period., 10396=From August 1999 through April 2000 Major Appliances employed, on average, 215 price changes to calculate its U.S. level monthly price index (see attachment 2). Approximately 10 percent, or 22, of these price changes were substitution price changes. In comparison, microwave ovens accounted for, on average, 39 of the 215 price changes used to calculate Major Appliances index, and averaged (just) four substitutions per month from August 1999 through April 2000., 42184=0.9242426, 54589=Attachment 6 illustrates the differences between the published and quality adjusted indexes on a monthly basis for the nine-month period in the study—August 1999 through April 2000. Comparisons of the quality adjusted and published Major Appliances price indexes reveal the following: In months when the index increased, the quality adjusted index rose faster than the published index in one month (August), both indexes rose at the same rate for two months (September and April), and the quality adjusted index rose slower than the published index in the remaining two months (November and March). In addition, in the remaining four months when the index fell, there were two months (December and February) in which both indexes fell at the same rate and two months (October and January) in which the quality adjusted index fell faster than the published index., 7070=The microwave oven was introduced into the CPI sample in 1978.5 Since its' inception to the CPI, microwave ovens have been represented in three item stratum price indexes over three CPI revisions:, 5606=In 1947, Raytheon demonstrated the world's first microwave oven and called it a \"Radarange.\"3 The first microwave ovens cost between two and three thousand dollars and were sold primarily to the commercial marketplace. By the early 1950s, U.S. appliance makers began showing interest in the microwave oven since it had the ability to provide more flexibility to the consumer by reducing the time needed to cook different meals. In 1955, the Tappan Stove Company—under a licensing agreement with Raytheon—brought the first consumer microwave ovens to the U.S. market with a price tag of $1,300. These first consumer microwave ovens were more compact and less powerful than their \"Radarange\" predecessors and reflected only modest sales at their price range., 166115=1999-2000 U.S. Level Price Relatives, Indexes and, 28532=It was assumed that microwave ovens with a higher number of sequential cooking stages offered more convenience and greater value to the consumer than microwave ovens with a lesser number of sequential cooking stages ceteris paribus. However, the December 1999 Consumer Reports study on microwave ovens notes that \"most models can be programmed to cook for at least two sequential stages and up to about 100 minutes in all.\"14, 180146=July to Apr, 43670=0.8532257, 190054=Last Modified Date: October 16, 2001, 52753=Monthly price indexes were simulated for August 1999 through April 2000 to determine the impact of quality adjusted microwave oven substitution price changes on the Major Appliances CPI. First the published indexes, or without quality adjustment indexes, were recreated by Statistical Analysis System (SAS) computer programs using historical CPI data. The duplication of the published indexes provides a \"control\" environment from which the quality adjusted Major Appliances indexes can be compared., 27054=Most microwave ovens can control the (total) cooking power or wattage—most commonly this feature is given in 10 percent increments ranging from a low power of 10 percent to a high power of 100 percent. The December 1999 Consumer Reports study on microwave ovens notes that \"most models\" have 10 power settings.13 Similarly, most of the observations in the microwave oven sample were described as possessing 10 power settings. Other values collected for this specification element were \"manual setting,\" \"not specified,\" and \"not applicable.\" Since 10 power settings was the only specification element listed in the \"Number of Power Settings\" category and no other meaningful variables could be created, the 10 power settings variable was not included in the final model., 46901=0.062619, 77031=Silver, M.S. (1998), \"An evaluation of the use of hedonic regressions for basic components of consumer price indices,\" Third Meeting of the International Working Group on Price Indices, Statistics Netherlands, Voorburg: Netherlands (1998) 1-12. http://www.statcan.ca/secure/english/ottawagroup/pdf/23SIL3.pdf (accessed November 1999)., 76697=Fixler, Fortuna, Greenlees and Lane (1999), \"The Use of Hedonic Regressions to Handle Quality Change: The Experience in the U.S. CPI,\" Presented at the Fifth Meeting of the International Working Group on Price Indices; August 1999; Pages 1-20. http://www.statice.is/ottawa/bls.rtf (accessed November 1999)., 43972=0.101837, 76420=Consumer Digest\u0092s 1999 Annual Buying Guide, 16225=Basically, two types of microwave ovens are sold in today's appliance market. Countertop models are more frequently advertised by manufacturers and retailers and accounted for approximately 76 percent of the microwave ovens in the sample. Consumers who have smaller kitchens and lack counter space can opt for an over-the-range model—this type of microwave oven accounted for the remaining 24 percent of the microwave oven sample. All over-the-range models come with an installation kit for mounting. In addition, since over-the-range models take the place of a range or stove exhaust hood, all come with a ventilation fan that exhaust both the range and microwave oven cooking gases. The mean prices for the 288 countertop models and 93 over-the-range models in the hedonic sample were $140.64 and $416.31, respectively. By way of comparison, a December 1999 Consumer Reports study on microwave ovens found that the countertop ovens they tested sold for $200 or less while over-the-range models typically sold for about $350 to $450.10 Dummy or indicator variables were created for both types of microwave ovens. The over-the-range variable was included in preliminary models and was expected to have a large, positive impact on price., 57925=Microwave Oven Characteristics That May Be Important in Future Models, 48515=During the study period from August 1999 through April 2000, a total of 39 microwave oven substitution price changes—an average of (just) four per month—occurred in the Major Appliances price index sample. For each microwave oven substitution price quote, differences in the specification or characteristic data of the old and new items were identified to see if the parameter estimates in the hedonic model could be utilized to quality adjust the official price change., 63750=Many manufacturers and retailers of consumer appliances are optimistic that these \"smart\" microwave ovens—and other \"smart\" appliances—will become popular with consumers when they start to become available to U.S. consumers in early 2001. Their optimism is based, in part, on \"the swift acceptance of the Internet among consumers and because of the soon-to-be-widespread availability of so called 'broadband' internet access, where home users will have swift connections that eliminate the delays and slow downloads of standard modem connections.\" 24, 40934=0.8452731, 3113=The U.S. Consumer Price Index (CPI) for Major Appliances would have increased 0.6 percent instead of the official index increase of 0.8 percent if hedonic quality adjustment methods had been applied to microwave oven (substitution) price changes from August 1999 through April 2000 (see attachment 1). This quality adjusted empirical result provides a more refined measure of price inflation for Major Appliances since there are a greater number of \"pure\" price changes used to calculate this item stratums' price index., 65126=\"Currently, the electronics industry is mulling over two emerging, would-be standards for home networking of smart appliances, both based on software widely used in personal computers and across the Internet. One of the home networking standards—known as Universal Plug and Play (UPnP)—is being developed by a team of appliance hardware and software manufacturers headed by Microsoft. The competing platform—a language from Sun Microsystems called Jini—has the same goals as UPnP, which is to provide a standard for networking home appliances. The first generation of both types of smart appliances should be hitting the market in early 2001.\"26, 8921=Microwave ovens were selected as a product that would benefit from hedonic regression modeling since manufacturers provide a vast range of sizes, configurations, and features. In the Consumer Digest\u0092s 2000 Annual Buying Guide, the latest annual review on microwave ovens notes that, 45866=0.7001641, 181396=Aug to Apr, 40613=0.7371506, 40285=0.9442307, 64373=Many retailers are expected to aggressively advertise smart appliances when they become available in the U.S. economy sometime in early 2001. For example, Sears intends to create room settings inside many of the 860 full-line, mall-based Sears stores to explain to consumers the value-added properties of these new (smart appliance) products and services. In addition, these new smart appliance products will be demonstrated so consumers can relate them to their own living rooms and kitchens. Recently, a spokesperson for Sears indicated that the company \"views the Internet as a huge catalyst that will drive transformation in the home, and we intend to position ourselves to play whatever role is necessary.\" 25, 77393=Lane, Walter (2000), \"Addressing the New Goods Problem in the Consumer Price Index,\" Presented at the Issues in Measuring Price Change and Consumption Conference, Bureau of Labor Statistics, Washington, D.C., June 5-8, 2000, pages 1-26., 165199=The graph above shows the percent of large and midsize countertop microwave ovens bought new between 1995 and 1999 that were ever repaired or had a serious problem that was not repaired. The data apply to all models within a brand and do not account for manufacturing changes that could affect the reliability of current models. Source: Consumer Reports, December 1999, page 31., 6425=In 1965, Raytheon acquired Amana Refrigerators, Incorporated—an appliance maker with a well established distribution channel—and, in 1967, introduced to the U.S. market the first \"countertop\" model of microwave ovens that sold for $495 retail and were smaller, safer and more reliable than previous models. By 1986, 25 percent of U.S. households owned a microwave oven, up from less than one percent in 1971.4 Assuming microwave oven penetration into U.S. households was constant during this 15 year period, about 12 to 13 percent of U.S. households would have owned a microwave oven in 1978., 21762=Interestingly enough, the recent report on the CPI by The Conference Board, notes that \"In existing products, probably the biggest problem in quality change that the CPI never recognizes (is) the subtle, often gradual changes that are difficult to detect and to measure. These would include for example,\u0085reduced incidence of repairs to household appliances\u0085\"12 Coincidentally, a December 1999 Consumer Reports study on microwave ovens supplies data about percent of \"repairs and serious problems\" for microwave oven brands (see Attachment 4). This data was compared to the implicit price values estimated in the final hedonic regression model for microwave ovens to see if consumer valuation of brand was consistent across studies. Of the eight brands included in the final hedonic model and the 12 brands included in the Consumer Reports study, six brands were common to both studies. The following is an ordinal ranking of brand value for both studies results, 41389=-0.122763, 17660=Both the size and cooking power characteristics of microwave ovens are also assumed to have a significant impact on microwave oven prices. Manufacturers and retailers advertise size in terms of cubic feet and cooking power in terms of maximum watts. Both size and cooking power assume a wide range of numeric values—see the CPI checklist for microwave ovens (last attachment). To accommodate this wide range of values, continuous variables were created for both cavity cubic feet and maximum watt cooking. It was assumed that the price of the microwave oven would increase with increasing values for one or both of these variables. For example, a 2.0 cubic foot oven with 1100 watts of cooking power is assumed to sell for a higher price than a 0.8 cubic foot oven with 700 watts of cooking power ceteris paribus.}",
    "textBeforeTable": "  Number and Distribution of CPI Price Changes for Major Appliances (HK01) and Microwave Ovens (HK014 - 01A)   Attachment 2     Attachment 1 Lane, Walter (2000), \"Addressing the New Goods Problem in the Consumer Price Index,\" Presented at the Issues in Measuring Price Change and Consumption Conference, Bureau of Labor Statistics, Washington, D.C., June 5-8, 2000, pages 1-26. Silver, M.S. (1998), \"An evaluation of the use of hedonic regressions for basic components of consumer price indices,\" Third Meeting of the International Working Group on Price Indices, Statistics Netherlands, Voorburg: Netherlands (1998) 1-12. http://www.statcan.ca/secure/english/ottawagroup/pdf/23SIL3.pdf (accessed November 1999). Fixler, Fortuna, Greenlees and Lane (1999), \"The Use of Hedonic Regressions to Handle Quality Change: The Experience in the U.S. CPI,\" Presented at the Fifth Meeting of the International Working Group on Price Indices; August 1999; Pages 1-20. http://www.statice.is/ottawa/bls.rtf (accessed November 1999). Consumer Reports December 1999 Issue, pages 28-31. Consumer Digest\u0092s 2000 Annual Buying Guide (December 1999), pages 106-108. Consumer Digest\u0092s 1999 Annual Buying Guide (December 1998), pages 110-113. References Paraphrased from: \"Can Appliances Get Smart?\" Washington Post; May 26, 2000, pages 1-3; http://washingtonpost.com/wp-dyn/articles/A8164-2000May25.html (accessed May 26, 2000). Source: \"Can Appliances Get Smart?\" Washington Post; May 26, 2000, pages 1-3; http://washingtonpost.com/wp-dyn/articles/A8164-2000May25.html (accessed May 26, 2000). Source: \"Appliances to Be Linked to Internet,\" Washington Post; January 18, 2000, pages 1-5; http://www.washingtonpost.com/wp-dyn/business/A57379-2000Jan17.html (accessed May 5, 2000). Source: \"Appliances to Be Linked to Internet,\" Washington Post; January 18, 2000, pages 1-5;",
    "textAfterTable": "05 / (19) 9910 233 33 / (14) 30 / (91) 03 / (09) 9911 208 16 / (08) 11 / (69) 05 / (31) 9912 209 15 / (11) 09 / (60) 06 / (40) 0001 213 22 / (10) 17 / (77) 05 / (33) 0002 208 08 / (04) 07 / (88) 01 / (12) 0003 210 19 / (09) 14 / (74) 05 / (26) 0004 209 20 / (10) 19 / (95) 01 / (05) Average 215 22 / (10) 16 / (73) 06 / (27)   Microwave Ovens (HK014 - 01A         Month Total Prices Collected Substitutions # / (% of Total Prices) Comparable # / (% of Subs)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}