{
    "relation": [
        [
            "County.",
            "Dare . . . . .",
            "Hyde . . . . .",
            "Pamlico . . . . .",
            "Carteret . . . . .",
            "Total . . . . ."
        ],
        [
            "Area Public Grounds.",
            "4,604.16",
            "6,891.94",
            "4,495.61",
            "4,561.40",
            "20,553.11"
        ],
        [
            "Area Natural Beds.",
            "2,118.25",
            "1,642.90",
            "437.00",
            "1,012.50",
            "5,210.65"
        ]
    ],
    "pageTitle": "North Carolina. Board of Agriculture. North Carolina and Its Resources.",
    "title": "",
    "url": "http://docsouth.unc.edu/nc/state/state.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71132507,
    "recordOffset": 70816850,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{353492=        The Acme mine, about three-fourths of a mile west of Statesville, was operated in 1893 to the extent of producing about 50 tons of clean corundum. Corundum was discovered here about 1875 by Mr. J. A. D. Stevenson, but active mining operations were not begun until 1893., 910665=        This orphanage was opened in 1872 by the Grand Lodge of Masons of North Carolina, at the annual communication, by resolution to change St. John's College, to Oxford Orphan Asylum. In 1873 the State made an annual appropriation of $5,000, increased in 1885 to $10,000, which is the present amount. The children are in school two-thirds of their time, and work one-third. The Grand Lodge contributes $3,500 annually, other contributions about $1,800 and asylum earnings, $3,250, making a total of about $18,500. It has, 4411=        The electronic edition is a part of the UNC-CH digitization project, Documenting the American South.         The text has been entered using double-keying and verified against the original. The text has been encoded using the recommendations for Level 4 of the TEI in Libraries Guidelines.         Original grammar, punctuation, and spelling have been preserved. Encountered typographical errors have been preserved, and appear in red type.         All footnotes are inserted at the point of reference within paragraphs.         Any hyphens occurring in line breaks have been removed, and the trailing part of a word has been joined to the preceding line.         All quotation marks, em dashes, and ampersand have been transcribed as entity references.         All double right and left quotation marks are encoded as \" and \" respectively.         All single right and left quotation marks are encoded as ' and ' respectively.         All em dashes are encoded as --         Indentation in lines has not been preserved.         Running titles have not been preserved.         Spell-check and verification made against printed text using Author/Editor (SoftQuad) and Microsoft Word spell check programs., 90865=        The records of the War Department at Washington, comprising forty-nine volumes of about one thousand pages each, furnish a statistical history of the war. The result is impartial and represents the combined labors of five Federal and two Confederate officers. The casualties on both sides are recorded. The tables of dead and wounded show that on the Confederate side North Carolina lost more soldiers killed than any other Southern State, as follows: 14,522; and that she headed the list in the number that died of wounds, and that 20,602 of her soldiers perished of disease. Her military population in 1861 was 115,369, yet she furnished 125,000 to the Confederate cause., 350089=        In the production of corundum, North Carolina leads all the other States, and indeed, during 1895, nearly all the corundum mined in the United States, came from North Carolina. With a single exception (Acme mine in Iredell county) the mines in the State which have been operated during the past few years, are located in a narrow belt of crysolite rock, which extends from Virginia across this State into Georgia, between the Blue Ridge and the Great Smoky mountains. The more important of these mines which have been recently operated, are the following: Corundum Hill (Cullasaja) mine and Hosea Moses mine in Macon county; Sapphire (Hog Back) mine in, 504897=        Dr. W. R. Capehart, of Avoca, Bertie county, the third of his direct generation engaged in commercial fishing, in a letter dated March, 1896, says:, 535149=        Of the seed product, 70,341 tons are reported in the census of 1890, valued at $718,741--no inconsiderable item in the value of the crop. But as the best cotton yields only about thirty-three per cent. of lint, evidently the tons of seed reported to a crop of over 336,000 bales, were less than half the actual product, which was in the neighborhood of 160,000 tons. The amount reported represented probably the sales, the balance going into home consumption., 877634=        The total valuation of real and personal property in North Carolina is, according to the auditor's report for 1895, $259,564,449.99. But the valuation of property in this State is known to be much, 918709=        opened January 1st, 1876, in the city of Charlotte. Managers are nine female communicants of St. Peter's (Episcopal) Church. Mrs. Jane Wilkes, Secretary. Cares for eighty patients annually. Maintained by voluntary subscriptions., 541785=the following table, where the column showing farm values was computed from the prices reported in December, 1895. In most of the States where an increase appears a correction of last year's acreage is probably involved. North Carolina, however, with more than double the acreage and product reported in 1894, plainly shows the stimulus of local manufacture., 510791=        If the increase in the whole State has kept pace with that of the Albemarle sound, the value of the 1895 catch must have reached the two-million dollar mark., 79634=        The Roanoke Colony Memorial Association was organized in the Spring of 1894. The chief agents in its organization were Prof. Edward Graham Daves, of Baltimore; Dr. S. Weir Mitchell and Mr. Talcott Williams, of Philadelphia. Earlier than this Prof. Daves, who was a North Carolinian by birth, had made a tour in North Carolina, lecturing for the benefit of the scheme., 907468=        Is situated in the southeastern part of Raleigh, and erected in 1875, being the first in the world for the colored race. Has three stories, with parlor, chapel, music room, infirmary, recitation rooms, dormitories, &c. Heated by steam, lighted by gas. Has good water supply. In the summer of 1895 a new three story wing with handsome cupola was built on the south side. Built originally for forty inmates, it now accommodates 65 boys and 55 girls. Proposals have been advertised for the building of a similar addition on the north side. Shoemaking, chair and mattress making, cane seating and dressmaking are taught, in addition to the regular scholastic work. A new workshop is in contemplation., 625430=        The rapid progress of the past few years is clearly seen from a comparison of the number of looms and spindles now at work with the figures given in the Hand Book of 1893., 548973=the plant will straighten up within twenty days, when all the water is taken off and the fields kept dry for a like period. Then the \"harvest flow\" is turned on, and remains for about two months, or within a few days before the harvest begins. On August 20th, never varying more three days, the multitudinous rice bird puts in his appearance. They come in such vast flocks that men and boys with guns must be stationed at intervals in and around the fields to prevent the destruction of the crop. Six weeks after the appearance of the first head of rice, the crop is ready for harvest. A sickle is used, the laborers are paid by the acre for cutting and tying into bundles. After one day's exposure it is shocked in the field, and after ten days it is ready for the barn. The threshing is done by steam, and the grain, weighing forty-five pounds to the bushel, is shipped in bags and sold to the miller, who cleans and grades it for consumption. To Mr. Fred. Kidder, of Wilmington, must be given the credit for this article. He is a practical rice planter and has been among the most successful in this State., 868474=        The following statement from the State Auditor's Report for the year ending November 30, 1895, sets forth the aggregate number and value of the various subjects of taxation in the State, and the gross amount of the State, school and county taxes derived from the same., 354345=        Mica mining in North Carolina has been carried on to a greater or less extent during the past twenty-five years, mainly in the counties west of the Blue Ridge. The majority of the mines are located in Mitchell, Yancey, Jackson and Macon counties. During the past few years the low tariff rate has permitted the importation of large quantities of mica from India, and this has had a tendency to decrease the North Carolina product, but the yield of these mines during the past year (1895) has approximated 36,000 pounds cut mica. Since 1891, the industry has received something of a stimulus by the introduction of the mica mill for the grinding of scrap mica, which prior to that date had been regarded as waste product; the quantity of ground mica produced has increased considerably since that time., 540462=        The U. S. Department of Agriculture, working carefully and constantly through its different agencies, is the most reliable authority on crop productions of any in the United States. The crop report for March, 1896, says:, 81855=        North Carolina was most forward in resisting the arbitrary aggressions of the British Government. The first pitched battle against governmental tyranny was at Alamance, May 12, 1771. The first legislative body in defiance of the Royal Governor was at Newbern, Aug. 25, 1774. The General Assembly had placed on its seal May 20, 1775, as the date of the first declaration of independence., 838598=        Of those coming direct to our shores, the immigrating colonies were small and infrequent. After the efforts of colonization on the waters of the north-eastern section of the State, in 1584, under the auspices of Sir Walter Raleigh and his successors, had failed, a long interval passed away before decided or successful effort was made to plant other colonies on our shores. Among the more ambitious and well considered schemes was that of Sir John Yeamans, who, about the year 1659-'60, landed within the mouth of the Cape Fear river a body of several hundred colonists of English birth or descent, from the island of Barbadoes. A settlement at about the same spot had previously been made by adventures from New England, who thus made this section favorably known, and who eventually abandoned it, disappointed in over-wrought expectation. In like manner the colony of Sir John, or the larger body of it, moved first to Port Royal, in South Carolina, and subsequently to the spot where they founded the present city of Charleston, but leaving behind them the impress of a good name and a high character, permanently stamped and manifesting itself upon their descendants in the present city of Wilmington and other points on the lower Cape Fear., 957975=        The Law School, inaugurated in 1894, has proved a signal success and is largely patronized., 109996=        Its capacity as a grazing country has long been known. But formerly the cattle were left to the resources of nature, which indeed, in such a country were abundant and rich. \"Horses and horned cattle,\" says General Clingman in one of his publications, \"are usually driven out into the mountains about the first of April and brought back in November. Within six weeks after they have thus been put into the range, they become fat and sleek. There are, however, on the top and along the sides of the higher mountains ever-green and winter grasses on which horses and horned cattle live well through the entire winter. Such animals are often foaled and reared there until fit for market, without ever seeing a cultivated plantation.\" Of late, attention has been turned to the breeding of fine stock, and some herds of cattle and flocks of sheep are found there which will compare not unfavorably with those of any country. This country is already penetrated by one railroad, and others are in course of construction. When fairly laid open to railroad communication it will offer--besides its rich mining interests and timbers--one of the finest fields for cattle and sheep breeding and for dairy products that the Union presents., 994943=        There is the Theological department, in which young men are trained for the ministry; the missionary training school in which christian women are trained for missionary service; the Leonard Medical school, with a fine building and a corps of competent teachers; the Law department, and the female department, provided with a capacious four-story brick building; the whole with ample and shaded and ornamented grounds, giving token of a very remarkable change in the condition of the colored race. The value of the whole property is estimated at $175,000, free from encumbrance. Chas. F. Meserve, A. M., is successor of Rev. H. M. Tupper, who died in 1893., 452037=        Just under Cape Lookout opens, between Core and Bogue sounds, and at the mouth of Newport river, the inlet which lets into Beaufort harbor. Vessels drawing twenty feet can enter readily from the sea, and, in twenty minutes, are lying snugly at their anchorage or at their wharves. It is entered at all times, except against a north or northwest wind. It is a harbor of refuge in time of storm, from the enemy in time of war, a rendezvous chosen as the basis of naval operations, as during the war of the Revolution, when the fleet destined for the attack on Charleston first concentrated here; when, in the war of 1812, captured prizes were brought in here for adjudication, and when in the late Civil war, the harbor was filled with war vessels and transports of the Federal Government. The water within the harbor is sufficient for the largest merchant vessels, yet it is not a commercial port of value, for the reason that no great navigable stream brings to it the riches of the interior, and because the single line of railroad which reaches it has not yet been able to divert the current of traffic from its accustomed channel., 456407=away nearly all that had been accomplished, and efforts were abandoned until 1870, when they were resumed with determined purpose and with large appropriations. This has been done until the breach between Smith's and Zeke's islands was closed, and eventually the flow through New inlet finally checked. This is not the place for the details of this important work, the present object being only to show by what methods the usefulness of the Cape Fear river, in its relation to material and domestic commerce, has been restored. This has been done by the erectiom of a solid dam more than a mile in length and with a breadth of from ninety to a hundred and twenty-five feet, knit together by natural grass and oyster shells, until it is apparently impregnable to the assaults of the fiercest tempests. The effect on the depth of water on the main bar was not at once appreciable; but in two or three years, and assisted by the process of suction dredges, a great gain has been made, so that whereas in 1878, when the shortest soundings in the Bald Head channel were nine feet, in 1882 they were fourteen feet, and now, there is twenty to twenty-two feet and more at high tide., 352089=        The Sapphire mines, near the Great Hog Back mountain in the southeastern corner of Jackson county, were operated on a considerable scale from 1892, to the latter part of 1893, from fifty to sixty men being constantly employed in mining and prospecting. The product in 1893 was over four hundred tons of material, one-fourth of which was said to have been nearly pure corundum crystal., 908517=creation was passed in 1891, and its Board organized April 23rd, 1892. The building is located upon a tract of 213 acres near Morganton. It is of three stories above the basement in the form of a capital Roman T, and is 256 feet long with 162 feet from front through center building and dining room. Heated by steam and lighted by electricity, with an artesian water system and sewerage, the sanitary conditions are perfect. Accommodations for 250; there are 150 rooms. This is known to be one of the best buildings in America for the deaf and dumb. Carpentry, cabinet-making, shoemaking, printing, freehand and industrial art, mattress making, sewing, practical farming, gardening, &c., are the divisions of the industrial department. There were at the last report 161 pupils. The deaf mutes at this institution print the \"Kelly Messenger,\" which is a creditable specimen of the printer's art., 911839=        This is also in Oxford, and was opened in the year 1886. The buildings can accommodate one hundred and fifty. The average daily number in 1895, was seventy-five. Of these sixty-three are without father and mother. Receipts, chiefly from the State, were a little over $4,000. The Legislature of 1895, doubled the former appropriation. Rev. Robt. Shepard, (colored), is the Superintendent, and is receiving increased contributions, through the confidence of the people in his management., 609966=        Not only about Newbern, but all along the Atlantic and North Carolina railroad, at Kinston and LaGrange, the market gardening industry has developed to a wonderful extent. On the Wilmington and Weldon branch of the Atlantic Coast Line the increase in this business has been equally marked. Here just north of Wilmington, the truck industry had its first beginning. Then, near Rocky Point, Mr. G. Z. French has seven hundred acres devoted to the culture of small fruits and early vegetables, and that point has become an important shipping centre. From Wilmington to Goldsboro, the development has of late tended more in the direction of strawberry growing than in vegetable culture, and the broad fields devoted to this fruit are one of the most attractive features of the country to the traveller on the railroad. Mr. J. A. Westbrook, at Mt. Olive, has made a conspicuous success in the culture of the strawberry. He bought fourteen years ago a worn out farm, and went to work growing strawberries, with a capital of $1000 and a single horse. From this small beginning he has made a fine home, and a fertile farm from a very poor one and has bought several other farms here and one in Florida. His returns, net, from strawberries, on his home place last year were $14,000 from thirty acres in this fruit. It should be stated that part of this was from the sale of the new strawberry plant, Lady Thompson. The cost of cultivating, fertilizing and shipping strawberries here will run from $100 to $125 per acre annually. Along these lines of railroad, lands suitable for the growth of garden vegetable and small fruits are rapidly advancing in value, though there are wide areas still to be had at very low prices. As has been intimated, the greatest development is yet to come here in the skillful use of glass, and there is the greatest opening for men skilled in the use of glass in green houses and frames. This culture offers the best inducement for the investment of capital and skill of any business in the trucking section. There are as yet few men there who have had any experience in the handling of vegetables and fruits under glass, and it only needs to be started by skilled men to make it an assured success from the start., 1090107=        Historically, this county possesses great interest. It was the focus of the troubles of the Regulators, and on its soil was fought the decisive battle between the Royal forces and those of the rebellious colonists, a preliminary to the struggle between the Crown and the colonies, to be continued until American Independence was secured by the success of the latter. The county was formed in 1848, from parts of Guilford and Orange., 990012=        Recognizing the need of practical training for the young men of the colored race, and with a view to aid them in maintaining themselves in the higher grades of industrial life, the Legislature of North Carolina, at the session of 1891, enacted \"that a College of Agriculture and Mechanic Arts, be established for the colored race, to be located at some eligible place within the State, to be selected by the Board of Trustees\" charged with the management of the institution. The corporate name is \"The Agricultural and Mechanical College for the colored Race.\", 1091719=        The North Carolina railroad runs through the center of the county, and has been an important stimulus to its industries and general prosperity. Graham is the county seat and has a population in excess of 1000. It contains the Saxapahaw, Oneida (Nos. 1, 2 and 3,) and Belmont cotton mills. Haw River (town,) is the seat of the Granite, the Thos. M. Holt, and the Cora cotton mills, and has a population of 1750. Burlington, with a population of more than 2,000, has nine cotton factories, as follows: Glencoe, Lakeside, Juanita, Carolina, Alamance, Aurora, Elmira, E. M. Holt and Windsor. There are twenty-three cotton factories in the county., 350992=        The first of these, the Corundum Hill mine, seven miles southeast of Franklin, is not only the best known, but has been the longest and most successfully worked of any of these mines. Operations were begun here by Col. C. W. Jencks, in 1871; and since 1878, the annual output of this mine has been from two hundred to three hundred tons of clean corundum. Dr. H. S. Lucas is the present manager. The first mining here was chiefly for gems, and the work was done by hydraulic process, the soil and the decayed rock of the surface being washed through a series of sluice boxes inclined at a considerable angle. The lighter minerals naturally floated off, while the corundum and other heavy minerals remained in the box. The Hosea Moses mine, on Ellijay creek, a few miles north of Corundum Hill, was operated for several years by the same company that operated the Corundum Hill (Hampden Emery Corundum Co). The force employed at these two mines during the past few years has been somewhat variable, but is usually from thirty to forty men., 37441=        At the December (1895) meeting of the State Board of Agriculture it was agreed that a new edition of the Hand Book was a necessity, and the Secretary to the Board was charged with its preparation. This involved a complete revision of the former publication, the selection of suitable illustrations, the preparation of much new data, and the issuing during this year of a volume illustrative of the vast resources of North Carolina. All of this with the view of pointing out progress already made, and the possibilities presented for future development. The work has proved more exacting than at the time was contemplated, in that the changes necessary frequently required the rewriting of such portions of the former volume as were still considered in part available, and to make more complete the presentation whole chapters have been introduced presenting matter hitherto entirely omitted or to which but slight allusion was made., 934406=        The present public school system exists under that feature of the State Constitution providing for a State Board of Education, consisting of the Governor, Lieutenant-Governor, Secretary of State, Treasurer, Auditor, Attorney-General and Superintendent of Public Instruction. The latter is the head of the system of public schools. Each county has its Board of Education and County Examiners. The County Board consists of the commissioners. The normal system was adopted in 1877 for the whites as well as the colored people, and eight normal schools have been established for the former and seven for the latter. The Normal and Industrial School for white women has superceded the eight white normal schools. A normal department is provided at the University for young men with a summer school for both sexes of white teachers. The seven colored normal schools are still continued, for which the State pays annually $10,000., 927857=        The first step toward free public schools was taken by Judge Murphey, in the session of the Legislature of 1816, in a report urging the establishment of a judicious system of public education. But no further legislative action on the subject was taken until the session of 1825, in which year a fund for the establishment of common schools was created by the General Assembly, \"consisting of the dividends arising from the stocks then held or afterwards acquired by the State in the banks of New Bern and Cape Fear, the dividends arising from the stocks owned by the State in the Cape Fear Navigation Company, the Roanoke Navigation Company, and the Club Foot and Harlowe Creek Canal Company, the tax imposed by law on license to retailers of spirituous liquors and auctioneers, the unexpended balance of the agricultural fund, all moneys paid to the State for the entries of vacant land, and all the vacant and unappropriated swamp lands of the State, together with such sums of money as the State may find it convenient to appropriate from time to time.\", 540741=        \"Between 1888 and 1893, no returns of tobacco were published by the department, and a comparison of the figures for recent crops with those of receipts for manufacture and net exports, published by the Treasury, leaves ample room for a suspicion that the whole product was at no time reported. The correspondents' returns of yield and acreage compared with the year before, appearing in the monthly statistical reports for 1895, having been found to give a total product considerably less than that actually brought to light in previous years, the statistician instituted in December a special investigation of the subject, a circular of additional inquiries being sent to all the tobacco producing States. The results of that investigation are embodied in, 937197=        The University embraces the College, the Law School, the Medical School, and the Summer School for teachers. The College contains fourteen departments offering one hundred and one courses of instruction, arranged both for graduate and undergraduate instruction. The Law School and the Medical School each offers two years instruction. The Summer School for Teachers is held during the month of July, and offers about forty courses of instruction. There is also a Summer Session of the Law School (July-September)., 566721=buildings to cover all classes of exhibits. The society has done much to encourage agriculture, and to promote the raising of fine horses, cattle, sheep and swine. Its annual fairs call together not only the farmers but all classes of our people, for social pleasure and to compare notes and see the progress made in the avocations of farmer, trucker, gardener and fruitgrower. The fair is always held in October., 484993=        The statistical data herewith presented cover the entire commercial fishery interests of the State, including the river basins. From the three general tables which follow, a clear conception may be gained of the condition and extent of the fisheries as they existed in 1890. (The last available census returns.), 947041=        This College is the Presbyterian institution of higher learning and may be regarded as the legitimate, if somewhat remote, successor to Queen's College, or Liberty Hall, as it was called after Royal recognition of the former had been denied. After many efforts at revival, and against strong opposition to the creation of a distinctly denominational college, Concord Presbytery, in the spring of 1835, adopted resolutions looking to the establishment of a Presbyterian College in their Presbytery; and in the fall of the same year a site was selected in the northern part of Mecklenburg County, at which has been called the literary and geographical centre of the State. The institution was named in honor of General William Davidson, the revolutionary hero., 153489=        On the other hand, the State does lie in the path of the so-called sub-tropical storms which move up from the coast of Florida. These storms occur most frequently during the months of August, September and October, and are usually accompanied by heavy rains and, 933158=        The population of North Carolina by the census of 1890 is--white, 1,049,191; colored, 567,170; all others, 1,586; a total of 1,617,947, the colored population being a little more than one-third of the whole. In the contribution to the support of schools, the whites contribute nearly five-sixths of the whole, and the colored little more than one-sixth. Nevertheless, the appropriation is made ridgidly pro rata, as if the contribution had been on the same basis., 537522=        Nearly all the counties in the State raise tobacco, in patches for home consumption, if not for market; but the crop for market purposes was confined, as shown by the census of 1890, chiefly to thirty counties. Of these thirty, only eleven are accredited with over a million pounds, and these eleven counties produced two-thirds of the crop of '89. These are, in descending order of production: Rockingham, Granville, Stokes, Caswell, Person, Madison, Vance, Forsyth, Buncombe, Surry and Durham., 875440=        The interest on the 4 per cent. bonds is due semi-annually, in January and July, and is paid upon presentation of coupons, out of special taxes levied for the purpose., 38432=        The remarkable development in all branches of industry, with corresponding increase in the volume of business, together with the varied and ever-widening conditions favorable to the avocation of the farmer, the trucker, the fruit grower, the lumberman, the miner and the fisherman, have all combined to induce the publication of this volume by the Board of Agriculture. The Board, always in the lead, is ever found promoting the best interests of the people of the State, lending encouragement to the development of her rich resource of forest, of mine, of soil and of sea. The State Constitution provides for an Agricultural Department, and its earlier reports date back to 1825. The present organization of the Board was effected under an act of the General Assembly in 1877. From the day of its organization it began the discharge of the duties assigned it with an earnest determination to foster and stimulate agriculture in all its branches, and to promote every legitimate attempt to develop the State's resources. It has aided in almost every movement in this direction, being in a certain sense a pioneer, by directing attention to the possibilities offered. It was first among the States to increase the catch of fish by means of fish hatcheries; it explored the phosphate beds of the eastern, 535667=        Compared with other States, North Carolina stands eighth in amount of production. \"Neither as a whole, nor in any considerable portion of its area, is the cotton production of North Carolina distinguished for its density. Of the entire land surface of the State, 3.69 per cent. was devoted to cotton planting in 1889, or little more than one-third the proportion obtaining in the adjacent State of South Carolina.\" (Extract Census, 1890.), 365116=        The Cumnock mines in Chatham county are the only operating colleries in North Carolina. These mines, originally opened years since, were operated in a desultory and primitive manner prior to 1888, when Samuel A. Henszey, of Philadelphia, Pa., obtained possession, organized a company, and vigorously proceeded to re-open the mines upon an extensive scale, install a modern and efficient plant and introduce business methods, absence of which had accounted for previous indifferent success. Encountering many obstacles, the restoration and development proved slow and expensive, but by determined and persistent effort the property has been finally placed in a position that assures success. The underground works have been opened upon a large scale and in a most permanent manner for economical operation. The machine plant, both underground and on the surface, has been perfected with the most modern appliances for hoisting, pumping and ventilation, and every available safeguard for the protection of life and property has been introduced., 959888=        The buildings are located on a well cultivated farm of two hundred and sixty acres, six miles west of Greensboro, in Guilford county, near the Winston and Salem railroad; and consist of the original building, Founders Hall, erected in 1835-'7; King Hall and Archdele Hall, both built in 1885; Y. M. C. A. Hall, erected in 1891; and a gymnasium, seventy-five by fifty feet, constructed in 1896, which is under the directorship of a graduate of the Boston Normal School of Gymnastics., 940457=        When the college opened in 1889, it had only one building, very little equipment, and only five professors present for duty. In the six years that have passed since then, nine other large and comfortable buildings have been added, equipment and apparatus have been bought for all departments, and the faculty has increased from five to twenty., 970797=        This prosperous institute is located at Murfreesboro, Hertford county. It has very fine buildings, situated on highly ornamented grounds, containing twenty-eight acres. This institution originated in the purpose of the Bertie Union Meeting (Baptist,) embracing the counties of Northampton, Bertie and Hertford, to establish in their midst a high school for girls, and a school building was provided at Murfreesboro and opened October 11, 1848, with the Rev. A. McDowell, of South Carolina and a graduate of Wake Forest College, as President. The prosperity of the institution was so rapid and so marked as to demand the erection of large buildings, and in 1851, a joint stock company took charge of the school, selected a new site and completed a large and handsome brick building. The value of the property is now estimated at $50,000. The funds were chiefly contributed by the Chowan Association. With its greater facilities, the institution was soon filled with young ladies from most of the southern States and some from the north. It has had successively as its presidents, Dr. McDowell, Rev. William Hooper, D. D., LL. D., Rev. Mr. Forney, and again Mr. McDowell, who returned to the presidency in 1862, and died in 1881, to be succeeded by Prof. John B. Brewer, who resigned this year and is succeeded by Rev. W. O. Petty. In the college there are two departments, the preparatory, requiring two years for completion, and the collegiate, four years. In the latter the course is as full and satisfactory as in the other female colleges in the State., 970186=        This institution was chartered in 1891, and is to be the leading school of the Baptist denomination in North Carolina. The main building for the University is now in course of construction at Raleigh, on a very eligible location near the center of the city. This building when completed will cost over $40,000. It is expected that the University will be opened in September, 1897, and as it is to be the head of female education for this denomination, a large patronage is expected, 920104=        This institution is located in Raleigh, and was established by a fund left by a long deceased citizen. The hospital maintained for a number of years by St. John's Guild, and located at the south end of Salisbury street, was purchased in 1893, and after improving the same by several thousand dollars worth of repairs and additions, and the erection of a building for colored patients, the whole was opened as Rex Hospital May 15th, 1894. In the first two years it has admitted three hundred and fifty-six patients, including one hundred and six white males, 102 white females; seventy-five colored males and seventy-five colored females. To this has been recently added by private benevolence, a well arranged ward for sick children. The city contributes annually $2,000 to the support of the hospital. Col. Benehan Cameron has recently given a fund as an endowment for the \"P. C. Cameron Memorial Cot,\" R. H. Battle, Esq., is chairman of the board of Trustees., 546053=        Historians tell us that the cultivation of rice dates back to nearly three thousand years B. C., and though it is indigenous to India, the first mention of its culture is among the Chinese. It was cultivated in Syria, four hundred years B. C., was introduced by the Arabs into Spain, and the fifteenth century, was planted by the Italians. The first rice raised in America was at Charleston, S. C., in the seventeenth century, and from that beginning sprang the rice crop of the present. Before the introduction of rice into this State, in 1738, the tide-water low lands were seeded to indigo, which gradually gave place to the more remunerative crop. Wild indigo still troubles the rice miller more than all other weeds, as its discoloring effect upon the cleaned product is disastrous. There are two varieties of rice, the white and the golden seed, both have adherents as to superiority. Rice can be grown upon all lands, but to be successful on an extensive scale, there should be proper facilities for irrigating the crop at its critical periods. The upland rice is inferior in size, color and weight, but makes an additional food crop under careful treatment., 87028=        The attempts of Sir Walter Raleigh having signally failed, no further attempts at colonization were made for three-quarters of a century. In 1629, a charter was granted by Charles I. of England to Sir Robert Heath of the Southern part of Virginia, Latitudes 31° to 36°, under the name, in honor of that king, of Carolina. As Heath did nothing under it, a renewal was granted in 1663 to eight Lords Proprietors, and an enlargement to 36° 30′ and 29°, two years afterwards. The first permanent settlement in the limits of North Carolina was called the County of Albemarle. The Lords Proprietors appointed Governors of Albemarle, and then Governors, or Deputy, 932209=        The value of public school property in 1894-5 for whites was $817,148.08; for colored, $301,149.80. The number of public school houses in the same year was--for whites, 4,556; for colored, 2,010. Number of schools taught in same period, for whites, 4,811; colored 2,296. Number of school districts, for whites 5,123; for colored, 2,424; and the statistics of the Normal Schools for 1894-5 for the colored race, show an attendance at Fayetteville of 236; at Salisbury, of 236; at Franklinton, 215; at Plymouth, 301; and at Goldsboro, 277., 288879=        The Read mine is ten miles southeast of Concord. It is of special interest as being the site of the earliest recorded discovery of gold in North Carolina. The placer deposits have produced many famous and valuable nuggets. One nugget recently found there (April, 1896,) weighed twenty pounds, seven ounces and six dwts. The auriferous quartz veins are confined to a large greenstone dike and are from four inches to three feet in thickness., 893430=        By an act of the General Assembly of North Carolina, ratified March 5, 1891, a Railroad Commission was created, consisting of three members to be elected by the Legislature, charged with the general supervision of railroads, steamboat and canal companies, and express and telegraph companies doing business in North Carolina; restraining on the part of railroad and other public transportation companies the exaction of more than a reasonable compensation for the carriage of freight or passengers, under penalty of fine, to be adjudged sufficient under conviction for extortion; and also empowering the Commission with authority to forbid such companies to give undue preference to patrons of their lines, and authorizing it to make rates for freight and passenger tariffs, forbidding unjust discriminations, the giving of rebates and the charging of more for a shorter than a longer distance. Empowering it to approve special excursion rates, empowering it to fix the charges for the transportation of passengers and freight, to make schedules that shall meet the general public convenience, and take such other steps and do such other acts as shall conduce to the protection of the business and traveling public from oppression and injustice, allegations of which induced the creation of the Commission., 965194=        This grand old institution was founded by the Moravians in 1802. There have been private schools in the State so excellent as to have drawn to them patronage from distant parts of the State, but the honor must be ascribed to the Moravians of having located the first institution of a public nature, and which now, after the lapse of ninety-four years, grows rather than loses, in usefulness and reputation, for it draws to it annual recruits from all and the most distant southern, northern and western States, and from foreign countries to fill the places of those sent forth to illustrate the solidity and splendor of their mental and social equipment., 959251=        This institution was founded by North Carolina yearly meeting of Friends, and was opened in the year 1837, under the name of \"New Garden Boarding School,\" being chartered by the Legislature in 1834. From 1837, it has been in continuous operation, and has been open alike to both sexes., 503644=        North Carolina is the most southern State in which the menhaden fishery and industry are carried on. The fishery may be said to be the only one except that for oysters in which vessels are employed, and it is the only off-shore vessel fishery in the State, although a considerable part of the fish handled, are caught in the sounds adjacent to the ocean and not in the ocean itself. The business is centered at or in the vicinity of Beaufort, where six factories were in operation in 1890. The capital invested in buildings, vessels, apparatus, etc., was $97,060, the number of persons employed was one hundred and eighty-seven, the value of the fish handled was $16,171, and the value of the manufactured products was $38,727., 991764=        The Mechanical building, which cost $7,000 was constructed during the summer and fall of 1895. It is the finest building of the kind in the southern states. The equipment is of the highest standard. The blacksmith shop and the wood working department are complete. The chemical laboratory is temporarily located in this building and is complete in all its appointments. In this building are taught all the trades, and every branch of Mechanics. The building is heated by steam and lighted by gas., 876700=        There are old refundable bonds still outstanding, which will require $270,910 new 4 per cent. bonds, provided they shall be presented before January 1, 1897, at which time the law expires., 459468=        Wilmington, or the Cape Fear river harbor, during the civil war illustrated some peculiar features of value. With its ease of access it was also readily defensible. One of its fortifications successfully repelled the first assaults of one of the largest and strongest squadrons and the fiercest and most terrible bombardments known in naval annals. It did indeed succumb in the second and more formidable attempt; but not until after three or more years of effort to capture or to close the port were the blockading vessels, which alone kept the Southern States in communication with the outer world and kept up some semblance of trade, effectually excluded. It is stated that the number of blockaders, as they were called, those that ran the gauntlet and got in safely with their cargoes, was, from May 20, 1863, to December 31, 1864, about two hundred and sixty; prior to May 20, 1863, fifteen; and after December 31, 1864, ten, making a total of two hundred and eighty-five., 1004957=        This institution, located at Franklinton, in Franklin county, furnishes free tuition for all colored youth residing in North Carolina and Virginia. It was founded in 1880 and was chartered in 1891. It has three courses of study--Scientific, Normal and Theological. It is supported by the Christain denomination, and is managed by a board of control elected by the American Christain Convention. There are three buildings situated in a beautiful oak grove--College building, Boarding hall and the President's residence. Its special work is fitting teachers and ministers for their work., 443203=        In the construction of canals, North Carolina claims a proud pre-eminence; for as far back as 1790, was authorized by the Legislature of the State the construction of the Dismal Swamp canal, connecting the waters of Pasquotank river (North Carolina) with those of Elizabeth river (Virginia). This was required to be done by private subscription, and it was so done; and thus was completed the existing Dismal Swamp canal, undertaken thirty-five years before the great Erie canal was completed, and eighteen years before the Pioneer canal of New England--the Middlesex--was opened for use. This canal served its purpose usefully for nearly a century. Recently it has been sold, perhaps for other uses, because other means of inter-communication, swifter and more capacious, have largely superseded it., 509245=        The increase in the volume of business done on the Albemarle and its tributaries may be briefly summarized by these facts recently obtained from transportation companies. From 1882 to 1892--ten years--the increase of iced fish shipped was from 13,700 to 23,900 boxes. From 1892 to January, 1896, the shipments have climbed to 42,400.\", 509731=        Comparing Dr. Capehart's later data with that of the United States Fish Commission for 1890, it will be observed that the Albemarle Sound and its tributaries present a most remarkable increase. In round numbers the 1895 value of the catch there is very nearly equal to four-fifths of the total value of the catch for the State at large for the former year:, 503125=        The porpoise industry and the fishery which it supports are of less extent than formerly, owing to the diminished inducements offered to the fisherman by the low prices received for the raw products. In 1890, only two firms were engaged in handling the porpoises, in preparing their hides, and in trying out their oil. The number of porpoises killed was 1,747, for which the fishermen received $4,398. The resulting manufactured products were valued at $10,350., 961455=        The Bingham School was established in 1793, by the Rev. William Bingham, a native of Ireland, at Pittsboro. The School, in its succession through three generations of the same name and family, has long been pre-eminent in the South, and noted throughout the whole Union. Mr. Bingham, for five years, from 1801 to 1805, was Professor of Latin in the State University, and then resigned to reopen his School at Hillsboro. At his death, 1826, he was succeeded by his eldest son, William J. Bingham, who continued it for twenty years at Hillsboro, with a reputation that brought him pupils from all parts of North Carolina and from all the Southern States. Subsequently the School was removed to Oaks, in Orange County, where the Principal was assisted by his sons William and Robert Bingham, both graduates of the University. On the death of the elder Bingham, the School was removed to a point near Mebanesville, in the same county. William Bingham soon after died, and was succeeded by his brother Robert, by whom the institution was still conducted. In addition to thorough classical and English and business education, the military feature has been added, an officer of the United States Army having been detailed as commandant of the cadets. Owing to the destruction of a portion of the School buildings by two successive fires, Major Robert Bingham was induced to remove the School to Asheville, where it now is, without abatement of its usefullness or reputation., 904024=        This asylum, for the colored insane, is the first ever designed and built for that class in the world, and was opened August 1st, 1880. The plan includes a center building for administration and officers' quarters, and wings for patients. It is supplied with water by an artesian well 570 feet deep, and from Little river; is heated, ventilated[,] sewered, &c., by approved modern apparatus, and supplied with electric lights. The rooms are 10×7, with 13 feet pitch. On account of the rapidly increasing number of the insane of the colored population, the hospital has been enlarged twice by the addition of three story wings at each end. Its original capacity was for 233 patients. In 1895 there were treated 427, of which number 40 were cured, being 33 per cent. of 120 admitted during the year. About 125 acres are in cultivation. Dr. J. F. Miller adds to his medical accomplishments such practical ability as an architect, that he has made many improvements at small expenditure. A very large proportion of the inmates are happily employed at work, and the modern congregate dining rooms are used with perfect satisfaction. The institution is a short distance west of Goldsboro., 996103=        This is a normal school and collegiate institute for colored students of both sexes. It is under the control of the Episcopal Church of North Carolina, and was established out of the proceeds of a bequest of $40,000 made by a citizen of Pennsylvania. It is situated in the suburbs of Raleigh, and is provided with large four-story buildings for the accommodation of young men and girls. It also has a beautiful stone chapel, a stone library and a large industrial building. The school was established in 1867 and has trained several hundred teachers. About twenty of the colored clergy of the Episcopal church received here their entire training. In 1894 the theological department was given up in order that greater attention might be paid to the collegiate studies of young men preparing for the ministry., 928982=        In 1789, the Legislature in session in Fayetteville, by anticipation, had cut off by far the largest resources applicable to the school fund. The largest body of vacant land then owned by the State, included all the territory of the present State of Tennessee. But as a heavy debt rested upon the National Government for the costs of the Revolutionary War, Congress had frequently urged upon the States owning western territory, the policy of ceding the whole or part of such territory to aid in the extinguishment of such debt. North Carolina, with responsive generosity, gave up the territory of Tennessee, with all her prospective school lands, and fell back upon her other resources and the relief or aids of future legislation., 353871=        During the past few years a considerable amount of prospecting has been done in the counties west of the Blue Ridge, especially in Jackson, Macon and Clay, and several new mines are being opened up at the present time. A few miles north of Franklin, on Cowee creek, hydraulic mining in search for gem corundum has been carried on during 1895-'96, on a considerable scale., 900314=        was one of the institutions that honored the labors of the lamented Miss D. L. Dix. It was opened for patients in February, 1856, having been seven years in construction. The original design was that of a cross, with main building one hundred and sixteen feet long, eighty feet eight inches wide and eighty-six feet two inches from first floor to top of dome, an arcade eighty feet eight inches long, and twenty-six feet four inches wide. The wings are each three hundred and twenty-five feet long, forty feet eight inches wide and fifty feet high, at right angles., 572058=        THE SAND HILL SECTION.--This is the beginning of the great sandy ridge that extends in a southwest direction from North Carolina. through South Carolina, Georgia, Alabama, Mississippi, Louisiana and terminates in Texas. It extends in this State through parts of the counties of Harnett, Cumberland, Moore and Richmond, and is a well marked line of division between the Coastal plain and the lower Piedmont regions. It is a region of elevated sandy ridges, covered with a growth of long leaf pine, now in most sections very largely depleted by the operations of the turpentine gatherers and the lumbermen, which is being followed by a growth of scrub oaks of various species. Until recent years it has been a wild forest with little attempt to cultivate the apparently barren soil. The dry soil and the balmy climate have of late years attracted attention to the region as a winter resort for persons afflicted with diseases of the throat and lungs, and the great benefit which has been received by many who have come there for their health, has led to permanent settlements of Northern people at Southern Pines and Pinehurst in Moore county. These settlers began to experiment with the cultivation of the soil, and it was found that this apparently barren soil has a wonderful capacity for the cultivation of fruits of various kinds, particularly the grape, peach and blackberry. About the settlement know as Southern Pines, it is estimated that there are now about one thousand acres planted in grapes. These are grown entirely for shipping as fresh fruit to the northern markets, in July and August, though some experiments have been made in wine making. Grapes start from this section about the middle of July and the culture has been found remunerative to those who have given their vineyards proper attention. The Delaware and Niagara grapes grown here are noted as the best that reach the northern markets. More recently the peach has been planted. One orchard of three hundred and fifty acres paid in the fourth year, a profit of twenty per cent. on its cost in its first crop, and peaches are being planted more extensively than any other fruit; several hundred acres being set out the present spring (1896). The blackberry, mainly the Wilson Early variety, has been largely planted, and as the fruit reaches the northern market before strawberries are ripe they have been very profitable. Some have grown the Lucretia dewberry, which goes to market the last of May, and it has been found to be particularly profitable. Few experiments have been made here with strawberries, but there is evidence that in proper locations they will be a very profitable crop. It is believed that other fruits can be grown equally well here, such as the Japanese and American plums, and, 239933=        The Canadian Zone takes in the northern part of New England, New Brunswick, Quebec and northern Ontario, the southern part of Newfoundland, and extends across the continent to the Valley of the Yukon, in Alaska and, in spite of our southern situation, the fauna of this zone occurs in North Carolina along the crests of the Blue Ridge and the Great Smoky Mountains. The boundaries of this division with us are, of course, determined by the altitude, the lower limit being about 4,500 feet, (see Brewster, on Birds of Western North Carolina, \"Auk,\" Jan. 1886). Of animals belonging to this fauna and having a range to the far north but occurring in this State may be mentioned--the Canada Lynx (Lynx canadensis) and the Red Squirrel (Sciurus hudsonius), the \"Boomer\" of our mountains. Among the summer birds are the Carolina Snow bird (Junco hyemalis carolinensis), Mountain Solitary Vireo (Vireo solitarius alticola), Blackburnian Warbler (Dendroica blackburniae), Winter Wren (Troglodytes hiemalis), Redbreasted Nuthatch (Sitta canadensis), &c. It is a remarkable feature of North Carolina animal life that a stretch of country lying between the parallels 34° and 37°, as this State does, should possess among its native animals and birds species that belong naturally to a fauna characteristic of the great forests of Canada and that reaches on its northern border to beyond 60° of north latitude. But to this great degree does the altitude of our mountain peaks modify their southern position. This is the region of such northern trees as the firs and spruces, forests of which cap the towering peaks of these North Carolina mountain chains., 972524=        In 1850 there was established by the Baptists an institution in the town of Oxford for the higher education of girls, known as the Oxford Female College. Under various administrations this school was continued until the year 1880, when it passed under the control of Prof. F. P. Hobgood, who for ten years had been President of the Raleigh Female Seminary. Under his control it is still flourishing. It has ample buildings, large grounds and a teaching force representing in their acquirements the most noted American colleges and some European institutions. It is doing work of a very thorough character., 521784=Commissioners of the county for a term not less than one year. Residents must obtain a license for the use of boats, and individuals desiring to catch oysters, whether on their own account or that of employers, must take out from the Clerk of the Court an annual license, paying for the same $2.50 and a Clerk's fee of twenty-five cents, and must make oath that he has been a bona fide resident of the State for twelve months next preceding the application for license. Oysters are to be culled on the public grounds when taken, and oysters of a specified size are to be returned to the waters on the public grounds. Oysters must not be taken from the public grounds between the first day of May and the first day of October. The control of the oyster interest is placed under charge of one Chief Commissioner, to be appointed by the Governor, and to hold office; and, to enable the Commissioner to discharge his duties of visiting the grounds and repelling and capturing interlopers, a patrol boat is provided, with authority to use arms when necessary., 154073=        The forests of North Carolina have for many years been one of the chief resources of revenue to the people of the State, the value of their products, including domestic fuel, timber for construction and such forest by-products as turpentine and its derivatives, amounting in 1893 at least to $25,000,000, and probably much exceeding that amount in the year ending March 1st, 1896. The forests in their original distribution extended compact and unbroken throughout the length and breadth of the State, with the exception of unimportant savannas in the eastern section, covered with coarse grasses and sedges, and isolated mountain summits in the extreme western counties, which, bare of trees and shrubs, produced a close turf of vigorous and hardy but tender grasses; and at the present time, after the encroachment of field and pasture for over a century, nearly two-thirds of the area of the State is still under forest cover., 569393=do pears attain such perfection as on the Coastal plain, and nowhere can the culture of this fruit be carried on more profitably with intelligent culture, though the culture at present there is not extensive except in a few localities. Here is the great home of the Scuppernong grape. In all the Coast region this grape attains greater perfection than any where else. It is in fact the native home of this grape and the place from which it has been disseminated. Seedling varieties of the same class of grapes have originated in this favored region. But while the Scuppernong is a russet grape the other varieties are almost invariably black. The finest of these grapes of the Rotundifolia class is the James, from Pitt Co., a grape of the largest size, fully as large as a good sized Damson plum, and decidedly the finest of its class. But it is the strawberry that has made for itself a greater place in the horticulture of the Coastal plain than any other fruit. The soil seems particularly adapted to the growing of the strawberry in the greatest perfection, and the earliness of the climate makes the crop of particular value for northern shipment. The persistent bearing of the strawberry in this section is a source of wonder to all who see it for the first time. In the North, the strawberry season is a short one and soon over, but in this favored region the plants seem to never know when the season is over. Strawberries are commonly found in abundant supply on the tables of growers there the middle of July, from fields which sent the fruit to market the first week in April. Of course the shipping season for the northern markets ceases when the supply north of us becomes plentiful, but strawberries can be had most of the summer in this region. The strawberry business has reached large proportions in the counties of Craven, Lenoir, Wayne, Duplin, Pender, New Hanover, and Columbus, and is one of the most rapidly growing interests along the Atlantic Coast Line railroad. Blackberries do equally well though there has not been so much attention paid to their culture. The Lucretia dewberry, which can be shipped from this section in May has been found to be very profitable and its culture as well as that of the high bush varieties is extending. Raspberries have not been cultivated to much extent, as they are found not to ship so well long distances. Cherries, except the Morello and Duke classes do not thrive well in the Coastal region. The Chinese quince and the fine variety known as the Champion, which does not do very well at the North, would be found profitable fruits here., 916536=        Is located at Goldsboro, and liberally supported by that benevolent order. It began operations in May, 1892. Had twenty-eight in 1895 with the number gradually increasing; Mr. J. T. Deams, Superintendent. In addition to the original structures, a fine modern building has just been added, to more completely fulfill its design., 931616=        The school census of 1894-5 shows the number of persons between six and twenty-one years of age to have been--white, 389,709; colored, 212,191; total, 601,900; of which there was an enrollment of--white, 235,486; and of colored, 123,899; total, 359,385. The average attendance during the same time was, for whites, 149,046 for colored, 71,246. Average length for school terms--for whites 12.85. for colored, 12.12. Average salary of teachers--white males, $25.53; white females, $23.08; colored males, $23.08; colored females, $19.27., 916049=        Situated at Barium Springs, Iredell county, and under the charge of Rev. R. W. Boyd, Superintendent, who is the representative of a Board, chosen by the Synod of North Carolina (Presbyterian). Has property worth $15,000. The institution began operations only a few years ago, and in 1895 had seventy-two children., 895436=        The Bureau of Labor Statistics was established by the Legislature of 1887, and its first Commissioner was Hon. W. N. Jones, who was succeeded two years later by Hon. J. C. Scarborough, who held the office until 1892, when he was elected State Superintendent of Public Instruction. Governor Carr, who has ever proved himself the friend of the laboring classes, appointed as Commissioner Mr. B. R. Lacy, a representative labor man who, as Chairman of the Locomotive Engineers of the S. A. L. system between Portsmouth, Va., and Atlanta Ga., had, by his wise and conservative course, succeeded in doing what was considered almost an impossibility, that was, gained the respect and confidence of both the railroad officials and the men whom he represented. His nearness to, and his intimate knowledge of the wants of the people for whom the office was created gave new life to the work., 539061=        Since the census report of 1890 was taken, the decline in price of cotton has greatly stimulated the production of tobacco in the counties of Wilson, Nash, Edgecombe, Green, Lenoir, Beaufort, Pitt, Washington, Franklin, Wayne, Wake, Martin, Bertie and Halifax., 957644=        \"The North Carolina Baptist Students' Loan Fund,\" incorporated March, 1877, lends money arising from the interest of its invested fund to indigent young men wishing to study in the college, the loan to be re-paid with interest after the completion of the course., 932805=        For the fiscal year ending November 30th, 1895, there had been levied for school purposes on white polls, $250,458.85; and on colored polls, $94,436.58. On general property there had been levied on the whites $363,258,68, and on colored $12,861.92. Total from all sources for 1895, $765,510.27., 952714=        In 1890, in accordance with the order of the Board of Trustees of the College, of the North Carolina and of the Western North Carolina Conferences Methodist Episcopal Church, South, and of the General Assembly, amending the charter, the institution was ordered to be removed to Durham, where Blackwell's Park, consisting of sixty-two and a half acres of eligibly situated land, was secured as a site for the buildings and grounds. Liberal donations made by citizens of Durham, and other munificent aid enabled the management to proceed so rapidly with the construction of the necessary buildings that the session of 1892-'3 was opened at Durham. These buildings consist of the main College, the Technological building, the College Inn, the Gymnasium buildings and seven residences for the Faculty and officers, altogether constituting a mass of well constructed and architecturally imposing edifices. The grounds are well laid off, and the whole is an independent municipal corporation, with its own mayor, commissioners and peace officer., 955491=1849. Since that period, by the earnest and liberal zeal of prominent members of the Baptist Church, an endowment fund has been accumulated, now amounting to more than $220,000. In the number, excellence and elegance of the college buildings, Wake Forest is the equal of any like institution in the country. Among these may be mentioned the \"Lea Laboratory,\" the \"Wingate Memorial Hall,\" the \"Old Dormitory\" and the \"Heck-Williams Library Building.\", 878226=        The North Carolina Geological Survey, as at present organized, was authorized by the General Assembly in 1891, and in May, of the same year, Professor Joseph A. Holmes was commissioned as State Geologist. The object of the survey was two fold, as expressed in the act creating it: \"the thorough examination of the nature and extent of the mineral and timber resources of the State.\" During the first years after his appointment, Professor Holmes devoted his energies to the gathering of the unpublished information of former Geologists--Emmons and Kerr--many of the results from both having been lost by not being published; and in connection with this a large amount of exploration was found necessary before entering more directly upon the special new work contemplated by the framers of the law. After this reconnoisance work, he associated with him an able corps of assistants, and has issued the following bulletins: Iron Ores; Gold Deposits; Road Materials and Road Construction; The Forests, Forest Lands and Forest Products; Forest Fires; Monazite and Monazite Deposits; Corundum and Basic Magnesian Rocks, and besides these he has in preparation or in press the following additional Bulletins: Building Stone in North Carolina; Timber Trees; Water Powers; Gold Mining in North Carolina; Drinking Water Supplies; Clay Deposits and Clay Industries; Mica Deposits and Mica Mining; Mineral Waters; List of Elevations and an Historical Sketch of North Carolina Scientific and Economic Surveys, and Bibliography of North Carolina Geology and Mineralogy. These Bulletins are mailed to those desiring information on the special subjects treated, on receipt of the postage; address the State Geologist, at Chapel Hill, or Raleigh, N. C. The progress of the work has been most gratifying and the appreciation of its usefulness is steadily growing among the people of the State., 1095652=        The tax returns for 1895 show 156,835 acres of land, valued at $632,239, and 181 town lots, valued at $52,363., 138065=the east, both because the Gulf Stream is separated from the land by fifty miles of cold water, and because the prevailing winds are from the southwest or northeast and do not blow the moist air of the Gulf Stream over the land, as is so often stated. The annual mean temperature of Southport, situated in the southeast corner of the State, is 64 degrees. Here vegetation of semi-tropical origin, as the palmetto and magnolia flourishes and rice is cultivated. The decrease in annual mean temperature towards the north is only to 59 degrees at Coinjock and Weldon. The land is level and fertile, and the earlier and more rapid development of vegetation has led to one of the most important industries of the State, that of truck farming. The shipments of truck and strawberries to northern markets begins before the middle of April., 539571=        Col. Cameron in his admirable treatise on tobacco, in the Handbook of North Carolina, issued in 1893, discredits the correctness of the census report of the crop of 1889, and in support of his position quotes from a very carefully prepared address of Mr. W. W. Wood, President of the State Tobacco Association, made to that body in August, 1891. Col. Cameron exonerates the enumerators of the census from carelessness or intentional error, and explains the discrepancy of their reports with the actual amount of production. Mr. Wood makes his estimates from entirely different sources, and reaches the conclusion that the crop amounted to 76,000,000 pounds. That Mr. Wood's estimate was none too large, and showing also the enormous increase in production during the past six years, the highest possible confirmation is now adduced., 1003128=course, with a corps of six professors and a course of four years, with the usual college designation of classes. The College course embraces two courses of study--the classical and the scientific--the students of the former receiving the degree of Bachelor of Arts on graduation; the other that of Bachelor of Science. There is also a Preparatory and Normal department, with its appropriate faculty; and Industrial department, in which the mechanical trades are taught, and the Home department, which embraces chiefly the domestic and internal order of the college buildings and grounds. The whole number of students for 1895-6 is 249, in all the departments, viz.: Theological, 22; Collegiate, 62; Preparatory and Normal, 162. The president of University is the Rev. D. J. Sanders, D. D., 861705=        The following table, carefully calculated by those in authority in the several denominations, will serve to show the names of the denominations and the number of communicants or members in each for the year 1895-96:, 935940=        The University was chartered in 1789, and opened in 1795. It is the oldest university in the south; up to 1860 it had a very large patronage from all the southern States. Its roll of alumni includes many names of national repute, and it may be doubted whether so large a percentage of the alumni of any other American college have achieved eminence in public life. Among them may be named President, Jas. K. Polk; Vice-President, Wm. R. King; Senator, Thomas H. Benton; Wm. A. Graham, Secretary of the Navy, Whig candidate for the Vice-Presidency; Major General Francis P. Blair, U. S. A., Democratic candidate for the Vice Presidency; John Y. Mason, Leonidas Polk, John Branch, Willie P. Mangum, Jacob Thompson, Aaron V. Brown, James C. Dobbin, John H. Eaton,, 845979=        The Indian portion of the population is confined to the mountain counties of Jackson, Swain and Graham. They are a remnant of the tribe which was removed in 1836 to the trans-Mississippi reservation, and which obtained the consent of the government to be exempted from the decree of expatriation. They were allotted in the counties above named a tract of about 100,000 acres, and left in the enjoyment of their former habits and customs. They are for the most part christianized, and speak both English and their native tongue. They are peaceable and generally law-abiding, but do not accumulate property, are only industrious enough to meet daily wants. There are about 1,800 of them, and they increase slowly., 43218=        It is fitting here to give credit and make due acknowledgment to those who have so generously contributed in the preparation of the matter for the work. Much has been drawn from the very excellent and accurate work of Col. John D. Cameron, in the Hand Book of 1893. He has written much that is enduring, and from it the most liberal quotations have been made. For information relating to the ores, building stones, minerals, waterpowers and roads, I am indebted to Professor Joseph A. Holmes, State Geologist; for information in regard to taxation and the State debt, to Hon. R. M. Furman, State Auditor; for articles on Agriculture, to Hon. S. L. Patterson, Commissioner of Agriculture; for information prepared on horticulture, to Prof. W. F. Massey; for information relating to flora and the climate, to Dr. H. B. Battle, Director of the North Carolina Experiment Station, and to Professor Gerald McCarthy, Botanist, and Mr. C. F. von Herrmann, Meteorologist, of the Experiment Station staff, and to the following for information on the subjects annexed to their names:, 89196=        North Carolina was not forward in adopting secession. The people by a small majority in February, 1861, voted down the proposal to call a convention to consider Federal relations. But when coercion by the United States Government was resolved upon, a convention was called, and, on May 20, 1861, an ordinance of secession was passed by unanimous vote, and it was supported by large levies of money and troops. It was not the policy of the Confederacy to defend seriously the North Carolina coast, and by the Spring of 1862 the whole of the country from Beaufort to the Virginia line was in the hands of the Federals. Plymouth was, however, recaptured with nearly two thousand prisoners by the Confederates under General Hoke, but in a few months it was lost again, the Confederates having previously been ordered to Virginia. Fort Fisher at the mouth of the Cape Fear was defended with conspicuous courage for many months, thus enabling Confederate vessels to evade the blockade and introduce large supplies of necessaries, such as cloth, blankets, shoes, medicine, &c., for the use of our soldiers. And this was brought about by the efforts of Governor Zebulon B. Vance, seconded by the votes of the Legislature in authorizing large increase of bonds and treasury notes. A sharp but indecisive battle was fought at Bentonsville near the close of the struggle, but the valor and the sacrifices of the soldiers, 973253=        This college occupies a fine brick building in a fine natural park of forty acres in a pleasant part of Greensboro. It is a Methodist institution, the original suggestion of the Trustees of the Greensboro Female School, to the Virginia Conference of the Methodist Episcopal Church, asking that a female college under their auspices, be established at Greensboro. This was in 1837, when the North Carolina Conference had no separate existence. It acquired such the same year; and in 1838 the North Carolina Conference obtained a charter from the State Legislature. This was the first female college chartered in North Carolina, and the first south of the Potomac, except Wesleyan Female College at Macon, Ga. The institution was opened for students under the presidency of the Rev. Solomon Lea, succeeded as the result of successive resignations, by the Rev. A. M. Shipp, D. D., the Rev. Chas. F. Deems, and the Rev. T. M. Jones. The school building was destroyed by fire in 1863, and not rebuilt until 1871. It was opened in 1873 under the presidency of the Rev. T. M. Jones, and continued under him with great success until the period of his death which occurred in 1889, when he was succeeded by the Rev. B. F. Dixon., 599018=        THE POMONA NURSERIES.--These nurseries are situated near the city of Greensboro, at Pomona. They are conducted and owned by Mr. J. Van Lindley, one of the leading members of the American Pomological Society, and of the North Carolina Horticultural Society, and who is largely interested in the culture of fruit both in North Carolina and other southern states. Mr. Lindley was born a nurseryman, as his father followed the business before him, and by his energy and enterprise in getting the newest and best adapted fruits for the State has done a great deal to advance pomology in North Carolina, and has built up an extensive business, producing fruit trees of all sorts by the million. The extent of this nursery is shown by the fact that there are now 625,000 apple trees of various ages, five acres of apple seedlings for grafting, 400,000 peaches will be budded the summer of 1896, and there are 100,000 plum stocks for grafting, besides many thousands of apricots, nectarines, cherries, mulberries, grapes, pecans, English walnuts, Japan chestnuts, with many thousands of roses and ornamental trees and shrubbery. Four greenhouses are used in the propagation and growth of ornamental plants. The nurseries occupy about three hundred acres of land., 916984=        Is near High Point, and was organized in 1895. While this latest of the family of orphanages in North Carolina is only in its infancy, it is doing most effective work. Dr. J. M. Tomlinson of Archdale, is the Chairman of the Friends' Committee having its interest in charge. There can be no doubt that this good work will grow and multiply., 917441=        located at Asheville, was established in March, 1890. This was organized to meet the needs of the county of Buncombe, and its history renders it a model for the State. At last report (October 1895) it was caring for thirty-one children, and had had charge of one-hundred and fifty-seven children since its organization, many of whom had been placed in good homes., 997950=        Its mission is for the industrial and higher training of the colored youth of both sexes, and has four departments of instruction, viz:--Normal, Grammar School, Primary and Industrial. Under the latter, are included Sewing, Cooking, Shoe-making, Agriculture, Wood-working, &c., 901199=        On the 29th of August, 1894, an infirmary building for female patients, with associate dining room attached, was opened, furnishing accommodations at present for three hundred and eighty-two. This is connected by a covered corridor thirty-one and a half feet long with the south wing, and has a front section three stories high, sixty feet by forty, with spacious verandas. There are one hundred and eighty acres in cultivation; value of farm products $9,145; appropriation for support for 1896 was $65,245. The daily average of patients for 1895 was three hundred and thirty-six, and the percentage of cures upon admissions was forty-six. The standard of this institution has always been high and notable for success. At one period under Dr. Eugene Grissom, the percentage of cures reached sixty-eight. It is now under the skillfull care of Dr. George L. Kirby. During the past year a reservoir of four hundred thousand gallons of water has been added., 566430=        The State Agricultural Society will hold this year, 1896, its thirty-sixth annual fair. It has large and conveniently located grounds near the city of Raleigh; fine half mile track, with ample, 55292=        I have myself stood upon such an eminence on Wokokon Island as that described by the voyagers, but I sought a more poetical hour than midday, and I had, too, the benefit of a blustering March wind, which threw the waters all into a rage, and brought down the waves of the Pamlico all the way from Roanoke Island, as heavy as if they had been born in the Gulf Stream. It was a clear, cold day; and with the history of these voyages fresh in my memory, I had wandered about the island, and at sunset I placed myself as near as possible on the very eminence on which they had stood centuries ago. The view before me was indeed wild and startling. The glorious sunset gilded the crested waves of the Pamlico, as they broke in boundless succession afar to the west and to the north, and the narrow island that curves around to the northeast from Ocracock to Hatteras, all covered as it was with the mellow tints of the sun, resembled a rainbow resting on the face of the sea. The opposite towns of Portsmouth and Ocracock, and the old shell castle, stood before me amid the noisy waves, as if they had arisen to earth from the convulsive throes of the excited sea, and then there was the narrow island, with its naked woods and vines, and the waves bursting and thundering upon its shores, combing their foam higher and higher on each return, as if in the wantonness of their strength they would clap their hand over the very spot on which I stood. To me there is something especially fascinating in the scenery about Ocracock Inlet. I love it for its very bleakness; and historical association, too, hallows it in my memory. It is indeed a place of storms, for nature has there provided everything which can give fury to the winds, and, come from what quarter they will, they bring noise and strife. An easterly wind arouses the whole Atlantic, and the waves, 87797=Governors, of North Carolina until 1728. Seven of them then sold their interests to the Crown, Lord Carteret, afterwards Earl Granville, yielding the right of government, but retaining his one-eight interest in the land of all Carolina. In 1744 he obtained a grant in severalty of about one-half of North Carolina, next to the Virginia line. The colony was therefore under the crown from 1728 to the Revolution., 842733=        The location of his large colony of Moravians by Count Zinzendorff, in 1754, in the present county of Forsyth, is the only instance of attempted complete isolation, of the seclusion of an entire colony,, 152806=        There remains to be considered one special advantage possessed by the State, due to its position with reference to the prevailing course of cyclonic storms. The great path of these \"weather breeders\" is across the lake region and thence northeastward up the St. Lawrence Valley. North Carolina lies entirely out of this general path. Of the total number of storms charted from 1874 to 1890, only 16 per-cent. crossed North Carolina. There are, therefore, longer periods of pleasant weather than can be experienced in more northerly states. Of destructive tornadoes, North Carolina experiences not one in ten years., 498652=        The seine is the form of apparatus that takes the largest amount of fish and yields the greatest money returns. In 1890, 17,984,830 pounds of fish, valued at $401,036, were caught in this way., 514896=        One of the first decisive steps taken was the enactment of a law, ratified March 11, 1885, directing the State Board of Agriculture to cause a survey to be made, both of natural oyster-beds and private oyster gardens, with reference to the culture of shellfish. Under the act, the Governor was requested to ask the Federal Government to, 410070=        Several years ago the strongest opposition to the movement came from these eastern counties, where the surface of the country is level, and where the stone for macadamizing purposes is scarce or entirely absent; but during 1893, and years following, Wayne, Lenoir, Edgecombe and New Hanover counties, adopted plans for improving their earth roads and have pushed the work forward with vigor and success, accomplishing results of decided benefit at a small expenditure of money. This has resulted in arousing considerable interest in the subject in a number of adjoining counties., 148405=        As illustrating extreme years with respect to total precipitation, it may be mentioned that the wettest year recorded occurred in 1877, with an average of 64.88 inches for the State. September, of that year, had the only average of over 10 inches for one month. During the year 1890, the total annual rainfall was 46.49 inches, and November of that year had an average of only 0.35 inch., 581074=people from the north settled and engaged in fruit culture. The frostless belts are found along the east slopes of the mountains, and seem caused by the settling of the cold air at night into the valleys, pushing up the warm air, and they show a luxuriant green in the autumn long after frost has browned everything in the valley below. The same influences protect the blooming trees in the spring. All over these uplands, and particularly in the upper part next the mountain barrier, fruit trees of all kinds flourish with proper attention, and many diseases that affect them in more northern localities are unknown. The culture of apples will prove a most remunerative business, when undertaken by intelligent cultivators and with the proper varieties. Many apples are grown there already, but as a rule, the varieties most popular in the North, are not grown to the extent they should be. The exhibits from North Carolina and Virginia, at the Chicago Exposition, opened the eyes of apple dealers north to the great value of certain varieties that grow here to greater perfection than elsewhere. This is particularly true as to the Winesap and the York Imperial apples. The latter variety is grown to some extent under the name of Johnson's Fine Winter. During the past winter, (1895-96,) these two varieties of apples from North Carolina and Virginia, have brought higher prices in New York and in Liverpool than any other apple, not excepting the famous Albemarle Pippin, of Virginia. In the black soil of the mountain coves, the Albemarle Pippin thrives as well as in its native locality. But the Winesap and the York Imperial thrive over a wider range of country and there are fortunes in the cultivation of these two apples in this section. On the breezy uplands the peach reaches greater perfection than anywhere, except in the Sand Hill country; and in the neighborhood of Greensboro there are profitable orchards. In no section of the State do cherries reach such perfection, and the fine cherries of this section sell next to the product from California in the New York market, bringing at times as high as forty cents per pound. On the foothills the cherry will prove a most remunerative fruit crop. While the finer cherries do not thrive in the eastern part of the State, they here reach their highest perfection. Plums of the American and Japanese varieties are grown to a considerable extent and have been found to pay well. Pears also succeed well, and should be largely grown. Grapes for wine making are grown to some extent and the fruit is of remarkably fine quality. By grafting on the native roots, and paying attention to spraying to prevent mildew, the fine varieties of the European grapes can be grown to great perfection. The possibilities in this line are but just being appreciated, and it is believed that, 884473=        The State Board of Agriculture has enlarged and perfected the State Museum. This was made possible by the wise provision of the Act of the Assembly in 1891 which provided that all nonperishable material used by the State in its presentation of resources at the great Columbian Exposition at Chicago in 1893, should revert to the Board for the purpose of adding to its then small collection. Thus has the Board had the first substantial aid from the State in this work, and very wisely has it been administered. The Board also has the hearty co-operation of the State Geological Survey in the museum work, especially in those divisions devoted to metalliferous ores, minerals and building stones., 46336=        On the 4th of July, 1584, two English ships hove in sight of the coast of North Carolina, somewhere about Cape Fear. They were the vessels of Sir Walter Raleigh, and were on a voyage of discovery, to take possession of some portion of the new world in the name of the crown of England. The day on which they first beheld the shores of our country has since become the great political holiday of the age, and is now distinguished as the anniversary, not of the origin, but of the downfall of the authority of England over the United States. The commanders of these two ships were Philip Amadas and Arthur Barlowe; and the ceremony which they performed upon the coast of North Carolina, and which I am now about to celebrate, is perhaps one of the most memorable events in the history of mankind. The fortunate results of the dominion of England over the territory of our Union are as innumerable as are the stars; and the free Anglo-American, in whatever forests he may be found, will turn reverently to the spot consecrated as its birthplace. The two adventurers loitered along the coast of North Carolina, in full view of the shore as it sweeps in a curve from Cape Lookout to Cape Fear. There was scarcely wind enough to ruffle the plumage of the two ships as they lay their gentle course, and the mild land-breeze was so fragrant, that the voyagers exclaimed that they seemed to be in the midst of some delicate garden, abounding with all kinds of odoriferous flowers. Thus making their liquid way, on the 13th of July, 1584, we find the two ships at anchor in the roads of Ocracock Inlet, within a few hundred yards of the island which lies to the south, and which the Indians called Wokokon. And this is the spot, of all the fair lands of our wide-spread country, which was first occupied by old mother England., 886903=        It is under the control of the Board of Agriculture. It was established in 1877, and was the first Experiment Station in the Southern States, and the second in America. Its first work was in the control of the fertilizer trade by a chemical analysis of the fertilizing ingredients offered for sale, thus preventing fraud and causing the manufacturers to furnish the materials they claimed to sell. It continues to occupy this position for the protection of all classes of farmers, and it is safe to say that in twenty years of its existence it has saved the farmers of the State many millions of dollars by preventing the sale of such adulterated and worthless fertilizers. In the early years of its life, chemical investigations were its main work. Besides analyzing fertilizers, it also examined thousands of samples of marls, mucks, soils, cotton seed products, phosphates, waters, home-made composts, miscellaneous fertilizing ingredients and chemicals. It has spread broadcast hundreds of thousands of its publications, giving information on almost every subject connected with agriculture. It thoroughly examined the natural phosphate deposits of the State, the pyrite deposits, the by-products of the rice industry, of cotton and tobacco products, also the jute and sugar beet industry, and others of importance., 1093515=        Alexander, one of the smallest counties in the State, lies south of Wilkes, from which it is separated by the Brushy mountains, and north of the Catawba river. The county, especially in the northern and western sections, is traversed by spurs and high ridges, many of which rise to an elevation of 2000 feet. The drainage is southward into the Catawba and eastward into the Yadkin. The tributaries descending from the mountains afford ample water power easily accessible. A greater part of this is yet undeveloped, though there are numerous grain mills and two cotton factories are now in course of erection., 444489=stretches of natural slackwater, with practicable navigation for comparatively long distances. These undertakings were made a long time since. Thus the Cape Fear Navigation Company, with power to construct canals, received a charter to improve the Cape Fear river in 1795; the Roanoke Navigation Company and the Neuse River Navigation Company in 1812; the New River, the Tar River, the Catawba River and the Cape Fear and Yadkin River companies in 1816., 88634=        The Tuscarora war of 1711 brought terrible losses of life and property to the young colony. By the aid of troops from South Carolina the uprising was quickly suppressed. Afterwards in the Yemassee Indian war, North Carolina repaid her neighbor by sending prompt and efficient succor under Col. Maurice Moore. She likewise sent troops to aid the unsuccessful attempt on Carthagena, and to Virginia and New York to fight against the French and Indians., 956298=        The faculty now consists of C. E. Taylor, president, professor of Moral Philosophy; W. B. Royall, professor of Greek; L. R. Mills, professor of Pure Mathematics; B. F. Sledd, professor of English; W. L. Poteat, professor of Natural History; C. E. Brewer, professor of Chemistry; J. B. Carlyle, professor of Latin; J. F. Lanneau, professor of Physics and Applied Mathematics; W. J. Ferrell, assistant professor of Mathematics; R. W. Haywood, assistant professor of Languages; T. H. Briggs, Jr., director of Physical Culture. The number of students in 1895-96 was 261., 1071919=        This place is on the picturesque French Broad river, near the Tennessee line in a region of attractions in the way of scenery has especially to boast of its climate and healthfulness. Its altitude of 1700 feet, freedom from fog, and pure dry air make it most desirable for the debilitated., 477490=freely with the ocean by means of Caffey inlet, which was closed in the year 1800. Prior to this time the sound contained marine fish, but at present only fresh water and anadromous fishes are found in it. Black bass (locally called chub) and white perch are very abundant, and at the proper season rock and herring enter the Sound in considerable numbers. The catch of black bass is probably greater than in any other part of the State, if not the largest in the country. The region is annually visited by enormous numbers of wild fowl, and is one of the most noted hunting resorts on the Atlantic coast., 930956=        Without going into details involving the legislation of several years, it is enough to say here that in 1894-5, from the general poll-tax, general property tax (18 cents on the $100), special poll-tax, special property tax under local acts, special poll-tax under local acts, fines, forfeitures and penalties, liquor licenses, auctioneers, estrays and other sources, all of which are specially applied to the school fund, and from the State Board of Education, there was realized the sum of $777,079.29, as against the receipts of 1884 of $580,311.06; and for 1894-5 the expenditures were $783,405.09., 1082626=of sport to the most exacting gunner, Bob White stands pre-eminently first. To rise with whirring wing while you are off guard, to dash down from a pine top until he skims the ground, to swerve behind the nearest tree or bush that will stop your load--all with the rapidity of lightning--seems to be as easy to him as a straight-away flight. May his cheery whistle long echo over the land! Bags of twenty-five to fifty are not uncommon with our best gunners, and occasionally a round hundred will be the count when the game bag is emptied at the close of a day's sport., 319682=        Among the most important localities in this region are: the William Nelson mine, four and one-half miles northwest of Danbury. The ore was originally mined for the Clements forge built near here in 1790. The ore is of the hard variety, and the thickness of the body as now visible is three to eight feet. Analyses of select ores show:, 144456=        In the summer months the southern portion of the Piedmont Plateau presents higher monthly means and greater extremes than either the Coastal or the Mountain regions, probably in part due to the sandy nature of the soil. The warmest month is July, and a few stations sometimes have for that month a mean of over 80 degrees; the coldest month is January, and in the mountains the mean for that month sometimes is as low as 30 degrees. The extremes in temperature for the State are considerable, but rarely does the temperature reach zero, except during such extraordinary cold periods as occurred in 1873, 1886 and 1893. During a normal winter the minimum temperature in the central portion of the State will sink to 10 or 12 degrees, but such cold is usually of very short duration. During a normal summer the temperature will perhaps on two or three days reach 100 degrees., 454162=        Here might be expected a harbor of easy entrance and ample capacity. Therefore we find a new England colony of adventurers seeking settlement and homes within its shelter in 1660, followed by a colony from Barbadoes in 1662-'63, and thenceforward continued occupation, founding of towns, opening up of plantations, enlargement of population and increase of wealth up to the present day. In early times the class of merchant vessels, or even of war vessels, was small and draft light, so that the question of depth of water on the bar and in the inner channels never seemed to have been presented. In all probability there never was occasion for it, for there was but a single entrance--that between Smith's and Oak islands, and that secured sufficient water for all vessels using the harbor. But in 1761 a long-continued tempest cut through the banks between Smith's island and what was long afterwards known as Federal Point, forming, until recently closed, what was known as New Inlet. The waters turned into this new channel in time attained a depth of water equal to that on the old or main bar, and eventually reduced the depth of water on that, in 1839, to about nine feet at low water, the New inlet bar at the same time showing ten feet, and becoming the channel through which most of the coasting trade was conducted. This reduction in depth involved diminution in trade, and Wilmington was seriously menaced with the loss of its most valuable commerce. Therefore the State of North Carolina began the work of relief, continuing it from 1823 to 1828, when the General Government very properly assumed the duty and the cost. The operations for many years consisted of efforts to deepen and clear the channel of the river for some miles down by dredging, but chiefly by the construction of jetties, and after some years of labor and a large expenditure of money, a gain of two or more feet in depth was effected. The work was suspended, and resumed in 1852, and directed to attempts to close the New inlet by closing the entrance between Smith's and Zeke's islands, and fair progress was made, when, in September, 1857, a great storm swept, 81131=        Virginia Dare was the first white child born in North America, of English-speaking parents. It is also significant that the first Christian sacrament in America was the baptism of Manteo, an Indian, and Virginia Dare, infant native white American, which occurred on Roanoke Island. North Carolina, in August, 1587., 784785=        The first line chartered in the State was that between Fayetteville and Salisbury, 1833; it was surveyed and finally failed for lack of funds. The Raleigh and Gaston railroad was begun in 1836, and completed in 1840. In the same year, the Wilmington and Weldon railroad was completed between the terminals. This road was one hundred and forty-six miles in length and was then one of the longest roads on the continent; and, indeed, longer than any at that date in Europe., 500301=        Few changes in the fisheries of the State during the past decade have been more remarkable than the large increase in the number of pound nets. In 1880, only one hundred and seventeen such nets were set in the State, while in 1890, there were nine hundred and fifty. The pound-nets are most numerous in the Albemarle region, but are also employed in the other sounds, and the rivers emptying into them. This form of net was introduced into Albemarle sound in 1870, since which time it has exerted a marked influence on the development of the fisheries, by supplanting to a greater or less extent the older types of apparatus because of its greater cheapness and efficiency., 600331=        GREENSBORO NURSERIES.--These nurseries are in the same neighborhood as the Pomona nurseries, and this business is more extensive about Greensboro than elsewhere in the State. Mr. John A. Young is the proprietor. They are east of the city of Greensboro, and have at various times been under the management of different owners, but have been under the present ownership since 1884. The nurseries occupy two hundred and seventy-five acres of fine land. Thirty to forty men are annually employed as traveling agents and the trade is mainly in this State, Georgia, Alabama, Mississippi, Louisiana and Virginia. An average of thirty-five men are employed in the nursery grounds. The Comet and the Greensboro peaches were, 927151=        Public financial confusion, general private pecuniary distress, materially delayed action upon the wise determination of the founders of our State government. Yet under all untoward circumstances, the University was chartered in 1786, and entered upon its work in 1795. It lit the torch of public education, if at the time it could do no more. Its own career grandly illustrated its own usefulness Its example and influence kept alive that broader ultimate plan and purpose of an education to be brought to every child in the land.\", 80060=        At the first meeting, which was held in May, 1894, Prof. Daves was elected president; Mr. W. D. Pruden of Edenton, vice president; and Dr. J. S. Bassett of Trinity College, secretary and treasurer. In the succeeding July Prof. Daves died, and the vacancy thus made was filled by the election of his brother, Maj. Graham Daves, of Newbern, N. C., 917923=        founded in 1885 and managed by a committee of ladies from the Episcopal, Baptist, Methodist and Presbyterian ladies of Asheville. Supported by voluntary contributions and a small sum from the county. Cares for about one hundred patients during the year., 303732=the most famous localities in the South Mountain region, a large amount of gold having been obtained here since the first discovery in 1828. From Pilot Mountain and along its lower slopes, a number of gravel channels radiate in all directions. Some of these, as the White Bank and the Magazine mines have been worked as high as water could be obtained, but a large amount of virgin ground still remains that has not been worked. The total length of the several ditch lines on this property is about twenty miles. The head obtained at the mines is from sixty to two hundred feet., 151760=        Considering Raleigh, the capital city, as representing the average with respect to the probability of the occurrence of frost, it may be stated that the average date for the last frost in spring is April 10th, though killing frost have occurred on rare occasions in May. In autumn, the first frost will generally occur about October 26th. Necessarily in the mountain region these dates are both much advanced, while in the east, the modifying effects of the many arms of the sea penetrating the land greatly diminishes the danger of killing frosts at the season when crops are growing., 785315=        The North Carolina railroad--Goldsboro to Charlotte--two hundred and twenty-three miles in length, was completed in 1856, and the next year saw the completion of the Atlantic and North Carolina railroad from Goldsboro to Morehead and Beaufort harbor; it is ninety-seven miles long and links the east with the great Piedmont region. Later the western links of the system were completed, from Salisbury, 4027=Source Description: (title page) North Carolina and its Resources. State Board of Agriculture xv, 413 p., ill. Winston M. I. & J. C. Stewart, Public Printers and Binders 1896 Call number C917 N87a (North Carolina Collection, University of North Carolina at Chapel Hill), 963554=        This excellent school was established in Oxford in 1851 by James H. Horner, the course of instruction is thorough, embracing the classical, mathematical, scientific and military features. Each course is arranged for four years. The classical course embraces the studies in the schools of Latin, Greek, Mathematics, English Grammar and Rhetoric, Geography and History. The scientific and English course embraces Mathematics, Natural Science, Metaphysics, English Grammar and Rhetoric, Geography, History., 82894=        In the winter of 1775-76, North Carolina troops under Howe helped drive Lord Dunmore from Virginia. In February, 1776, the Tory Highlanders were crushed at Moore's Creek bridge. On April 25, 1776, North Carolina, first of all the colonies, empowered her delegates to the Continental Congress to vote for independence. In the next month her troops assisted to repel the British fleet at Charleston. In the same Summer her militia under Rutherford, marching over trackless mountains, effectively humbled the hostile Cherokees. Her troops fought gallantly under Washington at Brandywine, German-town and Monmouth and were among the picked men to storm Stony Point under Wayne. By their stubborn endurance and pluck her people thwarted Cornwallis' attempt to subjugate the Carolinas and Virginia. They furnished troops and leaders for capturing Ferguson at King's Mountain. They aided Green in crippling Cornwallis at Guilford Court House, and the virtual victory of Eutaw Springs., 839954=        In 1709, the Baron De Graffenreid, with a colony of Swiss, established himself at the confluence of the rivers Neuse and Trent, and there founded the present city of New Bern--a settlement destined to be permanent, but of slow growth, and receiving few farther accessions from the native land of the founder., 1038776=        At Wrightsville and at the Beach there are fully 150 cottages, hotels and boarding houses. At least 100 families spend the summer here, and during the months of June, July and August, it has a large number of visitors., 554055=        Dairy products increased from 7,212,507 lbs. butter in 1880 to 13,129,374 lbs. butter in 1890; poultry increased from 2,071,616 chickens in 1880 to 7,507,593 chickens in 1890; eggs, from 7,455,132 doz. to 11,755,635 doz.; honey, from 1,591,590 lbs. to 2,373,560 lbs. Estimated value of all farm products $50,070,530, for the last census year., 902265=        This is the model institution for the insane south of the Potomac river, and was authorized by the Legislature in 1875, and built by Nereus Mendenhall, M. D., Eugene Grissom, M. D., M. Whitehead, M. D., Col. T. G. Walton, and Capt. C. B. Denson, Commissioners. It was not finally completed until 1886, and is on the linear plan, having a greater frontage than the Capitol at Washington. About 600 acres belong to the institution. During 1895 there were under, 218773=        The total number of distinct species growing within a circle of say twenty-five miles diameter, in a fertile and well varied district, is from 1000 to 1200, not including microscopic fungi., 1089203=        There are ninety-six counties in North Carolina, and each has an interest peculiarly its own. The space allotted is necessarily small, but this volume would be incomplete without special reference to the features of soil, climate, natural resource, or other condition peculiar to any county. It is the purpose of the Board of Agriculture to present impartially the characteristics and advantages of the several counties, and to that end sought the aid of prominent and well informed residents of each, to whom public acknowledgment is due for the careful and valuable assistance rendered. The substance of all revisions has been incorporated, and forms part of the presentation of the counties, which follow in their alphabetical order. The statistics are from the report of the Auditor, for 1895., 358569=        The larger part of this monazite has been mined in Burke, Cleveland, Rutherford and McDowell counties. The best sands (highest in thoria) came from Burke and Cleveland counties, though some of special high grade has been reported from McDowell county. The price of monazite has varied from twenty-five cents per pound in 1893, to as low as three cents for the poorer grades and six to ten cents per pound for the better grades sold in 1894-'95., 939689=        The college opened its doors for students in October of 1889, and has had a healthy and steady growth ever since. Like all new enterprises it had to encounter some hostility, and a great deal of indifference and incredulity as to power to do the work that was wanted., 950373=        The leading Methodist College of North Carolina, is the outgrowth of the Grammer School, established by the Rev. Brantly York, in 1838, in the north-west corner of Randolph county, five miles south of the town of High Point, on the North Carolina Railroad, and about one hundred miles west of Raleigh. In 1842, Dr. York, resigned the charge of the school, and the Rev. B. Craven, then only nineteen years old, was elected as successor. In 1851, the school was re-chartered and the name changed to \"Normal College.\" By this charter, the school was brought under the State supervision, and the Governor of the State became ex officio President of the Board of Trustees, and the Superintendent of Common Schools, Secretary. The object of this connection was to secure a higher grade of teachers for the common schools, and, by a provision of the charter, a certificate from the Normal College was made ample lawful evidence of qualification to teach in such schools. At the annual session of the North Carolina Conference of the Methodist Church, held in Salisbury, in 1851, the connection between the school and the Conference was adopted, and the Trustees of the College agreed that young men preparing for the ministry should be educated without charge. In 1853, the charter was amended, and the College was authorized to confer degrees. In 1858-'9, the management of the institution was transferred to the North Carolina Conference of the Methodist Episcopal Church, South and by act of the Legislature, the College was vested in the Conference with all the the rights and privileges usually granted in such cases, and the name was changed from Normal to Trinity College. The College suffered from the effects of the war, and in 1865, for a short time, exercises were suspended. Dr. Craven, in that year, was re-elected President, and the next year exercises were resumed. In 1882, Dr. Craven died, with disastrous influence on the fortunes of the institution, which fell so low as to, 1105124=        Beaufort was erected into a separate county prior to 1775, and named in honor of the Duke of Beaufort, one of the original Lords Proprietors of Carolina., 975519=        The Lutheran College for the higher education of women has just been organized under the auspices of the Evangelical Lutheran Synod of North Carolina, and will be located at Charlotte. This institution is now in process of construction, and the plans provide for a $50,000 structure to be ready for the fall term, beginning in September, 1897. Rev. C. B. King is the President, and Professor C. L. T. Fisher, Vice-President., 1087176=        In the large bodies of fresh and brackish water and their tributaries, near the eastern seaboard, including some of the larger sounds and lakes, may be had some of the best fresh water fishing in the country. Striped Bass of enormous size occur in numbers and afford excellent sport. Pike, two species, Pike Perch, Speckled Perch or Strawberry Bass, White Perch, several species of the Sun Perches, &c., are all caught in quantities by the local fisherman on the rudest kind of tackle; what might then be done with the improved tackle of the up to date angler? But beyond all of the foregoing, the noble Black Bass swims to the front. Both species--the large mouthed and small mouthed--occur, and it is no exaggeration to call the Black Bass really plentiful throughout this region. It runs to a large size, too, six and seven pound specimen being by no means uncommon, while ten to fourteen pounders occassionally occur. To give some idea of the abundance of these species, it may be noted that in 1890--the latest available statistics--the catch for market in one county alone was upwards of 335,000 pounds, a catch that could hardly be equalled by other like area in the country. The Bass are caught locally with a rude outfit, but they are the same tough old fighters as ever, and, 352532=        The Behr mine, five miles east of Hayesville, was opened in 1880. A steam cleaning plant was erected at the mine and considerable developments and prospecting work was done., 502289=        Skim nets are used in greatest numbers on the Roanoke, Tar, and Neuse rivers in the capture of shad and alewives. In 1890, 247,148 pounds of fish, worth $10,581, were taken by this means. Eel pots are sparingly employed in four counties--Currituck, Dare, Hyde, and Beaufort--and their use appears to be increasing, especially in Dare county. Pots took 153,415 pounds of eels, for which the fishermen received $9,222. Fyke nets are the only remaining apparatus used commercially in taking fish, and these are only sparingly employed in Dare and Sampson counties, where they catch small quantities of catfish, mullet, perch, red horse, sheepshead, striped bass, and squeteague. The total yield was 24,885 pounds, valued at $716., 997532=        This institution, named for John F. Slater, who bequeathed a million dollars for the industrial training of the negroes of the South, was established in 1892, through the interests and liberality of citizens of Winston and Salem, and was adopted by the State as a Normal school in 1895, the General Assembly appropriating $1,000 per annum towards its support., 1005651=        The enrollment of students for 1895-96 was one hundred and fifty one., 3409=Text transcribed by Apex Data Services, Inc. Images scanned by Tampathia Evans Text encoded by Apex Data Services, Inc. Lee Ann Morawski, and Jill Kuhn Sexton First edition, 2001 ca. 1.4M Academic Affairs Library, UNC-CH University of North Carolina at Chapel Hill, 2001., 959605=        In 1888, the Institution was chartered under the name of Guilford College. New buildings having been erected, the course of study extended, and the Faculty increased to ten members; and authority was given to confer degrees., 929773=        Such legislation was had, and by the transfer to the Literary Fund by the State Government in 1837 of the State's share of the surplus deposit fund, in the United States Treasury distributed to the States by the Act of Congress of June 23, 1836, the Literary Fund for the \"Common Schools\" was increased by $1,133,757.39. The total \"Surplus revenue\" fund turned over by the Treasurer of the United States to the State comptroller was $1,433,757.39. Of this the State Treasury used $100,000, and $200,000 was applied to draining swamp lands., 132028=        If the indications of nature are to be relied on, North Carolina was plainly marked out as the land for vineyards. In the sober narrative of the voyage of Amadas and Barlowe, made in 1584, to North Carolina, then an unbroken wilderness, the author tells us, in most graphic language of the abundance of grapes: \"so full of grapes as the very beating and surge of the sea overflowed them.\", 448993=        In the history of our coast there is nothing that presents itself as so unstable and capricious as some of these inlets, almost literally here to-day, there to-morrow. Once there were inlets into Currituck sound, with good depth of water, now there are none--one closed in 1775, one in 1828. Opposite the eastern opening of Albemarle sound was once an inlet; now occupied by dangerous Kitty Hawk and the fatal Killawil dunes. A little farther south, opposite Roanoke Island, was once the deep inlet of Nag's Head, through which the earliest English adventurers made their entrance and found a convenient landing-place on the shores of the famous island. That inlet has long been closed, and on the solid land which now fills its channel stands the hotel which forms the noted summer resort of \"Nag's Head.\" Opposite the lower end of Roanoke Island opens Oregon inlet, which for many years has provided safe entrance for vessels drawing ten to twelve feet of water into the waters of the sound. Thence down the coast, through the very thin line of \"banks,\" are two or three unsteady, unsafe entrances, opening and closing at the will of the outside waters. Passing down the coast opens Hatteras, 279857=        The McMackin veins are rich in silver ores. Up to 1874 it is estimated that the total production of the Gold Hill mines was $3,000,000.00, which represents about twenty-three per cent. of the assay value of the ores., 906211=        The act for its establishment was passed January 12, 1845; school opened May 1st of the same year, but the building now occupied was not completed until January, 1849. Main building of four stories, with two wings at right angles, three stories each. Scholastic course in full with library of 16,500 volumes, trades are also taught, and music and other accomplishments for the girls. Enlarged at several periods and finally had accommodations for 250 pupils. But it was deemed best to separate the deaf and dumb from the blind, and on October 1st, 1894, the former class was transferred to the North Carolina School for the Deaf and Dumb, at Morganton. The old institution in Raleigh was thoroughly repaired and improved, and devoted altogether to the blind, having a capacity of 155 of that class. It is doing good work, and has at this time a remarkable orchestra of thirty musicians, string and brass, among its pupils. W. J. Young, Esq., is principal. It is located on one of the squares reserved by the State when the Capital City was laid out. A kindergarten department has been a recent and valuable addition., 909491=        In October, 1889, the Confederate Veteran Association of North Carolina adopted a resolution that a home for helpless and disabled veterans was a necessity, and instructed the secretary (at that time Mr. W. C. Stronach) to open a book for subscriptions. By August 29th, 1890, the amount of $3,000 was thus secured. The executive committee then authorized the secretary to rent a building, which was soon filled. The Legislature, February 16th, 1891, appropriated $3,000 per annum, and gave the Camp Russell property of five acres. The appropriation is now about $8,500, with which about one hundred veterans are maintained with the strictest economy. This would be impracticable but for the benevolence of private parties, and the generosity of the railroads in transporting the veterans to their homes, there being an average per cent. daily of about sixty-five. The State owes a debt of gratitude to Mr. W. C. Stronach, chairman of the executive committee of the Board of Managers, who is always adding to the comfort and welfare of the disabled heroes., 238741=        The distribution of North American land animals has been ably discussed by Dr. J. A. Allen, in the Bulletin, of the American Museum of Natural History, of New York, Vol. 4, 1892, and also by Dr. C. Hart Merriam, of the United States Department of Agriculture, in the publications of that department (see particularly, Year Book of the Department of Agriculture, 1894.), 41205=        It is most gratifying to note the advance made all along the lines of enterprise since 1893. The extent of progress in the industries and the manufactures; the extension of agriculture and horticulture; the widening of remunerative truck fields; the adaptability of hitherto worthless sand-hills and flat lands to the profitable production of peaches, grapes, berries and bulbs, and the expansion of the facilities for all forms of education--these all tell of the solid progress of our people and point with unerring conviction to North Carolina as the most progressive, most desirable and most healthful of all the South Atlantic States as a place of residence. Her homogeneous, hospitable population, conservative laws, light taxation, salubrious and temperate climate, and the great possibilities of her natural and improved conditions also present inviting fields to the investor or to the home-seeker., 954720=        This college was chartered at the session of the General Assembly of 1833. A tract of land containing 615 acres sixteen miles north of Raleigh, at the point now known as Wake Forest, was purchased, and the erection of buildings begun. The institution was opened in February, 1834., 544116=        Standing sixth in point of production in 1879, fourth in 1889, in 1895 North Carolina forges ahead and stands second to Kentucky only in amount of production, and first of all the States in the value of her product, exceeding Kentucky by over one million dollars., 993149=        Board of Trustees 1896--First Congressional District, Hugh Cole; Second Congressional District, W. W. Long; Third Congressional District, H. R. Tyson; Fourth Congressional District, T. F. Debnam; Fifth Congressional District, T. B. Keogh; Sixth Congressional District, J. B. Dudley; Seventh Congressional District, J. B. Holman; Eighth Congressional District, E. W. Gray; Ninth Congressional District, W. H. McClure; President, T. B. Keogh, Greensboro, N. C.; Secretary, J. B. Dudley, Wilmington, N. C.; Treasurer, R. W. Murrey, Greensboro, N. C., 915726=        Rev. E. A. Osborne, Superintendent, organized about 1883. Situated at Charlotte. Has eighty acres of land, and cares for about sixty children. Is supported by voluntary contributions mainly by Episcopalians., 277079=        The Crawford mine in Stanly county is four miles northeast of Albemarle. It is a placer deposit of comparatively recent discovery. The gravel bed is from one-half to two feet in thickness, overlaid by two to four feet of soil. The width of the channel is about two hundred and fifty feet. During 1895 two notable nuggets were found here, weighing eight and a half and ten pounds respectively., 918299=        Organized in 1881, and its support is given, three-fifths from the county and two-fifths from the city. Dr. W. W. Love, is Superintendent. In 1894, it had two hundred and two charity patients, sixty-eight pay; total two hundred and seventy. Is admirably situated near the city of Wilmington., 132534=        Upon the visit of the voyagers to the house of the Indian King, on Roanoke Island, wine was set before them by his wife. It is further mentioned that, \"while the grape lasteth, they (the Indians) drink wine;\" they had not learned the art of preserving it. Harriot, a distinguished man in an age of distinguished men, of whom it was justly said that he cultivated all sciences and excelled in all, visited the same coast in 1586, where he was struck with the abundance of grape vines, and he was impressed with the fact that wine might be made one of the future staples of the State. \"Were they,\" he writes, \"planted and husbanded as they ought, a principal commodity of wines might be raised.\" This State has proved to be far richer in this respect than it is probable even he suspected. Grape vines were found in equal profusion in the original forest throughout the State. They often interlaced the trees to such an extent that they were a serious impediment to the work of clearing away the forest, catching and suspending the trees as they were felled. At this day, if a tract of forest is enclosed, and cattle of every kind excluded, they spring up spontaneously and thickly over the land, Some of the finest wine grapes of the United States, the Scuppernong, the Isabella, the Catawba and the Lincoln, are native to this State. But it was long before the bounty of nature in this regard was improved. This was probably due to the fact that the State was settled almost wholly by emigrants from the British Isles, who knew nothing of the culture of the vine. It was planted here and there to yield grapes for table use; but it was not until within thirty years that a vineyard was known in the State. Within that period several of large and a great number of small extent have been planted. Grapes in season are abundantly supplied for domestic consumption, and shipped in hundreds of tons. The wines of the established vineyards are held in high and just repute. In a broad commercial sense, the possibilities of the Scuppernong, as a wine grape, is yet to be developed: North Carolina should supply the bulk of the wine used in this country., 1073169=        Within the last few years Roaring Gap, Alleghany county, has attained the importance of a resort. A large and well arranged hotel has been built on a site commanding charming views and vistas. It is on the Blue Ridge at an elevation of 2914 feet, and is reached over the Northwestern and North Carolina railroad, a branch of the Southern, 967907=        Peace Institute has had only two principals. It began its career under Rev. Robert Burwell, D. D., in 1872, and is the continuation of a school conducted by him commencing in 1837. The present principal, James Dinwiddie, A. M., took charge in 1890. The institute does not aim at large numbers, but at thorough scholarship and a high standard of attainments of character., 944480=        The State Normal and Industrial School for women, located at Greensboro, was established by act of the General Assembly of 1891, and began its work in October, 1892. It is supported mainly by the State, but receives liberal aid from the Peabody Fund, and has considerable revenue from tuition fees., 840591=        Perhaps the largest body of native Europeans coming approximately at one time, and constituting a distinctive foreign element, was the Scotch or Highland colony, which occupied the country along the upper waters of the Cape Fear, now know as the counties of Bladen, Cumberland, Moore, Robeson, Richmond and Harnett. These came, some voluntarily, most of them by compulsion, after the disastrous defeat of Culloden, in 1746. They have also blended with the other European families, but still retain in marked degree their national characteristics of piety, morality, and care of education., 72766=thus was Roanoke known long before the beach of Jamestown was settled or the rock of Plymouth consecrated. She is the classic land of all English America, and will live in the future story of our Republic as the mother-earth of American liberty. The illustrious names of Raleigh, of Cavendish, of Grenville and of Drake--the heroes of the reign of Elizabeth--are a part and portion of her history. Hariot, the mathematician and philosopher of the age, for the space of a whole year studied its natural resources and Indian History; and nearly two hundred and fifty years since gave to the world a book unequalled for the accuracy and the interest of its details. It would seem, indeed, as if the chivalry and learning of that age had contributed this splendid representation, to give a dazzling brilliancy to the early history of that State on whose shores the flag of England was first unfurled, and in whose valleys, and over whose hills, the mountain Goddess Liberty first shouted the cry of American independence. Bear witness, Mecklenburg, on the 20th of May, 1775., 1073702=        This whole region is easily accessible--Pullman cars leave New York at 4:30 P. M., and Cincinnati at 8 P. M., arriving at most any of these resorts next afternoon., 531629=        North Carolina has never been among the foremost of the cotton growing States, for although nearly all of the ninety-six counties of the State make report of the crop in the census tables, as a matter of fact, more than one-half the cotton producing area is confined to twenty-eight counties. Nor have the farmers of this cotton section been so dependent on the planting of cotton, that they might not readily increase or diminish production by adoption of other crops to correspond with ruling prices in the markets of the world; hence, as should be expected, the statistics, such as were made from 1801 to 1840, when crop returns were first enumerated in the census reports, and the census reports from 1840 to 1890, all show that the cotton production of the State has been marked by greater fluctuations than that of any other State. The following table indicates the variableness of production, and gives the total products at different periods in the State's history:, 147821=        One advantage must not pass unnoticed, namely that the rainfall is uniformly distributed throughout the year, and that during those months when growing crops require the most moisture, the amount is greatest. The largest amounts occur in July and August, when the averages for the State are respectively 5.44 and 6.09 inches; the least amounts occur in October and November (3.66 and 3.40 inches) during which the weather is especially favorable for the final work of the farmer, before the much needed rest of winter begins., 915367=        Rev. J. B. Boon, Superintendent. Opened November 11th, 1885, at Thomasville, has three hundred and six acres of land, and twenty buildings provides for one hundred and fifty to two hundred orphans, supported chiefly by the Baptist Church., 553093=        For other products not given by the Department of Agriculture for the year 1895, reference must be had again to the census report of 1890. This gives:, 266051=        The total amount of the precious metals produced by the mines of North Carolina up to the end of 1894 is estimated at approximately $24,000,000.00. The production for the past ten years is ascertained to be $1,295,676. By far the greater proportion of this is gold, the amount of silver being insignificant., 576069=        As intimated, the peach thrives in the Sand Hill region as well as the grape, and the development of the culture of this fruit has of late outstripped even the grape there. The most notable orchard there is that owned by the J. Van Lindley Company, near Southern Pines. This Company has now in bearing over three hundred and fifty acres in peaches, and has extended its planting the present spring (1896), to the extent of about one hundred acres more. The intention is to make the orchard finally cover one thousand acres. The crop from this orchard, in 1895, was the first crop from the trees, and is said to have paid twenty per cent. on the investment on the whole tract of over one thousand acres. The same Company has planted about ten thousand pear trees, which are in a flourishing condition, but not as yet in a bearing state. The success of this large peach orchard has greatly stimulated the planting of trees in the Sand Hill country, and the available land in the immediate vicinity of the railroads, is rapidly being taken up and advancing in price., 518352=abandoned a profitable lumber business for the purpose of engaging in oyster growing, and who has, I understand, the intention of making as his original outlay a sum about equal to the total value, prior to 1886, of the whole oyster industry of the State., 40219=        This is the fifth publication of its kind emanating from the Board; the first appearing in 1879, which was followed by an improved edition in 1883; this was exhausted by distribution at the Boston and New Orleans expositions, so that in 1886 a new and still better book was issued and did good service until the approach of the great Columbian Exposition, when it was determined to offer a more exhaustive treatment of the conditions presented in North Carolina for the profitable investment of capital. This volume was a departure from the ordinary Hand Book type, and proved a most acceptable résumé of the varied conditions so happily distributed in the State by the munificent hand of nature. So useful a volume was soon brought to the attention of the public, and so persistent was the demand that the edition of ten thousand had dwindled to as many hundred, when the Board took the action referred to above., 930391=        The common school system, as it was designated, was adopted in 1839, and continued in force until superceded by the results of the war. Under that system in 1850 the number of schools was 2,657; of teachers, 2,730; of pupils, 104,095. The income being in that year $158,564, increased in 1860 to $268,719., 82300=        [The skirmish at Lexington on April 19, 1775, although insignificant in itself, fired the American heart; the news of the encounter reached Charlotte, in Mecklenburg county, on the 19th of May following, and on the next day, May 20, the patriots of Mecklenburg met in convention and declared the independence of the colonies. The cause of Massachusetts and of New England was theirs also, and a blow struck there in furtherance of British aggression must ultimately be repeated in North Carolina; hence this bold and patriotic action.], 947858=        The College was opened in March, 1837, with 66 students. A charter was granted by the Legislature in 1838. The manual labor system was at first adopted, but as at Wake Forest, it proved a failure and was abandoned. In 1855, Maxwell Chambers, Esq., of Salisbury, made the munificent bequest of $258,000 to the College, and this relieved it of all existing financial trouble and assured its future freedom from embarrassment. The terms of the charter limited the endownment to $200,000, and only that amount could be realized from the bequest. About $100,000 of this endownment was lost by reason of the war. In addition to the proceeds arising from the interest of this endownment, the College has endowed scholarships, such as the Maxwell Chambers scholarship of $3,000, endowed by the Presbyterian Church of Salisbury; the D. A. Davis scholarship of $1,500, endowed by the same church; the George Bower scholarship of $1,000, endowed by Mrs. A. C. Davis, of Salisbury, and the Thomas Brown scholarship of $1,000, endowed by Brown Bros., of Winston, and one of $500, endowed by Gen. Rufus Barringer and Mr. George E. Wilson, of Charlotte, one of $1,500, the Kate Williams scholarship, endowed by G. W. Williams, Esq., of Wilmington; one of $1,000, J. S. Carr, Esq., Durham; one of $1,000, by S. H. Wiley, Esq., Salisbury; the Oates scholarship of $500, by R. M. Oates and Oates Bros., Charlotte; the P. T. Penick scholarship of $500, by the Presbyterian Church at Mooresville, and the Willie J. Brown scholarship of $500, endowed by Col. Jno. E. Brown of Charlotte., 969258=        St. Mary's is a college for girls and young ladies at Raleigh. The grounds are very ample; a great park indeed, which is much admired for its natural beauty. They were applied to their present uses in May, 1842, when Rev. Dr. Albert Smedes founded the present St. Mary's School, under the auspices of the Episcopal Church in North Carolina. The exercises have been maintained continuously ever since, the son of the founder, the Rev. Dr. Bennett Smedes succeeding to the control on the death of his father. The patronage is}",
    "textBeforeTable": "                 The following table taken from the census books shows that there was no backward step: cities. The handling of her products enriched the merchants of Charleston, Norfolk, Richmond, Baltimore and New York. Then the opening for purchase at government rates of immense areas of fertile lands in the West and Southwest carried off many of her citizens with all their substance to build up Indiana, Tennessee, Georgia, Alabama, Mississippi and other States. Page 14         After the Revolution the State steadily increased in population and wealth, albeit hindered by two causes. In the first place, as she then had no good accessible harbors within her limits, she was denied the striking evidences of prosperity which attend the building of great AFTER THE REVOLUTION.         By the patriotism of Ex-Judge David Schenck, the battlefield of Guilford Court House has been purchased, and converted into a beautiful park, with appropriate monuments to the gallant heroes of the action.         In the winter of 1775-76, North Carolina troops under Howe helped drive Lord Dunmore from Virginia. In February, 1776, the Tory Highlanders were crushed at Moore's Creek bridge. On April 25, 1776, North Carolina, first of all the colonies, empowered her delegates to the Continental Congress to vote for independence. In the next month her troops assisted to repel the British fleet at Charleston. In the same Summer her militia under Rutherford, marching over trackless mountains, effectively humbled the hostile Cherokees. Her troops fought gallantly under",
    "textAfterTable": "1860 . . . . . 992,622 1870 . . . . . 1,071,361 1880 . . . . . 1,399,750 1890 . . . . . 1,617,947         This population is of a singularly homogeneous character. The immigrants in early days, Virginians (mainly English), Pennsylvanians (mainly Scotch-Irish and German), Scotch-Irish, Scotch Highlanders and Lowlanders, Swiss, French, Huguenots, Germans from the Rhine and elsewhere, have fused by inter-marriages or business or social communication into a homogeneous people of steady, orderly and friendly habits. The relations between masters and slaves were singularly free from cruelty on the one side and insolent spirit of rebellion on the other. And after emancipation there was little friction in the adjustment of the new relation of employer and employee. PROPRIETARY AND ROYAL GOVERNMENT.         The attempts of Sir Walter Raleigh having signally failed, no further attempts at colonization were made for three-quarters of a century. In 1629, a charter was granted by Charles I. of England to Sir Robert Heath of the Southern part of Virginia, Latitudes 31° to 36°, under the name, in honor of that king, of Carolina. As Heath did nothing under it, a renewal was granted in 1663 to eight Lords Proprietors, and an enlargement to 36° 30′ and 29°, two years afterwards. The first permanent settlement in the limits of North",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}