{
    "relation": [
        [
            "Fiscal Year",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "Total"
        ],
        [
            "Amounts per PMO",
            "$ 948",
            "$ 1,891",
            "$ 3,729",
            "$ 3,698",
            "$ 4,843",
            "$ 742",
            "$ 15,851"
        ],
        [
            "Amounts per eCPIC",
            "-",
            "-",
            "$ 5,730",
            "$ 5,634",
            "$ 3,576",
            "$ 5,634",
            "$ 20,574"
        ],
        [
            "Difference",
            "$ 948",
            "$ 1,891",
            "$ 2,001",
            "$ 1,936",
            "$ 1,267",
            "$ 4,892",
            "$ 4,723"
        ]
    ],
    "pageTitle": "OIG Audit Report 07-37",
    "title": "",
    "url": "https://oig.justice.gov/reports/plus/a0737/findings.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886597595,
    "recordOffset": 886570641,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Audit Report 07-37 June 2007 Office of the Inspector General}",
    "TableContextTimeStampAfterTable": "{58781=DEA officials also provided us with copies of the PMO electronic spreadsheets they used to track Concorde’s contracts and related invoices since FY 2000. The following table presents Concorde’s contract-related expenditures between FYs 2000 through 2005., 56912=The DEA’s response to our request for Concorde cost information showed that the program began in 2000, with related costs through FY 2005 totaling $19.8 million. The DEA also reported government FTE costs amounting to $3.7 million, with five contractors individually paid at least $1.3 million over this same period. The following table presents a selection of the cost data DEA initially provided., 74598=We requested the amounts paid to BAE Systems, the single largest contractor that provides full life cycle support services for JCON, so we could verify these costs from a source independent of the PMO. Using the BAE’s tax identification number, we requested a listing of all payments made to the contractor from the JMD Finance staff. From a listing of payments made containing over 1,400 transactions totaling more than $149 million, we identified 504 payments related to JCON between FYs 2002 and 2005 totaling $49,537,777. The difference between the value we calculated and the value reported by JCON is $89,135, or less than 1 percent of the reported costs., 79270=In summary, by using financial system and budget data we were able to verify the costs the JCON Project Management Office reported to us. However, the Project Management Office said the costs only represent the current standard architecture. Although JMD views the various versions of JCON as separate systems, we believe the true cost of JCON should include all costs incurred since 1996 when the JCON project was initiated. Therefore, we conclude that JCON’s costs since 1996 should be at least $53 million more than the $193.6 million we verified. In addition, because complete cost data was not available for JCON prior to FY 2002, we were unable to determine what amounts, if any, were paid in connection with the 1996 $500 million contract., 87527=The FBI included a comment in the response to the Senate Subcommittee indicating that LEO is not an ongoing project, and FY 2006 development, modernization, and enhancement DME funds were used for tactical enhancements only. We discussed this issue further with LEO and other FBI officials. They told us their initial response was made in error, and said they subsequently amended the response to be consistent with the information provided to us., 60985=DEA finance staff provided us with an FFS report that captured all activity associated with the Concorde fund code in FYs 2005 and 2006. To the extent possible, we tested the completeness of the Concorde PMO spreadsheets by using this FFS report. Although the report tracks the use of Concorde funding allotment within the DEA budget, it does not necessarily capture all costs related to Concorde. From the PMO spreadsheets, we identified costs related to Concorde that were funded from DEA sources other than the Concorde budget allotment. DEA officials told us these other sources funded Concorde as well a number of other projects., 53101=In addition to our analysis using the Bureau Personnel Management System, we asked the LEO Director at LSU to provide the number of FBI employees working on LEO. She estimated that during FY 2005, approximately 30 FBI employees worked full time on LEO-related tasks., 59045=Concorde Contract Invoices FYs 2000 - 2005, 71254=In summary, the Concorde costs we reviewed did not include all program costs since inception. We identified approximately $700,000 in software–related expenditures missing from project cost sheets, and another $770,000 of expenditures from the first 2 years of program that were not reported. In addition, Concorde’s actual reported FTE costs are estimated at the beginning of each year. In our view, the true costs of Concorde should include all costs incurred since 1997 when Concorde began., 45181=We next obtained a listing from FMS of all payments made to LSU since October 1999.31 This listing contained 387 payments totaling $45,813,271. With the help of the CJIS Financial Management Unit staff, we attempted to reconcile the payments from FMS with the requisitions contained in the LEO spreadsheets. The reconciliation proved to be difficult because the CJIS spreadsheets track requisitions and FMS data is based on payments. Because one requisition may result in a number of payments, we did not independently research each of the hundreds of payments., 39707=LEO Reported Costs for FYs 1995-2005 ($ in millions), 39221=We met with CJIS Financial Management Unit officials to discuss the source of the amounts reported in our questionnaire and their methods for tracking actual costs. These officials told us the $115 million in costs through FY 2005 comprised personnel and non-personnel costs, but no indirect costs. In addition, non-personnel costs included costs associated with a cooperative agreement with LSU. The following table presents the breakdown of actual LEO costs through FY 2005., 91273=The DOJ’s FY 2006 enacted budget is approximately $22 billion., 60604=Although we previously determined that the DEA’s financial system, the FFS, is not organized in such a way to easily and reliably identify all the costs associated with any particular IT system, DEA finance staff told us a unique code to track funding for Concorde was created in FY 2005. Prior to 2005, Concorde did not have a defined allocation within the DEA’s budget., 52472=Although the current combined salary amount in the Bureau Personnel Management System for the three cost codes is 8 percent higher than the reported LEO amount in FY 2005, we do not believe this, by itself, indicates reported costs are understated. Instead, the relatively small difference may be attributable to the following causes:, 21024=Since FY 2001, Congress has authorized more than $12 billion for DOJ IT equipment, software, and services – an average of more than $2 billion annually.21 DOJ spending authority represents approximately 4 percent of the $64 billion authorized on IT across the federal government in FY 2007 and 11 percent of DOJ’s annual budget.22 These funds are used to acquire new computers and other assets as well as to cover expenses associated with operating and maintaining legacy IT systems. Funding for new acquisitions and improvements to existing IT is referred to as Development, Modernization, and Enhancement (DME) costs, while operating expenses are known as “steady state” costs. In FY 2005, DOJ spending authority related to steady state activities amounting to nearly $1.5 billion – more than double the $702 million allocated to DME expenditures., 80344=In testing the completeness of reported costs for selected IT systems, we found that the control of IT spending and budgets by component CIOs varies. The FBI CIO’s control over IT spending has increased over the last few years. In 2004, the FBI reported in its first IT Strategic Plan that its CPIC process and IT spending were not centrally managed. However, the budget for the CIO now includes nearly 50 percent of the FBI’s IT spending, and the CIO also has approval authority for IT spending not within the CIO’s budget. This change since 2004 indicates more centralized management of the FBI’s IT budget within the CIO’s office., 57320=Concorde Reported Costs FYs 2000-2005 ($ in millions), 513=The OIG identified 38 major DOJ IT systems and collected cost and other information on these systems from DOJ components. DOJ components reported $5.7 billion in incurred costs for these systems through FY 2005 and estimated total costs of $15 billion through FY 2012. We determined that DOJ has fragmented and inconsistent systems and methodologies for reporting IT system costs and lacks the controls necessary to ensure accuracy and completeness. Also, DOJ’s financial systems are not designed to provide cost data on an individual IT-system basis and were therefore not useful as a source of cost data., 58321=We met with DEA officials to review their cost-tracking methods and supporting documentation, and analyzed the cost information provided. After we requested that DEA ensure the cost data extended back to the beginning of the Concorde project, DEA officials provided information noting that the program was conceived in 1997 with the name “UMBRELLA.” DEA officials told us the goals of UMBRELLA were the same as Concorde and only the name had changed., 92542=The Office of Federal Financial Management’s Core Financial System Requirements issued in January 2006 requires the following seven functions: financial system management, general ledger management, funds management, payment management, receivable management, cost management, and reporting., 39043=Although the LEO response did not indicate a start date, FBI and LSU documents indicated the system was created in 1995 and transferred from a FBI unit to CJIS in 1997., 91176=DOJ IT spending authority for FY 2006 is an enacted amount., 67762=Because the Concorde program began in 1997 and the earliest cost data we reviewed was for FY 2000, we asked DEA officials to provide any additional spreadsheets or cost data they could identify with this data. Officials provided us with past IT spending plans for FYs 1998 and 1999 showing Concorde total obligated costs of $770,000.36, 75269=We met with JCON PMO staff to discuss the potential for using financial system and budget execution data to verify the remaining reported costs through FY 2005. We previously determined the various DOJ financial systems would not be able to identify the costs associated with all of the IT systems in the inventory. We discussed financial issues further with the JCON PMO and learned it would be possible in this case to create a report from the financial system that could identify planning and acquisition-related costs for JCON. The JCON PMO then prepared a JMD financial system (FMIS) report that matched the $193.567 million it reported on our questionnaire. JCON officials told us this amount included the government FTE costs incurred over the period., 68364=Concorde PMO and eCPIC Cost Data Excluding Government Personnel Costs FYs 2000 – 2005 ($ in thousands), 66935=The DEA did not have this type of information available for any years prior to FY 2003. However, we used the average annual FTE costs from the table above to estimate the FTE costs from FYs 2000 through 2005. The total FTE costs we estimated – $3,584,165 – is only 3 percent less than the FTE costs of $3,703,000 the DEA reported., 42281=To test the completeness of the reported LEO costs, we compared the values in the CJIS electronic spreadsheets to a number of sources. First, we tested the completeness of the LEO requisitions in the CJIS spreadsheets with the LEO requisitions in the BEARS database. Because BEARS was not in use until 2002, we did not expect the LEO requisitions in BEARS to contain all of the CJIS requisitions contained in the LEO spreadsheets. We did expect that all of the LEO requisitions coded in BEARS to be present in the CJIS electronic spreadsheets. Our review of the 86 LEO requisitions in BEARS showed, however, that 10 requisitions were not included in the CJIS spreadsheets. The invoiced amounts associated with these 10 requisitions were less than 1 percent of the total invoiced amount in BEARS of $41 million. The following table shows the requisitions related to LEO in BEARS., 93234=FMS data prior to FY 2000 has been archived and retrieving this data took more time than our analysis permitted., 51854=For FY 2005, the FBI salaries related to LEO amounted to $2,323,795. To this amount the CJIS Financial Management Unit applied the fringe benefit rate of 32.8 percent prescribed by OMB, and the resulting total amount of LEO FTE costs for FY 2005 was reported as $3,086,000., 92880=Established in 1992, CJIS serves as the focal point and central repository of criminal justice information services at the FBI., 2917=After an initial survey that included interviewing Department and component IT and finance staff, we determined no component-level or DOJ-wide systems collect data on individual IT system costs. To obtain the best available data on the 38 major IT systems in the inventory, we asked the managers of each system to provide us with detailed cost and other information on the systems they manage. System managers reported $5.7 billion in system costs through FY 2005 and an additional $9.3 billion estimated through FY 2012, for a total of $15 billion., 52925=Staffing changes since FY 2005 would result in changes in salaries; or, 78131=We researched government and industry sources for more information on JCON and JCON contracts. This search identified a $500 million JCON contract awarded in 1996, more than 5 years before the first costs reported in our questionnaire. Although the JCON PMO response made clear that the reported costs related to JCON IIA, we consider the JCON initiative to have begun in 1996 when the decision was made to replace a collection of separate office automation systems with a consolidated DOJ platform., 76037=From our discussions with the JCON PMO, we also learned that in FYs 2004 and 2005, JCON planning and acquisition costs were funded entirely from the Legal Activities Office Automation appropriation. Because JCON planning and acquisition in the CPIC process was essentially the same as the Legal Activities Office Automation appropriation in the budget process, we compared the costs from these two processes. First, we matched the FY 2005 Exhibit 53 amount for JCON of $39.967 million with the $40 million reported for the Legal Activities Office Automation appropriation. Both these amounts reflect the budget authority. We then compared the amount of outlays for planning and acquisition in the Exhibit 300 with the same amount reported for the Legal Activities Office Automation appropriation in FY 2005. The Exhibit 300 reported about $49 million in outlays for FY 2005, while the President’s Budget included outlays of $43 million for the same period – a difference of over $6 million., 74143=Costs related to a single contractor account for $49,626,912 of the $193.6 million in costs incurred through FY 2005., 3476=The IT systems managers completed an OIG-developed questionnaire, distributed through the DOJ CIO, that requested costs and timeframes associated with each phase of the project’s system development life cycle, total costs incurred through FY 2005, funding amounts and funding sources necessary to complete the system, contractor information, a brief description of the methods used to determine reported costs, and other information required to respond to the congressional request., 61629=The following table presents the amounts in FFS related to Concorde funding for operations and equipment during FYs 2005 and 2006., 65220=Concorde FTE Cost Data FYs 2003 - 2005, 41663=Not all of the LEO-related expenditures reported were incurred by CJIS, since LEO was under different management until 1997. Since that time, other FBI divisions have participated with funding and managing LEO activities., 77656=In addition to the comparison of FY 2005 CPIC and budget data, we compared the $246 million total amount reported in the JCON Exhibit 300 for planning and acquisition to the $193.6 million total amount reported in the OIG questionnaire. JCON officials told us total costs in the Exhibit 300 costs were $53 million more than total costs reported to the OIG because the Exhibit 300 included expenditures from FY 2000 and 2001 and were not considered part of JCON IIA., 74499=Forecasts of funding requirements past FY 2009 have not yet been developed., 79057=Although JCON has not yet developed cost estimates for FYs 2010 through 2012, the JIST Budget Officer told us that funding in these years is expected to equal at least the FY 2009 level of $89.5 million., 77037=We asked JCON officials about this discrepancy, and were told the $49 million included in the Exhibit 300 represented appropriations instead of outlays. We confirmed that the President’s Budget reported $49 million for obligations in FY 2005 and asked JCON officials why outlays were not provided as required by OMB Circular A-11. JCON officials explained that they began reporting obligations because it was difficult to retrieve data on outlays from the previous version of the FMIS. To be consistent and avoid reporting the same cost twice, the JCON PMO continued reporting obligations rather than outlays., 40997=LEO’s direct, non-personnel requisitions are tracked in the CJIS Budgetary and Evaluation and Reporting System (BEARS) database.30 However, the CJIS Financial Management Unit does not use BEARS to report LEO’s costs for CPIC purposes. Instead, officials use electronic spreadsheets primarily for budget monitoring. CJIS Financial Management Unit officials provided us with copies of these electronic spreadsheets and demonstrated how they sorted the data to calculate the direct, non-personnel amount included on our questionnaire. This amount, $85 million, comprises 74 percent of the total LEO costs reported through FY 2005., 87984=Although the amounts reported by the DEA for Concorde appeared consistent, the DEA indicated to the Senate Subcommittee that Concorde began in 1998, while we were initially provided cost data only as far back as 2000. Subsequently, the DEA confirmed a 1997 start date and provided us with the cost data for the years omitted from their initial response to us., 25720=A report known as the IT Investment Portfolio or Exhibit 53, required by the Clinger-Cohen Act and the Paperwork Reduction Act of 1995, is designed to help OMB and other federal agencies provide a full and accurate accounting of an agency’s IT investments. The Exhibit 53 is a product of the IT CPIC and ITIM processes. As the name suggests, the CPIC process should enable an agency to plan, acquire, and manage its IT acquisitions. During the CPIC process, the agency CIO is responsible for collecting and managing the data necessary for the preparation of the IT Investment Portfolio., 94348=The FY 1998 IT spending plan includes FY 1997 obligations for Concorde. The total obligated costs of $770,000 reflects FYs 1997 through 1999., 78640=The JCON PMO confirmed that the first attempt at replacing the existing office automation systems, known as JCON I, began in 1996 and was terminated in 1998 when it did not work. JCON II followed and evolved into JCON IIA by FY 2002. Because the earlier JCON efforts predate the current JCON Project Manager and other staff, they were not able to provide us with the complete costs of JCON prior to FY 2002., 64442=We next evaluated the government FTE costs of $3.7 million reported by DEA in our questionnaire. This amount reflects all DEA personnel costs since FY 2000 and translates to approximately five FTEs per year. DEA officials provided us with a spreadsheet used to estimate Concorde FTE costs. This spreadsheet included estimates for FYs 2003 through 2020. Total estimates are calculated by identifying the number of FTEs in each of eight job categories and multiplying this number by the amounts for salaries and benefits related to each category. In addition to salary and benefits, the FTE spreadsheets include estimated amounts for other DEA employee expenses, such as training and travel. The following table presents the Concorde FTE cost data from FYs 2003 to 2005., 46835=Comparison of LSU and CJIS Cost Data Related to Contracted Activities FYs 1995 through 2005, 53568=LEO PMO and eCPIC Cost Data FYs 1995 - 2005 ($ in millions)}",
    "textBeforeTable": "The DEA did not have this type of information available for any years prior to FY 2003. However, we used the average annual FTE costs from the table above to estimate the FTE costs from FYs 2000 through 2005. The total FTE costs we estimated – $3,584,165 – is only 3 percent less than the FTE costs of $3,703,000 the DEA reported. Although this analysis suggests that the FTE costs reported by the DEA for Concorde are supportable, these amounts are not based on actual results. DEA officials told us they have no procedures for tracking the time employees spend working on any particular project and the FTE costs are essentially estimates. In addition, the DEA does not have a time utilization tracking system that would identify the actual time spent on Concorde-related activities for all job categories. Because the Concorde program began in 1997 and the earliest cost data we reviewed was for FY 2000, we asked DEA officials to provide any additional spreadsheets or cost data they could identify with this data. Officials provided us with past IT spending plans for FYs 1998 and 1999 showing Concorde total obligated costs of $770,000.36 Finally, we obtained from DOJ’s OCIO the reported amounts for Concorde contained in OMB’s eCPIC database. The following table compares these amounts with the amounts contained in the PMO spreadsheets already discussed. Concorde PMO and eCPIC Cost Data Excluding Government Personnel Costs",
    "textAfterTable": "Source: DEA and DOJ officials We asked DEA officials to explain the significant differences between these two amounts’ sources. Although the eCPIC data appears to represent prior years actual outlays, the DEA official responsible for entering IT system data into eCPIC told us this is not the case. He explained that budget estimate amounts from the start of the year are often used to report the outlays at the end of the year. The DEA does not routinely report actual amounts for prior year outlays because they view eCPIC as a planning tool, where the emphasis is placed on estimated future amounts, not costs previously incurred. In summary, the Concorde costs we reviewed did not include all program costs since inception. We identified approximately $700,000 in software–related expenditures missing from project cost sheets, and another $770,000 of expenditures from the first 2 years of program that were not reported. In addition, Concorde’s actual reported FTE costs are estimated at the beginning of each year. In our view, the true costs of Concorde should include all costs incurred since 1997 when Concorde began. JMD Justice Consolidated Office Network JMD’s Justice Consolidated Office Network (JCON) is the common office automation platform that over 70,000 employees from 16 DOJ components use daily. JCON provides the IT tools and services that allow these employees to perform their",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}