{
    "relation": [
        [
            "Bobby Deren scarletnation.com",
            "With starting tailback Paul James returning to the lineup and quarterback Gary Nova coming off his best game of the season, Rutgers is improving on offense. But the bottom line is that Rutgers has averaged just 15.6 points per game over the last three contests. Cincinnati, on the other hand, is averaging 34.3 points in its last three games. I am going with the hotter offense in this one and that's Cincinnati",
            "Cincinnati is sixth in the nation against the rush and Rutgers is 119th in passing yards allowed. The Scarlet Knights have also encountered problems stopping spread offenses all season long. It is a young defense that has also been hurt by injuries. The easy edge here goes to the Bearcats.",
            "Gary Nova. With so many defensive question marks abound, a heavy responsibility may fall on the shoulders of Nova. How he fares could be very instrumental in the outcome. If the Cincinnati offense can put some points on the board, it will be up to Nova to match the Bearcats in a shootout. Nova has proven capable in the past but has also fallen short, especially against teams with winning records. The Nova factor will come into play in a big way.",
            "Dave Cohen. Rutgers has failed to scheme up anything that will slow down the spread offense this season and has given up 49 points or more on three separate occasions. Defensive coordinator Dave Cohen will need to dial up a good game if RU is to have a chance defending Cincy's spread attack. Putting players in the right positions will help out this young defense which has struggled consistently throughout the season.",
            "I will give this one to Rutgers. Its return game has been very good with true freshman Janarion Grant manning those duties. Nick Marsh has been solid as a punter and the punt block game remains among the best in the country. The only drawback on special teams has been the inconsistent play of kicker Kyle Federico. Still, Rutgers has more than enough weapons to outweigh the poor special teams play of Cincinnati. An easy edge here goes to Rutgers.",
            "Rutgers used a last-minute drive to win its last game and Nova has shown the ability to do it in the past. Cincy might not have too much trouble moving down the field late in the game against a Rutgers defense that has fizzled out in the fourth quarter against spread teams this season. Both teams are quite capable, so I will call this one a draw.",
            "Rutgers barely escaped with a win against a very bad Temple team two weeks ago, although Cincy's six FBS wins came against teams with a combined total of seven wins. Rutgers will be the best team the Bearcats has faced to date as the Bearcats have been underwhelming at 7-2. Both teams have their share of deficiencies and the winner will be the team that makes one less mistake. I'll say the Bearcats botch one more play than the Scarlet Knights. Rutgers 31 Cincinnati 30."
        ],
        [
            "",
            "Which team has the more potent offense?",
            "Which team has the better defense?",
            "Who is the offensive X-factor and why?",
            "Who is the defensive 'X Factor,' and why?",
            "Who has the edge on special teams?",
            "If the game comes down to a final drive, which team drives the length of the field?",
            "Which team will win?"
        ],
        [
            "Mark Givler bearcatreport.com",
            "This one is definitely close, but I'd give Cincinnati a slight edge. The Bearcats rank just a bit higher in total passing, total rushing, and points per game but Rutgers certainly has a capable offense itself. Much of Cincinnati's offense is 'by committee' whether at running back or wide receiver, making it tougher to just key on one or two guys.",
            "I would give Cincinnati the edge here. Though the defense hasn't produced a ton of turnovers lately, it has been the stronger unit for Cincinnati for most of the season and comes into this game ranked 14th in the nation in points per game allowed.",
            "Senior quarterback Brendon Kay, without question. After taking over for the injured Munchie Legaux, Kay had an up and down start to his season which saw the Bearcats drop a game they probably shouldn't have to South Florida and barely squeak by a bad Miami (Ohio) team. Since that time, Kay has improved in just about every facet of playing the quarterback position and now leads the nation in completion percentage.",
            "It's tough to pick just one guy on defense has the unit has just been overall solid and it's been a different guy each week stepping up, but linebacker Nick Temple is probably the answer here. He is second on the team in tackles but he makes more big plays than anybody on defense with a team high 8.5 tackles-for-loss to go along with four sacks and an interception. He simply has a knack for making the big play.",
            "That would be Rutgers and it's not particularly close. Cincinnati kicker Tony Miliano has struggled, going just 3-for-8 on field goals and also missing two extra points. Meanwhile, Rutgers has returned three kicks for scores while Cincinnati has yet to register a return touchdown. Punter John Lloyd has been solid for the Bearcats but this is a clear edge for the Scarlet Knights and the difference between the two units has to be concerning for Tuberville and his staff.",
            "Given the way Brendon Kay has played lately and the depth that UC has at wide receiver, I would have to go with the Bearcats. But I think both teams have the offensive firepower to make that late touchdown drive if it is needed.",
            "It is hard to ignore the road woes that have plagued Cincinnati this year. Both losses are on the road and there has certainly been an ugly win or two on the road as well. This will likely be a tougher road environment than what they have seen before outside of maybe Illinois, but things seem to have clicked a bit recently and I am going to go with Cincinnati in a nail biter. Cincinnati 34 Rutgers 31."
        ]
    ],
    "pageTitle": "ScarletNation.com - Rutgers vs Cincinnati: Who has the edge?",
    "title": "",
    "url": "https://rutgers.rivals.com/content.asp?CID=1575835&PT=4&PR=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888488543,
    "recordOffset": 888470841,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1946=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 ScarletNation.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41654=November 16, 2013}",
    "textBeforeTable": "Rutgers welcomes Cincinnati to High Point Solutions Stadium today in a game that should give fans a good idea where both teams stand as the season heads into its final weeks. Which team has the edge? We asked our resident experts! November 16, 2013 Rutgers vs Cincinnati: Who has the edge? Bobby Deren and Mark Givler Special to ScarletNation.com Scarlet Knight Shop Freelance Opportunities Rutgers on Ebay For Recruits",
    "textAfterTable": "Talk about it in The Round Table FEATURED PRODUCT Nike Rutgers Scarlet Knights Scarlet Practice Performance Hoodie Rutgers NEWS [More] Latest Headlines:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}