{
    "relation": [
        [
            "Citing Patent",
            "US6495151 *",
            "US6683041 *",
            "US6733773",
            "US6846480",
            "US6878380",
            "US6919089",
            "US6955817 *",
            "US6981291",
            "US6986932 *",
            "US7115551 *",
            "US7122238",
            "US7179772",
            "US7191486",
            "US7195771 *",
            "US7208217",
            "US7235250",
            "US7309182",
            "US7331090",
            "US7332224",
            "US7364380",
            "US7377001",
            "US7381667",
            "US7704558",
            "US7721381",
            "US7767303",
            "US8147853",
            "US8257818",
            "US8263058",
            "US8272511",
            "US8475817",
            "US8987180",
            "US20020131943 *",
            "US20040076660 *",
            "US20040180018 *",
            "US20040255440 *",
            "US20040265243 *",
            "US20050031847 *",
            "US20150017215 *",
            "DE10219638A1 *",
            "DE10219638B4 *",
            "DE10301838A1 *",
            "DE10301839A1 *",
            "DE10301841A1 *",
            "EP1275370A1 *",
            "EP1275371A1 *",
            "EP1790326A1 *",
            "WO2003005982A1 *",
            "WO2003005983A1 *",
            "WO2003022230A1 *",
            "WO2003092635A1",
            "WO2004004679A1 *",
            "WO2004058214A1",
            "WO2004059062A1 *",
            "WO2004062702A1",
            "WO2006124043A2 *",
            "WO2009103651A2",
            "WO2012009593A1",
            "WO2012141946A1"
        ],
        [
            "Filing date",
            "Jun 18, 2001",
            "Jan 25, 1999",
            "Nov 21, 2000",
            "Nov 13, 2002",
            "Sep 10, 2001",
            "Jun 10, 2002",
            "Sep 6, 2002",
            "Jan 12, 2004",
            "Jul 10, 2002",
            "Jun 3, 2003",
            "Oct 5, 2004",
            "Sep 9, 2004",
            "Aug 12, 2003",
            "Nov 21, 2000",
            "Jul 13, 2004",
            "Apr 4, 2003",
            "Aug 31, 2004",
            "Apr 6, 2006",
            "Dec 9, 2004",
            "May 21, 2004",
            "May 31, 2006",
            "Aug 21, 2003",
            "Jan 7, 2008",
            "Mar 19, 2007",
            "Jan 7, 2008",
            "Feb 15, 2005",
            "Sep 11, 2006",
            "Aug 20, 2007",
            "Oct 19, 2005",
            "Jul 31, 2007",
            "Dec 18, 2012",
            "May 9, 2002",
            "Apr 4, 2003",
            "Mar 10, 2003",
            "Apr 7, 2004",
            "Mar 29, 2004",
            "Jul 12, 2002",
            "Jul 17, 2014",
            "May 2, 2002",
            "May 2, 2002",
            "Jan 20, 2003",
            "Jan 20, 2003",
            "Jan 20, 2003",
            "Jul 13, 2001",
            "Jul 13, 2001",
            "Oct 26, 2006",
            "Jul 12, 2002",
            "Jul 12, 2002",
            "Aug 30, 2002",
            "Apr 30, 2003",
            "May 6, 2003",
            "Dec 16, 2003",
            "Dec 2, 2003",
            "Jan 8, 2004",
            "Jul 20, 2005",
            "Feb 12, 2009",
            "Jul 15, 2011",
            "Apr 4, 2012"
        ],
        [
            "Publication date",
            "Dec 17, 2002",
            "Jan 27, 2004",
            "May 11, 2004",
            "Jan 25, 2005",
            "Apr 12, 2005",
            "Jul 19, 2005",
            "Oct 18, 2005",
            "Jan 3, 2006",
            "Jan 17, 2006",
            "Oct 3, 2006",
            "Oct 17, 2006",
            "Feb 20, 2007",
            "Mar 20, 2007",
            "Mar 27, 2007",
            "Apr 24, 2007",
            "Jun 26, 2007",
            "Dec 18, 2007",
            "Feb 19, 2008",
            "Feb 19, 2008",
            "Apr 29, 2008",
            "May 27, 2008",
            "Jun 3, 2008",
            "Apr 27, 2010",
            "May 25, 2010",
            "Aug 3, 2010",
            "Apr 3, 2012",
            "Sep 4, 2012",
            "Sep 11, 2012",
            "Sep 25, 2012",
            "Jul 2, 2013",
            "Mar 24, 2015",
            "Sep 19, 2002",
            "Apr 22, 2004",
            "Sep 16, 2004",
            "Dec 23, 2004",
            "Dec 30, 2004",
            "Feb 10, 2005",
            "Jan 15, 2015",
            "Nov 20, 2003",
            "May 4, 2005",
            "Jul 29, 2004",
            "Jul 29, 2004",
            "Jul 29, 2004",
            "Jan 15, 2003",
            "Jan 15, 2003",
            "May 30, 2007",
            "Jan 23, 2003",
            "Jan 23, 2003",
            "Mar 20, 2003",
            "Nov 13, 2003",
            "Jan 15, 2004",
            "Jul 15, 2004",
            "Jul 15, 2004",
            "Jul 29, 2004",
            "Nov 23, 2006",
            "Aug 27, 2009",
            "Jan 19, 2012",
            "Oct 18, 2012"
        ],
        [
            "Applicant",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company",
            "Kimberly-Clark Worldwide, Inc.",
            "Regenesis, Llc",
            "Chesebrough-Pond's Usa, Division Of Conopco, Inc.",
            "Unilever Home & Personal Care Usa, A Division Of Conopco, Inc.",
            "The Procter & Gamble Company",
            "The Hartz Mountain Corporation",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company",
            "Unilever Home & Personal Care Usa, Division Of Conopco, Inc.",
            "Unilever Home & Personal Care Usa, Division Of Conopco, Inc.",
            "Butler Home Products, Llc",
            "Kimberly-Clark Worldwide, Inc.",
            "Tredegar Film Products Corporation",
            "Unilever Home & Personal Care Usa, Division Of Conopco, Inc.",
            "The Hartz Mountain Corporation",
            "Unilever Home & Personal Care Usa, Division Of Conopco",
            "Regenesis Llc",
            "The Hartz Mountain Corporation",
            "The Hartz Mountain Corporation",
            "Unilever Home & Personal Care Usa, Division Of Conopco, Inc.",
            "Regenesis, Llc",
            "Butler Home Products, Llc",
            "Regenesis, Llc",
            "The Procter & Gamble Company",
            "Polymer Group, Inc.",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company",
            "Kimberly-Clark Worldwide, Inc.",
            "Gary Grey",
            "Unilever Home & Personal Care Usa, Division Of Conopco, Inc.",
            "Scott Adrian O.",
            "Polymer Group, Inc.",
            "Beiersdorf Ag",
            "Nicholas Martens",
            "Georgia-Pacific Consumer Products Lp",
            "Beiersdorf Ag",
            "Beiersdorf Ag",
            "Beiersdorf Ag",
            "Beiersdorf Ag",
            "Beiersdorf Ag",
            "Johnson and Johnson GmbH",
            "Johnson and Johnson GmbH",
            "Johnson and Johnson Consumer Companies, Inc.",
            "Johnson & Johnson Gmbh",
            "Johnson & Johnson Gmbh",
            "Lever Hindustan Ltd",
            "Beiersdorf Ag",
            "Kimberly Clark Co",
            "Procter & Gamble",
            "Unilever Plc",
            "Johnson & Johnson Gmbh",
            "Nordico Market Dev Inc",
            "Basf Se",
            "The Procter & Gamble Company",
            "The Procter & Gamble Company"
        ],
        [
            "Title",
            "Cleansing articles for skin or hair",
            "Wet-like articles comprising a multi-phase, multi-component emulsion and an activation web",
            "Paper products treated with oil-in-water emulsions",
            "Cleaning article containing hydrophilic polymers",
            "Cosmetic effervescent cleansing pillow",
            "Pucker resistant cosmetic sachet",
            "Cleansing articles for skin or hair",
            "Motorized cleaning apparatus",
            "Multi-layer wiping device",
            "Cleansing articles for skin or hair",
            "Cleansing article for personal care",
            "Extended lathering pillow article for personal care",
            "Cleaning pad",
            "Water-soluble lotions for paper products",
            "Storage and delivery article for highly viscous fluid",
            "Personal care towelette article",
            "Liquid dispensing brush",
            "Hydroentangled textile and use in a personal cleansing implement",
            "Cleaning article containing hydrophilic polymers",
            "Grooming/cleaning apparatus",
            "Grooming/cleaning apparatus",
            "Hydroentangled textile and use in a personal cleansing implement",
            "Cleaning article containing hydrophilic polymers",
            "Cleaning pad",
            "Cleaning article containing hydrophilic polymers",
            "Personal care compositions containing hydrophobically modified non-platelet particles",
            "Apertured dusting wipe",
            "Personal care compositions that deposit hydrophilic benefit agents",
            "Packaging and disposable article disposed therein",
            "Cleansing articles for skin or hair",
            "Wet wipes including silicone reactive amino containing dimethicone copolyols",
            "Hair cap with conditioner or other hair conditioning agent",
            "Personal care towelette article",
            "Method and apparatus for hair care",
            "Three-dimensionally imaged personal wipe",
            "Cosmetic cleaning foams",
            "Products comprising a sheet and a lipid and aqueous phase",
            "Cleaning wipe for use with disinfectants, method of manufacture thereof, and system",
            "Hautreinigungstuch",
            "Hautreinigungstuch",
            "Surface-structured dry-look wipes useful for skin cleansing are impregnated with a cleansing composition comprising five surfactants",
            "Surface-structured dry-look wipes useful for skin cleansing are impregnated with a cleansing composition comprising defined amounts of sarcosinate and alkyl glucoside",
            "Cosmetic composition for impregnating cleansing wipes comprises cocoamidopropyl betaine, sodium laureth sulfate, sodium lauroyl glutamate, sodium lauroyl sarcosinate and polyethylene glycol 9 cocoglyceride",
            "Products comprising a sheet and a lipid and aqueous phase",
            "Dry products comprising a sheet and two phases",
            "Effervescent cleansing article",
            "Products comprising a sheet and a lipid and aqueous phase",
            "Dry products comprising a sheet and two phases",
            "Cosmetic effervescent cleansing pillow",
            "Skin cleansing towelette",
            "Skin cleansing products incorporating cationic compounds",
            "Cloth-like personal care articles",
            "Hydroentangled textile and use in a personal cleansing implement",
            "Products comprising a sheet and a wax dispersion",
            "Personal care and surface cleaning article",
            "Preparation of cationic nanoparticles and personal care compositions comprising said nanoparticles",
            "Wipes product",
            "Particles and particle gas saturated solution processes for making same"
        ]
    ],
    "pageTitle": "Patent US6280757 - Cleansing articles for skin or hair - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6280757?dq=5,579,517",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483553627,
    "recordOffset": 483489318,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6045=1 J/mol=0.239006 cal/mol and 1000 J=1 kJ.}",
    "TableContextTimeStampAfterTable": "{120473=Solubility parameters obey the law of mixtures such that the solubility parameter for a mixture of materials is given by the weighted arithmetic mean (i.e. the weighted average) of the solubility parameters for each component of that mixture. See, Handbook of Chemistry and Physics, 57th edition, CRC Press, p. C-726 (1976-1977), which is incorporated by reference herein in its entirety., 43880=Nonlimiting examples of synthetic materials useful in the present invention include those selected from the group consisting of acetate fibers, acrylic fibers, cellulose ester fibers, modacrylic fibers, polyamide fibers, polyester fibers, polyolefin fibers, polyvinyl alcohol fibers, rayon fibers, polyurethane foam, and mixtures thereof. Examples of some of these synthetic materials include acrylics such as acrilan, creslan, and the acrylonitrile-based fiber, orlon; cellulose ester fibers such as cellulose acetate, arnel, and acele; polyamides such as nylons (e.g., nylon 6, nylon 66, nylon 610, and the like); polyesters such as fortrel, kodel, and the polyethylene terephthalate fiber, dacron; polyolefins such as polypropylene, polyethylene; polyvinyl acetate fibers; polyurethane foams and mixtures thereof. These and other suitable fibers and the nonwoven materials prepared therefrom are generally described in Riedel, “Nonwoven Bonding Methods and Materials,” Nonwoven World (1987); The Encyclopedia Americana, vol. 11, pp. 147-153, and vol. 26, pp. 566-581 (1984); U.S. Pat. No. 4,891,227, to Thaman et al., issued Jan. 2, 1990; and U.S. Pat. No. 4,891,228 which are all incorporated by reference herein in their entirety., 32644=The present invention relates to disposable, single use personal cleansing articles especially useful for cleansing facial skin. Each such article comprises a) a water-insoluble, non-woven substrate having at least one cleansing surface; and b) from about 0.5% to 250% by weight of the substrate of a lathering surfactant which is releasably associated with the substrate. The cleansing surface of the substrate contains a plurality of apertures which range in size from about 0.5 mm to 5 mm in diameter. These apertures are located within said cleansing surface of the substrate at a frequency of from about 0.5-12 apertures per linear centimeter. Preferred multiple layer cleansing articles of this invention utilize a two-ply substrate wherein one or both plies are apertured. Also preferably at least one of the plies of the substrate is wet extensible and the second ply is less wet extensible than the first ply. Preferred articles are also substantially dry prior to use and contain one or more water-soluble or water-insoluble conditioning agents in addition to the lathering surfactant component., 81001=When applied as parallel stripes, lines, or bands, the adhesive can be applied to the nonwoven second layer 200 using a slot coating applicator. A suitable slot coating applicator is a Nordson MX series hot melter with extrusion head commercially available from the Nordson Company of Norcross, Ga. The H1382-01 adhesive referenced above can be applied to the second layer 200 at a temperature of about 350 Fahrenheit, at an application level of about 0.03 grams of adhesive per square inch. Immediately following application of the adhesive to the nonwoven second layer 200, the nonwoven second layer 200 and the paper first layer 100 can be bonded together by pressing the two layers 100 and 200 together with the adhesive disposed between the second layer 200 and the first layer 100. One suitable means for pressing the two layers 100 and 200 together is by passing the two layers through a nip formed between two rollers, with the rollers loaded to provide adequate nip pressure for bonding., 26950=This application is a continuation-in-part (CIP) of the following copending U.S. patent applications: U.S. Ser. No. 09/065,991, filed Apr. 24, 1998, in the names of Timothy John Fowler, Lourdes Dessus Albacarys, and David Michael McAtee (P&G Case 6335R); U.S. Ser. No. 08/861,750, filed May 22, 1997 in the names of Erik John Hasenoehrl, Lourdes Dessus Albacarys, and Timothy John Fowler (P&G Case 6652); U.S. Ser. No. 09/148,540, filed Sep. 4, 1998 in the names of Erik John Hasenoehrl and David Michael McAtee (P&G Case 6819); and U.S. Ser. No. 09/152,034, filed Sep. 11, 1998 in the names of David Michael McAtee, Nicholas James Nissing, Erik John Hasenoehrl, and David William Cabell (P&G Case 6840)., 53091=The substrate can be made into a wide variety of shapes and forms including flat pads, thick pads, thin sheets, ball-shaped implements, irregularly shaped implements, and having sizes ranging from providing a cleansing surface area of at least about 5 cm2. The exact size will depend upon the desired use and product characteristics. Especially convenient are square, circular, rectangular, or oval pads having a cleansing surface area of from about 6 cm2 to 1000 cm2, preferably from about 65 cm2 to about 775 cm2, and more preferably from about 150 cm2 to about 400 cm2, and a thickness of from about 1 mil to about 500 mil, preferably from about 5 mil to about 250 mil, and more preferably from about 10 mil to about 100 mil., 68743=It is believed that the paper strength can significantly alter the overall appearance of the complete article. The amount of crepe input to the first layer is directly proportional to the amount of planar expansion and thereby the amount of caliper generated upon wetting. However, if the wet strength of the paper article is insufficient, the “buckles” may collapse to form a more “wrinkled” product having less caliper. Therefore both crepe and wet strength can be adjusted to provide an amount of texture based on the intended use of the article. Wet burst measurements can be made with a Thwing-Albert Burst Tester model number 1300-77, which tests peak load of a fully wetted substrate. The test utilizes a 1.3 cm ball diameter, a 12.7 cm/min ball velocity, and clamps the test sample around a 8.9 cm diameter circle perpendicular to the motion of the ball. Peak load wet burst strengths are between 100 and 1200 grams per ply. More preferably between 400 and 700 grams per ply and most preferably between 500 and 600 grams per ply., 145742=The compositions which are added onto or impregnated into the articles of the present invention may comprise a wide range of optional ingredients. Particularly useful are added polymers (as distinct from the polymeric material which may form the substrate), various active ingredients, and cationic surfactants useful for delivering various non-conditioning or non-cleansing benefits of the skin or hair during the cleansing and conditioning process. Additional ingredients of these types are described in greater detail in Procter & Gamble; PCT Application No. WO 99/13861; published Mar. 25, 1999 (P&G Case 6840). This document is incorporated herein by reference., 99477=wherein: R1 is H, C1-C4 alkyl, 2-hydroxyethyl, 2-hydroxy-propyl, preferably C1-C4 alkyl, more preferably methyl or ethyl, most preferably methyl; R2 is C5-C31 alkyl or alkenyl, preferably C7-C19 alkyl or alkenyl, more preferably C9-C17 alkyl or alkenyl, most preferably C11-C15 alkyl or alkenyl; and Z is a polhydroxyhydrocarbyl moiety having a linear hydrocarbyl chain with a least 3 hydroxyls directly connected to the chain, or an alkoxylated derivative (preferably ethoxylated or propoxylated) thereof. Z preferably is a sugar moiety selected from the group consisting of glucose, fructose, maltose, lactose, galactose, mannose, xylose, and mixtures thereof. An especially preferred surfactant corresponding to the above structure is coconut alkyl N-methyl glucoside amide (i.e., wherein the R2CO— moiety is derived from coconut oil fatty acids). Processes for making compositions containing polyhydroxy fatty acid amides are disclosed, for example, in G.B. Patent Specification 809,060, published Feb. 18, 1959, by Thomas Hedley & Co., Ltd.; U.S. Pat. No. 2,965,576, to E. R. Wilson, issued Dec. 20, 1960; U.S. Pat. No. 2,703,798, to A. M. Schwartz, issued Mar. 8, 1955; and U.S. Pat. No. 1,985,424, to Piggott, issued Dec. 25, 1934; which are incorporated herein by reference in their entirety., 69800=In a more preferred embodiment, the first layer 100 comprises an apertured wetlaid paper web of cellulosic wood pulp fibers. The apertures 102 can be formed in the first layer 100 in any suitable manner. For instance, the apertures 102 can be formed in the first layer 100 during formation of the paper web of the first layer 100, or alternatively, after the paper web of the first layer 100 is manufactured. In one embodiment, the paper web of the first layer 100 is produced according to the teachings of one or more of the following U.S. patents, which patents are incorporated herein by reference: U.S. Pat. No. 5,245,025 issued Sep. 14, 1993 to Trokhan et al.; U.S. Pat. No. 5,277,761 issued Jan. 11, 1994 to Phan et al.; and U.S. Pat. No. 5,654,076 issued Aug. 5, 1997 to Trokhan et al. In particular, U.S. Pat. No. 5,277,761 at Column 10 discloses formation of a paper web having apertures., 119845=Standard tabulations of heat of vaporization and molar volume additive group contributions for a wide variety of atoms and groups of atoms are collected in Barton, A.F.M. Handbook of Solubility Parameters, CRC Press, Chapter 6, Table 3, pp. 64-66 (1985), which is incorporated by reference herein in its entirety. The above solubility parameter equation is described in Fedors, R. F., “A Method for Estimating Both the Solubility Parameters and Molar Volumes of Liquids”, Polymer Engineering and Science, vol. 14, no. 2, pp. 147-154 (February 1974), which is incorporated by reference herein in its entirety., 90453=Nonlimiting examples of anionic lathering surfactants useful in the compositions of the present invention are disclosed in McCutcheon's, Detergents and Emulsifiers, North American edition (1986), published by allured Publishing Corporation; McCutcheon's, Functional Materials, North American Edition (1992); and U.S. Pat. No. 3,929,678, to Laughlin et al., issued Dec. 30, 1975, all of which are incorporated by reference herein in their entirety., 72415=The paper web is manufactured by first forming an aqueous papermaking furnish. The furnish comprises papermaking fibers, and can further comprise various additives. U.S. Pat. No. 5,223,096 issued Jun. 29, 1993 to Phan et al. is incorporated herein by reference for the purpose of disclosing various wood pulps and papermaking additives., 129553=Nonvolatile silicones such as polydialkylsiloxanes, polydiarylsiloxanes, and polyalkarylsiloxanes are also useful oils. These silicones are disclosed in U.S. Pat. No. 5,069,897, to Orr, issued Dec. 3, 1991, which is incorporated by reference herein in its entirety. The polyalkylsiloxanes correspond to the general chemical formula R3SiO[R2SiO]xSiR3 wherein R is an alkyl group (preferably R is methyl or ethyl, more preferably methyl) and x is an integer up to about 500, chosen to achieve the desired molecular weight. Conmmercially available polyalkylsiloxanes include the polydimethylsiloxanes, which are also known as dimethicones, nonlimiting examples of which include the Vicasil� series sold by General Electric Company and the Dow Corning� 200 series sold by Dow Corning Corporation. Specific examples of polydimethylsiloxanes useful herein include Dow Corning� 225 fluid having a viscosity of 10 centistokes and a boiling point greater than 200� C., and Dow Corning� 200 fluids having viscosities of 50, 350, and 12,500 centistokes, respectively, and boiling points greater than 200� C. Also useful are materials such as trimethylsiloxysilicate, which is a polymeric material corresponding to the general chemical formula [(CH2)3SiO1/2]x[SiO2]y, wherein x is an integer from about 1 to about 500 and y is an integer from about 1 to about 500. A commercially available trimethylsiloxysilicate is sold as a mixture with dimethicone as Dow Corning� 593 fluid. Also useful herein are dimethiconols, which are hydroxy terminated dimethyl silicones. These materials can be represented by the general chemical formulas R3SiO[R2SiO]xSiR2OH and HOR2SiO[R2SiO]xSiR2OH wherein R is an alkyl group (preferably R is methyl or ethyl, more preferably methyl) and x is an integer up to about 500, chosen to achieve the desired molecular weight. Commercially available dimethiconols are typically sold as mixtures with dimethicone or cyclomethicone (e.g. Dow Corning� 1401, 1402, and 1403 fluids). Also useful herein are polyalkylaryl siloxanes, with polymethylphenyl siloxanes having viscosities from about 15 to about 65 centistokes at 25� C. being preferred. These materials are available, for example, as SF 1075 methylphenyl fluid (sold by General Electric Company) and 556 Cosmetic Grade phenyl trimethicone fluid (sold by Dow Corning Corporation)., 144705=In the present invention, the weight ratio of the lathering surfactant to the conditioning component is preferably less than about 40:7, more preferably less than about 5:1, even more preferably less than about 2.5:1, and most preferably less than about 1:1., 79062=The adhesive is preferably water insoluble so that the article 20 can be wetted with water without delamination of the first and second layers. The adhesive is preferably also surfactant tolerant. By “surfactant tolerant” it is meant that the bonding characteristics of the adhesive are not degraded by the presence of surfactants. Suitable adhesives include EVA (ethylene vinyl acetate) based hot melt adhesives. One suitable adhesive is a hot melt adhesive commercially available as H1382-01 from Ato-Findley Adhesives of Wauwatosa, Wis., 49794=Nonwoven substrates made from synthetic materials useful in the present invention can be obtained from a wide variety of commercial sources. Nonlimiting examples of suitable nonwoven layer materials useful herein include HEF 40-047 an apertured hydroentangled material containing about 50% rayon and 50% polyester, and having a basis weight of about 61 grams per square meter (gsm), available from Veratec, Inc., Walpole, Mass.; HEF 140-102 an apertured hydroentangled material containing about 50% rayon and 50% polyester, and having a basis weight of about 67 gsm, available from Veratec, Inc., Walpole, Mass.; Novonet� 149-616, a thermo-bonded grid patterned material containing about 100% polypropylene, and having a basis weight of about 60 gsm available from Veratec, Inc., Walpole, Mass.; Novonet� 149-801, a thermo-bonded grid patterned material containing about 69% rayon, about 25% polypropylene, and about 6% cotton, and having a basis weight of about 90 gsm, available from Veratec, Inc. Walpole, Mass.; Novonet� 149-191, a thermo-bonded grid patterned material containing about 69% rayon, about 25% polypropylene, and about 6% cotton, and having a basis weight of about 120 gsm, available from Veratec, Inc. Walpole, Mass.; HEF Nubtex� 149-801, a nubbed, apertured hydroentangled material, containing about 100% polyester, and having a basis weight of about 84 gsm, available from Veratec, Inc. Walpole, Mass.; Keybak� 951V, a dry formed apertured material, containing about 75% rayon, about 25% acrylic fibers, and having a basis weight of about 51 gsm, available from Chicopee, New Brunswick, N.J.; Keybak� 1368, an apertured material, containing about 75% rayon, about 25% polyester, and having a basis weight of about 47 gsm, available from Chicopee, New Brunswick, N.J.; Duralace� 1236, an apertured, hydroentangled material, containing about 100% rayon, and having a basis weight from about 48 gsm to about 138 gsm, available from Chicopee, New Brunswick, N.J.; Duralace� 5904, an apertured, hydroentangled material, containing about 100% polyester, and having a basis weight from about 48 gsm to about 138 gsm, available from Chicopee, New Brunswick, N.J.; Chicopee� 5763, a carded hydroapertured material (8�6 apertures per inch, 3�2 apertures per cm), containing about 70% rayon, about 30% polyester, and a optionally a latex binder (Acrylate or EVA based) of up to about 5% w/w, and having a basis weight from about 60 gsm to about 90 gsm, available form Chicopee, New Brunswick, N.J.; Chicopee� 9900 series (e.g., Chicopee 9931, 62 gsm, 50/50 rayon/polyester, and Chicopee 9950 50 gsm, 50/50 rayon/polyester), a carded, hydroentangled material, containing a fiber composition of from 50% rayon/50% polyester to 0% rayon/100% polyester or 100% rayon/0% polyester, and having a basis weight of from about 36 gsm to about 84 gsm, available form Chicopee, New Brunswick, N.J.; Sontara 8868, a hydroentangled material, containing about 50% cellulose and about 50% polyester, and having a basis weight of about 72 gsm, available from Dupont Chemical Corp. Preferred non-woven substrate materials have a basis weight of about from 24 gsm to about 96 gsm, more preferably from about 36 gsm to about 84 gsm, and most preferably from about 42 gsm to about 78 gsm., 123721=Petrolatum, which is also known as petroleum jelly, is a colloidal system of nonstraight-chain solid hydrocarbons and high-boiling liquid hydrocarbons, in which most of the liquid hydrocarbons are held inside the micelles. See The Merck Index, Tenth Edition, Entry 7047, p. 1033 (1983); Schindler, Drug. Cosmet. Ind., 89, 36-37, 76, 78-80, 82 (1961); and International Cosmetic Ingredient Dictionary, Fifth Edition, vol. 1, p. 537 (1993), which are incorporated by reference herein in their entirety., 97291=Alkyl glucosides and alkyl polyglucosides are useful herein, and can be broadly defined as condensation articles of long chain alcohols, e.g. C8-30 alcohols, with sugars or starches or sugar or starch polymers, i.e., glycosides or polyglycosides. These compounds can be represented by the formula (S)n—O—R wherein S is a sugar moiety such as glucose, fructose, mannose, and galactose; n is an integer of from about 1 to about 1000, and R is a C8-30 alkyl group. Examples of long chain alcohols from which the alkyl group can be derived include decyl alcohol, cetyl alcohol, stearyl alcohol, lauryl alcohol, myristyl alcohol, oleyl alcohol, and the like. Preferred examples of these surfactants include those wherein S is a glucose moiety, R is a C8-20 alkyl group, and n is an integer of from about 1 to about 9. Commercially available examples of these surfactants include decyl polyglucoside (available as APG 325 CS from Henkel) and lauryl polyglucoside (available as APG 600CS and 625 CS from Henkel). Also useful are sucrose ester surfactants such as sucrose cocoate and sucrose laurate., 146482=The articles of the present invention can comprise a wide range of other optional components. These additional components should be pharmaceutically acceptable. The CTFA Cosmetic Ingredient Handbook, Second Edition, 1992, which is incorporated by reference herein in its entirety, describes a wide variety of nonlimiting cosmetic and pharmaceutical ingredients commonly used in the skin care industry, which are suitable for use in the compositions of the present invention. Nonlimiting examples of functional classes of ingredients are described at page 537 of this reference. Examples of these and other functional classes include: abrasives, absorbents, anticaking agents, antioxidants, vitamins, binders, biological additives, buffering agents, bulking agents, chelating agents, chemical additives, colorants, cosmetic astringents, cosmetic biocides, denaturants, drug astringents, external analgesics, film formers, fragrance components, humectants, opacifying agents, pH adjusters, preservatives, propellants, reducing agents, skin bleaching agents, and sunscreening agents., 121649=Solubility parameters have also been tabulated for a wide variety of chemical materials. Tabulations of solubility parameters are found in the above-cited Handbook of Solubility Parameters. Also, see “Solubility Effects In Product, Package, Penetration, And Preservation”, C. D. Vaughan, Cosmetics and Toiletries, vol. 103, Oct. 1988, pp. 47-69, which is incorporated by reference herein in its entirety., 123370=Mineral oil, which is also known as petrolatum liquid, is a mixture of liquid hydrocarbons obtained from petroleum. See The Merck Index, Tenth Edition, Entry 7048, p. 1033 (1983) and International Cosmetic Ingredient Dictionary, Fifth Edition, vol. 1, p.415-417 (1993), which are incorporated by reference herein in their entirety., 65396=For example, a wipe that has been adhesively bonded with an EVA hot melt adhesive (one suitable adhesive is a hot melt adhesive commercially available as H1382-01 from Ato-Findley Adhesives of Wauwatosa, Wis.), may increase in caliper between 10-20% after a post-lamination heat treatment. In this case, a suitable hot melt adhesive is applied and the resulting article is cooled to room temperature. Heat treatment may then be performed, for example, raising the temperature to 100 degrees Celsius for 20 seconds is sufficient to initiate contraction of the polymer network. While not being bound by theory, it is believed that for this process to be effective, the pattern of bonding must be a continuous or essentially continuous network. Discrete bond sites may not sufficiently contract to improve the appearance of the article., 45149=Nonwoven substrates made from natural materials consist of webs or sheets most commonly formed on a fine wire screen from a liquid suspension of the fibers. See C. A. Hampel et al., The Encyclopedia of Chemistry, third edition, 1973, pp. 793-795 (1973); The Encyclopedia Americana, vol. 21, pp. 376-383 (1984); and G. A. Smook, Handbook of Pulp and Paper Technologies, Technical Association for the Pulp and Paper Industry (1986); which are incorporated by reference herein in their entirety., 126784=Also useful are various C1-C30 monoesters and polyesters of sugars and related materials. These esters are derived from a sugar or polyol moiety and one or more carboxylic acid moities. Depending on the constituent acid and sugar, these esters can be in either liquid or solid form at room temperature. Examples of liquid esters include: glucose tetraoleate, the glucose tetraesters of soybean oil fatty acids (unsaturated), the mannose tetraesters of mixed soybean oil fatty acids, the galactose tetraesters of oleic acid, the arabinose tetraesters of linoleic acid, xylose tetralinoleate, galactose pentaoleate, sorbitol tetraoleatc, the sorbitol hexaesters of unsaturated soybean oil fatty acids, xylitol pentaoleate, sucrose tetraoleate, sucrose pentaoleate, sucrose hexaoleate, sucrose hepatoleate, sucrose octaoleate, and mixtures thereof. Examples of solid esters include: sorbitol hexaester in which the carboxylic acid ester moieties are palmitoleate and arachidate in a 1:2 molar ratio; the octaester of raffinose in which the carboxylic acid ester moieties are linoleate and behenate in a 1:3 molar ratio; the heptaester of maltose wherein the esterifying carboxylic acid moieties are sunflower seed oil fatty acids and lignocerate in a 3:4 molar ratio; the octaester of sucrose wherein the esterifying carboxylic acid moieties are oleate and behenate in a 2:6 molar ratio; and the octaester of sucrose wherein the esterifying carboxylic acid moieties are laurate, linoleate and behenate in a 1:3:4 molar ratio. A preferred solid material is sucrose polyester in which the degree of esterification is 7-8, and in which the fatty acid moieties are C18 mono- and/or di-unsaturated and behenic, in a molar ratio of unsaturates:behenic of 1:7 to 3:5. A particularly preferred solid sugar polyester is the octaester of sucrose in which there are about 7 behenic fatty acid moieties and about 1 oleic acid moiety in the molecule. Other materials include cottonseed oil or soybean oil fatty acid esters of sucrose. The ester materials are further described in, U.S. Pat. Nos. 2,831,854, 4,005,196, to Jandacek, issued Jan. 25, 1977; U.S. Pat. No. 4,005,195, to Jandacek, issued Jan. 25, 1977, U.S. Pat. No. 5,306,516, to Letton et al., issued Apr. 26, 1994; U.S. Pat. No. 5,306,515, to Letton et al., issued Apr. 26, 1994; U.S. Pat. No. 5,305,514, to Letton et al., issued Apr. 26, 1994; U.S. Pat. No. 4,797,300, to Jandacek et al., issued Jan. 10, 1989; U.S. Pat. No. 3,963,699, to Rizzi et al, issued Jun. 15, 1976; U.S. Pat. No. 4,518,772, to Volpenhein, issued May 21, 1985; and U.S. Pat. No. 4,517,360, to Volpenlein, issued May 21, 1985; all of which are incorporated by reference herein in their entirety., 133260=Nonlimiting examples of conditioning agents useful as water soluble conditioning agents include those selected from the group consisting of polyhydric alcohols, polypropylene glycols, polyethylene glycols, ureas, pyrolidone carboxylic acids, ethoxylated and/or propoxylated C3-C6 diols and triols, alpha-hydroxy C2-C6 carboxylic acids, ethoxylated and/or propoxylated sugars, polyacrylic acid copolymers, sugars having up to about 12 carbons atoms, sugar alcohols having up to about 12 carbon atoms, and mixtures thereof. Specific examples of useful water soluble conditioning agents include materials such as urea; guanidine; glycolic acid and glycolate salts (e.g. ammonium and quaternary alkyl ammonium); lactic acid and lactate salts (e.g. ammonium and quaternary alkyl ammonium); sucrose, fructose, glucose, eruthrose, erythritol, sorbitol, mannitol, glycerol, hexanetriol, propylene glycol, butylene glycol, hexylene glycol, and the like; polyethylene glycols such as PEG-2, PEG-3, PEG-30, PEG-50, polypropylene glycols such as PPG-9, PPG-12, PPG-15, PPG-17, PPG-20, PPG-26, PPG-30, PPG-34; alkoxylated glucose; hyaluronic acid; and mixtures thereof. Also useful are materials such as aloe vera in any of its variety of forms (e.g., aloe vera gel), chitin, starch-grafted sodium polyacrylates such as Sanwet (RTM) IM-1000, IM-1500, and IM-2500 (available from Celanese Superabsorbent Materials, Portsmouth, Va.); lactamide monoethanolamine; acetamide monoethanolamine; and mixtures thereof. Also useful are propoxylated glycerols as described in U.S. Pat. No. 4,976,953, to Orr et al., issued Dec. 11, 1990, which is incorporated by reference herein in its entirety., 39461=The term “mild” as used herein in reference to the lathering surfactants and articles of the present invention means that the articles of the present invention demonstrate skin mildness comparable to a mild alkyl glyceryl ether sulfonate (AGS) surfactant based synthetic bar, i.e. synbar. Methods for measuring mildness, or inversely the irritancy, of surfactant containing articles, are based on a skin barrier destruction test. In this test, the milder the surfactant, the lesser the skin barrier is destroyed. Skin barrier destruction is measured by the relative amount of radio-labeled (tritium labeled) water (3H—H2O) which passes from the test solution through the skin epidermis into the physiological buffer contained in the diffusate chamber. This test is described by T. J. Franz in the J. Invest. Dermatol., 1975, 64, pp. 190-195; and in U.S. Pat. No. 4,673,525, to Small et al., issued Jun. 16, 1987, which are both incorporated by reference herein in their entirety. Other testing methodologies for determining surfactant mildness well known to one skilled in the art can also be used.}",
    "textBeforeTable": "Patent Citations This mixture is then added to the first mixing vessel. About 2.5 grams of the resultant mixture are added to the non-woven/paper composites to form cleansing articles of the present invention. 0.15 0.15 0.15 Propyl Paraben 2.0 2.0 2.0 Butylene Glycol 2.0 2.0 2.0 Water In a separate mixing vessel, the following components are added. The components are then mixed (with heat to 40� C. as necessary) until propyl paraben is dissolved.",
    "textAfterTable": "US5866110 Oct 29, 1996 Feb 2, 1999 The Procter & Gamble Company Mild shower gel composition comprising fatty alcohol which imparts improved lathering and thickening properties US5871762 Oct 7, 1996 Feb 16, 1999 The Procter & Gamble Company Cosmetic applicators which contain stable oil-in-water emulsions US5914177 * Aug 11, 1997 Jun 22, 1999 The Procter & Gamble Company Wipes having a substrate with a discontinuous pattern of a high internal phase inverse emulsion disposed thereon and process of making US5951991 Nov 26, 1997 Sep 14, 1999 The Procter & Gamble Company Cleansing products with improved moisturization US5972361 Oct 25, 1996 Oct 26, 1999 The Procter & Gamble Company Cleansing products US5980931 Nov 19, 1997 Nov 9, 1999 The Procter & Gamble Company Cleansing products having a substantially dry substrate US6063397 Oct 25, 1996 May 16, 2000 The Procter & Gamble Company Disposable cleansing products for hair and skin US6074655 Feb",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}