{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel very safe on campus, and with our campus security simply a call away, even if I did have a problem, I know they'd be there to help me very quickly. That's another plus to our smaller campus: fast and efficient security.",
            "There are many, many clubs that potential students can join, from religious clubs to the Free Thinkers Club, which is run by the philosophy department and open to all students, whether they want to talk about a specific issue or simply listen.",
            "Sacramento City College is great for students that might feel overwhelmed at a larger college. Our smaller campus has a more connected feeling to me, and I've gotten to know my professors and fellow students well. If you want a more personal experience, come here.",
            "There are many sporting events that you can attend on campus; I've only ever been to football games because that is what my schedule has allowed so far, but our baseball team is very good and I recommend seeing them play if you have the chance.",
            "The City Cafe, or cafeteria, offers a good selection of food. They rotate what they sell during the week, so it's not the same food every day. There is also a coffee shop in the cafeteria, which has very good coffee. If you don't want to eat at school, there are many good restaurants within walking distance of campus that students frequent every day.",
            "There aren't dorms that I know of here, though there are lots of low-income (or not) apartments in the surrounding area available to students.",
            "I feel challenged in my classes; perhaps not as challenged as it would have been in an upper division, four-year college class, but challenged nevertheless. I've learned so much in my time here, and can't wait to finish my education at a four-year college.",
            "Have your financial aid taken care of before you start the semester. I can't stress this enough! The sooner you have it done, the sooner you'll have your money and everything is just so much less stressful. If you need help, don't hesitate to ask someone, whether that be the financial aid office or lab, or your counselor at your high school.",
            "Sacramento City College is a very fun place. It may be smaller than some of its sister schools, but it offers so much for students. I've enjoyed my time here and I feel like it's prepared me to transfer to a four-year college."
        ]
    ],
    "pageTitle": "Sacramento City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Sacramento-City-College/reviews?_escaped_fragment_=/show/82517",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905378123,
    "recordOffset": 905325162,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{245991=Since enrolling here at Sacramento City College in Spring of 2011, I have experienced three things that have helped me grow as an individual. One, throughout the classes that I have attended, my professors have been helpful in expanding my understanding of the world, attentive to my educational needs, and considerate of obstacles I have faced in the past years. Second, my counselors have played a positive roll in contributing to my educational goals by providing guidance and personal insight. And third, I have become an active member on campus through community oriented clubs such as Brown Issues, Puente, Alianza, and RISE. With all these resources offered to students, I give SCC a rating of 9.5., 187273=Sacramento City College has been in place since 1905 and is one of oldest and prestigious community colleges in the valley which draws professor's who intend to give students all they can handle. This means when you take courses they are preparing you for the next level. The courses will challenge you which means you walk away not only with a grade but an understanding that will follow you when you transfer., 249523=There are currently over 30 clubs on campus. They are all wonderful and supportive for any student interested in them. For more information check out the links below: http://www.scc.losrios.edu/Documents/ChrisTorres/Club%20Lists/Spring%20Club%20List%202014.pdf http://www.scc.losrios.edu/Current_Students/Student_Services/Student_Leadership_and_Development/Student_Clubs.htm, 271089=Remember to complete your FAFSA every year and apply for scholarships in January. Stay in contact with counselors, even if you think you know what you are doing they are still a good resource and can help you get higher priority registration. Assist.com is also a good resource for California community college students as it shows prerequisite information for transfer into majors at several 4 year California colleges and universities., 274472=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 67 karen from Galt, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Share any unusual traditions or locations on campus an unusual tradition that we have here at scc is that during the middle of the semester we have many people come to our campus and sell things, so its like a flee market. Bang for the buck if you are a person who is on a budget for books, make sure you ask around for cheap books and read the bulletins for books that students are selling. What to do for fun there are many things around the campus to do for fun. there is a park across the street if you need some fresh air, there are many fast food chains across the street, and a really great library on campus for those who love to read. Food and Dining the food is great because there are many variety to chose from but the only bad thing about it is that its pretty pricing. Dorm Life i live at home and drive myself to class everyday so i am not sure about the dorm life. Academic Rigor do all your work",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}