{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have our own campus police station with at least 100 cops.... NEED I SAY MORE???",
            "I personally am not in Greek life but I am friends with many of the people that are and it is an amazing lifestyle. There are the fun parties and activities within Greek life but they also require you to have certain amounts of library hours every week so that you keep up with your academics. Greek Village is being built right now which is a new housing subdivision where all the Greek's will have houses right there together on like their own little campus instead of being spread out everywhere.",
            "SAB Greek Life Any christian organizations ETC.... There are so many activities that I cant even think of all of them.",
            "UCA IS GREAT FOR EVERYONE! YOU BELONG AT UCA is our slogan and it fits every student interested in attending.",
            "Every semester during exam week there is an Undie Run where everyone that wants to participate, strips down to their Undies and you run all around campus. Girls and Guys are allowed to participate. Its a fun break from studying for exams to just relax and enjoy a good laugh.",
            "You get a lot for your money. Though the college tuition is kind of expensive, it is worth it completely. Financial aid also helps you by giving you as much excess aid as they can to help you pay for a wonderful college experience. Don't let lack of money keep you from getting a good quality education, and a place to make friends for life.",
            "There is so many activities on campus to do so that you are never bored. We have SAB (Student activities board) that plans all sorts of fun movie nights and comedians to come and perform. There are lots of parties and Greek life activities also. The RA's of every dorm plan little activities that you can do within your residence hall.",
            "Their food is amazing in the cafeteria and in the student center! I reccomend the pasta lady in the cafeteria. She is so sweet and she is such an amazing cook. There is also a deli bar, a salad bar, home cooked food, pizza and much more to choose from in the cafeteria. In the student center we have quiz-nos, chick-fil-a, Grill works, pizza hut, and a sushi place. There is also an Einsteins Brothers, Starbucks, and Java City on campus.",
            "All the dorms are nice and clean. They are nice in size and they pick your roommates pretty well if you do random roommates. You also have the option of which dorm you want and also the choice of your roommate! It is an excellent place to call home",
            "The Staff is amazing. There are so many resources on campus that help you out when you're struggling in a class. We have tutoring labs, a writing center, and many other excellent sources for help.",
            "1. Get your financial aid done before school starts so that you are on time and don't have to wait for the aid to purchase your books. 2. Get your books as early as possible, it is okay to rent your books, its cheaper and easier! 3. Check student accounts and financial aid during welcome week so that you can make sure all scholarships, and aid are in order. 4. Make sure to go by the post office and rent out a mailbox. Its already paid for in tuition so you might as well use it.",
            "I love UCA it is the best school someone could ever attend. The faculty and staff are absolutely amazing and they will do anything to help their students progress in their learning. The students here at UCA are so much fun, and they are so kind and genuine."
        ]
    ],
    "pageTitle": "University of Central Arkansas Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Central-Arkansas/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909198991,
    "recordOffset": 909126846,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{292822=I feel safe on campus - good lighting and always someone outside. I think the police escort hours should go beyond 10:00 p.m., 364627=I feel 100% protected on this campus. The police close all the gates around 10:00 p.m. only allowing one or two entrances on campus. I see the police cars everywhere on campus either driving or walking and monitoring. There are also multiple emergency buttons around campus if you're in trouble and need immediate help., 399203=© 2015, Cappex.com, LLC, 37629=the university of central arkansas is a community oriented school. this school has a 1:19 professor-student ratio, which allows for individual based learning in a higher education type learning environment. this school is great for those who like the pleasures of both a small town and a larger town., 355925=Food isn't awful on campus, but you will grow tired of it, especially in the cafeteria. The dorms all have kitchens so it wouldn't be too difficult to concoct a homemade meal occasionally.}",
    "textBeforeTable": "01/17/2010 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 of 97 Megan from Sherwood, AR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Gwendolyn from Malvern, AR 02/02/2011 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 97 Categories Comments Great for these types of students UCA is a great place for people who love meeting new people. There are tons of people on campus who are eager to get to know new people and just have fun. It is also a perfect place for someone who is really serious about their studies. There are faculty members in every department with office hours just to help students who need help or to discuss interests with students who really apply themselves. Tips for prospective students The two most important things a student can do: Really get involved with organizations on campus, and really apply yourselves in your classes. The former will ensure that you are meeting new people and making the most of your time at UCA. The latter will make certain that you are earning the respect of your teachers and classmates and, most importantly, yourself.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}