{
    "relation": [
        [
            "Patent application number",
            "20140318956",
            "20150122642"
        ],
        [
            "Description",
            "SPUTTERING TARGET AND METHOD FOR PRODUCING THE SAME - A sputtering target which is made of a magnesium oxide sintered body having a purity of not less than 99.99% or not less than 99.995% by mass %, a relative density of not less than 98%, and an average grain size of not more than 8 μm. The average grain size of the sputtering target is preferably not more than 5 μm, more preferably not more than 2 μm. A sputtered film having an excellent insulation resistance and an excellent homogeneity can be obtained by using the sputtering target.",
            "SPUTTERING TARGET AND METHOD FOR PRODUCING THE SAME - A sputtering target which is made of an alumina sintered body having a purity of not less than 99.99% by mass %, a relative density of not less than 98%, and an average grain size of less than 5 μm or is made of an alumina sintered body having a purity of not less than 99.999% by mass % and a relative density of not less than 98%. A sputtered film having an excellent insulation resistance and an excellent homogeneity can be obtained by using the sputtering target."
        ],
        [
            "Published",
            "10-30-2014",
            "05-07-2015"
        ]
    ],
    "pageTitle": "Miyashita, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/miyashita-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426716495,
    "recordOffset": 426686438,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sachio Miyashita, Tokyo JP //]]> BarDraw('2897862',['Patent applications by Noe Miyashita, Tokyo JP'],[[1,5,1]],['2010','2011','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2897862\" align=\"center\"></div> </div> <canvas id=\"bg2897862\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Noe Miyashita, Tokyo JP</p> <div class=\"bar2897862\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-06-2013</td> <td><a href=\"/patents/app/20130139898\">REAGENT SPLITTING/DISPENSING METHOD BASED ON REAGENT DISPENSING NOZZLE AND REAGENT SPLITTING/DISPENSING MECHANISM</a> - A reagent splitting/dispensing method based on a reagent dispensing nozzle controls a split or dispensation amount of reagent, includes a waiting process of disposing a first air layer between an interface of the operation fluid and a nozzle tip end in the reagent dispensing nozzle; a first moving process of moving the reagent dispensing nozzle to a position above the reagent to be split; a second moving process of depositing the nozzle tip end in the reagent; an air layer adjusting process of increasing the occupation amount of the operation fluid in the reagent dispensing nozzle and decreasing the occupation amount of the first air layer, between the first moving process and the second moving process; and a reagent splitting process of decreasing the occupation amount of the operation fluid in the reagent dispensing nozzle and filling the reagent into the reagent dispensing nozzle from the nozzle tip end.</td> <td>20130139898</td> <tr> </tr> <td>07-28-2011</td> <td><a href=\"/patents/app/20110183408\">REAGENT CARTRIDGE FOR MICROORGANISM DETECTION APPARATUS</a> - A reagent cartridge for a microorganism detection apparatus includes a plurality of reagent vessels, a support plate, and side plates,",
    "textAfterTable": "Shigehiro Miyashita, Tokyo JP Patent application number Description Published 20110044334 COMMUNICATION SYSTEM AND COMMUNICATION METHOD - In a communication system in which computer 02-24-2011 20110310900 COMMUNICATION RELAY APPARATUS, COMMUNICATION RELAY SYSTEM AND COMMUNICATION RELAY METHOD - A communication relay apparatus includes a frame transfer unit. The frame transfer unit has a function to change destination information included in a frame, which is a unit of data transfer, from information indicating the own apparatus into information indicating a predetermined external communication apparatus without changing source information included in the frame, when the frame is received. Further, the frame transfer unit has a function to transfer the frame after the change to the external communication apparatus. 12-22-2011 Shinichi Miyashita, Tokyo JP Patent application number Description Published 20090232502 VISIBLE LIGHT COMMUNICATION SYSTEM AND OPTICAL WIRELESS LAN DEVICE - A visible light communication system and an optical wireless LAN device are provided, which are capable of establishing a 10 Mbit/s LAN connection by means of an LED lighting unit which integrally has a plurality of LEDs. The optical wireless LAN device 09-17-2009 Sugaya Miyashita, Tokyo JP Patent application number Description Published 20120222589 SAFETY BOX - A safety box comprises a main body housing provided with a storage portion and a weight portion. The storage portion has a storage",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}