{
    "relation": [
        [
            "Published Date",
            "Apr 7, 2015",
            "Oct 3, 2014",
            "Nov 12, 2013",
            "Oct 31, 2012",
            "Jan 5, 2011",
            "Sep 24, 2009",
            "May 22, 2007"
        ],
        [
            "Version",
            "8 (current)",
            "7",
            "6",
            "5",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - QUINAPRIL HYDROCHLORIDE AND HYDROCHLOROTHIAZIDE- quinapril hydrochloride and hydrochlorothiazide tablet, film coated",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=845356a8-221c-41ec-9ac4-a1a114365275",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61492847,
    "recordOffset": 61448144,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{88849=In patients with renal insufficiency, the elimination half-life of quinaprilat increases as creatinine clearance decreases. There is a linear correlation between plasma quinaprilat clearance and creatinine clearance. In patients with end-stage renal disease, chronic hemodialysis or continuous ambulatory peritoneal dialysis have little effect on the elimination of quinapril and quinaprilat. Elimination of quinaprilat is reduced in elderly patients (≥ 65 years) and in those with heart failure; this reduction is attributable to decrease in renal function (see DOSAGE AND ADMINISTRATION). Quinaprilat concentrations are reduced in patients with alcoholic cirrhosis due to impaired deesterification of quinapril. In a study of patients with impaired renal function (mean creatinine clearance of 19 mL/min), the half-life of hydrochlorothiazide elimination was lengthened to 21 hours., 59606=In clinical trials, hyperkalemia (serum potassium ≥ 5.8 mmol/L) occurred in approximately 2% of patients receiving quinapril. In most cases, elevated serum potassium levels were isolated values which resolved despite continued therapy. Less than 0.1% of patients discontinued therapy due to hyperkalemia., 4069=Quinapril and Hydrochlorothiazide Tablets, USP 20 mg/ 12.5 mg, 42127=Carcinogenicity, mutagenicity, and fertility studies have not been conducted in animals with quinapril and hydrochlorothiazide., 13628=Angiotensin II could presumably serve as a specific antagonist-antidote in the setting of quinapril overdose, but angiotensin II is essentially unavailable outside of scattered research facilities. Because the hypotensive effect of quinapril is achieved through vasodilation and effective hypovolemia, it is reasonable to treat quinapril overdose by infusion of normal saline solution., 87406=Single doses of 20 mg of quinapril provide over 80% inhibition of plasma ACE for 24 hours. Inhibition of the pressor response to angiotensin I is shorter-lived, with a 20 mg dose giving 75% inhibition for about 4 hours, 50% inhibition for about 8 hours, and 20% inhibition at 24 hours. With chronic dosing, however, there is substantial inhibition of angiotensin II levels at 24 hours by doses of 20 mg to 80 mg., 36468=Safety and effectiveness of quinapril and hydrochlorothiazide in children have not been established., 69625=If excessive hypotension occurs, the patient should be placed in a supine position and, if necessary, treated with intravenous infusion of normal saline. Quinapril and hydrochlorothiazide treatment usually can be continued following restoration of blood pressure and volume. If symptomatic hypotension develops, a dose reduction or discontinuation of quinapril and hydrochlorothiazide may be necessary., 51763=Therapy with quinapril and hydrochlorothiazide should be interrupted for a few days before carrying out tests of parathyroid function., 57956=Hydrochlorothiazide decreases urinary calcium excretion and may cause elevations of serum calcium. Monitor calcium levels in patients with hypercalcemia receiving quinapril and hydrochlorothiazide., 9354=Regimens of therapy with quinapril and hydrochlorothiazide tablets need not take account of renal function as long as the patient’s creatinine clearance is > 30 mL/min/1.73 m2 (serum creatinine roughly ≤ 3 mg/dL or 265 µmol/L). In patients with more severe renal impairment, loop diuretics are preferred to thiazides. Therefore, quinapril and hydrochlorothiazide tablets are not recommended for use in these patients., 14577=Data from human overdoses of ACE inhibitors are scanty; the most likely manifestation of human quinapril overdosage is hypotension. In human hydrochlorothiazide overdose, the most common signs and symptoms observed have been those of dehydration and electrolyte depletion (hypokalemia, hypochloremia, hyponatremia). If digitalis has also been administered, hypokalemia may accentuate cardiac arrhythmias., 86008=While the dose-response relationship is relatively flat, doses of 40 mg to 80 mg were somewhat more effective at trough than 10 mg to 20 mg, and twice daily dosing tended to give a somewhat lower trough blood pressure than once daily dosing with the same total dose. The antihypertensive effect of quinapril continues during long-term therapy, with no evidence of loss of effectiveness., 94453=The principal metabolite of quinapril, quinaprilat, is an inhibitor of ACE activity in human subjects and animals. ACE is peptidyl dipeptidase that catalyzes the conversion of angiotensin I to the vasoconstrictor, angiotensin II. The effect of quinapril in hypertension appears to result primarily from the inhibition of circulating and tissue ACE activity, thereby reducing angiotensin II formation. Quinapril inhibits the elevation in blood pressure caused by intravenously administered angiotensin I, but has no effect on the pressor response to angiotensin II, norepinephrine, or epinephrine. Angiotensin II also stimulates the secretion of aldosterone from the adrenal cortex, thereby facilitating renal sodium and fluid reabsorption. Reduced aldosterone secretion by quinapril may result in a small increase in serum potassium. In controlled hypertension trials, treatment with quinapril alone resulted in mean increases in potassium of 0.07 mmol/L (see PRECAUTIONS). Removal of angiotensin II negative feedback on renin secretion leads to increased plasma renin activity (PRA)., 71492=Quinapril and hydrochlorothiazide can cause symptomatic hypotension, probably not more frequently than either monotherapy. It was reported in 1.2% of 1,571 patients receiving quinapril and hydrochlorothiazide during clinical trials. Like other ACE inhibitors, quinapril has been only rarely associated with hypotension in uncomplicated hypertensive patients., 85600=Hemodynamic assessments in patients with hypertension indicate that blood pressure reduction produced by quinapril is accompanied by a reduction in total peripheral resistance and renal vascular resistance with little or no change in heart rate, cardiac index, renal blood flow, glomerular filtration rate, or filtration fraction., 76643=Angioedema of the face, extremities, lips, tongue, glottis, and larynx has been reported in patients treated with ACE inhibitors and has been seen in 0.1% of patients receiving quinapril. In two similarly sized U.S. post-marketing quinapril trials that, combined, enrolled over 3,000 black patients and over 19,000 non-blacks, angioedema was reported in 0.30% and 0.55% of blacks (in Study 1 and 2, respectively) and 0.39% and 0.17% of non-blacks. Angioedema associated with laryngeal edema can be fatal. If laryngeal stridor or angioedema of the face, tongue, or glottis occurs, treatment with quinapril and hydrochlorothiazide should be discontinued immediately, the patient treated in accordance with accepted medical care, and carefully observed until the swelling disappears. In instances where swelling is confined to the face and lips, the condition generally resolves without treatment; antihistamines may be useful in relieving symptoms. Where there is involvement of the tongue, glottis, or larynx likely to cause airway obstruction, emergency therapy including, but not limited to, subcutaneous epinephrine solution 1:1000 (0.3 to 0.5 mL) should be promptly administered (see PRECAUTIONS and ADVERSE REACTIONS)., 49542=Dual blockade of the RAS with angiotensin receptor blockers, ACE inhibitors, or aliskiren is associated with increased risks of hypotension, hyperkalemia, and changes in renal function (including acute renal failure) compared to monotherapy. Most patients receiving the combination of two RAS inhibitors do not obtain any additional benefit compared to monotherapy. In general, avoid combined use of RAS inhibitors. Closely monitor blood pressure, renal function and electrolytes in patients on quinapril and hydrochlorothiazide and other agents that affect the RAS., 53240=A patient receiving quinapril and hydrochlorothiazide should be told not to use potassium supplements or salt substitutes containing potassium without consulting the prescribing physician., 9904=For convenience, patients who are adequately treated with 20 mg of quinapril and 25 mg of hydrochlorothiazide and experience no significant electrolyte disturbances may instead wish to receive quinapril and hydrochlorothiazide tablets 20 mg/25 mg., 15326=No specific information is available on the treatment of overdosage with quinapril and hydrochlorothiazide or quinapril monotherapy; treatment should be symptomatic and supportive. Therapy with quinapril and hydrochlorothiazide should be discontinued, and the patient should be observed. Dehydration, electrolyte imbalance, and hypotension should be treated by established procedures., 68934=Quinapril and hydrochlorothiazide should be used with caution in patients with severe renal disease. Thiazides may precipitate azotemia in such patients, and the effects of repeated dosing may be cumulative., 62527=Quinapril and hydrochlorothiazide should be used with caution in patients with impaired hepatic function or progressive liver disease, since minor alterations of fluid and electrolyte balance may precipitate hepatic coma. Also, since the metabolism of quinapril to quinaprilat is normally dependent upon hepatic esterases, patients with impaired liver function could develop markedly elevated plasma levels of quinapril. No normal pharmacokinetic studies have been carried out in hypertensive patients with impaired liver function., 35365=Adverse experiences were usually mild and transient, and there was no relationship between side effects and age, sex, race, or duration of therapy. Discontinuation of therapy because of adverse effects was required in 2.1% of patients in controlled studies. The most common reasons for discontinuation of therapy with quinapril and hydrochlorothiazide were cough (1%; see PRECAUTIONS) and headache (0.7%)., 40799=Under the auspices of the National Toxicology Program, rats and mice received hydrochlorothiazide in their feed for 2 years, at doses up to 600 mg/kg/day in mice and up to 100 mg/kg/day in rats. These studies uncovered no evidence of a carcinogenic potential of hydrochlorothiazide in rats or female mice, but there was \"equivocal\" evidence of hepatocarcinogenicity in male mice. Hydrochlorothiazide was not genotoxic in in vitro assays using strains TA 98, TA 100, TA 1535, TA 1537, and TA 1538 of Salmonella typhimurium (the Ames test); in the Chinese hamster ovary (CHO) test for chromosomal aberrations; or in vivo assays using mouse germinal cell chromosomes, Chinese hamster bone marrow chromosomes, and the Drosophila sex-linked recessive lethal trait gene. Positive test results were obtained in the in vitro CHO sister chromatid exchange (clastogenicity) test and in the mouse lymphoma cell (mutagenicity) assays, using concentrations of hydrochlorothiazide of 43 to 1300 µg/mL. Positive test results were also obtained in the Aspergillus nidulans nondisjunction assay, using an unspecified concentration of hydrochlorothiazide., 67734=Some quinapril-treated hypertensive patients with no apparent preexisting renal vascular diseases have developed increases in blood urea nitrogen and serum creatinine, usually minor and transient, especially when quinapril has been given concomitantly with a diuretic. This is more likely to occur in patients with preexisting renal impairment. Dosage reduction of quinapril and hydrochlorothiazide may be required. Evaluation of the hypertensive patients should also include assessment of the renal function (see DOSAGE AND ADMINISTRATION)., 68691=When the renin-angiotensin-aldosterone system is inhibited by quinapril, changes in renal function may be anticipated in susceptible individuals. In patients with severe congestive heart failure, whose renal function may depend on the activity of the renin-angiotensin-aldosterone system, treatment with angiotensin-converting enzyme inhibitors (including quinapril) may be associated with oliguria and/or progressive azotemia and (rarely) with acute renal failure and/or death., 41964=Quinapril was not carcinogenic in mice or rats when given in doses up to 75 or 100 mg/kg/day (50 or 60 times the maximum human daily dose, respectively, on a mg/kg basis and 3.8 or 10 times the maximum human daily dose on a mg/m2 basis) for 104 weeks. Female rats given the highest dose level had an increased incidence of mesenteric lymph node hemangiomas and skin/subcutaneous lipomas. Neither quinapril nor quinaprilat were mutagenic in the Ames bacterial assay with or without metabolic activation. Quinapril was also negative in the following genetic toxicology studies: in vitro mammalian cell point mutation, sister chromatid exchange in cultured mammalian cells, micronucleus test with mice, in vitro chromosome aberration with V79 cultured lung cells, and in an in vivo cytogenetic study with rat bone marrow. There were no adverse effects on fertility or reproduction in rats at doses up to 100 mg/kg/day (60 and 10 times the maximum daily human dose when based on mg/kg and mg/m2, respectively)., 36875=If oliguria or hypotension occurs, direct attention toward support of blood pressure and renal perfusion. Exchange transfusions or dialysis may be required as a means of reversing hypotension and/or substituting for disordered renal function. Removal of quinapril, which crosses the placenta, from the neonatal circulation is not significantly accelerated by these means., 22686=Quinapril monotherapy has been evaluated for safety in 4,960 patients. In clinical trials adverse events which occurred with quinapril were also seen with quinapril and hydrochlorothiazide. In addition, the following were reported for quinapril at an incidence >0.5%: depression, back pain, constipation, syncope, and amblyopia., 24812=The following serious nonfatal adverse events, regardless of their relationship to quinapril and HCTZ combination tablets, have been reported during extensive post-marketing experience:, 38911=Because quinapril and hydrochlorothiazide are secreted in human milk, caution should be exercised when quinapril and hydrochlorothiazide is administered to a nursing woman., 66801=Another ACE inhibitor, captopril, has been shown to cause agranulocytosis and bone marrow depression rarely in patients with uncomplicated hypertension, but more frequently in patients with renal impairment, especially if they also have a collagen vascular disease, such as systemic lupus erythematosus or scleroderma. Agranulocytosis did occur during quinapril treatment in one patient with a history of neutropenia during previous captopril therapy. Available data from clinical trials of quinapril are insufficient to show that, in patients without prior reactions to other ACE inhibitors, quinapril does not cause agranulocytosis at similar rates. As with other ACE inhibitors, periodic monitoring of white blood cell counts in patients with collagen vascular disease and/or renal disease should be considered., 1885=Quinapril and Hydrochlorothiazide Tablets, USP 20 mg/ 25 mg, 86958=Administration of 10 mg to 80 mg of quinapril to patients with mild to severe hypertension results in a reduction of sitting and standing blood pressure to about the same extent with minimal effect on heart rate. Symptomatic postural hypotension is infrequent, although it can occur in patients who are salt- and/or volume-depleted (see WARNINGS)., 96032=Quinapril and hydrochlorothiazide tablets, USP are available for oral use as fixed combination tablets in three strengths of quinapril with hydrochlorothiazide: 10 mg with 12.5 mg (quinapril and hydrochlorothiazide 10/12.5), 20 mg with 12.5 mg (quinapril and hydrochlorothiazide 20/12.5), and 20 mg with 25 mg (quinapril and hydrochlorothiazide 20/25).* Each tablet also contains the following inactive ingredients: colloidal silicon dioxide, crospovidone, hypromellose, magnesium carbonate, magnesium stearate, microcrystalline cellulose, polydextrose, polyethylene glycol, povidone, pregelatinized starch (corn), sodium lauryl sulfate, titanium dioxide and triacetin. In addition, the 10 mg/12.5 mg tablets and 20 mg/25 mg tablets contain D&C Red No. 30 Aluminum Lake and the 20 mg/12.5 mg tablets contain D&C Yellow No. 10 Aluminum Lake, FD&C Blue No. 2 Aluminum Lake and FD&C Yellow No. 6 Aluminum Lake., 84880=After oral administration of hydrochlorothiazide, diuresis begins within 2 hours, peaks in about 4 hours, and lasts about 6 to 12 hours. Use of quinapril with a thiazide diuretic gives blood pressure lowering effect greater than that seen with either agent alone. In clinical trials of quinapril and hydrochlorothiazide using quinapril doses of 2.5 mg to 40 mg and hydrochlorothiazide doses at 6.25 mg to 25 mg, the antihypertensive effects were sustained for at least 24 hours, and increased with increasing dose of either component. Although quinapril monotherapy is somewhat less effective in blacks than in non-blacks, the efficacy of combination therapy appears to be independent of race. By blocking the renin-angiotensin-aldosterone axis, administration of quinapril tends to reduce the potassium loss associated with the diuretic. In clinical trials of quinapril hydrochloride and hydrochlorothiazide, the average change in serum potassium was near zero when 2.5 mg to 40 mg of quinapril was combined with hydrochlorothiazide 6.25 mg, and the average subject who received 10 mg to 20 mg/12.5 mg to 25 mg experienced a milder reduction in serum potassium than that experienced by the average subject receiving the same dose of hydrochlorothiazide monotherapy., 48940=Do not coadminister aliskiren with quinapril and hydrochlorothiazide in patients with diabetes. Avoid concomitant use of aliskiren with quinapril and hydrochlorothiazide in patients with renal impairment (GFR < 60 mL/min/1.73m2)., 56775=In patients undergoing surgery or during anesthesia with agents that produce hypotension, quinapril will block the angiotensin II formation that could otherwise occur secondary to compensatory renin release. Hypotension that occurs as a result of this mechanism can be corrected by volume expansion., 45807=Drug interaction studies of quinapril and other agents showed:, 34868=Adverse experiences probably or possibly related to therapy or of unknown relationship to therapy occurring in 1% or more of the 943 patients treated with quinapril plus hydrochlorothiazide in controlled trials are shown below., 35936=Quinapril and hydrochlorothiazide has been evaluated for safety in 1,571 patients in controlled and uncontrolled studies. Of these, 498 were given quinapril plus hydrochlorothiazide for at least 1 year, with 153 patients extending combination therapy for over 2 years. In clinical trials with quinapril and hydrochlorothiazide, no adverse experience specific to the combination has been observed. Adverse experiences that have occurred have been limited to those that have been previously reported with quinapril or hydrochlorothiazide., 12382=The side effects (see WARNINGS) of quinapril are generally rare and apparently independent of dose; those of hydrochlorothiazide are a mixture of dose-dependent phenomena (primarily hypokalemia) and dose-independent phenomena (e.g., pancreatitis), the former much more common than the latter. Therapy with any combination of quinapril and hydrochlorothiazide will be associated with both sets of dose-independent side effects, but regimens that combine low doses of hydrochlorothiazide with quinapril produce minimal effects on serum potassium. In clinical trials of quinapril and hydrochlorothiazide tablets, the average change in serum potassium was near zero in subjects who received HCTZ 6.25 mg in the combination, and the average subject who received 10 mg to 40 mg/12.5 mg to 25 mg experienced a milder reduction in serum potassium than that experienced by the average subject receiving the same dose of hydrochlorothiazide monotherapy., 50418=Increased serum lithium levels and symptoms of lithium toxicity have been reported in patients receiving ACE inhibitors during therapy with lithium. Because renal clearance of lithium is reduced by thiazides, the risk of lithium toxicity is presumably raised further when, as in therapy with quinapril and hydrochlorothiazide, a thiazide diuretic is coadministered with the ACE inhibitor. Quinapril and hydrochlorothiazide and lithium should be coadministered with caution, and frequent monitoring of serum lithium levels is recommended., 55846=Angioedema, including laryngeal edema, can occur with treatment with ACE inhibitors, especially following the first dose. Patients receiving quinapril and hydrochlorothiazide should be told to report immediately any signs or symptoms suggesting angioedema (swelling of face, eyes, lips, or tongue, or difficulty in breathing) and to take no more drug until after consulting with the prescribing physician., 70578=Quinapril and hydrochlorothiazide should be used cautiously in patients receiving concomitant therapy with other antihypertensives. The thiazide component of quinapril and hydrochlorothiazide may potentiate the action of other antihypertensive drugs, especially ganglionic or peripheral adrenergic-blocking drugs. The antihypertensive effects of the thiazide component may also be enhanced in the postsympathectomy patients., 78566=Quinapril and hydrochlorothiazide tablets are contraindicated in patients who are hypersensitive to quinapril or hydrochlorothiazide and in patients with a history of angioedema related to previous treatment with an ACE, 38098=Clinical studies of quinapril HCl/hydrochlorothiazide did not include sufficient numbers of subjects aged 65 and over to determine whether they respond differently from younger subjects. Other reported clinical experience has not identified differences in responses between the elderly and younger patients. In general, dose selection for an elderly patient should be cautious, usually starting at the low end of the dosing range, reflecting the greater frequency of decreased hepatic, renal, or cardiac function, and of concomitant disease or other drug therapy., 97871=Quinapril and hydrochlorothiazide tablets USP, are fixed-combination tablets that combines an angiotensin-converting enzyme (ACE) inhibitor, quinapril hydrochloride, and a thiazide diuretic, hydrochlorothiazide., 5917=Each film-coated tablet contains quinapril hydrochloride, USP equivalent to 10 mg quinapril and 12.5 mg of hydrochlorothiazide, USP., 64389=In the unusual case that there is no appropriate alternative to therapy with drugs affecting the renin-angiotensin system for a particular patient, apprise the mother of the potential risk to the fetus. Perform serial ultrasound examinations to assess the intra-amniotic environment. If oligohydramnios is observed, discontinue quinapril and hydrochlorothiazide, unless it is considered life-saving for the mother. Fetal testing may be appropriate, based on the week of pregnancy. Patients and physicians should be aware, however, that oligohydramnios may not appear until after the fetus has sustained irreversible injury. Closely observe infants with histories of in utero exposure to quinapril and hydrochlorothiazide for hypotension, oliguria and hyperkalemia (see PRECAUTIONS: Pediatric Use)., 93262=While the principal mechanism of antihypertensive effect is thought to be through the renin-angiotensin-aldosterone system, quinapril exerts antihypertensive actions even in patients with low renin hypertension. Quinapril was an effective antihypertensive in all races studied, although it was somewhat less effective in blacks (usually a predominantly low renin group) than in non-blacks. ACE is identical to kininase II, an enzyme that degrades bradykinin, a potent peptide vasodilator; whether increased levels of bradykinin play a role in the therapeutic effect of quinapril remains to be elucidated., 47057=In patients who are elderly, volume-depleted (including those on diuretic therapy), or with compromised renal function, coadministration of NSAIDs, including selective COX-2 inhibitors, with ACE inhibitors, including quinapril, may result in deterioration of renal function, including possible acute renal failure. These effects are usually reversible. Monitor renal function periodically in patients receiving quinapril and NSAID therapy., 46582=The antihypertensive effect of ACE inhibitors, including quinapril may be attenuated by NSAIDs., 16094=Other clinically important changes in standard laboratory tests were rarely associated with quinapril and hydrochlorothiazide administration. Elevations in uric acid, glucose, magnesium, cholesterol, triglyceride, and calcium (see PRECAUTIONS) have been reported., 80039=In using quinapril and hydrochlorothiazide tablets, consideration should be given to the fact that another angiotensin-converting enzyme inhibitor, captopril, has caused agranulocytosis, particularly in patients with renal impairment or collagen-vascular disease. Available data are insufficient to show that quinapril does not have a similar risk (see WARNINGS: Neutropenia/Agranulocytosis)., 6857=REVISED MARCH 2015 QHCTZ:R6, 14152=Laboratory determinations of serum levels of quinapril and its metabolites are not widely available, and such determinations have, in any event, no established role in the management of quinapril overdose., 90391=Following absorption, quinapril is deesterified to its major active metabolite, quinaprilat (about 38% of oral dose), and to other minor inactive metabolites. Following multiple oral dosing of quinapril, there is an effective accumulation half-life of quinaprilat of approximately 3 hours, and peak plasma quinaprilat concentrations are observed approximately 2 hours postdose. Approximately 97% of either quinapril or quinaprilat circulating in plasma is bound to proteins. Hydrochlorothiazide is not metabolized. Its apparent volume of distribution is 3.6 to 7.8 L/kg, consistent with measured plasma protein binding of 67.9%. The drug also accumulates in red blood cells, so that whole blood levels are 1.6 to 1.8 times those measured in plasma., 51937=The hydrochlorothiazide component of quinapril and hydrochlorothiazide may decrease serum PBI levels without signs of thyroid disturbance., 90932=The rate of quinapril absorption was reduced by 14% when quinapril and hydrochlorothiazide tablets were administered with a high fat meal as compared to fasting, while the extent of absorption was not affected. The rate of hydrochlorothiazide absorption was reduced by 12% when quinapril and hydrochlorothiazide tablets were administered with a high fat meal, while the extent of absorption was not significantly affected. Therefore, quinapril and hydrochlorothiazide tablets may be administered without regard to food., 70132=In patients at risk of excessive hypotension, therapy with quinapril and hydrochlorothiazide should be started under close medical supervision. Such patients should be followed closely for the first 2 weeks of treatment and whenever the dosage of quinapril or diuretic is increased. Similar considerations may apply to patients with ischemic heart or cerebrovascular disease in whom an excessive fall in blood pressure could result in myocardial infarction or cerebrovascular accident., 71098=Symptomatic hypotension sometimes associated with oliguria and/or progressive azotemia, and rarely acute renal failure and/or death, include patients with the following conditions or characteristics: heart failure, hyponatremia, high dose diuretic therapy, recent intensive diuresis or increase in diuretic dose, renal dialysis or severe volume and/or salt depletion of any etiology. Volume and/or salt depletion should be corrected before initiating therapy with quinapril and hydrochlorothiazide., 6253=Quinapril and Hydrochlorothiazide Tablets, USP 10 mg/ 12.5 mg, 89621=Some placental passage occurred when quinapril was administered to pregnant rats. Studies in rats indicate that quinapril and its metabolites do not cross the blood-brain barrier. Hydrochlorothiazide crosses the placenta freely but not the blood-brain barrier., 85248=Therapeutic effects of quinapril appear to be the same for elderly (≥ 65 years of age) and younger adult patients given the same daily dosages, with no increase in adverse events in elderly patients. In patients with hypertension, quinapril 10 mg to 40 mg was similar in effectiveness to captopril, enalapril, propranolol, and thiazide diuretics., 97625=Quinapril hydrochloride, USP is chemically described as [3S-[2[R*(R*)], 3R*]]-2-[2-[[1-(ethoxycarbonyl)-3-phenylpropyl]amino]-1-oxopropyl]-1,2,3,4-tetrahydro-3-isoquinolinecarboxylic acid, monohydrochloride. Its molecular formula is C25H30N2O5 ·  HCl and its structural formula is:, 3733=Each film-coated tablet contains quinapril hydrochloride, USP equivalent to 20 mg quinapril and 12.5 mg of hydrochlorothiazide, USP., 65381=Use of drugs that act on the renin-angiotensin system during the second and third trimesters of pregnancy reduces fetal renal function and increases fetal and neonatal morbidity and death. Resulting oligohydramnios can be associated with fetal lung hypoplasia and skeletal deformations. Potential neonatal adverse effects include skull hypoplasia, anuria, hypotension, renal failure and death. When pregnancy is detected, discontinue quinapril and hydrochlorothiazide as soon as possible. These adverse outcomes are usually associated with use of these drugs in the second and third trimester of pregnancy. Most epidemiologic studies examining fetal abnormalities after exposure to antihypertensive use in the first trimester have not distinguished drugs affecting the renin-angiotensin system from other antihypertensive agents. Appropriate management of maternal hypertension during pregnancy is important to optimize outcomes for both mother and fetus., 1551=Each film-coated tablet contains quinapril hydrochloride, USP equivalent to 20 mg quinapril and 25 mg of hydrochlorothiazide, USP., 12845=As individual monotherapy, quinapril is an effective treatment of hypertension in once-daily doses of 10 mg to 80 mg and hydrochlorothiazide is effective in doses of 12.5 mg to 50 mg. In clinical trials of quinapril/hydrochlorothiazide combination therapy using quinapril doses of 2.5 mg to 40 mg and hydrochlorothiazide doses of 6.25 mg to 25 mg, the antihypertensive effects increased with increasing dose of either component., 91631=The rate and extent of absorption of quinapril and hydrochlorothiazide from quinapril and hydrochlorothiazide tablets are not different, respectively, from the rate and extent of absorption of quinapril and hydrochlorothiazide from immediate-release monotherapy formulations, either administered concurrently or separately. Following oral administration of quinapril (monotherapy) tablets, peak plasma quinapril concentrations are observed within 1 hour. Based on recovery of quinapril and its metabolites in urine, the extent of absorption is at least 60%. The absorption of hydrochlorothiazide is somewhat slower (1 to 2.5 hours) and more complete (50% to 80%)., 52523=NOTE: As with many other drugs, certain advice to patients being treated with quinapril is warranted. This information is intended to aid in the safe and effective use of this medication. It is not a disclosure of all possible adverse or intended effects., 13926=No data are available to suggest physiological maneuvers (e.g., maneuvers to change the pH of the urine) that might accelerate elimination of quinapril and its metabolites. Hemodialysis and peritoneal dialysis have little effect on the elimination of quinapril and quinaprilat., 14907=The oral median lethal dose of quinapril/hydrochlorothiazide in combination ranges from 1063/664 to 4640/2896 mg/kg in mice and rats. Doses of 1440 to 4280 mg/kg of quinapril cause significant lethality in mice and rats. In single-dose studies of hydrochlorothiazide, most rats survived doses up to 2.75 g/kg., 10893=Patients whose blood pressures are not adequately controlled with quinapril monotherapy may instead be given quinapril and hydrochlorothiazide tablets 10 mg/12.5 mg or 20 mg/12.5 mg. Further increases of either or both components could depend on clinical response. The hydrochlorothiazide dose should generally not be increased until 2 to 3 weeks have elapsed. Patients whose blood pressures are adequately controlled with 25 mg of daily hydrochlorothiazide, but who experience significant potassium loss with this regimen, may achieve blood pressure control with less electrolyte disturbance if they are switched to quinapril and hydrochlorothiazide tablets 10 mg/12.5 mg or 20 mg/12.5 mg., 25348=Angioedema has been reported in 0.1% of patients receiving quinapril (0.1%) (see WARNINGS)., 54424=A patient receiving quinapril and hydrochlorothiazide should be cautioned that lightheadedness can occur, especially during the first days of therapy, and that it should be reported to the prescribing physician. The patient should be told that if syncope occurs, quinapril and hydrochlorothiazide should be discontinued until the physician has been consulted., 8484=Quinapril and Hydrochlorothiazide Tablets, USP are available containing quinapril 10 mg and hydrochlorothiazide 12.5 mg, quinapril 20 mg and hydrochlorothiazide 12.5 mg or quinapril 20 mg and hydrochlorothiazide 25 mg., 87871=The pharmacokinetics of quinapril and quinaprilat are linear over a single-dose range of 5 mg to 80 mg doses and 40 mg to 160 mg in multiple daily doses., 63328=No teratogenic effects of quinapril were seen in studies of pregnant rats and rabbits. On a mg/kg basis, the doses used were up to 180 times (in rats) and one time (in rabbits) the maximum recommended human dose. No teratogenic effects of quinapril and hydrochlorothiazide were seen in studies of pregnant rats and rabbits. On a mg/kg (quinapril/hydrochlorothiazide) basis, the doses used were up to 188/94 times (in rats) and 0.6/0.3 times (in rabbits) the maximum recommended human dose., 78102=Do not coadminister quinapril and hydrochlorothiazide tablets with aliskiren:, 17826=Increases (> 1.25 times the upper limit of normal) in serum creatinine and blood urea nitrogen were observed in 3% and 4%, respectively, of patients treated with quinapril and hydrochlorothiazide. Most increases were minor and reversible, which can occur in patients with essential hypertension but most frequently in patients with renal artery stenosis (see PRECAUTIONS)., 48327=Simultaneous administration of tetracycline with quinapril reduced the absorption of tetracycline by approximately 28% to 37%, possibly due to the high magnesium content in quinapril tablets. This interaction should be considered if coprescribing quinapril and tetracycline or other drugs that interact with magnesium., 96945=Quinapril hydrochloride is a white to off-white amorphous powder that is freely soluble in aqueous solvents., 38703=Because of the potential for serious adverse reactions in nursing infants from hydrochlorothiazide and the unknown effects of quinapril in infants, a decision should be made whether to discontinue nursing or to discontinue quinapril and hydrochlorothiazide, taking into account the importance of the drug to the mother., 55087=Female patients of childbearing age should be told about the consequences of exposure to quinapril and hydrochlorothiazide during pregnancy. Discuss treatment options with women planning to become pregnant. Patients should be asked to report pregnancies to their physicians as soon as possible., 68191=In clinical studies in hypertensive patients with unilateral renal artery stenosis, treatment with ACE inhibitors was associated with increases in blood urea nitrogen and serum creatinine; these increases were reversible upon discontinuation of ACE inhibitor, concomitant diuretic, or both. When such patients are treated with quinapril and hydrochlorothiazide, renal function should be monitored during the first few weeks of therapy., 82976=Quinapril and hydrochlorothiazide tablets, USP are indicated for the treatment of hypertension, to lower blood pressure. Lowering blood pressure reduces the risk of fatal and nonfatal cardiovascular events, primarily strokes and myocardial infarctions. These benefits have been seen in controlled trials of antihypertensive drugs from a wide variety of pharmacologic classes including the class to which this drug principally belongs. There are no controlled trials demonstrating risk reduction with quinapril and hydrochlorothiazide tablets.}",
    "textBeforeTable": "Number of versions: 7 QUINAPRIL HYDROCHLORIDE AND HYDROCHLOROTHIAZIDE- quinapril hydrochloride and hydrochlorothiazide tablet, film coated View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Mylan Pharmaceuticals Inc. (059295980) 02/26/2007 ANDA077093 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 90 in 1 BOTTLE, PLASTIC; Type 0: Not a Combination Product",
    "textAfterTable": "RxNorm QUINAPRIL HYDROCHLORIDE AND HYDROCHLOROTHIAZIDE- quinapril hydrochloride and hydrochlorothiazide tablet, film coated RxCUI RxNorm NAME RxTTY 1 310796 quinapril 10 MG / hydrochlorothiazide 12.5 MG Oral Tablet PSN 2 310796 Hydrochlorothiazide 12.5 MG / quinapril 10 MG Oral Tablet SCD 3 310796 HCTZ 12.5 MG / quinapril (as quinapril hydrochloride) 10 MG Oral Tablet SY 4 310796 HCTZ 12.5 MG / quinapril 10 MG Oral Tablet SY 5 310797 quinapril 20 MG / hydrochlorothiazide 12.5 MG Oral Tablet PSN 6 310797 Hydrochlorothiazide 12.5 MG / quinapril 20 MG Oral Tablet SCD 7 310797 HCTZ 12.5 MG / quinapril (as quinapril hydrochloride) 20 MG Oral Tablet SY 8 310797 HCTZ 12.5 MG / quinapril 20 MG Oral Tablet SY 9 310809 quinapril 20 MG / hydrochlorothiazide 25 MG Oral Tablet PSN 10 310809 Hydrochlorothiazide 25 MG / quinapril 20 MG Oral Tablet SCD 11 310809 HCTZ 25 MG / quinapril (as quinapril hydrochloride) 20 MG Oral Tablet SY 12 310809 HCTZ 25 MG / quinapril 20 MG Oral Tablet SY",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}