{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "greek life is very fun and can be a great way to improve your social life.",
            "uic offers a variety of clubs pertaining to every culture and way of life.",
            "millennium park is beautiful and has many things going on in the summer. all of the museums have free days a couple times a month. navy pier is always fun to walk around, enjoy the scenery. also there are many comedy clubs throughout the city, and improv clubs in places like wicker park.",
            "chi city is your backyard. you are given a u-pass, which allows you to ride all transportation for free. there is so much to do in the city,in the summer and winter. also many students have apartments on campus, so there is always something going on the weekends. greek life is also very fun.",
            "the food is decent, it could be better.",
            "the dorm life is very laid-back. it all depends on the people you meet. it is a commuter school so not that many dorm, and also many people go home on the weekends. if you find the right group of people you will be set.",
            "the curriculum is challenging at times, but can also be very laid back. if you know what your major is then uic will put you on the right track in order to fufil those requirements. if you are undecided you are given many options to help you figure it out.",
            "if you are not a city person, do not attend here. use all the help resources you are offered. so many people are here to help you and it is a shame to not use that to your advantage.",
            "the university of illinois at chicago is living up to my expectations. i love the campus and having the city as my backyard. the classes are challenging yet work-able."
        ]
    ],
    "pageTitle": "University of Illinois at Chicago (UIC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Illinois-at-Chicago/reviews?_escaped_fragment_=/show/90881",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911029427,
    "recordOffset": 910893732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{759384=© 2015, Cappex.com, LLC, 652382=This year on the 5th of November, a student painted the V for Vendetta symbol on a stone wall near the university's Quad., 338769=The Illinois Sheriff's Department has members working 24/7 on campus to ensure safety. Also, there are 1400 emergency call stations across campus which allow immediate Police assistance with the push of a button., 430279=Due to it being so close to downtown Chicago, UIC campus security is very efficient in the sense that they do the best job possible to keep students safe. You do get the crime alert reports but most of the time it's because a student was being risky and was walking at 3:00 am by himself., 329234=My Freshmen yr in 2010, food was crappy, however returning my sophomore year the CAF was completely redone and the food got alot better. The staff is very friendly and its best to develop close relationships with them!, 295429=The professors are brilliant, campus is nice, it's in the city, and it's right next to the train! I took the summer program offered for incoming freshman and met so many new people, I already feel comfortable going to college and I'll be a freshman this August.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 65 out of 65 people found this review useful. 1 person found this inaccurate. 1 of 177 Lester from River Grove, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Tips for prospective students Consider living in some sort of apartment rather than in the commons buildings. The dorm hall JST is more expensive, but a lot nicer. Bang for the buck The education is great, especially if you are in the medical professional field. The dorms are way overpriced. Apartments in the area may seem expensive, but in the end it is about the same price to live in a dorm for 8 months as it is to live in an apartment for 12. Money will be best spent living in JST, MRH, or TBH. The commons halls need lots of work. Am enjoying being here There are a lot of great campus activities, and being in the city is sure a plus. There are frequent crime alerts, but if you carefully plan your trips and stay in good areas you will be fine. The cheaper dorms are sub par. There was always something broken in the bathrooms on my floor which caused frequent flooding, but the work staff was usually pretty good about getting it done. The campus scenery isn't something to brag about; most of the buildings are tan with black windows. Am learning a lot The teachers",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}