{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Blue lights all throughout campus and campus police on campus",
            "There are many different Greeks every social Greek and also academic fraternities and sororities",
            "Over 250 clubs and organizations and you can create your own.",
            "People who are interested in learning Making memories Getting the bet college experience",
            "The annual Hawk rock, basically a team all day dance competition. Great workout great laugh great way to get involved.",
            "If you utilize your time well, IUP offers so many opportunities for advancement that you really get your money worth. And it is becoming a completely upgrades campus.",
            "There are always events on campus that are posted on our website or sent to your IUP e-mail in the beak. Also flyers are flooded throughout every building so every student knows",
            "Many dining halls and in the process of building a new dining hall for next year",
            "Suite style living",
            "Teachers are truly interested in students learning",
            "It's a wonderful school to get involved in if you are truly interested in mastering your field . Many organizations and clubs to get involved in. Teachers work well with you because the class size is average do there are always office hours and there are all types of free tutoring opportunities.",
            "IUP has a great academic program in each major. Great study abroad programs and tutoring assistance."
        ]
    ],
    "pageTitle": "Indiana University of Pennsylvania (IUP) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-University-of-Pennsylvania-Main-Campus/reviews?_escaped_fragment_=/show/34125",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904630615,
    "recordOffset": 904508413,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{632415=It's affordable. That said, you may have to take out loans if you do not get sufficient financial aid (this happens especially if you live in on-campus housing). My loans have averaged $1000 per semester. Also, the quality of education will depend on the department/major you are in. The Education department and Nursing programs have notable and excellent programs, while some others are very lacking in terms of instructor quality and rigor., 700862=© 2015, Cappex.com, LLC, 10966=Expect cold weather in October, but mostly expect amazing unity. The IUP campus is big and holds 14,000 students, but you feel so involved when you are here. Whether you join the paper or just play frisbee with friends in the Oak Grove, you will see how unified the students are.}",
    "textBeforeTable": "07/30/2009 Reviewer is A current student here. 16 out of 17 people found this review useful. 1 of 155 Laura from PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck It's cheap compared to other schools in Pennsylvania. What to do for fun You could go hang out at Indiana Mall or Walmart. There are also some interesting stores along with the Jimmy Stewart Museum on Philadelphia Street in downtown Indiana. Food and Dining The quality of the food depends on where you go. Fosters Dining Hall's food isn't so great, but it is buffet style. The HUB (our student union) has a make-your-own pasta and salad places along with a hamburger place, Chick-Fil-A, and a sandwich shop. Folgers Dining Hall has a pizza place, a wrap station, oriental food, home foods, Quiznos, and Starbucks. You can used meal swipes at most places and flex to cover the rest. Dorm Life The suites are brand new! You can have your own bedroom, the kitchens are furnished with a microwave and mini-fridge, and you have a bathroom located in your suite. You are spoiled at IUP as far as dorming goes. Academic Rigor I have found most of my classes to be fairly moderate in the difficulty and workload. English 101 is killer, some",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}