{
    "relation": [
        [
            "Patent application number",
            "20140025529",
            "20140326537"
        ],
        [
            "Description",
            "Systems and Methods for Generating Three-Dimensional Product Configuration - Computer-based systems and methods for the creation and design of custom products in real time that provides sales implementation functionality are provided. A visual design tool can provide a user the capability to configure in real time a three-dimensional product configuration using gestural, affordance-based construction techniques. The visual design tool can provide a navigable and interactive three-dimensional visualization of the product configuration. Once the design of the product configuration is complete, sales implementation information can be generated for the custom product. The sales implementation information can include, for instance, a specification, a bill of materials, engineering drawings for the product, a quote for fabrication and delivery of the product, and other information. On approval of the quote, the product can be ordered. The time from initiation of the customization to placing the order may be no more than a few minutes.",
            "MOBILE ACCESS UNIT AND CAGE - Fall restraint equipment comprising a mobile access unit having a mobile platform portion, a ladder portion, and a cage portion. The components of the fall restraint equipment are formed from butterflying, lasering, cutting, bending, and/or stamping continuous pieces of tubular and sheet metal. The components of the mobile access unit are modular and include adapters of varying height that cause the mobile access unit to exhibit varying height."
        ],
        [
            "Published",
            "01-23-2014",
            "11-06-2014"
        ]
    ],
    "pageTitle": "Honeycutt, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/honeycutt-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437712527,
    "recordOffset": 437694416,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Robert Honeycutt, Pawleys Island, SC US //]]> BarDraw('2678491',['Patent applications by Rob Honeycutt, Berkeley, CA US'],[[1,2,1,1,2,3]],['2009','2010','2011','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2678491\" align=\"center\"></div> </div> <canvas id=\"bg2678491\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Rob Honeycutt, Berkeley, CA US</p> <div class=\"bar2678491\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-17-2014</td> <td><a href=\"/patents/app/20140198929\">MAGNETIC EARPHONES HOLDER</a> - A set of headphones and audio system comprises a first set of buttons for controlling a volume level of transmitted audio to the headphones and a second set of buttons for controlling a volume level of external audio played by the headphones. The transmitted audio comprises audio received from an audio source such as an electronic device and the external audio comprises surrounding ambient noise received by a microphone coupled to the headphones. With the first set of controls and the second set of controls a user is able to adjust the volume level of the transmitted audio and the volume level of the external audio in order to listen to the transmitted audio while still interacting with the surrounding environment.</td> <td>20140198929</td> <tr> </tr> <td>06-19-2014</td> <td><a href=\"/patents/app/20140165338\">HEADSET CORD HOLDER</a> - A system for holding a headset cord comprises a female side, a male side that releasably couples to the female side and a first groove that receives and releasably holds a cord. In some embodiments, the male side comprises a cover which removably couples to a surface of the male side to cover the headset cord",
    "textAfterTable": "Robert W. Honeycutt, Pawleys Island, SC US Patent application number Description Published 20090144916 A GANGWAY AND METHOD FOR MANUFACTURING SAME - A gangway comprises at least one component formed from a continuous piece of metal. The at least one component formed from the continuous piece of metal may be a support structure or an underbody, a platform, a ramp, a step, or other support surface. A method for manufacturing such a gangway comprises forming the at least one component from the continuous piece of metal. 06-11-2009 20100031455 Fall Restraint Equipment Component and Method for Manufacturing the Same - Uprights and lateral or connecting posts to be used in conjunction with a gangway or other fall restraint equipment where the uprights and posts are created by cutting portions of integral, continuous pieces of tubular metal rather than welding smaller pieces of stock material together. Sidepost assemblies or handrails are created by connecting the uprights and posts together. 02-11-2010 20100031456 FALL RESTRAINT EQUIPMENT COMPONENT AND METHOD FOR MANUFACTURING THE SAME - A post to be used in conjunction with a gangway or other fall restraint equipment where the post defines an aperture having an upper portion and a lower portion such that the upper portion is configured to allow a link of a chain to pass there through while the lower portion allows the link to pass through in one orientation but prevents the link from passing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}