{
    "relation": [
        [
            "Bank",
            "",
            "",
            ""
        ],
        [
            "Account No.",
            "8601959483",
            "562834631688",
            "12029010070876"
        ],
        [
            "Account Name",
            "MPWS RICH RESOURCES SDN BHD",
            "MPWS RICH RESOURCES SDN BHD",
            "MPWS RICH RESOURCES SDN BHD"
        ]
    ],
    "pageTitle": "DAFTAR SEKARANG | Bengkel Sehari Asas SPSS",
    "title": "",
    "url": "http://postgraduateworkshop.com/spss/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 192914918,
    "recordOffset": 192906716,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5391=8.30 a.m. - 1030 a.m., 5002=10.30 a.m. - 1045 a.m., 2188=Dr. Othman bin Talib, B.Sc (UKM), M.Sc (UPM), EdD (Adelaide) completed his secondary and post-secondary education at the King George V Secondary School, Seremban and the Matriculation Centre, University Kebangsaan Malaysia (UKM). He completed his first degree in Chemistry from UKM in 1986. He then appointed as a Chemist (temporary basis). A year later, he was appointed as a Chemistry teacher at the Matriculation Centre, University Putra Malaysia (UPM). He completed his Master in Pedagogy from UPM in 1999 and then in February 2000, was appointed as a lecturer with the Faculty of Educational Studies, UPM. He pursued his study at the University of Adelaide, Australia and obtained the Doctor of Education degree in 2007.}",
    "textBeforeTable": "Step 1: Payment Details Make payment using Online Transfer / ATM Transfer / Cash Deposit / Cheque Deposit to the following account: --> } font-size: 12px; font-family: Arial, Helvetica, sans-serif; .style15 { .style14 {font-size: 12px} } margin-bottom: 0px; margin-top: 0px; body { .style13 {font-family: Arial, Helvetica, sans-serif}",
    "textAfterTable": "* You need to put the email mpws.training@gmail.com as the 3rd party email when making payment through CIMB Clicks / Maybank2u / BankIslam.biz and others. IMPORTANT: Make sure you always keep a record of transaction e.g. receipt for ATM Transfer / Cash Deposit / Cheque Deposit or print screen / PDF for Online Transaction as an evidence of payment during the registration. INSTRUCTION: Please provide your transaction details e.g. reference number, etc. at the row of 'Proof of Payment Transaction'. [IMPORTANT] Step 2: Instruction for Verification of Proof of Payment Make sure you fill in the verification of your payment. You need to provide your booking details and proof of payment for us to track your registration and payment. IMPORTANT NOTICE Due to the current Yahoo email anti-spoofing policy, we will not receive the notification email regarding your inquiry/request for quotation if you insert your Yahoo email in the Email Address column below. Here are the alternatives that you can follow to overcome the problem and ensure the smoothness of the process: 1. Use other",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}