{
    "relation": [
        [
            "Round",
            "First Round",
            "Second Round",
            "Quarterfinals"
        ],
        [
            "Opponent",
            "Nikolay Davydenko",
            "David Ferrer",
            "Gael Monfils"
        ],
        [
            "W / L",
            "Win",
            "Win",
            "Loss"
        ],
        [
            "Result",
            "6-4, 6-4",
            "6-4, 7-5",
            "2-6, 1-6"
        ]
    ],
    "pageTitle": "NBC Sports",
    "title": "",
    "url": "http://scores.nbcsports.msnbc.com/tennis/players.asp?tour=ATP&id=382240",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 206492848,
    "recordOffset": 206476454,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Birthplace: Deggendorf, West Germany Weight: 203 Handedness: Right Handed Born: 7/17/1987 Height: 6-5 Country: Germany Daniel Brands Select Other Player Aguilar, Jorge Albot, Radu Ali Mutawa, Jabor Mohammed Almagro, Nicolas Al Mutawa, Jabor Altamirano, Collin Alund, Martin Alves, Thiago Amritraj, Prakash Anderson, Kevin Andreev, Igor Andreozzi, Guido Andujar, Pablo Arguello, Facundo Arnabaldi, Andrea Arnaboldi, Andrea Artunedo Martinavarr, Andres Authom, Maxime Awadhy, Omar Bachinger, Matthias Baghdatis, Marcos Bagnis, Facundo Bai, Yan Baker, Brian Baker, Jamie Balazs, Attila Balleret, Benjamin Baluda, Victor Barrientos, Nicolas Basic, Mirza Basilashvili, Nikoloz Battistone, Brian Bautista Agut, Roberto Beck, Andreas Beck, Karol Becker, Benjamin Bedene, Aljaz Bednarek, Tomasz Bellucci, Thomaz Bemelmans, Ruben Benneteau, Julien Berankis, Ricardas Berdych, Tomas Berlocq, Carlos Berrer, Michael Betov, Sergey Bhambri, Yuki Bhupathi, Mahesh Biryukov, Mikhail Blake, James Bogaerts, Romain Bogomolov Jr., Alex Bohli, Stephane Bolelli, Simone Bopanna, Rohan Bossel, Adrien Bozoljac, Ilija Bracciali, Daniele Brands, Daniel Broady,",
    "textAfterTable": "AEGON Championships Surface: Grass Date: Jun. 9 - Jun. 15 Seed: None Round Opponent W / L Result First Round Sergiy Stakhovsky Loss 5-7, 2-6 Roland Garros Surface: Red Clay Date: May 25 - Jun. 8 Seed: None Round Opponent W / L Result First Round Andreas Haider-Maurer Loss 6-4, 6-4, 2-6, 3-6, 4-6 Sony Open Tennis Surface: Hard Date: Mar. 18 - Mar. 30 Seed: None Round Opponent W / L",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}