{
    "relation": [
        [
            "Modifier and Type",
            "class",
            "class"
        ],
        [
            "Class and Description",
            "GreekLowerCaseFilter Normalizes token text to lower case, removes some Greek diacritics, and standardizes final sigma to sigma.",
            "GreekStemFilter A TokenFilter that applies GreekStemmer to stem Greek words."
        ]
    ],
    "pageTitle": "Uses of Class org.apache.lucene.analysis.TokenStream (Lucene 3.6.1 API)",
    "title": "Subclasses of TokenStream in org.apache.lucene.analysis.el",
    "url": "http://lucene.apache.org/core/3_6_1/api/all/org/apache/lucene/analysis/class-use/TokenStream.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 142708043,
    "recordOffset": 142681882,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 21 Jul 2012 21:36:56 GMT",
    "textBeforeTable": "Uses of TokenStream in org.apache.lucene.analysis The highlight package contains classes to provide \"keyword in context\" features typically used to highlight search terms in the text of results pages. org.apache.lucene.search.highlight A simple query parser implemented with JavaCC. org.apache.lucene.queryParser High-performance single-document main memory Apache Lucene fulltext search index. org.apache.lucene.index.memory Expert: attributes streaming definition for indexing facets Steaming of facets attributes is a low level indexing interface with Lucene indexing. org.apache.lucene.facet.index.streaming Taxonomy. CategoryAttribute's to a given document using a CategoryPath's or Indexing of document categories Attachment of org.apache.lucene.facet.index AssociationProperty's). CategoryEnhancement for adding associations data to the index (categories with Association category enhancements A org.apache.lucene.facet.enhancements.association Enhanced category features Mechanisms for addition of enhanced category features. org.apache.lucene.facet.enhancements Document for indexing and searching. The logical representation of a",
    "textAfterTable": "TokenStream from a canned list of Tokens. class  CharTokenizer An abstract base class for simple, character-oriented tokenizers. class  EmptyTokenizer Emits no tokens class  FilteringTokenFilter Abstract base class for TokenFilters that may remove tokens. class  ISOLatin1AccentFilter Deprecated.  If you build a new index, use ASCIIFoldingFilter which covers a superset of Latin 1. This class is included for use with existing indexes and will be removed in a future release (possibly Lucene 4.0). class  KeywordMarkerFilter Marks terms as keywords via the KeywordAttribute. class  KeywordTokenizer Emits the entire input as a single token. class  LengthFilter Removes words that are too long or too short from the stream. class  LetterTokenizer A LetterTokenizer is a tokenizer that divides text at non-letters. class  LimitTokenCountFilter This TokenFilter",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}