{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Personalised Blue BOW White Wedding Garter Bridal | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/PERSONALISED-Blue-Bow-White-Wedding-Garter-Bridal-/280813542213?pt=AU_Wedding_Clothing&hash=item4161ca9b45",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420067943,
    "recordOffset": 420026406,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The seller won't accept returns for this item. Return policy details Return policy business days of receiving cleared payment - opens in a new window or tab. Will usually send within 10 Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will",
    "textAfterTable": "Seller's payment instructions Please also send me your personalisation details Please include what you would like printed on the: Left side of bow: Right side of bow: and what charm you would like: you can either leave a message in checkout or send me a message using the \"ask a question\" link Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}