{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "File No.",
            "Release Nos.",
            ""
        ],
        [
            "regulations.gov",
            "2014-07356",
            "3235-AK37",
            "S7-08-10",
            "33-9568",
            "34-71830"
        ]
    ],
    "pageTitle": "17 CFR 240.17Ad-4 - Applicability of | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/17/240.17AD-4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911776352,
    "recordOffset": 911760393,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1004=Title 17 published on 2014-04-01}",
    "TableContextTimeStampAfterTable": "{31985=124 Stat. 1376, 72073=On February 25, 2014, the Securities and Exchange Commission re-opened the comment period on two releases related to asset-backed securities. The Commission re-opened the comment period to permit interested persons to comment on an approach for the dissemination of potentially sensitive asset-level data. The comment period is scheduled to end on March 28, 2014. In light of public interest in providing comment on the approach, the Commission is extending the comment period until April 28, 2014 to permit interested persons additional time to analyze and comment on the approach., 13343=The Securities and Exchange Commission (“SEC” or “Commission”) is adopting rules and providing guidance to address the application of certain provisions of the Securities Exchange Act of 1934 (“Exchange Act”) that were added by Subtitle B of Title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), to cross-border security-based swap activities. These rules and guidance in large part focus on the application of the Title VII definitions of “security-based swap dealer” and “major security-based swap participant” in the cross-border context. The Commission also is adopting a procedural rule related to the submission of applications for substituted compliance. In addition, the Commission is adopting a rule addressing the scope of our authority, with respect to enforcement proceedings, under section 929P of the Dodd-Frank Act., 61581=The Securities and Exchange Commission (“SEC” or “Commission”) proposes to amend Rule 17Ad-22 and add Rule 17Ab2-2 pursuant to Section 17A of the Securities Exchange Act of 1934 (“Exchange Act”) and the Payment, Clearing, and Settlement Supervision Act of 2010 (“Clearing Supervision Act”), adopted in Title VIII of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”). Among other things, the proposed rules would establish standards for the operation and governance of certain types of registered clearing agencies that meet the definition of a “covered clearing agency.”, 23757=The Securities and Exchange Commission published a document in the Federal Register of January 8, 2014 that contained an incorrect instruction. This correction is being published to correct instruction 5.b in that document., 31593=§ 1350 - Failure of corporate officers to certify financial reports, 66597=In accordance with the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), the Securities and Exchange Commission (“Commission”), pursuant to the Securities Exchange Act of 1934 (“Exchange Act”), is proposing recordkeeping, reporting, and notification requirements applicable to security-based swap dealers (“SBSDs”) and major security-based swap participants (“MSBSPs”), securities count requirements applicable to certain SBSDs, and additional recordkeeping requirements applicable to broker-dealers to account for their security-based swap and swap activities. The Commission also is proposing an additional capital charge provision that would be added to the proposed capital rule for certain SBSDs. Finally, the Commission is proposing technical amendments to the broker-dealer recordkeeping, reporting, and notification requirements.}",
    "lastModified": "Sat, 20 Sep 2014 05:17:57 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 55078 - Nationally Recognized Statistical Rating Organizations 2014-09-15; vol. 79 # 178 - Monday, September 15, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 17. Title 17 published on 2014-04-01 [42 FR 32413, June 24, 1977, as amended at 48 FR 28246, June 21, 1983] 78w(a))) 78q-1 and 78q, 15 U.S.C. 78b, (Secs. 2, 17, 17A and 23(a) ( Within five business days following the close of each month, every exempt transfer agent shall calculate the number of items which it received during the preceding six months. Whenever any exempt transfer agent no longer qualifies as such under paragraph (b)(1), within ten business days after the end of such month: (1) It shall prepare",
    "textAfterTable": "SECURITIES AND EXCHANGE COMMISSION Final rules. This rule is effective November 14, 2014; except the amendments to § 240.17g-3(a)(7) and (b)(2) and Form NRSRO, which are effective on January 1, 2015; and the amendments to § 240.17g-2(a)(9), (b)(13) through (15), § 240.17g-5(a)(3)(iii)(E), (c)(6) through (8), § 240.17g-7(a) and (b), and Form ABS-15G, which are effective June 15, 2015. The addition of §§ 240.15Ga-2, 240.17g-8, 240.17g-9, 240.17g-10, and Form ABS Due Diligence-15E are effective June 15, 2015. 17 CFR Parts 232, 240, 249, and 249b Summary In accordance with the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”) and to enhance oversight, the Securities and Exchange Commission (“Commission”) is: adopting amendments to existing rules and new rules that apply to credit rating agencies registered with the Commission as nationally recognized statistical rating organizations (“NRSROs”); adopting a new rule and form that apply to providers of third-party due diligence services for asset-backed securities; and adopting amendments to existing rules and a new rule that implement a requirement added by the Dodd-Frank Act that issuers and underwriters of asset-backed securities make publicly available the findings and conclusions of any third-party due diligence report obtained by the issuer or underwriter. The Commission also is adopting certain technical amendments to existing rules.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}