{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "SafeWalk ensures you never have to walk home alone. There are safety 'stations' visible from any point on campus that you can use to reach RCMP and campus security. I always feel safe. The only issue is bike theft. But this usually only occurs to unlocked or really nice bikes.",
            "A large and active Greek life at UBC. The fraternities and sororities dominate a portion of campus life both physically and enthusiastically. A very involved aspect of the UBC community.",
            "A million and a half clubs are available with over thirty different culture clubs. There will be definitely something you enjoy as a club at UBC. I personally and a part of 5 clubs and that is after I cut a few from my list. Never a dull moment at UBC.",
            "All types of students will thrive at UBC. If you need extra help, it is readily available. If you don't, even better. You can even take many courses online as well.",
            "The yearly Ski and Board Undie Run is one of my favorite traditions. Everyone strips down and runs a 5km run around campus during final exam season. It relieves stress; all clothes get donated to a charity and it finishes with a jump in the outdoor pool (not sanctioned by the school)",
            "Living on campus can be expensive, but the location is worth it.",
            "My favorite past time is heading up to Whistler but I also enjoy hitting up the beach or seeing sweet concerts at local venues. Vancouver is definitely a culture hub in Canada.",
            "The residence cafeteria will spoil you with options. As well, they provide lots of options for food restrictions.",
            "The dorms are 5 minutes away from north america's biggest nude beach. Need I say more?",
            "Very academically rigorous. Sometimes other students will get too competitive over marks and lab scores.",
            "For prospective students, this is the school for you if you enjoy a wide variety of activities from athletics to educational opportunities. It's a great location being close to the mountains (a bus ride away from whistler) and not far from downtown. Living on campus is 5 minutes away from the beach. This is a great school and you will not regret going here!",
            "A great variety of opportunities with clubs and extracurriculars. The rivalry between faculties leads to a negative sense of community. The facilities are great and provide with great access for you education."
        ]
    ],
    "pageTitle": "University of British Columbia Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-British-Columbia/reviews?_escaped_fragment_=/show/103087",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899178155,
    "recordOffset": 899137250,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27222=It is a top 30 school for the price of a top 1000 school. Tuition is affordable and is cheaper than a private school in the states., 17375=Vancouver is a great city to live in so if you're looking for some fun, you can take a fourty minute bus to get to the buzzing down town area. However if you're looking for more outdoorsy fun, there is a beach right next to campus which is always crowded around summer time. There's also skiing and snowboarding available 40 minutes away, or if you're really serious about winter sports, there's Whistler, the host of the 2010 winter olympics., 73532=It may not be such a challenge to get accepted, however, it's staying in the university that is the challenge. It's a huge campus and lots of walking involved if you live in campus. Don't be deceived by the University advertisements, it rains all the time and the sun only comes out in April., 94176=-The Undie Run is an unusual tradition, but fun! Around March/April students gather together late one night and strip down to their underwear to do a rowdy lap around popular spots on campus. The run usually ends with students jumping in to the outdoor pool and the clothes are donated to a charity or local cause., 133836=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/22/2012 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 27 Mona from Canada Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if",
    "textAfterTable": "Login to rate or flag the reviews Rachel from Canada 04/16/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 27 Categories Comments Campus Safety UBC has campus safe walk where you can pick up a phone at a designated location (or by cell phone) and request an security escort if you feel unsafe. In general, the campus is far safer than the city. The biggest concern here is petty crime, which makes up about 90% of all crime in Vancouver. Violent crimes are extremely rare. The only time I have ever had a bad experience was when I lived off-campus in east Vancouver (the shady side of town). My suggestion is to be aware of your surroundings and the risks associated with the different parts of town. In general, the campus is quite safe and I occasionally stick my daughter in her stroller and take her for an evening jog. I have never felt unsafe. Clubs and Activities Too",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}