{
    "relation": [
        [
            "Objective Example",
            "Manage traffic approaching incident scene",
            "Contain and remove fuel spill"
        ],
        [
            "Strategies",
            "Deploy standard traffic control Disseminate traveler information Determine need to implement an alternate route Patrol traffic queues to prevent/respond to secondary incidents",
            "Prevent fuel from entering highway drainage facilities Stop additional fuel spill at source Transfer remaining fuel to empty tanker Apply and remove absorbent"
        ]
    ],
    "pageTitle": "FHWA Office of Operations - Simplified Guide to the Incident Command System for Transportation Professionals",
    "title": "Exhibit 5-4: Examples of Incident Objectives and Strategies",
    "url": "http://www.ops.fhwa.dot.gov/publications/ics_guide/index.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 630157279,
    "recordOffset": 630105048,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2930=February 2006, 10092=The material in this Guide is based largely on the Department of Homeland Security’s National Incident Management System (NIMS) and on the Model Procedures Guide for Highway Incidents developed by the National Fire Service Incident Management System Consortium. Homeland Security Presidential Directive 5 (HSPD-5), “Management of Domestic Incidents,” requires all Federal departments and agencies to make adoption of the NIMS by State, tribal, and local organizations a condition for Federal preparedness assistance beginning in fiscal year 2005. Adopting the basic tenets of ICS is one of the first steps to achieve compliance with the NIMS., 172239=EDL 14234 FHWA-HOP-06-004 FHWA-NHI-06-007 February 2006}",
    "lastModified": "Fri, 02 Aug 2013 16:45:36 GMT",
    "textBeforeTable": "Following a shift from a single IC to UC, a brief command meeting takes place at the ICP and initiates the unified planning process. Only the authorized agency or jurisdiction representatives that make up UC participate in the meeting. UC participants determine and prioritize a common set of incident objectives and strategies (see Exhibit 5-4 for examples), designate an Operations Section Chief to manage tactical operations, fill Command Staff positions (including the UC, Public Information Officer, Safety Officer, and Liaison Officer) and General Staff positions (including personnel assigned by UC to oversee each section) as necessary, and resolve outstanding issues affecting UC management. The IC uses the initial incident briefing as a key step in initiating the appropriate ICS structure for effectively and efficiently managing an incident. Agency Representatives may recognize a necessary transfer of command or elect to replace the IC with a UC structure. The current IC should brief the incoming Command, and all on-scene responders should be immediately notified of the Command shift. A review of established facilities should include a decision to make permanent the initial ICP or designate some other mobile, on-scene facility. Interagency communications should be initiated and maintained via established frequencies and protocol. Situation potential, safety concerns, and related issues Communications established Facilities established Resources en-route and/or ordered Resource assignments (personnel and equipment) Current ICS organizational structure IAP and progress Situation status—objectives, priorities, hazards, and resource needs Exhibit 5-3: Incident Briefing Topics",
    "textAfterTable": "Planning Meeting and IAP Preparation and Dissemination The results of a command meeting serve as input into an inter-agency planning meeting, conducted for the purpose of developing a formal IAP for the first operational period. An oral IAP is sufficient for most traffic incidents. Written IAPs typically exist for large-scale or complex highway incidents and must be prepared under UC. Basic IAP specifications include incident objectives, one or more strategies per objective, and associated operations tactics and resource assignments for accomplishing objectives. Command may designate a Planning Section Chief to supervise a formal planning meeting that leads to the preparation of an IAP. The next section of this Guide provides more detail on the IAP. A planning meeting may begin with an incident briefing and review of incident objectives, agency policy issues, and primary and alternative strategies. Key tasks involve determining operations tactics and developing an effective ICS management structure for the first operational period. The latter may involve designation of new branch, division, and group boundaries and functions to facilitate chain of command within span-of-control limits. Planning meeting participants also determine tactical and support resource requirements, gauge resource availability, and identify sources for filling resource orders. At this time, Command or the designated Operations Section Chief should designate a Staging Area(s) to provide a base for incident support facilities and a Staging Area Manager(s) to oversee tactical resource coordination. IAP implementation initiates the first operational period. At this point, an Operations Section is likely the only",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}