{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "This campus is very safe with their security and people.",
            "The MMA club is a really great club to be in if you are into mixed martial arts. There are other clubs too like the League of Legends club.",
            "The Student Union is an amazing location to get help and meet new friends.",
            "This school offers so many things. You will have fun here, you will learn, you will make new friends, and you will succeed.",
            "The Student Union offers many fun games, you can go to the game room, hang out and watch movies in the library. The whole campus is really entertaining.",
            "The food is incredibly tasty and we have many different cafeterias and restaurants like Taco Bell, Pizza Hut, and Sub sandwiches.",
            "I live in an apartment near the school, but many of my friends love their dorms in University Village!",
            "I love the academics at this school. It can be hard, but CSUSB also offers a variety of help for those who need help with their majors and classes.",
            "If you are someone who looks forward and makes goals, this school will help you accomplish what you need.",
            "CSUSB Is a very diverse campus. It offers so many different majors to choose from, and they are all interesting. The people here are very nice and provide you with help and entertainment all the time."
        ]
    ],
    "pageTitle": "California State University-San Bernardino (CSUSB) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-San-Bernardino/reviews?_escaped_fragment_=/show/112878",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892010663,
    "recordOffset": 891909006,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{459242=I lived in the freshmen dorms from 2009 to 2010., 53938=x1039 does a concert on campus every december, 2629=I am about to start my sophmore year in fall 2009 and cannot wait. My freshman year was amazing. I learned many things in class that I used outside of class. Professors take the time to answer questions students may have, and make convenient office hours for us. I know this school has a lot to offer to present and future students., 352783=California State University San Bernardino has great teaching staff, and very diverse student attendance. The ratio from boys to girls are 4:1. It's one of the safest campuses in the state of California., 267207=On a scale from 1-10 I would rate Cal State San Bernardino an 8 based off my recent experience of SOAR. At SOAR, which is an orientation for incoming freshman, the staff, students, and faculty made me feel welcome to their college and were filled with joy and enthusiasm to see the class of 2016. The students made sure we felt comfortable and had the best time at Cal State San Bernardino. Also this college is very diverse and mixed with all kinds of nationalities which makes meeting people even better., 576271=© 2015, Cappex.com, LLC, 178411=Every year they have a walk against domestic violence in the month of May. It's not on campus but is near and is for a great cause!!}",
    "textBeforeTable": "08/14/2009 Reviewer is A current student here. 27 out of 27 people found this review useful. 1 of 139 Sandy from Apple Valley, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck Doming is chep and it is very low on cost compare to other cal states. Am enjoying being here Made many friends while I dormed here, plus you meet many people from diffrent backgrounds. Much of the campus is calm and quiet. Am learning a lot Most of the classes are very Informative and especially on the small clases. Made time for one on one conversations with the proffesor and instructor when I needed help. Login to rate or flag the reviews Jessica from San Bernardino, CA 02/01/2012 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 139 Categories Comments Campus Safety we have a very dedicated police force on campus and they patrol from morning to night. also, we have many blue phones around campus in case",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}