{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "they have on campus police",
            "i donrt know i just go to school an back home dont spend to much tyime on campus",
            "no dorms it a community college",
            "easy to enroll online enrollment",
            "this school is a good school i learn alot. It is also easy to get to i take the bus everyday."
        ]
    ],
    "pageTitle": "Mt San Jacinto Community College District Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mt-San-Jacinto-Community-College-District/reviews?_escaped_fragment_=/show/67257",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881157071,
    "recordOffset": 881100949,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{174998=May theater arts clubs and phi theta kappa, also science and mathematics clubs and student body., 72122=The current price for classes is $46 a unit starting summer of 2012. Compared to a university, it is very cheap. There is also a board of governors wavier that one could apply for in order to have their classes paid for. One just has to show that they financially struggling., 30491=I would check out some other junior colleges in the area as well. Like Palomar or RCC. MSJC is a good school, its just really impacted and hard to get into classes. It would probably be a good idea to register for classes at a couple different places if you can, or just be okay with the fact that an AA/AS could take you 3 - 5 years., 159767=Class units cost $48 as of Oct. 2012. Way more affordable than starting off at a University. Pay close attention to which units transfer and which don't., 117121=As of now they are asking i believe $36 a unit which is just over $100 a class which is a whole lot cheaper for your general education then if you were going to a Four-year institution paying almost a $1000 or more per class. I say your going to get more band for your buck here then at a Four-year, 277808=© 2015, Cappex.com, LLC, 104405=Units will increase beginning Fall 2012 to $49 a unit}",
    "textBeforeTable": "08/09/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 64 Noelle from Murrieta, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Login to rate or flag the reviews Paul from Hemet, CA 07/07/2010 Reviewer is A current student here. 2 out of 3 people found this review useful. 2 of 64 Categories Comments Tips for prospective students take advantage of all the resources they offer and get involved in clubs they are helpful when transferring. Login to rate or flag the reviews Bethany from Wildomar, CA 10/13/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 64 Categories Comments Great for these types of students This school is great for any type of student, but is best for students who do not have a lot of money and are looking for a top-notch education. Even",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}