{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "WT Docket Nos."
        ],
        [
            "regulations.gov",
            "2014-30096",
            "",
            "07-250, 10-254: DA 14-1688"
        ]
    ],
    "pageTitle": "47 CFR 20.6 - CMRS spectrum aggregation limit. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/20.6?quicktabs_7=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922788815,
    "recordOffset": 922765928,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1084=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{33135=Title 47 published on 2014-10-01, 63679=On December 23, 2014, the Wireless Telecommunications Bureau and the Consumer and Governmental Affairs Bureau published a document seeking updated input to better understand the current consumer experience with hearing aid compatible wireless handsets, to explore technical or other barriers to the provision of hearing aid compatible devices on new wireless technologies, and to consider changes to its rules that may be necessary to ensure that wireless handsets used with advanced communications services are accessible in light of directives contained in the Twenty-First Century Communications and Video Accessibility Act (CVAA). The comment date was erroneously published as an effective date and neither the comment nor the comment-reply date was provided. We also failed to provide an address for submission of comments. This document corrects those errors and extends the time within which to file comments and reply comments., 32461=§ 302 - Repealed. June 5, 1936, ch. 511,, 29575=This Order on Remand responds to the court's directive, and specifically examines the interplay between the T-Mobile Order and the rural exemption rule. The Ninth Circuit found that the Commission's T-Mobile Order did not adequately analyze the order's affects upon the rural exemption rule in of the Communications Act of 1934, remanding the order to the Commission for “for further consideration.”}",
    "lastModified": "Sun, 02 Aug 2015 17:15:06 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38653 - The Commission's Rules To Improve Wireless Coverage Through the Use of Signal Boosters 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 67 FR 1642, Jan. 14, 2002] 64 FR 54574, Oct. 7, 1999, as amended at [ (4) That grant of a waiver is in the public interest because the benefits to the public of common ownership outweigh any potential anticompetitive harm to the market. (3) That the interest holder is not involved in the operations of the licensee and does not have the ability to influence the licensee on a regular basis; and (2) That the",
    "textAfterTable": "FCC 14-138 FEDERAL COMMUNICATIONS COMMISSION Final rule; announcement of effective date. 47 CFR 20.21(f)(1)(iv)(A)(2) published at 79 FR 70790, November 28, 2014, are effective on July 7, 2015. 47 CFR Parts 1 and 20 Summary In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, certain information collection requirements associated with the Commission's Order on Reconsideration regarding the Commission's rules to Improve Wireless Coverage Through the Use of Signal Boosters, FCC 14-138. This document is consistent with the Order on Reconsideration, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new information collection requirements. 2015-04-13; vol. 80 # 70 - Monday, April 13, 2015 80 FR 19738 - Protecting and Promoting the Open Internet GPO FDSys XML | Text",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}