{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Make friends ASAP, with your classmates, join organizations and or clubs that way you get to kno your peers.",
            "CSUDH is a small school which makes it easier to have a closer bond with the students and professors. They have all sorts of fairs almost every week which keep us informed and up to date on current events and helpful resources for our academic success. There is always quick services in the administrative offices!"
        ]
    ],
    "pageTitle": "California State University-Dominguez Hills Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Dominguez-Hills/reviews?_escaped_fragment_=/show/116404",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902179423,
    "recordOffset": 902118042,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{181796=Deadline to apply to CSU's is November 30 each year, so make sure to keep that in mind. Whether it's a back up or you've been planning to come here all along, it's a great school to have as an option. The admission rate is about a 2.4 average, so it's not too hard to get in to Dominguez, but that doesn't mean you shouldn't keep your grades up., 321883=© 2015, Cappex.com, LLC, 38730=there is also active greek life on this campus, but not so active since 2009., 51744=The bar has taco Tuesday! The 1910 restaurant has a buffet. You can never really go wrong with Subway. If those choices do not satisfy your fancy, there are other fast food places in the dining hall. If you want there are plenty of places to eat within a couple miles that offer student discount if you are a Toro! Wingstop 10% off your order.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 23 out of 23 people found this review useful. 1 of 84 Current Business student Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck I believe that even though the tuition is going up for the CSU's, with all of the help that is provided at the school, from free tutoring and a great computer lab, you really get a lot for what you're paying. Am enjoying being here I really enjoy it at Dominguez. It is a small campus but there are so many things that go on. From welcome week to Midnight Madness, and even Toro Tuesdays. They have many events to get the students involved. Am learning a lot I am learning many different things at Dominguez. My first year here has really built a great foundation for the rest of my scholastic career. From easy tips to taking notes and easy study tips. Login to rate or flag the reviews A nurse 07/01/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 2 of 84",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}