{
    "relation": [
        [
            "Hierarchical policy conditions",
            "pass",
            "pass followed by done",
            "done",
            "drop"
        ],
        [
            "Possible done statement execution sequence",
            "pass Continue_list",
            "pass or set action statement Stmt_list done",
            "Stmt_list without pass or set operation DONE",
            "Stmt_list drop Stmt_list"
        ],
        [
            "Behavior",
            "Marks the return value as \"true\" and continues execution within the same policy condition. If there is no statement after \"pass\", returns \"true\".",
            "Marks the return value as \"true\" and continues execution till the done statement. Returns \"true\" to the apply policy condition to take \"true-path\".",
            "Returns \" false\". Condition takes \"false-path\".",
            "The prefix is dropped or rejected."
        ]
    ],
    "pageTitle": "Cisco IOS XR Routing Configuration Guide for the Cisco XR 12000 Series Router, Release 4.3.x - Implementing Routing Policy [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-3/routing/configuration/guide/b_routing_cg43xxr12k/b_routing_cg43xxr12k_chapter_01001.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367538523,
    "recordOffset": 367474398,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{359282=The following policy discards any route whose network layer reachability information (NLRI) specifies a prefix longer than /24, and any route whose NLRI specifies a destination in the address space reserved by RFC 1918. For all remaining routes, it sets the MED and local preference, and adds a community to the list in the route., 73847=The effect of the origin-10 policy is that it adds the community 1234:10 to all routes that pass through this policy and have an AS path indicating the route originated from autonomous system 10. The origin-20 policy is similar except that it adds to community 1234:20 for routes originating from autonomous system 20., 365755=Routing Policy Language Commands on Cisco IOS XR Software module of the Cisco IOS XR Routing Command Reference for the Cisco XR 12000 Series Router, 138779=The following example shows how to configure the route policy retainer and apply it to the retain route target attach point. The route is accepted if the route contains route target extended communities 10:615, 10:6150, and 15.15.15.15.15:15. All other non-matching routes are dropped., 112075=See Cisco IOS XR Routing Command Reference for the Cisco XR 12000 Series Router for more information on the attributes and operations., 293562=For example, the following policy sets the rpf-topology to table t201 if the destination address is either 225.0.0.1 or 225.0.0.11 then table t201 will be used to figure out the reverse path, else if the destination is 225.0.0.3 or 225.0.0.13 default table will be used to figure out the reverse forwarding path., 370059=RFC 1771, 82042=This policy sets the community string on the route to contain all three community values: 10:23, 10:24, and 10:25., 70983=The apply statement indicates that the policy drop-everything should be executed if the route under consideration passed through autonomous system 1234.5 before it is received. If a route that has autonomous system 1234.5 in its AS path is received, the route is dropped; otherwise, the route is accepted without modification. This policy is an example of a hierarchical policy. Thus, the semantics of the apply statement are just as if the applied policy were cut and pasted into the applying policy:, 29699=RPL provides symbolic names for the standard well-known community values: internet is 0:0, no-export is 65535:65281, no-advertise is 65535:65282, and local-as is 65535:65283., 142631=The following example shows how to configure a route policy orf-preset and apply it to the neighbor ORF attach point. The prefix of the route is dropped if it matches any prefix specified in orf-preset (172.16.1.0/24, 172.16.5.0/24, 172.16.11.0/24). In addition to this inbound filtering, BGP also sends these prefix entries to the upstream neighbor with a permit or deny so that the neighbor can filter updates before sending them on to their destination., 366231=Understanding Regular Expressions, Special Characters and Patterns appendix in the Cisco IOS XR Getting Started Guide for the Cisco XR 12000 Series Router, 135929=The following example shows some match and set operations supported for the export route policy. If a route matches 172.16.1.0/24 then the route target extended community is set to 10:101, and the weight is set to 211. If the route does not match 172.16.1.0/24 but the origin of the route is egp, then the local preference is set to 212 and the route target extended community is set to 10:101. If the route does not match those specified criteria, then the route target extended community 10:111222 is added to the route. In addition, RT 10:111222 is added to the route that matches any of the previous conditions as well., 361673=The filter-bogons building block is a simple policy that filters all undesirable routes, such as those from the RFC 1918 address space. The policy set-lpref-prepend is a utility policy that can set the local preference and prepend the AS path according to parameterized values that are passed in. The common-inbound policy uses these filter-bogons building blocks to build a common block of inbound policy. The common-inbound policy is used as a building block in the construction of in-100 and in-101 along with the set-lpref-prepend building block., 103928=Policy grammar allows user to enter simple if statements with optional else clauses on the same line. However, the grammar is restricted to single action or disposition statement. For detailed command options, enter match statement on a separate line., 103347=This policy example sets the value of the local preference attribute to 100 on any route that has a community value of 12:34 or 56:78 associated with it. However, if any of these routes has a MED value of 150, then these routes with either the community value of 12:34 or 56:78 and a MED of 150 are dropped., 133554=The following example shows how to perform matches based on a route target extended community and then sets the next hop. If the route has route target value 10:91, then the next hop is set to 172.16.0.1. If the route has route target value 11:92, then the next hop is set to 172.16.0.2. If the route has Site-of-Origin (SoO) value 10:111111 or 10:111222, then the route is dropped. All other non-matching routes are dropped.}",
    "textBeforeTable": "Feature History for Implementing Routing Policy For more information about routing policy on the Cisco IOS XR software and complete descriptions of the routing policy commands listed in this module, see the Related Documents section of this module. . Note The routing policy language (RPL) provides a single, straightforward language in which all routing policy needs can be expressed. RPL was designed to support large-scale routing configurations. It greatly reduces the redundancy inherent in previous routing policy configuration methods. RPL streamlines the routing policy configuration, reduces system resources required to store and process these configurations, and simplifies troubleshooting. This module describes how routing protocols make decisions to advertise, aggregate, discard, distribute, export, hold, import, redistribute and modify the routes based on configured routing policy. A routing policy instructs the router to inspect routes, filter them, and potentially modify their attributes as they are accepted from a peer, advertised to a peer, or redistributed from one routing protocol to another. Implementing Routing Policy Additional References Translating Cisco IOS Route Maps to Cisco IOS XR Routing Policy Language: Example Modular Inbound Policy: Example Simple Inbound Policy:",
    "textAfterTable": "Parameterization at attach points New ‘done’ disposition policy statement type Release 3.6.0 No modification. Release 3.7.0 Support was added for IS-IS inter-area-propagate attach point, OSPF spf-prefix-priority attach point, and PIM policy rpf-topology attach point. Release 3.8.0 The vrf vrf-name keyword and argument were added for the PIM policy rpf-topology attach point to support MVPN extranet. The prefix matching performance feature was enhanced to use Radix trie lookup. Release 3.9.0 Parameterization was supported at all attach points. Release 4.2.0 The following features were added: Hierarchical Conditions Apply Condition Policies Release 4.2.1 The following features were introduced: Enhanced Prefix-length Manipulation.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}