{
    "relation": [
        [
            "cada uno(-a)",
            "todo el mundo",
            "quienquiera",
            "cualquiera"
        ],
        [
            "=",
            "=",
            "=",
            "="
        ],
        [
            "each (one)",
            "everyone",
            "anyone (at all)",
            "anything (whatsoever)"
        ]
    ],
    "pageTitle": "Pronouns in Spanish",
    "title": "",
    "url": "http://users.ipfw.edu/jehle/courses/PRONOUN1.HTM",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250641087,
    "recordOffset": 250627724,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29742=Demonstrative pronouns point out something (this, these, that, those). In English, we usually just make two distinctions: between this thing (close by) and that thing (in the distance, or close to the person spoken to). In Spanish, three distinctions are usually made: éste (this thing close by), ése (that thing close to the person spoken to) and aquél (that thing in the distance). You will recall that the demonstrative adjectives (este libro, esa mesa, etc.) do NOT carry accent marks; the use of accent marks on these pronoun forms is considered optional in some grammar books, but use them for in this class.}",
    "lastModified": "Wed, 26 Mar 2014 01:42:51 GMT",
    "textBeforeTable": "Subject pronouns (pronombres usados como sujetos) Pronouns",
    "textAfterTable": "you (formal) ustedes you él he ellos they (masc.) ella she ellas they (fem.) Note the accent marks over tú [to distinguish it from tu meaning \u0093your\u0094] and él [to distinguish it from el meaning \u0093the\u0094]. Subject pronouns are used as the subject of a verb (the verb may be implied); they are also used as the predicate complement after the verb ser. Yo prefiero coca-cola.     I prefer Coca-cola. ¿Es ella? Is it her? [Is it she?] \u0097¿Quién lo hizo? \u0097Yo. Who did it? I did. [implied verb] The vosotros form is used as the plural of tú in Spain; in Latin America ustedes is used as the second person plural, both familiar and plural. ¿Cómo estáis vosotros?   How are you all doing? (Spain, familiar) ¿Cómo están ustedes? How are you all doing? (Spain, formal plural; Latin America, both formal and familiar plural) The masculine forms nosotros, vosotros, and ellos are used when referring to a group of males and females; the feminine forms nosotras, vosotras, and ellas are used only when the group consists entirely of females. Nosotras estamos cansadas.     We are tired. (all",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}