{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Black Protestant",
            "Orthodox",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "43,335",
            "21,224",
            "20,564",
            "3,520",
            "2,020",
            "1,213",
            "103,532"
        ],
        [
            "Congregations",
            "21",
            "48",
            "79",
            "14",
            "5",
            "10",
            "-"
        ]
    ],
    "pageTitle": "Sturtevant, Wisconsin (WI 53177) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Sturtevant-Wisconsin.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372946103,
    "recordOffset": 372815612,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6705=According to our research of Wisconsin and other state lists there were 18 registered sex offenders living in Sturtevant, Wisconsin as of August 02, 2015. The ratio of number of residents in Sturtevant to the number of sex offenders is 387 to 1., 25541=Incorporated in 1907}",
    "TableContextTimeStampAfterTable": "{51890=2012 Presidential Elections Results, 30878=Air Quality Index (AQI) level in 2012 was 107. This is significantly worse than average., 79266=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 35387=Lead (Pb) [µg/m3] level in 2006 was 0.0169. This is about average. Closest monitor was 3.3 miles away from the city center., 71314=4.85% of this county's 2010 resident taxpayers moved to other counties in 2011 ($42,450 average adjusted gross income), 16880=On 4/27/1984, a category F4 tornado 30.5 miles away from the village center killed one person and injured 14 people and caused between $500,000 and $5,000,000 in damages., 52174=Graphs represent county-level data. Detailed 2008 Election Results, 160417=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 32445=Sulfur Dioxide (SO2) [ppb] level in 2000 was 3.26. This is significantly worse than average. Closest monitor was 4.8 miles away from the city center., 47940=School Enrollment by Level of School (%) in 2013, 51318=2004 Presidential Elections Results, 51032=2000 Presidential Elections Results, 159079=Total of 40 patent applications in 2008-2015., 69094=4.15% of this county's 2011 resident taxpayers lived in other counties in 2010 ($39,972 average adjusted gross income), 51604=2008 Presidential Elections Results, 47542=Educational Attainment (%) in 2013, 33188=Ozone [ppb] level in 2012 was 32.3. This is about average. Closest monitor was 4.1 miles away from the city center., 31540=Carbon Monoxide (CO) [ppm] level in 2002 was 0.477. This is significantly worse than average. Closest monitor was 4.8 miles away from the city center., 16592=On 9/28/1972, a category F4 (max. wind speeds 207-260 mph) tornado 23.0 miles away from the Sturtevant village center injured 20 people and caused between $500,000 and $5,000,000 in damages., 27684=Hotels: Holiday Inn Express Racine (13339 Hospitality Court), Best Western Grandview Inn (910 South Sylvania Avenue), Motel 94 Inc (1623 Northeast Frontage Road)., 50746=1996 Presidential Elections Results, 33887=Particulate Matter (PM10) [µg/m3] level in 2012 was 18.3. This is about average. Closest monitor was 5.2 miles away from the city center., 34636=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.79. This is about average. Closest monitor was 14.2 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Sturtevant village (based on Racine County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (0%) Electricity (15%) Utility gas (85%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 37 Racine County: 1.86 / 10,000 pop. Wisconsin: 1.86 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.10 / 10,000 pop. State: 0.11 / 10,000 pop. Number of convenience stores (no gas): 7 Racine County: 0.35 / 10,000 pop. Wisconsin: 0.38 / 10,000 pop. Number of convenience stores (with gas): 70 Racine County: 3.52 / 10,000 pop. State: 4.12 / 10,000 pop. Number of full-service restaurants: 125 Here: 6.28 / 10,000 pop. State: 8.64 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}