{
    "relation": [
        [
            "ATTRIBUTE TYPE",
            "Availability",
            "Stability Level"
        ],
        [
            "ATTRIBUTE VALUE",
            "SUNWdsee7",
            "Evolving"
        ]
    ],
    "pageTitle": "repl-cl-max-entry-count - 11g Release 1 (11.1.1.7.0)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E29127_01/doc.111170/e28967/repl-cl-max-entry-count-5dsconf.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75773757,
    "recordOffset": 75761197,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50044=An interval value of the form hhmm-hhmm 0123456, where the first element specifies the starting hour, the next element the finishing hour in 24-hour time format, from 0000-2359, and the second specifies days, starting with Sunday (0) to Saturday (6)., 52972=A DirectoryString value, as specified by RFC 2252 (http://www.ietf.org/rfc/rfc2252.txt)., 51373=A valid LDAP URL as specified by RFC 2255 (http://www.ietf.org/rfc/rfc2255.txt)., 22693=2000}",
    "lastModified": "Mon, 14 Apr 2014 18:52:08 GMT",
    "textBeforeTable": "PROPERTY: compression-entries Each Directory Server suffix you create is configured according to the suffix properties documented here and in the documentation specified under the SEE ALSO section. Description DS suffix configuration (SUF) properties repl-cl-max-entry-count PDF · Mobi · ePub Next Previous Contact Us Index Contents Home Oracle® Fusion Middleware Man Page Reference for Oracle Directory Server Enterprise Edition 11g Release 1 (11.1.1.7.0) Part Number E28967-01",
    "textAfterTable": "Is readable Yes Is modifiable Yes Is multi-valued No This property specifies entry eligibility for compression. all All the entries will be compressed. overflow Only entries in overflow pages will be compressed. PROPERTY: compression-mode Characteristic Value Syntax none|DSZ Default Value None Is readable Yes Is modifiable Yes Is multi-valued No This property specifies how entries are compressed. none No entries compression mechanism will be used. DSZ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}