{
    "relation": [
        [
            "Ref",
            "EV209897-NA-BLK",
            "EV209897-NA-GRY",
            "EV209897-NA-RED"
        ],
        [
            "Option",
            "Black",
            "Gun Metal",
            "Red"
        ],
        [
            "Availability",
            "In Stock",
            "In Stock",
            "In Stock"
        ],
        [
            "Price",
            "$65.41 $52.33",
            "$65.41 $52.33",
            "$65.41 $52.33"
        ]
    ],
    "pageTitle": "K-Edge Chain Catchers & Cycling Accessories | K-Edge | Evans Cycles",
    "title": "",
    "url": "https://www.evanscycles.com/brands/k-edge",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908035951,
    "recordOffset": 908011258,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71818=K-Edge was conceived from a simple single product, Kristin Armstrongs Chain Catcher. This was later to be named the K-Edge Chain Catcher. The K-Edge Chain Catcher is a purposeful design that was engineered for a single goal, to help Kristin Armstrong win the Gold at the 2008 Olympic Games. The K-Edge is also perfect for anyone who likes to keep their chain in place, improve shifting performance, and protect their frame from damage caused by a derailed chain. In no time at all K-Edge expanded their range to offer components for road, mountain, and cyclocross. While their focus has been on providing intelligent solutions for the elite level of our sport, the same solutions that the pros ride are available to cyclists of all abilities.}",
    "textBeforeTable": "(12 reviews) $62.78 K-Edge Combo Mount XL for Garmin Edge 1000 and GoPro Cameras Most Popular Price (Low to High) Price (High to Low) Rating Savings Sort by: View 99 products per page   Accessories (19) Components (1) Categories",
    "textAfterTable": "Ref Option Availability Price EV242895-NA-BLK Black, One Size In Stock $39.23 EV242895-NA-BLU Blue, One Size In stock at remote warehouse $39.23 EV242895-NA-GRY Grey, One Size In Stock $39.23 EV242895-NA-RED Red, One Size In Stock $39.23 K-Edge MTB Stem Mount For Garmin Edge - Adjustable $35.31 $39.23 Save 10%! (1 review) Ref Option Availability Price EV209903-NA-BLK Black In Stock $39.23 $35.31 EV209903-NA-GRY Gun Metal In Stock",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}