{
    "relation": [
        [
            "LOCKHEED C/N",
            "5451",
            "5452",
            "5453",
            "5473",
            "5474",
            "5475",
            "5476",
            "5486",
            "5487",
            "5501"
        ],
        [
            "USAF S/N",
            "96-5300",
            "96-5301",
            "96-5302",
            "97-5303",
            "97-5304",
            "97-5305",
            "97-5306",
            "98-5307",
            "98-5308",
            "99-5309"
        ],
        [
            "WHERE IS IT NOW?",
            "53rd WRS; delivered April 2004",
            "53rd WRS; delivered 11 October 1999",
            "53rd WRS; delivered October 2003",
            "53rd WRS; delivered 29 October 1999",
            "53rd WRS; delivered 15 November 1999",
            "53rd WRS, delivered April 2002",
            "53rd WRS, delivered June 2002",
            "53rd WRS; delivered 6 December 1999",
            "53rd WRS; delivered August 2003",
            "53rd WRS, delivery date unknown"
        ]
    ],
    "pageTitle": "Whiskey Charlie by Tom Robison",
    "title": "",
    "url": "http://www.awra.us/WhiskeyCharlie.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 301082851,
    "recordOffset": 301052942,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Born and raised in northeastern Indiana. Graduated high school in 1966, attended Purdue University for two years, then joined the Air Force. After an interminable Met/ARE tech school at Chanute, reported to the 55th Weather Recon Sq. at McClellan AFB, CA. Served there a year, then reported to the 54th Weather Recon Sq. at Andersen AFB, Guam.}",
    "TableContextTimeStampAfterTable": "{30219=In an effort to improve the radar capability of the WC-130s, 58-0725 (along with 62-3495) received a prototype forward-looking weather radar in 1972. Additionally, 58-0725 received a prototype side-looking weather radar, installed where the forward cargo door had been. This aircraft was conspicuous by a large black panel on the port fuselage just forward of the wing. The performance of both radar sets was considered unsatisfactory, but the cost to develop a new system was prohibitive. The C-130's standard search radar has been upgraded over the years, however, and is apparently sufficient for the weather mission., 43641=As usual, the 53rd WRS wasted no time in putting their new birds to work. On 16 Nov 1999, 96-5301 made fourteen penetrations of Hurricane Lennie during a 14-1/2 hour mission. All systems, it was reported, were \"Alpha-1\". As with most new systems, however, they take some time to mature.  Several issues were identified and resolved over the course of the next few years and the WC-130J was declared fully operational prior to the 2005 Atlantic Hurricane Season and the J-model has flown every operational mission since., 26221=Despite the damage and death caused by Hurricane Camille in 1969, there was one positive side-effect: she was a wake-up call to Congress. As a result, $8-million was appropriated to obtain more aircraft for the weather recon fleet, and upgrade all of them with state-of-the-art equipment. The Air Force dubbed the effort Project \"Seek Cloud\"3., 15901=In 1989, all the E-models were modified once again with the Improved Weather Reconnaissance System (IWRS)8 which had finally reached operational status after three years of testing and evaluation. At the same time, the atmospheric sampling infrastructure was removed from these aircraft, thus ending forever that capability of the WC-130., 64632=10) From the FY1997 Appropriations bill: \"Sec. 8041. None of the funds appropriated or made available in the Act shall be used to reduce or disestablish the operation of the 53rd Weather Reconnaissance Squadron of the Air Force Reserve, if such action would reduce the WC-130 Weather Reconnaissance mission below the levels funded in this act.\", 2383=U.S. Air Force aerial weather reconnaissance began a new era in 1962 when the Air Weather Service received its first Lockheed WC-130 Hercules. Over the intervening years, the Air Force and Air Force Reserve has operated 50 WC-130s: Three A-models, 17 B-models, six E-models, 15 H-models, and ten new J-models. 11, 20859=Few aviation writers and historians seem to be aware that there were three WC-130As. These three were originally trash-haulers, borrowed from TAC in late 1966 for use in Operation \"Popeye\", the rain-making mission in Southeast Asia, set to begin the following year. The intent of the mission was to create enough year-round rain to keep the Ho Chi Minh trails impassable with mud5. Tests were conducted over Laos in 1966, and the operational missions began in March of 1967 from Udorn RTAFB, Thailand. They were flown by crews of the 54th WRS, rotated on a regular basis from Guam. In addition, 54th crews were sometimes called upon to conduct synoptic weather reconnaissance from Udorn over various areas of Southeast Asia, out to and including the Bay of Bengal., 10874=All five B-models were again modified in 1970-71 under Project Seek Cloud3. 62-3492, which had become something of a guinea pig for the WC-130 fleet, was subsequently modified with the prototype Kaman Aerospace Advanced Weather Reconnaissance System4 (AWRS) in 1972., 10243=The five were modified for weather reconnaissance with the AN/AMR-1 Dropsonde Recording System2 at WRAMA in 1965 and were transferred to the 53rd WRS, then at Ramey AFB, Puerto Rico. The 53rd wasted no time in putting their new Herks to work, recording the first hurricane penetration by a WC-130 on 27 August of that year. (Since that time, the 53rd has logged thousands of hurricane penetrations with the WC-130B, E, H, & J without serious mishap.), 65021=From the FY1998 House Appropriations Subcommittee Budget Summary: \"WC-130. The Committee continues to strongly believe that the weather reconnaissance mission is critical to the protection of Defense installations and the entire population living along the east and Gulf coasts of the United States. The level specifically funded in this Act is to support a stand-alone squadron with dedicated 10 PAA aircraft, 20 line assigned aircrews, evenly divided between Air Reserve Technician (ART) and Reserve aircrews. The Committee directs the Air Force to provide a minimum of 3,000 flying hours to perform tropical cyclone and winter storm reconnaissance missions, aircrew training, counterdrug support, and airland missions in support of contingency operations during the non-hurricane season or slow periods during the season. The Committee is aware that advancements in two pilot cockpit technology do not provide an adequate margin of safety in the unique and dangerous hurricane reconnaissance missions that range from tropical storms to category 5 hurricanes which have winds in excess of 200 miles per hour. The Committee is pleased that the Air Force agrees with user recommendations to include a fully equipped augmented crew station to be manned by a navigator in all WC-130J aircraft and directs that the final operational requirements document reflect this decision.\", 21748=The A-models were modified for weather reconnaissance, probably at WRAMA, with the AN/AMR-1 system2. They were not configured for atmospheric sampling. Two were kept at Udorn, with the third rotating to and from Guam for maintenance, repair, and crew changes, from June 1967 through late 1970. When the third one was not enroute to/from Thailand, it was used for normal weather reconnaissance activities from Guam. In late 1970 the A's were replaced with three 1958 B-models, and the rain-making mission continued through mid-1972 with whichever B- or E-models were available from the 54th. After re-conversion to transport, the A's were transferred to Air Force Reserve units. During their brief stint as rain-makers, they flew a total of 1435 \"combat\" sorties, and it is reported that at least one of them received battle damage. All three A-models wore the standard Southeast Asia camouflage colors and markings, but with no unit designations of any kind. In 1973, 56-0519 was given or loaned to the South Vietnamese Air Force, and it became one of the spoils of war on April 30, 1975. The last reliable sighting was in April of 1999, which reported her corroded and derelict at Tan Son Nhut Airport, Ho Chi Minh City., 55742=4) In the wake of Hurricane Camille in 1969, the Air Force and the Commerce Department launched a joint effort to develop an advanced storm reconnaissance data collection system. In May, 1971, Kaman Aerospace was awarded over $7-million to develop the Advanced Weather Reconnaissance System (AWRS), later designated the AN/AMQ-32. After a cost overrun of some $2.5 million, Kaman installed the prototype system on 62-3492 in early 1972. The system was installed just behind the forward bulkhead on the starboard side of the cargo bay. (NOAA's Ark may have also carried this system, but the records are unclear.), 11808=As a result of a number of HC-130H aircraft becoming available to AWS in 1972, the five original B-models were \"traded in\" and converted to standard transport versions. 62-3496 was converted in 1974, and -3493, -3494, and -3495 were converted in late 1976. 62-3492 remained a WC-130 until 1979, as she was the only Herk equipped with the AWRS., 14925=Having proven the worth of the C-130 as a sampling and reconnaissance platform, AWS asked for and received six more, in 1965. 61-2360, 61-2365, and 61-2366 were transferred from TAC, and 64-0552, 64-0553, and 64-0554 were brand new. They were modified for weather reconnaissance2 at WRAMA. All six were delivered to AWS in 1965, and transferred to the 54th WRS, Andersen AFB, Guam, that same year. In 1967 they were sent to Lockheed-Marietta for the addition of the atmospheric sampling system, and then returned to the 54th where they remained through mid-1972. For the following fifteen years all of them would transfer 'round and 'round amongst the 53rd, 54th, 55th and 56th squadrons, wherever the operational demand was greatest. After the 54th closed in 1987, all six Es were reunited at the 53rd WRS, then at Keesler AFB, Mississippi., 16717=In 1993, the 53rd WRS Hurricane Hunters were re-activated as an Air Force Reserve entity at Keesler, and assumed all weather reconnaissance duties, aircraft, and personnel from the 815th. At that time, four C-130H aircraft of the 815th AS, which had previously been WC-130s, were re-converted to the type, and the six E-models were granted a well-deserved retirement in the Arizona sunshine., 61909=Since the elimination of the Omega navigation system in 1997, The Omega system components of the IWRS have been replaced by AVAPS, which uses lightweight digital radiosondes with integral GPS receivers for windfinding and positioning. New processing hardware in the dropsonde operator's console includes a personal computer, color monitor, new narrow-band receiver, GPS processors, and radiosonde interface circuitry. Another significant advantage of the system is its ability to track and record data from four radiosondes simultaneously. AVAPS was incorporated into all WC-130H aircraft in 1998. However, the installation in the new J-model has the ARWO pallet and the Dropsonde operator pallet side by side at the forward end of the cargo compartment, just aft of the forward bulkhead (FS245), with the Dropsonde position facing forward and the ARWO position facing aft. The dropsonde dispenser has also been moved to a central location just aft of the Dropsonde console., 1885=\"In the eye of a hurricane, you learn things other than of a scientific nature. You feel the puniness of man and his works. If a true definition of humility is ever written, it might well be written in the eye of a hurricane.\"  Edward R. Murrow, speaking aboard a WB-29, in the eye of Hurricane Edna, 10 Oct 1954 , 4708=Last Revised:  28 January 2011, 66441=11) It was hard to keep track of which WC-130Js were actually being operated by the 53rd WRS during the period after the initial delivery until they were declared fully operational in 2005.  It is believed that all ten WC-130Js are now owned by the 53rd WRS. The issues delaying the use of the J-model were many, and, unfortunately, the unit was not allowed to discuss problems that were being worked.  From official AF news releases, we know that the two biggest problems were, 1) damage occuring to the leading edge of the new high tech composite propellers, caused by heavy rain, and occasional hail, found in tropical storms, and  2) a lack of sensitivity with the new color radar.  The propeller problem was solved by adding a metal \"taco\" to the leading edge of each blade.  Changes in the radar software fixed that problem, allowing the aircraft to be declared fully operational. , 63632=Therefore, from 1966 through 1972, the 54th WRS packed up and moved to Elmendorf for the seeding season, which usually began in November and ended in mid-February. Likewise, the 53rd WRS conducted similar operations in Germany., 9384=After a grueling and deadly six years of operations with the WB-50, AWS was finally granted authority to purchase five new C-130Bs, purpose-built at the factory for atmospheric sampling1. They were delivered to the 55th WRS at McClellan AFB, California in October and November of 1962, and were immediately put to work flying daily reconnaissance tracks across the Pacific. After a brief period of OT&E, they were dispersed across the Pacific, one each to the 54th, 56th, and 57th WRS’, with the 55th keeping two, one at McClellan, the other at Eielson., 36561=As mentioned previously, 15 HC-130H aircraft of the ARRS were made available to AWS in 1972. (Although designated as H-models, they were actually E-model airframes with upgraded engines.) Eleven were converted to WC-130H and delivered between June 1973 and July 1974. Four more were modified in 1975. All were modified with the Project Seek Cloud equipment; none were configured for air sampling. They all retained the dorsal radome for several years, though it appears that vestige is now gone from the fleet, and all still sport the angular nose radome of the rescue-type, though all rescue gear has been removed., 57518=7) 65-0965 had only recently arrived at the 54th WRS after having been converted to WC-130H. On 12 Oct 1974, \"Swan 38\" departed Clark Air Base in the Philippines on a recon of Typhoon Bess. The last radio contact was at about 2200, when their position was approximately 400 miles northwest of Clark. An investigation board later speculated the crew was on the final leg inbound to make a second fix when they encountered some catastrophic problem. No emergency communications were received. Sea conditions at the time were such that a successful ditching was highly unlikely. Four days of relentless searching by rescue aircraft and two surface ships proved unsuccessful, and the six crewmen were declared missing and presumed dead. The callsign \"Swan 38\" was retired and a plaque honoring the crew was affixed to the squadron building at Andersen. [Said plaque was removed when the 54th closed in 1987, and it's whereabouts are currently unknown] The crew members, carried on AWS rolls as Killed In Action, were:, 17848=As this is written, -2360 has been scrapped; -2365 has been modified to \"C-130M\" technology demonstrator by Snow Aviation in Columbus, Ohio; -2366 is apparently awaiting the grim reaper at Davis-Monthan; -0552 is owned by Evergreen Aviation in McMinnville, Oregon; -0553 was scrapped in 2001, but the cockpit portion is under restoration at the Southern Utah Air Museum;  and, alas, 64-0554, shown above, is being used for Aircraft Battle Damage Repair (ABDR) training. This means she is being shot full of holes so that trainees can learn the intricacies of repairing battle damage. Ergo, my favorite Herk of all time is slowly and ignobly being reduced to scrap metal. She earned a better end.\", 26660=Under Project Seek Cloud, twelve 1958-series C-130Bs were obtained from PACAF. They were old, and some were not in great shape, but a tired C-130 is still the equal of almost any other airplane. All twelve were modified for weather reconnaissance at WRAMA in 1970-71 with the installation of the Seek Cloud equipment suite. None of them were configured for atmospheric sampling., 44201=Indications are that the WC-130J will be the most capable and sophisticated military aircraft ever dedicated to the weather reconnaissance mission. It will be the mainstay of this country's hurricane reconnaissance fleet through 2030 and probably beyond. The J represents a new era in hurricane reconnaissance, and a new commitment by the government to provide the best technology available for the \"Riders On The Storm\".  As this is written, all ten J-models have been delivered from Lockheed.  11, 28692=Three of the B-models (58-0729, -0742, and -0747) went to Guam to replace the 54th's A-models, and the remaining eight went to the 53rd, then at Ramey AFB, Puerto Rico. (The 53rd had given up two of its 1962 B-models to the 55th in 1970. After receiving the eight 1958 B-models, the 53rd gave up two more of its 1962 B-models to the 54th, in 1972.), 37196=In 1983, NOAA contracted with Tracor, Inc., for $2.4 million for development of two prototype Improved Weather Reconnaissance Systems (IWRS, also known as \"I-Wars\").8 USAF contributed about a third of the money. WC-130H 65-0968 received a prototype IWRS in 1985. Three years of operational testing and evaluation followed, whence the remainder of the WC-130 fleet was equipped with the production version. All WC-130s still carry this reconnaissance data system. In 1998, however, the Omega Dropwindsonde system, which was based on the Omega navigation network, was replaced with AVAPS (Airborne Vertical Atmospheric Profiling System), developed by the National Center for Atmospheric Research (NCAR). This system utilizes lightweight digital radiosondes and GPS for positioning and windfinding., 16374=In 1991 the 53rd was deactivated, and all six Es were transferred to the 815th Weather Reconnaissance \"Flight\" of the 815th TAS, 403rd TAW, an Air Force Reserve unit at Keesler. (For a time the 815th Flight was designated as the 920th Weather Reconnaissance Group.), 30859=All the 1958 B-models were painted in the standard MAC light gray with full color markings. NOAA's Ark was painted white over gray with a blue cheat line while serving with NOAA, and carried the appropriate civil registrations and NOAA symbols., 56663=5) The best published discussion of the USAF rain-making effort in Southeast Asia can be found in John Fuller's Thor's Legions. Fuller and Charles Bates briefly discussed this activity in their earlier work, America's Weather Warriors. An article on the 1966 test missions over Laos can be found in the December 1997 issue of VIETNAM magazine. Precious little else has ever been seen in print about this intriguing operation., 8721=The C-130 had been coveted by the Air Weather Service since it was first introduced in 1955. It was the ideal long-range reconnaissance aircraft, and a perfect replacement for the aging WB-29s then in service. AWS was thus deeply disappointed in mid-1956 when it learned that the Air Staff had approved the transfer of 66 B-50 aircraft to AWS to be modified to WB-50. Even though AWS enjoyed a high priority due to its success at radiation sampling and hurricane reconnaissance with war-weary B-29s, the mission simply did not warrant the procurement of brand new aircraft., 28148=Only eleven of these B-models kept their blue suits, however. 58-0731 was given a temporary duty assignment to the civilian sector, with NOAA's Hurricane Research Division. It was first re-numbered N6541C, then N8037, and was nicknamed NOAA's Ark. It served NOAA proudly for eleven years as a hurricane research aircraft. Re-converted to transport in 1981, she then served with the Texas, Ohio, and Kentucky Air National Guards before retiring in 1992. She was later sold to South Africa and was still flying as of late 2003., 11296=As delivered, these B-models were a natural aluminum finish with full color markings and \"day-glo\" red panels on the nose, upper wings, and tail surfaces. After modification in 1965, they were painted the standard MAC gloss gray, again with full-size color markings and a variety of MAC, AWS, and Squadron emblems and designations. They remained in this livery until conversion to transport., 12251=62-3494 was sold to Pakistan in 1985. On 17 August 1988, this aircraft crashed shortly after takeoff from Bahawalpur Airport, killing the Pakistani president and several senior military officers. It is suspected that the aircraft was sabotaged or shot down by Pakistani dissidents., 31122=The 1958 B-models enjoyed only a short tour with AWS. By 1973 the Air Force had approved the swap of all WC-130Bs (including the five 1962 models) for 15 HC-130Hs from the Aerospace Rescue and Recovery Service (ARRS). The B-models were gradually de-modified to trash haulers and found new homes in Air National Guard and Air Force Reserve units. By the 1990s, most of them had been sold to foreign governments, except 58-0729 and 58-0740. 729 has been reduced to beer cans and razor blades. 740, as was noted earlier, was severely damaged at Homestead AFB during Hurricane Andrew in 1992, but the fuselage was salvaged for use as a loading trainer.}",
    "textBeforeTable": "THE FIRST B-MODELS 1.  THE FIRST B-MODELS  2.  THE E-MODELS  3.  THE A-MODELS  4.  THE \"NEW-OLD\" B-MODELS  5.  THE H-MODELS  6.  THE J-MODELS  7.  ABBREVIATIONS AND ACRONYMS  8.  NOTES  9.  SOURCES FOR WHISKEY-CHARLIE 10.  ABOUT THE AUTHOR TABLE OF CONTENTS \"In the eye of a hurricane, you learn things other than of a scientific nature. You feel the puniness of man and his works. If a true definition of humility is ever written, it might well be written in the eye of a hurricane.\"  Edward R. Murrow, speaking aboard a WB-29, in the eye of Hurricane Edna, 10 Oct 1954  ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ U.S. Air Force aerial weather reconnaissance began a new era in 1962 when the Air Weather Service received its first Lockheed WC-130 Hercules. Over the intervening",
    "textAfterTable": "LOCKHEED C/N USAF S/N WHERE IS IT NOW? 3659 61-2360 Cut up for scrap, 2001  3688 61-2365 Snow Aviation Technology Demonstrator 3706 61-2366 AMARC, CF 146; no outer wings 4047 64-0552 Flying as CH-14 for Belgian AF 4048 64-0553 scrapped 3 Apr 2001; cockpit at SUAM 4049 64-0554 AMARC (ABDR), CF 136 WC-130E 64-0554 In-flight Photograph Courtesy Matsuoka, All Rights Reserved Having proven the worth of the C-130 as a sampling and reconnaissance platform, AWS asked for and received six more, in 1965. 61-2360, 61-2365, and 61-2366 were transferred from TAC, and 64-0552, 64-0553, and 64-0554 were brand new. They were modified for weather reconnaissance2 at WRAMA. All six were delivered to AWS in 1965, and transferred to the 54th WRS, Andersen AFB, Guam, that",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}