{
    "relation": [
        [
            "Degree conferred between*:",
            "April 15, 2014-March 15, 2015",
            ""
        ],
        [
            "Joined Sponsor’s Lab on or after:",
            "April 15, 2014",
            ""
        ]
    ],
    "pageTitle": "Damon Runyon Cancer Research Foundation - Cancer Research Award Programs",
    "title": "",
    "url": "http://www.damonrunyon.org/for_scientists/more/innovation_award_committee/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 398959747,
    "recordOffset": 398791452,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{903778=Application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices by 4:00 pm (ET) on July 1, 2013.  Along with the original full proposal (one hard copy), applicants must submit a USB flash drive of all the required materials.  Please see application submission instructions for detailed directives. , 951125=All application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before the February 17 deadline.  Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials. Do not staple any part of the application.  Please see application submission instructions below for detailed directives., 897690=Applicants must have three reference letters from senior scientists emailed or faxed directly to the Foundation using the referee’s own letterhead. Referees must submit their letters by email (Innovation@damonrunyon.org) OR fax (917.591.4780) on or before the application deadline (July 1). Do not follow up with a hard copy. For referees who are writing letters on behalf of more than one candidate, please submit each letter separately., 79748=2004 Damon Runyon Scientific Retreat October 26-29, 2004 Asilomar Conference Center Pacific Grove, California Featured speaker: Phillipa Marrack, PhD, 892547=Application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices by 4:00 pm (ET) on July 1, 2015.  Along with the original full proposal (one hard copy), applicants must submit a USB flash drive of all the required materials.  Please see application submission instructions for detailed directives. , 960347=Referees must submit their letters on their institution’s letterhead by email (.(JavaScript must be enabled to view this email address) ) OR fax (917.591.4780) on or before the application deadline (February 17).  Do not follow-up with a hard copy., 523467=Robert H. Vonderheide, MD, PhD Damon Runyon-Lilly Clinical Investigator “Clinical evaluation of telomerase as a widely expressed tumor-associated antigen linked to oncogenesis” with Carl H. June, MD, University of Pennsylvania, Philadelphia, Pennsylvania, 46041=The above application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before the December 1 deadline. Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials. ALL FILES MUST BE IN PDF FORMAT., 50248=Applications must be in our office by 4:00pm (ET) on the deadline—not simply postmarked by December 1., 79272=2006 Damon Runyon Fellows' Retreat September 25-28, 2006 The Lighthouse Inn West Dennis, Massachusetts Featured speakers: Phillip A. Sharp, PhD, and Gregory J. Hannon, PhD, 892074=> July 1, 2015 Application Deadline > October 2015 Notification of Finalists > November 12, 2015 Finalist Interviews > December 2015 Notification of Awardees > January 1, 2016 Funding Begins, 55721=Damon Runyon Fellows are eligible to apply in the fourth year of their Fellowship.  Currently, Damon Runyon Fellows selected in November 2011 and May 2012 (DRG-2105-12 to DRG-2142-12, DRSG-2P-12 to DRSG-3P-12) are eligible to apply.     ›  Fellows who have terminated their awards early to accept an independent academic faculty position or other funding are eligible.     ›  Fellows who have moved to a position at a for-profit organization are not eligible., 950857=Award Announcement: May 2016 , 79513=2005 Damon Runyon Scientific Retreat September 26-29, 2005 The Lighthouse Inn West Dennis, Massachusetts Featured speakers: Xiaodong Wang, PhD, and Greg Verdine, PhD, 1132157=Application Deadline June 1 (pre-proposal), 909996=FINALISTS WILL BE SELECTED BY THE INNOVATION AWARD COMMITTEE AND INVITED TO INTERVIEW IN FALL 2013. , 78815=2008 Damon Runyon Fellows' Retreat October 5-8, 2008 The Marconi Conference Center Marshall, California Featured speakers: Dr. Mark Davis and Dr. Andy Dillin, 77603=2013 Damon Runyon Fellows' Retreat September 29-October 2, 2013 The Wylie Inn and Conference Center Beverly, Massachusetts Featured Speakers: Elaine A. Ostrander, PhD and James E. Bradner, MD, 78323=2010 Damon Runyon Fellows' Retreat September 26-29, 2010 The Lighthouse Inn West Dennis, Massachusetts Featured speakers: Julie A. Segre, PhD, and John L. Rinn, PhD   , 995744=•    Selection committee meeting: mid-February 2016, 966859=Applications must be in our office by 4:00pm (ET) on the deadline—not simply postmarked by February 17., 998989=NOTICE: Institutional nominations have been reinstated. Please review carefully. The 2015 application deadline date for this award is Tuesday, February 17, 2015  , 36204=Review Panel Meeting: Mid-February, 2016, 53253=Application Deadline December 1, 2014, 890556=2015 Important Dates  |  Application Materials  |  Application Format  |  Finalist Information, 892475=APPLICATION DEADLINE: July 1, 2015, 950730=Finalists Interview: April 2016 at the Foundation's office in New York, NY , 36350=Funding Begins: July 1, 2016, 78575=2009 Damon Runyon Fellows' Retreat October 4-8, 2009 The Lighthouse Inn West Dennis, Massachusetts Featured speakers: Joan S. Brugge, PhD, and Pardis C. Sabeti, MD, DPhil, 35946=(Please note: completed applications and USB flash drives must be in our office by 4:00 pm (ET) on the deadline—not simply postmarked by December 1, 2014), 36542=All application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before the December 1 deadline.  Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials. Do not staple any part of the application.  Please see application submission instructions below for detailed directives., 62560=(Please note: completed applications and USB flash drives must be in our office by 4:00 pm (ET) on the deadline—NOT simply postmarked by the due date.) Applications are due on or before July 15, 2015. Damon Runyon Fellows selected in November 2011 and May 2012 (DRG-2105-12 to DRG-2142-12, DRG-112-12, DRSG-2P-12, and DRSG-3P-12)  are eligible to apply., 500920=Omar Abdel-Wahab, MD Edward P. Evans Foundation Investigator \"Understanding and targeting altered histone modifiers in the myeloid malignancies\" with Ross L. Levine, MD, at Memorial Sloan-Kettering Cancer Center, New York, New York, 1115546=Completed applications and USB flash drives must be in our office by 4:00 pm (ET) on the deadline—NOT simply postmarked by the due date. For the March deadline, applicants may apply for either the Damon Runyon Postdoctoral Fellowship Award or the Damon Runyon-Sohn Pediatric Fellowship Award, not for both., 62227=Application deadline:  July 15, 2015; Selection meeting:  November 6, 2015 * The award will begin immediately following the term of the original Fellowship.  For those whose Fellowships have already ended, the award will begin on January 1, 2016., 950586=Application Deadline: February 2, 2016, 1097948=NOTICE: For the March deadline, applicants may apply for either the Damon Runyon Postdoctoral Fellowship Award or the Damon Runyon-Sohn Pediatric Fellowship Award, not for both., 509161=Vu H. Nguyen, MD August M. Watanabe, MD, Investigator of the Damon Runyon Foundation \"Organ-specific regulatory T cells as a targeted therapy for graft-versus-host disease\" with Thomas F. Gajewski, MD, PhD, The University of Chicago, Chicago, Illinois, 902338=2013 Important Dates  |  Pre-Proposal Information  |  Semi-Finalist Information  |  Finalist Information, 77864=2012 Damon Runyon Fellows' Retreat October 3-6, 2012 Hayes Mansion Hotel San Jose, California Featured Speakers: James A. Wells, PhD and Karla A. Kirkegaard, PhD, 995666=•    Application deadline: December 1, 2015, 56756=DRG-2105-12 to DRG-2142-12 (and, 1001307=For the purposes of this award, the Foundation’s definition of clinical research will follow the definition set out in “The NIH Director’s Panel on Clinical Research Report to The Advisory Committee to The NIH Director,” December, 1997., 80174=The 2013 Accelerating Cancer Cures Research Symposium convened some of the brightest minds in industry and academia in Cambridge, MA to share research insights, discuss challenges, and nurture collaborations to search for clinical breakthroughs in cancer treatment., 1131368=Three-year Award $450,000 plus up to $100,000 medical school loan repayment Application Deadline February 15, 972159=All application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before the March 1 deadline.  Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials., 962107=The above application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before the February 17 deadline. Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials. ALL FILES MUST BE IN PDF FORMAT., 36129=Application Deadline: December 1, 2015, 77298=2014 Damon Runyon Fellows' Retreat September 28 - October 1, 2014 The Wylie Inn and Conference Center Beverly, Massachusetts Featured Speakers: Gustavo A. Stolovitzky, PhD, Stephen H. Friend, MD, PhD, and Matthew L. Meyerson, MD, PhD, 44278=Referees must submit their letters on their institution’s letterhead by email (.(JavaScript must be enabled to view this email address) ) OR fax (917.591.4780) on or before the application deadline (December 1).  Do not follow-up with a hard copy., 950402=(Please note: completed applications and USB flash drives must be in our office by 4:00 pm (ET) on the deadline—not simply postmarked by February 17, 2015), 888047=Application Deadlines March 16, 2015 and August 17, 2015, 78095=2011 Damon Runyon Fellows' Retreat September 25-28, 2011 Hayes Mansion Hotel San Jose, California Featured Speakers: Andy Rachleff and Maxence V. Nachury, PhD, 63883=The above application materials should be submitted to the Damon Runyon Cancer Research Foundation for arrival at our offices on or before July 15, 2015.  Along with the original application (hard copy), applicants must submit a USB flash drive of all the required materials IN PDF FORMAT., 36281=Finalists Interview: Spring 2016, 79042=2007 Damon Runyon Fellows' Retreat October 7-11, 2007 The Marconi Conference Center Marshall, California Featured speakers: Dr. Gerard Evan and Dr. Arshad Desai, 170846=The Scholar Award, an annual stipend of $100,000 for each of the three years, supported a Scholar’s independent investigation in the cancer field at a critical time in their research career, their first faculty position. This award was discontinued in 2006., 995830=•    Finalists interview: Spring 2016 (TBA), 950661=Review Panel Meeting: March 2016, 995908=•    Award start date: July 1, 2016, 900251=FINALISTS WILL BE SELECTED BY THE INNOVATION AWARD COMMITTEE AND INVITED TO INTERVIEW IN FALL 2015. , 903706=APPLICATION DEADLINE: July 1, 2013}",
    "lastModified": "Sun, 02 Aug 2015 08:40:07 GMT",
    "textBeforeTable": "Award Stipends The award may not be used for institutional overhead or indirect costs. Funding Foreign candidates may apply to do their research only in the United States. Candidates applying to work in foreign-based or United States government laboratories may be awarded a fellowship if they are considered to be especially meritorious or if the program represents an unusual opportunity for postdoctoral training. Candidates who are pursuing a degree are not eligible. Candidates who have already accepted a postdoctoral research fellowship award are not eligible. Postdoctoral training in the same institution in which the applicant received his/her degree is discouraged, particularly if it is in the same department.  (If either situation applies, the applicant must address the reason(s) in his/her application.)  Proposals to continue training in the laboratory where the applicant received his/her PhD will not be considered.  Proposals that are direct extensions of graduate work will not be funded. Only one fellowship application will be accepted from a Sponsor, co-Sponsor or Fellow per review session; there is no limit, however, to the number of applications from an institution. No more than two Damon Runyon and/or Damon Runyon-Sohn Fellows will be funded to work with the same Sponsor at any given time. The proposed research must be conducted at a university, hospital or research institution. Level 2 Funding: Physician-scientist applicants (MD, MD/PhD, DDS, DVM or the equivalent) must have completed their residencies and clinical training, must be board eligible in the United States",
    "textAfterTable": "2nd Year $50,000 $60,000 $2,000 3rd Year $50,000 $60,000 $2,000 4th Year $50,000 $60,000 $2,000 *Physician-scientists who have completed their residencies and clinical training and are board eligible in the United States will receive Level 2 funding. Expense Allowance The $2,000 expense allowance is awarded to the laboratory in which the Fellow is working and can be used by the Fellow for his/her educational and scientific expenses.  With written request to the Foundation from the Fellow, the expense allowance may be used to defray the cost of health benefits.  The Fellow determines how he/she would like to spend the money with approval from his/her sponsor.  It is not an allowance for institutional overhead, postdoctoral scholar registration fees or postdoctoral fellowship taxes.  Institutions may not automatically deduct any fees from this allowance without the Fellow’s approval.  If you have any questions on how the money may be spent, please contact the Foundation (212.455.0520 or .(JavaScript must be enabled to view this email address)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}