{
    "relation": [
        [
            "Patent application number",
            "20090082445",
            "20090118377",
            "20100317661",
            "20110184033",
            "20110319362",
            "20120232118"
        ],
        [
            "Description",
            "GOSSYPOL CO-CRYSTALS AND THE USE THEREOF - This invention relates to compositions comprising co-crystals of (−)-gossypol with a C",
            "APOGOSSYPOLONE AND THE USES THEREOF - The invention relates to the compound apogossypolone and salts and prodrugs thereof. Apogossypolone functions as an inhibitor of Bcl-2 family proteins. The invention also relates to the use of apogossypolone for inhibiting hyperproliferative cell growth, for inducing apoptosis in cells and for sensitizing cells to the induction of apoptotic cell death.",
            "SMALL MOLECULE INHIBITORS OF MDM2 AND THE USES THEREOF - The invention relates to small molecules which function as inhibitors of the interaction between p53 and MDM2. The invention also relates to the use of these compounds for inhibiting cell growth, inducing cell death, inducing cell cycle arrest and/or sensitizing cells to additional agent(s).",
            "Selective Ligands for the Dopamine 3 (D3) Receptor and Methods of using the Same - Potent and selective ligands for the dopamine 3 (D",
            "STAT3 LIGANDS AND THERAPEUTIC USES THEREOF - Inhibitors of STAT3 are disclosed. Methods of using the STAT3 inhibitors in the treatment of diseases and conditions wherein inhibition of STAT3 provides a benefit, like cancers, also are disclosed.",
            "SELECTIVE LIGANDS FOR THE DOPAMINE 3 (D3) RECEPTOR AND METHODS OF USING THE SAME - Potent and selective ligands for the dopamine 3 (D"
        ],
        [
            "Published",
            "03-26-2009",
            "05-07-2009",
            "12-16-2010",
            "07-28-2011",
            "12-29-2011",
            "09-13-2012"
        ]
    ],
    "pageTitle": "Chen, MI - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chen-mi-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442989075,
    "recordOffset": 442945730,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jianyong Chen, Ann Arbor, MI US 07-17-2014 BCL-2/BCL-XL INHIBITORS AND THERAPEUTIC METHODS USING THE SAME - Inhibitors of Bcl-2/Bcl-xL and compositions containing the same are disclosed. Methods of using the Bcl-2/Bcl-xL inhibitors in the treatment of diseases and conditions wherein inhibition of Bcl-2/Bcl-xL provides a benefit, like cancers, also are disclosed. 20140199234 07-26-2012 BCL-2/BCL-XL INHIBITORS AND THERAPEUTIC METHODS USING THE SAME - Inhibitors of Bcl-2/Bcl-xL and compositions containing the same are disclosed. Methods of using the Bcl-2/Bcl-xL inhibitors in the treatment of diseases and conditions wherein inhibition of Bcl-2/Bcl-xL provides a benefit, like cancers, also are disclosed. 20120189539 Published Description Patent application number Jianfang Chen, Ann Arbor, MI US 02-02-2012 Multiple Stage Heterogeneous High Power Battery System for Hybrid and Electric Vehicle - A multiple stage battery system has significantly improved battery life in hybrid and electric motorized vehicle. At least two segments of battery packs are charged and discharged with two different battery management strategies, one handles transient energy needs and the other copes with cruise energy needs. The primary segment of battery are charged and discharged within a controlled State of Charge (SOC) range at a set point, it stores relatively less energy but supplies relative high impulse current during charge and discharge. The secondary segments have larger energy capacity, and are charged and discharged at constant current mode in deep cycling, near complete full charge and full discharge. These",
    "textAfterTable": "Patent applications by Jianyong Chen, Ann Arbor, MI US Jia-Shiun Chen, Plymouth, MI US Patent application number Description Published 20110023823 Apparatus and Method for Throttle Control of Internal Combustion Engines - A throttle control valve is provided. It includes a valve housing having an inlet end, an outlet end. A valve body located within the housing has a sealing end and a spindle. The sealing end has a teardrop shaped cross-section for cooperating with the valve housing. 02-03-2011 Jin-Jae Chen, Canton, MI US Patent application number Description Published 20100332094 COOPERATIVE TRACTION CONTROL SYSTEM USING DUAL SLIP CONTROLLERS - A cooperative traction control system that integrates throttle control and torque distribution. The system also uses dual slip controllers and methods that involve controlling the distribution of torque between wheels in the front and rear axles of a vehicle and a relatively small or no adjustment of the engine throttle (or, more generally, engine torque output) to reduce wheel slip. The control is cooperative in the sense that two controllers—a front axle torque controller and a rear axle torque controller—work together (or are controlled together) to reduce wheel slip and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}