{
    "relation": [
        [
            "Template Detail",
            "Template type",
            "Template name and version",
            "Template Dependencies",
            "Template JAR file and location"
        ],
        [
            "Information",
            "Extension",
            "Oracle WebCenter Analytics Producer - 11.1.1.0",
            "Oracle JRF - 11.1.1.0",
            "WC_ORACLE_HOME/common/templates/applications/oracle.analyticscollector_template_11.1.1.jar"
        ]
    ],
    "pageTitle": "Fusion Middleware Product Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E21764_01/web.1111/e14138/fmw_templates.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71161507,
    "recordOffset": 71145881,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 13 May 2015 05:19:31 GMT",
    "textBeforeTable": "Table 3-26 Oracle WebCenter Analytics Template Details The following table provides key information about this template. The Oracle WebCenter Analytics template configures the Oracle WebCenter Analytics application and dependent templates. Oracle WebCenter Analytics WC_ORACLE_HOME/common/templates/applications/oracle.wc_custom_services_producer_template_11.1.1 Template JAR file and location Oracle WebCenter Services Producer Component Template Dependencies Oracle WebCenter Custom Services Producer - 11.1.1.0 Template name and version Extension Template type Information Template Detail Table 3-25 Oracle WebCenter Custom Producer Template Details The following table provides key information about this template. The Oracle WebCenter Custom Services Producer template adds the WC_CustomServicesProducer Managed Server. It also adds a JDBC data source for accessing the WebCenter, Activities and MDS schemas. Oracle WebCenter Custom Services Producer",
    "textAfterTable": "Oracle WebCenter Activity Graph The Oracle WebCenter Activity Graph template configures the Oracle WebCenter Activity Graph application and dependent templates. The following table provides key information about this template. Table 3-27 Oracle WebCenter Activity Graph Template Details Template Detail Information Template type Extension Template name and version Oracle WebCenter Activity Graph Producer - 11.1.1.0 Template Dependencies Oracle JRF - 11.1.1.0 Template JAR file and location WC_ORACLE_HOME/common/templates/applications/oracle.activitygraph_template_11.1.1.jar Oracle WebCenter Pagelet Producer The Oracle WebCenter Pagelet Producer template configures the Oracle WebCenter Pagelet Producer application and dependent templates. The following table provides key information about this template. Table 3-28 Oracle WebCenter Pagelet Producer Template Details",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}