{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Am learning a lot"
        ],
        [
            "Comments",
            "People that live close to Pearl City would benefit from this school or for people taking pre requisite classes to transfer.",
            "Check out the rates/reviews on professors before taking them.",
            "I learn quite a lot of interesting information. The teachers are great and love to help you."
        ]
    ],
    "pageTitle": "Leeward Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Leeward-Community-College/reviews?_escaped_fragment_=/show/69200",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900036188,
    "recordOffset": 899993533,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114214=Start early! Go online to fafsa.gov and apply for a Pell Grant before you do anything else. I started this process late in July, so had to wait until after the semester started to get any financial aid. Then go online to the Leeward website and figure out what major and classes you want to take. I'll say it again..start early!, 213401=© 2015, Cappex.com, LLC, 206390=The food is good, but expensive, plus they only except cash. Except for Subway, (They have a Subway there obviously) But our school throws many events, and at these events there is always great food. For our Halooween party this past wednesday on 10/29/2014 We had cupcake trucks and local food trucks. I ate Pastele Stew with Gandule Rice, along with Red Velvet Malasada Cheesecake Bites. and it was only 15.00 dollars for the both of tjem. it was very delicious., 112250=Student ID is free and qualifies you for student discounts at the movie theaters and on the bus. Parking on campus is always hard to find, but if you're lucky you'll find street parking. Price per unit here is $101 for Hawaii residents (2012 price). $1212 for 12 units. I bought my books at amazon.com for around $200 total.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 58 Brad from Waipahu, HI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "10/07/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 58 Categories Comments Am learning a lot This school is great-the staff, the students, and the activities! You have a huge opportunity to meet new people, and the teachers are really approachable. It's a very comfortable environment. I'm glad i made the decision to start my college career at a Community campus. Login to rate or flag the reviews Gavin from Waianae, HI 03/05/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 58 Categories Comments Campus Safety security always seems to pop up at inconvenient times... Clubs and Activities lots",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}