{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus police (KUPD) are always on patrol and campus safety is a priority here at Kean. Updates via notification alerts are also very helpful. Emergency services are always on hand to respond to any issues. Despite the urban surrounding area, the campus grounds are very safe, even at night.",
            "Several Greek organizations do exist on campus and are willing to take in members.",
            "Many clubs and organizations are at home at Kean and can be found via CougarLINK on Kean's website. Kean also has KeanXpedition: a competition program for Kean students that covers a variety of activities for students to participate in and win prizes.",
            "Design students (graphic design, interior design, industrial design) may find it very beneficial to attend Kean as the Robert Busch School of Design (Kean's design department) is relocating to the newly-constructed Green Lane building. The Thinking Creatively Conference is head annually at Kean and many of the staff members of the Robert Busch School of Design are professionals with many connections in the design industry.",
            "The academic environment is not too competitive and the tuition is very affordable compared to most other colleges within the area. The campus is visually appealing and the staff is generally helpful.",
            "The campus' University Center contains a game room filled with video game consoles, lounge areas, flat screen TVs, as well as ping-pong and foosball tables. Many clubs and organizations make their homes at Kean. The athletic center houses a gym among other athletic outlets open to all students. Shows and theatre productions are held by the Premiere Stages throughout the semesters and are always an option for entertainment.",
            "On-campus eateries could have better food. The Starbucks at the library is nice but, there are better dining choices outside of the campus, such as Rock'n'Joe at the Union train station.",
            "Technical issues such as heating/air conditioning as well as elevator problems have affected many students. Much of the student population is comprised of commuters so, don't expect to be too accustomed to dorming at Kean.",
            "General education classes have not been very difficult however, major-related classes can be challenging; as they should be.",
            "- Tuition rates are fairly low compared to most other 4-year schools near the central NJ area. - Students interested in design and visual arts may find good opportunities here, as there's been a strong focus on the design department. - Commuting by car is NOT recommended as traffic and parking are huge issues for many students. Commute by train via NJTRANSIT.",
            "It's a modest but, somewhat overambitious four-year university. The campus is very attractive and the staff is generally helpful. However, university policies could do with some improvement."
        ]
    ],
    "pageTitle": "Kean University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Kean-University/reviews?_escaped_fragment_=/show/5343",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905388667,
    "recordOffset": 905331813,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{148631=Honestly Kean University spends more money on appearance than they do on maintenance. Everyday Fall 2011 Semester workers were out there building & creating new scenery. Cutting the grass, trimming the edges, etc. But when it came to maintaining the residence halls they slacked. The heat had been broken, which took them weeks to fix and the washing machines in Whiteman Hall had been out of order for a week on end. It was just very inconvenient., 184523=I am a transfer student and will be attending Kean University Fall 2012., 311654=© 2015, Cappex.com, LLC, 188449=A lot of fun! Not many people dorm, only like 1000, but there has been a great request lately. A great college experience!}",
    "textBeforeTable": "01/19/2010 Reviewer is A current student here. 26 out of 28 people found this review useful. 1 of 80 Lisette from Clifton, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Login to rate or flag the reviews Brianna from Piscataway, NJ 03/23/2012 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 80 Categories Comments Campus Safety We have our own police station on campus and they are always roaming around to make sure that the campus is safe. What to do for fun There's night clubs surrounding us, yes you will have to call a taxi or have a car but it is worth it. We also have an Applebees up the street and if you travel a little bit further we have a plethora of restaurants. We also have Jersey Gardens which we have a shuttle that takes us there and back. We have a pool, tennis court, basketball court, football field, gymnastics rooms and dance rooms. Food and Dining Unfortunately, the food has its highs and lows. The cafeteria that every freshman has to get swipes for is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}