{
    "relation": [
        [
            "Patent application number",
            "20100228002",
            "20110159193"
        ],
        [
            "Description",
            "SELF-CROSSLINKING POLYAMIC ACID, SELF-CROSSLINKING POLYIMIDE, METHOD OF MANUFACTURING SELF-CROSSLINKING POLYIMIDE, AND SELF-CROSSLINKING POLYIMIDE FILM INCLUDING THE SELF-CROSSLINKING POLYIMIDE - Provided are a self-crosslinking polyamic acid being a condensation reaction product of melamine-based material, an acid anhydride, and a diamine compound, a self-crosslinking polyimide being a condensation and imidization reaction product of melamine-based material, an acid anhydride, and a diamine compound, a method of preparing the self-crosslinking polyimide, and a self-crosslinking polyimide film including the self-crosslinking polyimide.",
            "METHOD OF FORMING FLEXIBLE MOISTURE AND OXYGEN BARRIER THIN FILM SUBSTRATE - Disclosed herein is a method of forming a flexible moisture and oxygen barrier thin film substrate for a flexible display and food packaging, the thin film being able to increase the life-spans of organic devices. The method includes the steps of: a) uniformly dispersing plate-shape nanometer-size or micrometer-size particles in polymer solution; b) casting the polymer solution dispersed with the nanometer-size or micrometer-size particles using the solution casting method and then removing the solvent from the cast polymer solution to form a plastic film; c) stretching the formed plastic film between the glass transition temperature and melting point to exfoliate the plate-shape nanometer-size or micrometer-size particles and to orient the exfoliated nanometer-size or micrometer-size particles; d) coating the stretched plastic film with an organic film to smooth the surface of the flexible substrate; and e) heat-treating the flexible substrate to cure the organic film."
        ],
        [
            "Published",
            "09-09-2010",
            "06-30-2011"
        ]
    ],
    "pageTitle": "Chang, Seoul - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chang-seoul-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425263223,
    "recordOffset": 425224287,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jin-Hae Chang, Seoul KR 08-20-2009 Diagnose device for measuring the ratio of proteins with similar structure - The present invention relates to a diagnostic device for measuring the ratio of similar structural proteins among the proteins secreted in a liquid test sample taken from diagnosis subject. In further detail, the test device according to the present invention comprises detection marker-antibody conjugate recognizing the same site on two or more similar structural proteins and a detection zone in which antibody specifically recognizes each of said proteins via formation of sandwich type complex, wherein said antibodies form a set, and the present Invention relates to a diagnostic device for early diagnosis of polycystic ovary syndrome, abnormal pregnancy, prostatic carcinoma etc. based on determination of the ratio of follicle stimulating hormone and luteinizing hormone in case of polycystic ovary syndrome, the ratio between hCG isomers in case of abnormal pregnancy, and the ratio of prostate-specific antigens (PSA) in case of prostatic carcinoma. 20090208983 Published Description Patent application number Jindong Chang, Seoul KR //]]> BarDraw('2735793',['Patent applications by Jin A. Chang, Seoul KR'],[[2,2,1]],['2008','2010','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2735793\" align=\"center\"></div> </div> <canvas id=\"bg2735793\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jin A. Chang, Seoul KR</p> <div class=\"bar2735793\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-20-2011</td> <td><a href=\"/patents/app/20110258559\">MOBILE TERMINAL AND MESSAGE LIST DISPLAYING METHOD THEREIN</a> - A mobile terminal and message list displaying",
    "textAfterTable": "Jin Yeop Chang, Seoul KR Patent application number Description Published 20110103581 METHOD AND APPARATUS FOR GENERATING NON-INTERACTIVE KEY AND METHOD FOR COMMUNICATION SECURITY USING THE SAME - A method and apparatus for generating a non-interactive key, and a method for communication security using the same. A event is detected, and keys are generated based on the detected event. Thus, keys are generated using a small number of calculating operations with a simple interface and thus a user may easily generate the keys, and the performance of an apparatus using the keys is improved. In addition, the keys are generated without wireless interaction between nodes, thereby improving communication security. 05-05-2011 20130324121 APPARATUS AND METHOD FOR MACHINE-TO-MACHINE COMMUNICATIONS - Provided are an apparatus and method for executing machine-to-machine (M2M) communications. A device is abstracted through a pre-stored device master template and a pre-stored resource master template, M2M communications are managed through an interface to access resources, and information is periodically synchronized. A problem of system scalability and a problem of heterogeneity of interfaces to access resources may be solved and synchronization may be performed while a load of a network service capability layer (NSCL) is minimized without deteriorating service quality. 12-05-2013 Jong Soo Chang, Seoul KR Patent application number Description Published 20120028359 PRODUCTION PROCESS OF GENDER-SPECIFIC SERUM AND BIOMARKER USING THE SERUM - The present invention relates to a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}