{
    "relation": [
        [
            "Keyer",
            "robincampbell87",
            "pjfogarty",
            "pamgarfield1",
            "bookwilson",
            "barbandjoann",
            "caitierosem",
            "Gma3Nancy",
            "marionbaccelli",
            "damsel71451",
            "SAlbrecht601"
        ],
        [
            "Records Keyed",
            "20,287",
            "13,053",
            "6,403",
            "3,678",
            "2,631",
            "2,053",
            "1,939",
            "1,575",
            "1,402",
            "1,392"
        ]
    ],
    "pageTitle": "All about genealogy and family history - World Archives Project Completed Project Statistics - Ancestry.com Wiki",
    "title": "",
    "url": "http://www.ancestry.co.uk/wiki/index.php?title=World_Archives_Project_Completed_Project_Statistics&curid=10907&diff=32914&oldid=32912",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 284171143,
    "recordOffset": 284109382,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Easy English United States - Georgia 1864 Census for Re-Organizing the Georgia Militia Top Arbitrators Top Keyers Project Stats Difficulty Language Location Project WAP 2 USHMM (World Memory Project) 1 WAP Contents This page is manually updated by volunteers, so it may take a little while for newly completed projects to show up. The keying statistics for some projects are not documented and thus are blank or are all zeroes/nulls here. Some older projects do not have a wiki page; their project titles show up in red. Those projects with 0% for every project statistical category were arbitrated (two people key every page, and an arbitrator chooses the correct keying for each field) rather than reviewed (one person keys every page, and an arbitrator reviews each field for correctness). Because this page is very large",
    "textAfterTable": "Keyer Records Keyed arlatx 4,879 mickeyr68505 3,149 gradisys 2,638 Sara Curtis 2,560 Paulmd199 2,513 mtnavsfan_1 2,294 pjfogarty 2,163 wiedwoman 1,846 bjwebb3749 1,704 klnienhouse 1,622 Arbitrator Records Arbitrated Paulmd199 7,917 pjfogarty 3,380 wiedwoman",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}