{
    "relation": [
        [
            "Patent application number",
            "20090150232",
            "20120209675",
            "20120209676",
            "20120239472"
        ],
        [
            "Description",
            "Methods and Systems for Retail Customer Referral Compensation Programs - Embodiments of the present invention relate generally to business methods and systems for retail marketing, and specifically to Retail Customer Referral Compensation Programs for using Performance-Driven criteria to award Production Points for determining a Referring Customer's position in a Performance-Driven Floating Matrix compensation and matching bonus plan in a retail marketing organization",
            "Methods and Systems for Retail Customer Referral Compensation Programs - Embodiments of the present invention relate generally to business methods and systems for retail marketing, and specifically to retail customer referral compensation programs for using performance driven criteria to award production points for determining a referring customer's position in a performance driven floating compensation structure and matching bonus plan in a retail marketing organization",
            "Methods and Systems for Retail Customer Referral Compensation Programs - Embodiments of the present invention relate generally to business methods and systems for retail marketing, and specifically to Retail Customer Referral Compensation Programs for using Performance-Driven criteria to award Production Points for determining a Referring Customer's position in a Performance-Driven Floating Matrix compensation and matching bonus plan in a retail marketing organization.",
            "Methods and Systems for Retail Customer Referral Compensation Programs - Embodiments of the present invention relate generally to business methods and systems for retail marketing, and specifically to Retail Customer Referral Compensation Programs for using Performance-Driven criteria to award Production Points for creating a Position Changing Point Driven matrix and determining a Referring Customer's position and compensation within that matrix."
        ],
        [
            "Published",
            "06-11-2009",
            "08-16-2012",
            "08-16-2012",
            "09-20-2012"
        ]
    ],
    "pageTitle": "Tyler, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tyler-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438959983,
    "recordOffset": 438925580,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "J. Benjamin Tyler, Orem, UT US //]]> BarDraw('3051125',['Patent applications by James S. Tyler, Woodstock, GA US'],[[1,2,1,2]],['2008','2009','2010','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3051125\" align=\"center\"></div> </div> <canvas id=\"bg3051125\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by James S. Tyler, Woodstock, GA US</p> <div class=\"bar3051125\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-23-2011</td> <td><a href=\"/patents/app/20110147039\">Communication Cable Comprising Electrically Discontinuous Shield Having Nonmetallic Appearance</a> - A tape can comprise a dielectric film that has a pattern of electrically conductive areas adhering thereto. The conductive areas can be electrically isolated from one another. The tape can utilize means to obscure the metallic finish and can contain indicators to deter installers from grounding the tape at either end. The tape can be wrapped around one or more conductors, such as wires that transmit data, to provide electrical or electromagnetic shielding for the conductors. The resulting cable can have a shield that is electrically discontinuous between opposite ends of the cable.</td> <td>20110147039</td> <tr> </tr> <td>06-23-2011</td> <td><a href=\"/patents/app/20110147033\">Communication Cable Comprising Electrically Discontinuous Shield Having Nonmetallic Appearance</a> - A tape can comprise a dielectric film that has a pattern of electrically conductive areas adhering thereto. The conductive areas can be electrically isolated from one another. The tape can utilize means to obscure the metallic finish and can contain indicators to deter installers from grounding the tape at either end. The tape can be wrapped around one or more conductors, such as wires that transmit data, to provide electrical",
    "textAfterTable": "Jeffrey M. Tyler, Leland, MS US Patent application number Description Published 20090055955 SOYBEAN VARIETY D4698573 - The invention relates to the soybean variety designated D4698573. Provided by the invention are the seeds, plants and derivatives of the soybean variety D4698573. Also provided by the invention are tissue cultures of the soybean variety D4698573 and the plants regenerated therefrom. Still further provided by the invention are methods for producing soybean plants by crossing the soybean variety D4698573 with itself or another soybean variety and plants produced by such methods. 02-26-2009 20090055956 SOYBEAN VARIETY D4125897 - The invention relates to the soybean variety designated D4125897. Provided by the invention are the seeds, plants and derivatives of the soybean variety D4125897. Also provided by the invention are tissue cultures of the soybean variety D4125897 and the plants regenerated therefrom. Still further provided by the invention are methods for producing soybean plants by crossing the soybean variety D4125897 with itself or another soybean variety and plants produced by such methods. 02-26-2009 20090055957 SOYBEAN VARIETY D4325666 - The invention relates to the soybean variety designated D4325666. Provided by the invention are the seeds, plants and derivatives of the soybean variety D4325666. Also provided by the invention are tissue cultures of the soybean variety D4325666 and the plants regenerated therefrom. Still further provided by the invention are methods for producing soybean plants by crossing the soybean variety D4325666 with itself or",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}