{
    "relation": [
        [
            "Manufacturer",
            "AMD",
            "AMD"
        ],
        [
            "Core",
            "Pluto",
            "Orion"
        ],
        [
            "Series",
            "Athlon",
            "Athlon"
        ],
        [
            "Socket",
            "Slot A",
            "Slot A"
        ],
        [
            "Cores",
            "1",
            "1"
        ],
        [
            "L2 Cache/Core",
            "512 KB",
            "512 KB"
        ],
        [
            "FSB",
            "100 MHz x2",
            "100 MHz x2"
        ],
        [
            "Process Size",
            "180 nm",
            "180 nm"
        ],
        [
            "Top Speed",
            "850 MHz",
            "1.0 GHz"
        ]
    ],
    "pageTitle": "The Big Processor Guide - AMD Cores - 10stripe",
    "title": "",
    "url": "http://www.10stripe.com/featured/cpu/amdcores.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265466407,
    "recordOffset": 265441412,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1690=While computer processors are their most high-profile business, a substantial portion of AMD's revenues have historically come from flash memory production (since spun off as Spansion, of which they own a good portion). They are also a player in the embedded device processor market now. And July 24, 2006, they announced they would be merging with ATI, thus putting them in the chipset and video card markets.}",
    "TableContextTimeStampAfterTable": "{50238=Palermo: The replacement for the Paris core. They are basically retooled Winchester (later Venice) chips. They are on a smaller process than Paris. Beginning at the E3 stepping, they support SSE3. Beginning at the E6 stepping, they support the full AMD64 extensions; some refer to these as the \"Sempron 64\" series. All support the NX bit. The Socket 939 chips support an increased 1000 MHz HyperTransport speed., 60762=These mobile variants on the Athlon 64 line initially targeted only the desktop replacement market (due to the high power consumption of the Clawhammer core), but with the introduction of Lancaster began to expand their appeal. 1600 MT/s HyperTransport., 73101=Cut-down Mobile Athlon 64s, the Mobile Sempron series is aimed for the smaller budget. With reduced L2 cache, they underperform their bigger brothers. HyperTransport speed of 1600 MT/s.}",
    "textBeforeTable": "Thuban: Six cores that more-than-slightly resemble the Opteron Istanbul. Gains Turbo Core. Shared 6 MB L3 cache. A better, faster Phenom. Phenom II products are in the Shanghai family, Barcelona's die-shrunk successor. Phenom II Mainstream Desktop Server Value Mainstream Laptop Value High End Mainstream Desktop Contents Note: All Front Side Bus speeds are listed at the frequency of the clock that drives them; double-pumping is indicated by a \"x2\" and quad-pumping by an \"x4\". This page identifies sockets that support those features.\"HTT\" indicates the processor uses HyperTransport. While computer processors are their most high-profile business, a substantial portion of AMD's revenues have historically come from flash memory production (since spun off as Spansion, of which they own a good portion). They are also a player in the embedded device processor market now. And July 24, 2006, they announced they would be merging with ATI, thus putting them in the chipset and video card markets. Advanced Micro Devices, Inc., has historically been a small but notable figure in the microprocessor market. While never matching the enormous size of long-time rival (and one-time partner) Intel, they have firmly established themselves as the second biggest player in the marketplace. In the days of the 486, they were noted for producing chips able to clock to higher speeds than those made by Intel, who originated",
    "textAfterTable": "FSB Process Size Top Speed AMD Callisto Phenom II X2 AM3 2 512 KB 4 GT/s HTT 45 nm 3.0 GHz (545) Heka: Deneb, with one core disabled. Like Deneb, Heka has 6 MB of L3 cache. Manufacturer Core Series Socket Cores L2 Cache/Core FSB Process Size Top Speed AMD Heka Phenom II X3 AM3 3 512 KB 4 GT/s HTT 45 nm 2.8 GHz (720) Deneb: The desktop version of Shanghai, Deneb is on a smaller process than its predecessors and includes other improvements. The result is higher performance and lower power usage, both of which earlier Phenom products needed. The 9xx series have 6 MB of L3 cache (shared between all cores), while the 8xx series have only 4 MB. Manufacturer Core Series Socket Cores L2 Cache/Core FSB Process Size Top Speed AMD Deneb Phenom II X4 AM3 4 512 KB 4 GT/s HTT 45 nm 3.0 GHz (945) AMD Deneb Phenom II X4 AM2+ 4 512 KB 4 GT/s HTT 45 nm 2.8 GHz (920) Phenom The next generation, Phenom brings the new K10 microarchitecture to the desktop. Toliman: Agena with one of the four cores disabled. All of the L3 cache is present. Because L2 cache in the K10 design is kept separate for the individual",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}