{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "GN Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-30079",
            "",
            "12-268",
            "14-143"
        ]
    ],
    "pageTitle": "47 CFR 73.190 - Engineering charts and related formulas. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/73.190?quicktabs_7=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 926642155,
    "recordOffset": 926598408,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1003=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{272842=This document requests comments on a Petition for Rule Making filed by Red Wolf Broadcasting Corporation, proposing to amend the FM Table of Allotments, Section 73.202(b) of the Commission's Rules, by allotting Channel 233A at Sagaponack, New York, as a first local service. A staff engineering analysis indicates that Channel 233A can be allotted to Sagaponack consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 3.2 kilometers (2 miles) northwest of the community. The reference coordinates are 40-56-01 NL and 72-18-55 WL., 85069=At the request of The Navajo Nation, the Audio Division amends the FM Table of Allotments, by allotting FM Channel 258C2 at Rough Rock, Arizona, as a first local Tribal Allotment and a first local service to the community. A staff engineering analysis confirms that Channel 258C2 can be allotted to Rough Rock consistent with the minimum distance separation requirements of the Commission's Rules with the imposition of a site restriction 7.1 km (4.4 miles) southeast of the community. The reference coordinates are 36-21-08 NL and 109-49-54 WL., 18652=The Audio Division amends the FM Table of Allotments, by allotting Channel 277A at Shelter Island, New York, as the community's first local service. A staff engineering analysis indicates that Channel 277A can be allotted to Shelter Island consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 12 kilometers (7.5 miles) south of the community. The reference coordinates are 40-57-54 NL and 72-22-59 WL., 202669=The Commission has before it a petition for rulemaking filed by TDS Broadcasting LLC (“TDS”), the licensee of KOHD, channel 51, Bend, Oregon, requesting the substitution of channel 18 for channel 51 at Bend. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. TDS has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 18 would remove any potential interference with authorized wireless operations in the adjacent Lower 700 MHZ A Block., 61809=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 142391=The Audio Division, at the request of Ashley A. Bruton, allot Channel 280A at McCall, Idaho, as the community's eighth local transmission service. A staff engineering analysis confirms that Channel 280A can be allotted to McCall, Idaho consistent with the minimum distance separation requirements of the rules with a site restriction 0.4 kilometers (0.2 miles) southwest of the community. The reference coordinates are 44-54-30 NL and 116-06-00 WL. See SUPPLEMENTARY INFORMATION, supra., 23488=In this document, the Commission announces that the Office of Management and Budget (OMB) approved on April 9, 2015, for a period for three years, an information collection for FCC Form 2100, Application for Media Bureau Audio and Video Service Authorization, contained in the Report and Order, FCC 14-50. This document is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the requirements., 137365=The Audio Division, at the request of Bryan Broadcasting License Corporation, substitutes Channel 274A for vacant Channel 267A at Centerville, Texas, and grant the Application for Station KKEE, Centerville, Texas, File No. BMPH-20140324ADD. A staff engineering analysis indicates that Channel 274A can be allotted to Centerville, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 4.3 kilometers (2.7 miles) east of Centerville. The reference coordinates are 31-15-00 NL and 95-56-00 WL., 104269=The Audio Division, at the request of Bryan King (“petitioner”), deletes FM Channel 227A and allots FM Channel 277A at Pearsall, Texas. Channel 277A can be allotted at Pearsall, consistent with the minimum distance separation requirements of the Commission's rules, at coordinates 28-56-40 NL and 99-11-44 WL, with a site restriction of 11.4 km (7.1 miles) northwest of the community. The Government of Mexico has concurred with the allotment of Channel 277A at Pearsall, which is located within 320 kilometers (199 miles) of the U.S.-Mexican border. See Supplementary Information infra., 400315=The Commission has before it a petition for rulemaking filed by Entravision Holdings, LLC (“Entravision”), the licensee of station KCEC(TV), channel 51, Denver, Colorado, requesting the substitution of channel 26 for channel 51 at Denver. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. KCEC(TV) has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 26 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 277729=The Commission has before it a petition for rulemaking filed by WLAJ-TV LLC, the licensee of station WLAJ-TV, channel 51, Lansing, Michigan, requesting the substitution of channel 25 for channel 51 at Lansing. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. WLAJ-TV LLC has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 25 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 197529=The Commission has before it a petition for rulemaking filed by WJAR Licensee, LLC (the Licensee), the licensee of WJAR(TV), channel 51, Providence, Rhode Island, requesting the substitution of channel 50 for channel 51 at Providence. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. The Licensee has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 50 would remove any potential interference with authorized wireless operations in the adjacent Lower 700 MHZ A Block., 243436=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 51817=At the request of Chris Samples Broadcasting, Inc., licensee of Station KXDJ(FM), Channel 252C2, Spearman, Texas, the Audio Division amends the FM Table of Allotments, by substituting Channel 221A for vacant Channel 252A at Silverton, Texas to accommodate the Application that requests to upgrade the facilities of Station KXDJ(FM) from Channel 252C2 to Channel 252C1 at Spearman, Texas. The channel substitution at Silverton, Texas would be in the public interest because it would accommodate the Application and eliminate the Station KICA-FM 73.215 short-spacing. A staff engineering analysis indicates that Channel 221A can be allotted to Silverton, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 7.8 kilometers (4.9 miles) east of Silverton. The reference coordinates are 34-28-15 NL and 101-13-09 WL., 99798=The Audio Division, at the request of Threshold Communications, substitutes FM Channel 235C1 for Channel 249C1 at Altamont, Oregon. Channel 235C1 can be allotted at Altamont in compliance with the Commission's minimum distance separation requirements with a site restriction of 20 km (12.6 miles) northeast of Altamont, at 42-08-37 North Latitude and 121-30-19 West Longitude., 128795=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection associated with the Commission's Report and Order, 2014 Quadrennial Regulatory Review, FCC 14-28. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the requirements., 227422=In this document, the Commission proposes to expand to cable operators, satellite TV providers, broadcast radio licensees, and satellite radio licensees the requirement that public inspection files be posted to the FCC's online database. In 2012, the Commission adopted online public file rules for broadcast television stations that required them to post public file documents to a central, FCC-hosted online database rather than maintaining the files locally at their main studios. Now that television broadcasters have completed their transition to the online file, the Commission believes it is appropriate to commence the process of expanding the online file to other media entities to extend the benefits of improved public access to public inspection files and, ultimately, reduce the burden of maintaining these files., 267759=This document requests comments on a Petition for Rule Making filed by Charles Crawford, proposing to amend the FM Table of Allotments, of the Commission's rules, by allotting Channel 247A at Bogata, Texas, as a first local service. A staff engineering analysis indicates that Channel 247A can be allotted to Bogata, Texas consistent with the minimum distance separation requirements of the Commission's rules with a site restriction located 12.9 kilometers (8 miles) northwest of Bogata. The reference coordinates are 33-33-21 NL and 95-18-28 WL., 156330=The Audio Division, at the request of JER Licenses, LLC, substitute alternative Channel 281C for vacant Channel 280C at Toquerville, Utah to accommodate the “hybrid” application that requests the downgrade of the new FM station from Channel 281C3 to Channel 280A at Peach Springs, Arizona. A staff engineering analysis confirms that Channel 281C can be allotted to Toquerville, Utah consistent with the minimum distance separation requirements of the Rules without a site restriction. The reference coordinates for Channel 281C at Toquerville are 37-15-12 NL and 113-17-00 WL. See Supplementary Info. supra., 312627=The Commission has before it a petition for rulemaking filed by KCEB License Company, LLC (“KCEB License”), the licensee of KCEB(TV), channel 51, Longview, Texas, requesting the substitution of channel 26 for channel 51 at Longview. While the Commission instituted a freeze on the acceptance of full power television rulemaking petitions requesting channel substitutions in May 2011, it subsequently announced that it would lift the freeze to accept such petitions for rulemaking seeking to relocate from channel 51 pursuant to a voluntary relocation agreement with Lower 700 MHz A Block licensees. KCEB License has entered into such a voluntary relocation agreement with T-Mobile USA, Inc. and states that operation on channel 26 would eliminate potential interference to and from wireless operations in the adjacent Lower 700 MHZ A Block., 425084=This document requests comments on a Petition for Rule Making filed by Chris Samples Broadcasting, Inc, licensee of Station KXDJ(FM), Channel 252C2, Spearman, Texas, proposing to substitute Channel 221A for vacant Channel 252A at Silverton, Texas. A staff engineering analysis indicates that Channel 221A can be allotted to Silverton, Texas consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 7.8 kilometers (4.9 miles) east of Silverton. The reference coordinates are 34-28-15 NL and 101-13-09 WL. The purpose of the channel substitution is to accommodate the “hybrid” application requesting to upgrade the facilities of Station KXDJ(FM) from Channel 252C2 to Channel 252C1 at Spearman, Texas, File No. BPH-20140519AHY., 375670=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 253036=This document requests comments on a Petition for Rule Making filed by Red Wolf Broadcasting Corporation, proposing to amend the FM Table of Allotments, § 73.202(b) of the Commission's rules, by allotting Channel 277A at Shelter Island, New York, as a first local service. A staff engineering analysis indicates that Channel 277A can be allotted to Shelter Island consistent with the minimum distance separation requirements of the Commission's rules with a site restriction located 12 kilometers (7.5 miles) south of the community. The reference coordinates are 40-57-54 NL and 72-22-59 WL., 159346=Title 47 published on 2014-10-01, 283089=This document requests comments on a Petition for Rule Making filed by Charles Crawford, proposing to amend the FM Table of Allotments, Section 73.202(b) of the Commission's Rules, by allotting Channel 295A at Wright City, Oklahoma, as the community's first local service. A staff engineering analysis indicates that Channel 295A can be allotted to Wright City consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 14 kilometers (8.6 miles) east of the community. The reference coordinates are 34-04-44 NL and 94-51-15 WL., 27816=At the request of Red Wolf Broadcasting Corporation, the Audio Division amends the FM Table of Allotments, by allotting Channel 233A at Sagaponack, New York, as the community's first local service. A staff engineering analysis indicates that Channel 233A can be allotted to Sagaponack consistent with the minimum distance separation requirements of the Commission's Rules with a site restriction located 3.2 kilometers (2 miles) northwest of the community. The reference coordinates are 40-56-01 NL and 72-18-55 WL., 169261=The Incentive Auction Task Force provides the results of several staff simulations of the initial clearing target optimization procedure proposed in the Auction 1000 Comment PN and/or Comment PN as discussed further in this under the Supplementary Information. In this document, the Federal Communications Commission's (Commission) Incentive Auction Task Force seeks comment on the data and analyses released in this document and the attached Appendix., 237634=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals.}",
    "lastModified": "Thu, 02 Jul 2015 08:38:24 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 30630 - Television Broadcasting Services; Providence, Rhode Island 2015-05-29; vol. 80 # 103 - Friday, May 29, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. [28 FR 13574, Dec. 14, 1963, as amended at 30 FR 12720, Oct. 6, 1965; 33 FR 15420, Oct 17, 1968; 48 FR 42959, Sept. 20, 1983; 49 FR 43963, Nov. 1, 1984; 50 FR 18844, May 2, 1985; 51 FR 4753, Feb. 7, 1986; 52 FR 36879, Oct. 1, 1987; 56 FR 64869, Dec. 12, 1991]",
    "textAfterTable": "DA 15-621 FEDERAL COMMUNICATIONS COMMISSION Final rule. This rule is effective May 29, 2015. 47 CFR Part 73 Summary The Commission has before it a Notice of Proposed Rulemaking issued in response to a petition for rulemaking filed by WJAR Licensee, LLC (the Licensee), the licensee of WJAR(TV), channel 51, Providence, Rhode Island, requesting the substitution of channel 50 for channel 51 at Providence. The licensee filed comments reaffirming its interest in the proposed channel substitution and stated that if the proposal is granted, it will promptly file an application for the facilities specified in its rulemaking petition and construct the station. The licensee asserts that adopting the proposed channel substitution would serve the public interest because it would remove any potential interference with a wireless licensee in the Lower 700 MHz A Block located adjacent to channel 51 in Providence, Rhode Island-New Bedford, Massachusetts and Boston, Massachusetts television markets. 2015-05-20; vol. 80 # 97 - Wednesday, May 20, 2015 80 FR 28848 - Television Broadcasting Services; Bend, Oregon GPO FDSys",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}