{
    "relation": [
        [
            "City",
            "Venray",
            "Delft",
            "Amstelveen",
            "Amsterdam",
            "Den Haag"
        ],
        [
            "Cabinets",
            "54",
            "130",
            "180",
            "528",
            "866"
        ],
        [
            "Activated",
            "30",
            "60",
            "87",
            "212",
            "421"
        ],
        [
            "Calculation Time (s)",
            "2.6",
            "5.3",
            "6.3",
            "22.9",
            "46.3"
        ]
    ],
    "pageTitle": "OSA | Roll-out of Reliable Fiber to the Cabinet: An Interactive Planning Approach",
    "title": "",
    "url": "https://www.osapublishing.org/jocn/abstract.cfm?uri=jocn-6-8-705",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903683023,
    "recordOffset": 903633491,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{106643=F. Phillipson, “Fast roll-out of fibre to the cabinet: Practical approach for activation of cabinets,” in 19th Eur. Conf. on Networks and Optical Communications (NOC 2014), Milano, Italy, 2014., 189672=In this paper a total approach is presented for interactive planning of a reliable fiber-to-the-cabinet network. Interactive means here that areas with 600 to 1000 cabinets can be planned roughly within minutes. The problem of telecom operators, when planning fiber to the cabinet, is to find the minimum number of cabinets that are equipped with active equipment such that a required number of customers are within a targeted distance from an activated cabinet. Next, these activated cabinets need to be clustered and connected with a highly reliable fiber ring, satisfying capacity constraints. A three-step approach is described: an activation problem, a cluster problem, and a routing problem, each in a heuristic approach. The paper shows that the total interactive approach is indeed possible by presenting several real life cases., 117140=M. Inaba, N. Katoh, and H. Imai, “Applications of weighted Voronoi diagrams and randomization to variance-based k-clustering,” in Proc. of 10th ACM Symp. on Computational Geometry, 1994, pp. 332–339., 137912=M. Labbé, G. Laporte, I. R. Martín, J. José, and J. González, “The ring star problem: Polyhedral analysis and exact algorithm,” Networks, vol.  43, pp. 177–189, 2004. [CrossRef], 123441=A. Fink, G. Schneidereit, and S. Voß, “Solving general ring network design problems by meta-heuristics,” in Computing Tools for Modeling, Optimization and Simulation. Springer, 2000, pp. 91–113., 128538=T. Cormen, C. Leiserson, R. Rivest, and C. Stein, Introduction to Algorithms, 3rd ed. Cambridge, MA: MIT, 2009., 126777=R. Daamen, “Heuristic methods for the design of edge disjoint circuits,” M.Sc. thesis, Tilburg University and TNO, 2013., 140127=A. Jain, “Data clustering: 50 years beyond K-means,” Pattern Recogn. Lett., vol.  31, pp. 651–666, 2010. [CrossRef], 140597=S. Gollowitzer and I. Ljubić, “MIP models for connected facility location: A theoretical and computational study,” Comput. Oper. Res., vol.  38, pp. 435–449, 2011., 133303=G. Croes, “A method for solving traveling salesman problems,” Oper. Res., vol.  6, pp. 791–812, 1958. [CrossRef], 108808=J. MacQueen, “Some methods for classification and analysis of multivariate observations,” in Proc. of 5th Berkeley Symp. on Mathematical Statistics and Probability, 1967, pp. 281–297., 136766=J. Xu, S. Chiu, and F. Glover, “Optimizing a ring-based private line telecommunication network using tabu search,” Manage. Sci., vol.  45, no. 3, pp. 330–345, 1999., 202013=1The author is with TNO, PO Box 5050, 2600 GB Delft, The Netherlands (e-mail: frank.phillipson@tno.nl)., 141962=D. Tipper, “Resilient network design: Challenges and future directions,” Telecommun. Syst., vol.  56, no. 1, pp. 5–16, 2014., 135381=K. Darby-Dowman and H. Lewis, “Lagrangian relaxation and the single-source capacitated facility-location problem,” J. Oper. Res. Soc., vol.  39, no. 11, pp. 1035–1040, 1988., 131730=D. Arthur and S. Vassilvitskii, “K-means++: The advantages of careful seeding,” in Proc. of the 18th Annu. ACM-SIAM Symp. on Discrete Algorithms, 2007, pp. 1027–1035., 188705=© 2014 Optical Society of America, 139565=D. Aloise, A. Deshpande, P. Hansen, and P. Popat, “NP-hardness of Euclidean sum-of-squares clustering,” Mach. Learn., vol.  75, pp. 245–248, 2009. [CrossRef], 134896=S. Lloyd, “Least squares quantization in PCM,” IEEE Trans. Inf. Theory, vol.  IT-28, no. 2, pp. 129–137, 1982., 138364=T. Thomadsen and T. Stidsen, “Hierarchical ring network design using branch-and-price,” Telecommun. Syst., vol.  29, no. 1, pp. 61–76, 2005., 135823=G. Mateus, F. Cruz, and H. Luna, “An algorithm for hierarchical network design,” Location Sci., vol.  2, no. 3, pp. 149–164, 1994., 137265=M. Henningsson, K. Holmberg, M. Rönnqvist, and P. Värbrand, “Ring network design by Lagrangian based column generation,” Telecommun. Syst., vol.  21, no. 2–4, pp. 301–318, 2002., 140842=S. Gollowitzer, L. Gouveia, and I. Ljubić, “A node splitting technique for two level network design problems with transition nodes,” Lect. Notes Comput. Sci., vol.  6701, pp. 57–70, 2011., 130732=P. Bradley, K. Bennet, and A. Demiriz, “Constrained K-means clustering,” Microsoft Research, , 2000., 134474=G. Clarke and J. Wright, “Scheduling of vehicles from a central depot to a number of delivery points,” Oper. Res., vol.  12, no. 4, pp. 568–581, 1964. [CrossRef], 138964=R. Baldacci, M. Dell’Amico, and J. S. González, “The capacitated m-ring-star problem,” Oper. Res., vol.  55, no. 6, pp. 1147–1162, 2007. [CrossRef], 141526=K. Vajanapoom, D. Tipper, and S. Akavipat, “Risk based resilient network design,” Telecommun. Syst., vol.  52, pp. 799–811, 2012., 141339=M. Chardy, M.-C. Costa, A. Faye, and M. Trampont, “Optimizing splitter and fiber location in a multilevel optical FttH network,” Eur. J. Oper. Res., vol.  222, no. 3, pp. 430–440, 2012., 136290=M. Gendreau, M. Labbé, and G. Laporte, “Efficient heuristics for the design of ring networks,” Telecommun. Syst., vol.  4, no. 1, pp. 177–188, 1995., 112024=R. Zhao, H. Liu, and R. Lehnert, “Topology design of hierarchical hybrid fiber-VDSL access networks with ACO,” in Proc. of the 4th Advanced Int. Conf. on Telecommunications, Athens, Greece, 2008., 133868=E. Dijkstra, “A note on two problems in connexion with graphs,” Numer. Math., vol.  1, no. 1, pp. 269–271, 1959. [CrossRef], 106871=F. Phillipson, “A cost effective topology migration path toward fibre,” in Proc. of the 3rd Int. Conf. on Information Communication and Management (ICICM2013), Paris, France, 2013., 106402=F. Phillipson, “Efficient clustering of cabinets at FttCab,” in Internet of Things, Smart Spaces, and Next Generation Networking. Berlin, Germany: Springer, 2013, pp. 201–213., 115063=M. Kalsch, M. Koerkel, and R. Nitsch, “Embedding ring structures in large fiber networks,” in Proc. of Telecommunications Network Strategy and Planning Symp. (NETWORKS), Rome, Italy, 2012.}",
    "textBeforeTable": "Selected Cases for Testing TABLE I × Close end if 37: 36:  go to line 14 then a swap has been performed if 35: ; 1 = l k x ; 0 = v k x ; 1 = v u x ; 0 = m u x ; 0 = u y 34: ; v u l k swapcost   argmin = )",
    "textAfterTable": "Den Haag 866 271,622 502,000 6 Close × TABLE II Results for t j = 2   AIMSS Heuristic Random City Value Time Value Time Value Time Venray 913,232 32 s 926,310 < 1     s 961,121 (1,009,696) < 1     s Delft 1,735,156 261 s 1,758,314 < 1     s 2,143,430 (2,349,740) 17 s Amstelveen 2,425,093 102 s",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}