{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Returning students, single parents, middle-aged students, students looking for fun classes.",
            "There will always be a free-food event atleast weekly.",
            "You'll find yourself bored at the easiness sometimes.",
            "Fort Vancouver Historical site is a few blocks away. Downtown Vancouver is a 10 minute drive away, and Downtown Portland is a 20 minute drive down the highway.",
            "Cafeteria food is delicious and cheap, no meal is more expensive than $8.00.",
            "No dorm life available.",
            "As long as you attend class, you'll pass the class.",
            "Check your e-mail every morning for class cancellation, and look up potential professors on RateMyProfessor.com.",
            "Clark has a laid back atmosphere. Professors are professional and easy-going. Students are kept well-informed through constant up-dates, bulletins, and e-mails."
        ]
    ],
    "pageTitle": "Clark College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Clark-College/reviews?_escaped_fragment_=/show/19568",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912935535,
    "recordOffset": 912864127,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{284233=The culinary institute is closed for the year of 2013, but Clark is still full of food! We have several delicious food carts, and a fully funtional bakery, with everything from pies to hot pockets, all made from scratch with the best ingredients available., 354326=At any time you can have security walk you to your car or class, they're always available and walking around campus. Clark sends out an email of anyone with a criminal past such as sexual offenders enrolled and gives you a bunch of information about the criminal and crimes committed. This last week (May 29, 2015) our newspaper staff wrote an article on how Clark is one of the safest campuses in either Washington State or the nation. But as a female minority, I've never had any problems with campus security. *knock on wood*, 115404=Compared to the price of a University, this is a GREAT value. Many of the classes have been standardized so that it makes transferring to another school easier, which also means that a 5 credit English class at Clark (which would be about $400) is practically identical to $2000 3 credit English class at a University. It's the same education, for $1,600 less., 339458=1. Don't talk religion or politics unless you are positive that the people around you are not listening or don't care; extremists on both sides will bash on you publicly. 2. Most of the college populous is made up of high schoolers who are a part of the running start program. This means that you have a lot of people who don't actually know what they want to do with their life but they think they're cool and grown up because they're at a college. This does not change the fact that they are still high schoolers and they definitely act like it. Drama, immaturity, the whole sha-bang. 3. The campus is beautiful and you're expected to help keep it that way by not littering or any of that business. 4. Get your FAFSA in early or right on time and then continually check with the department to make sure you have all other required material in along with your FAFSA. Otherwise you will be put on hold until the next term. 5. Don't sign up or pay for classes online if the website is under construction. I don't know why this happens but you'll think you're good then you'll get to class the first day and you won't be on the attendance sheet. 6. Security guys= good guys. They're very nice and will try to help you out if you have an issue like a dead car battery or a stalker. 7. If you don't have hard core evidence that you are being harassed by another student or a teacher (like video or a sound bite) then don't expect to get any real help. I was in a situation where it was my word against the harasser and because I didn't have any hard evidence (other than a journal of all the instances) the harasser was told to avoid me and I was told to go talk to a councilor for blowing things out of proportion. Obviously not the result I wanted. 8. The cafeteria is going through renovations until 2016 and so there are food carts on campus to make up for the lack of any real food (Mighty Bowl is delicious!) 9. There are always events and clubs to go hang around. Some are great and some are not. I mostly chose not to participate due to the fact that I don't enjoy a lot of the culture that is perpetuated among my peers. Overall, I don't like Clark. That doesn't mean you won't, I've just had some very bad experiences with the people there. Is it a smart decision to get started on your AA here? If you think you can thrive here, then yes. Otherwise I suggest biting the bullet and taking out a loan so you can go straight to university., 195123=Be on top of your deadlines and any other important dates especially for your financial aid! The sooner you file your financial aid paperwork the smoother your process goes. If you wait until the last minute or even two weeks to a month before the term starts to do your paperwork you will be stuck in lines for at least an hour; and forget getting an email reply until after quarter begins. If you need to meet with an advisor for a registration pin, meet with them as soon as you know pins are available! This is especially important if you're interested in taking biology classes or getting into prerequsites for the nursing program as these classes are very competitive to register for. They're available weeks before registration begins and registration will even send out an email letting you know when you can begin getting them. It's extremely time consuming to try to get your registration pin right around the time registration starts because most students wait until the last minute to get them. If you go as early as possible you're in and out in about 15 minutes tops. Parking is a total pain at Clark. If you're taking an 8 am class I would suggest arriving at 7:20-7:30 am because the parking lots are typically deserted until around 7:40-7:45. If you arrive around 8-9 am you may have luck parking around the gym. The purple lot is also a gem if you know about its existence. It's across Ft. Vancouver Way right next to the tennis courts. Almost no one parks there in the morning and even in the mid-morning/afternoon you shouldn't have too much trouble finding a spot. It's a little ways of a walk from the main buildings but it's a lot less stressful to find a parking space there (not to mention it saves gas!). Worst case scenario you end up parking in the park area on Mill Plain Blvd. across the street from Hudson's Bay High School or in the neighborhoods., 109498=Fort Vancouver is only one of the tourist attractions in downtown Vancouver and offers the largest fireworks diplay on the 4th of July west of the Mississippi., 365694=© 2015, Cappex.com, LLC, 7463=“In 1933, in the midst of the Great Depression, a group of educators boldly embraced a dream of higher education for Southwest Washington. More than 75 years later, that dream still resonates for Clark College and the community it serves.” www.clark.edu Clark College is a community college providing two-year transfer degree studies for as many as 16,000 full-time and part-time students each quarter. Clark's main campus is located on 101 beautiful acres and is the second largest college in the Washington State which has 34 community and technical colleges.}",
    "textBeforeTable": "07/27/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 86 Katherine from Brush Prairie, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am learning a lot Clark is defiantly a great school to attend. There are great teachers in every department who really love teaching and make class interesting. Login to rate or flag the reviews Gina from Vancouver, WA 10/14/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 86 Categories Comments Great for these types of students All students can benefit and learn here. I am glad and proud I attend this school and I know I am getting an affordable and quality education that is the stepping stone for my new career. Tips for prospective students Take the Orientation and look around the campus, it makes the first day of school a lot less stressful. Although there are over 16,000 students here, he campus is large and the classrooms are kept to under 30 students usually, so it does not feel crowded. Do not hesitate to use your resources, talk to your advisers, fellow students and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}