{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security guard always always out patrolling area and he is always very friendly, not a day has gone by where I haven't seen him making rounds.",
            "unknown",
            "never been in them??",
            "non traditional, working and parents",
            "none",
            "Costs is high for some classes.",
            "No time for fun study study study.",
            "No specific food and dining at Midland Campus but they do provide a student lounge with vending machines and it is a nice place to snack while studying between classes, very quiet.",
            "Unknown live off campus.",
            "Instructors make you work for your grades.",
            "Enjoy your time here it goes by quickly.",
            "DU is a great college for those of you who are non traditional, the instructors and counselors help you get back into the swing of things. Class sizes are small in Midland Campus, instructors care about you future."
        ]
    ],
    "pageTitle": "Davenport University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Davenport-University/reviews?_escaped_fragment_=/show/16626",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906026351,
    "recordOffset": 905981015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{223897=© 2015, Cappex.com, LLC, 61522=I would rate Davenport University with high ratings as they have really proved to me that their instructors/facilitators are there to help each student achieve their goals. The courses are easy to understand and each student has the option to take 7-10-15 week courses and are able to complete there degree. If it was not for the advisers, financial aid and instructors then I would not be close to graduation., 202034=I loved Davenport because it allowed me to return to school full-time as a wife, mother and full-time working adult. I received my Associate and Bachelors from there starting classes in the Fall of 2010 and ending in August of 2013. It was a great experience and I found an interesting new field in Health Information Management. The instructors were helpful and for both degrees I completed my courses primarily online with the exception of 2 on campus courses. I graduated with honors and feel so proud ad thankful for my experience there!, 125342=Be prepared to put in many study hours to do well. The 7 week accelerated courses are a great way to complete the program much faster. Apply for the in-house scholarship for $1500 per semester.}",
    "textBeforeTable": "12/23/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 63 Lauren from Hastings, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Great for these types of students anyone going in to the Business, technology or nursing this is the school for you. If you are interested in Biometric security, we are 1 of only very few universities in the nation that offer it. Tips for prospective students Apply early. Keep your GPA up. and ask lots of questions, the staff is always willing to answer any you may have. Bang for the buck Davenport is a career focused college. You start working on classes related to your career right away. No required Art or Gym classes. According to professors most students graduating from Davenport make on an average more money faster in their field compared to students graduating from other universities going in to the same field. Am enjoying being here The Dorms at Davenport are amazing. They are large spacious rooms with each student getting their own bed room in all of the 3 residence halls located here on the main campus located off of Kraft road near M6. We are currently ranked the 17th safest university in the country, the only other college in Michigan to even place on list was Cornerstone. We are a dry campus, so there is no need to worry",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}