{
    "relation": [
        [
            "Version",
            "8.x-1.x-dev",
            "7.x-1.x-dev",
            "6.x-1.x-dev"
        ],
        [
            "Download",
            "tar.gz (36.91 KB) | zip (45.46 KB)",
            "tar.gz (27.51 KB) | zip (34.73 KB)",
            "tar.gz (18.34 KB) | zip (22.17 KB)"
        ],
        [
            "Date",
            "2015-Jun-17",
            "2015-Jun-29",
            "2013-Oct-01"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?f[2]=im_vid_3%3A65",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894230139,
    "recordOffset": 894200731,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 02 Aug 2015 16:30:59 GMT",
    "textBeforeTable": "Recommended releases Downloads If you want to do something more complicated than this, such as displaying location fields from multiple nodes on a map, see: https://www.drupal.org/project/gmap This module is about the simplest way to get a Google Map, and/or a link to a Google Map, displayed with your content. It provides a field formatter for Drupal plain text fields. You enter an address that Google Maps can recognize in the plain text field, and the formatter displays it as a map, link to Google Maps, or both. January 23, 2012 at 5:21pm jhodgdon on Posted by Simple Google Maps Categories: Seeking co-maintainer(s), Maintenance fixes only, Fields, Location, Utility ⋅ Read more about Geocoder View all releases Notes 2015-May-21 tar.gz (23.39 KB) | zip (33.22 KB) 7.x-1.x-dev Notes",
    "textAfterTable": "Version Download Date 8.x-1.x-dev tar.gz (11.07 KB) | zip (13.38 KB) 2015-Jul-29 7.x-1.x-dev tar.gz (10.84 KB) | zip (11.95 KB) 2013-Nov-20 View all releases Read more about Simple Google Maps ⋅ Categories: Actively maintained, Under active development, Fields, Location Location Map Posted by babbage on December 11, 2010 at 11:30am This simple module displays just one location map via Google Maps, for brochure and company profile web sites. #D7CX: As pledged, Location Map module had a full Drupal 7 release on the day that Drupal 7 was released. Location Map will: create a Google Maps page with a marker on your location based on an address",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}