{
    "relation": [
        [
            "Element",
            "Field list",
            "Operator field",
            "Value field",
            "Select button",
            "Add button",
            "Update button",
            "Query Expression box",
            "Delete button",
            "Custom Query Expression check box",
            "Custom Query Expression box"
        ],
        [
            "Description",
            "The metadata field that is evaluated for each content item. Items matching this field are exported.",
            "Specifies how the Value is evaluated for each content item. The available operators depend on the type of metadata field selected: Is exports content items with the exact value specified. Is Not exports content items with a different value than the specified value. Begins With exports content items with the specified value at the beginning of the field. Contains Word exports content items with the specified value anywhere in the field. Is Date Before exports content items with dates before the specified value. Is Date After exports content items with dates after the specified value.",
            "The value for the specified metadata field. Depending on the option chosen in the Field list, this field can be a text entry field, text entry field with Select button, or list of the available options.",
            "Displays a list of existing items (such as content items or users), from which you can select a value for the Value field. This button appears only when certain metadata fields are selected.",
            "Adds the specified export query as a new line in the Query Expression box.",
            "Replaces the line selected in the Query Expression box with the specified export query.",
            "Shows the SQL export criteria as specified with the Add or Update buttons.",
            "Removes the selected line from the Query Expression box.",
            "Selected: The query expression can be edited directly. Clear: The query expression is limited to the criteria specified in the Field, Operator, and Value fields (described previously). See the Caution and Note messages below.",
            "The SQL expression that is evaluated for each content item during export. By default, multiple criteria use the AND operator."
        ]
    ],
    "pageTitle": "A.4 System Migration Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E14571_01/doc.1111/e10792/e01_interface004.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74058719,
    "recordOffset": 74031077,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:14:23 GMT",
    "textBeforeTable": "Query Definition pane: Click Edit in the Export Query section. Click the Main Archiver Export Screen and the Content tab. Select an archive. To access this screen: The Edit Export Query screen is used to create an export query that defines which content items to export. A similar screen is used to create queries for tables (Edit Export Query (Table) Screen). A.4.3.3 Edit Export Query (Content) Screen Displays a screen where you can specify whether to export content configuration information or user configuration information. Edit button Shows whether user attributes will be exported. User Configuration field Shows whether content types will be exported. Content Configuration field Description Element",
    "textAfterTable": "Caution: If you clear the Custom Query Expression check box, the expression reverts to its original definition; all modifications are lost. Note: You can use Idoc Script in the query expression. See the Idoc Script Reference Guide for more information. Query Options pane: Element Description Export Revisions with Release Date later than most recent Export Date check box Selected: Exports only the revisions that have released since the last export and that meet the export criteria. Clear: Exports all revisions that meet the export criteria. Allow Export of Published Revisions check box This check box is for use with Oracle Content Publisher. Selected: Exports all revisions that meet the export criteria. Clear: Does not export revisions that were published to the content server by Oracle Content Publisher. All Selected Revisions option Exports all revisions of content items that meet the export criteria. Latest Revisions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}