{
    "relation": [
        [
            "Patent application number",
            "20130167035",
            "20130227126",
            "20130318217",
            "20130318444",
            "20130325190"
        ],
        [
            "Description",
            "METHOD FOR ZONE BASED ENERGY MANAGEMENT WITH WEB BROWSER INTERFACE - A method of managing a site includes monitoring an activation of a proximity detection function of a plurality of sites, with each site having a first zone as a home zone and a second zone having a boundary that is away from the first zone. The method proceeds by displaying an indicator within a web-based GUI enabling each user of each site to activate and deactivate use of the proximity detection function. Each site can include multiple users associated with each respective site. The method proceeds by detecting the multiple users as being home or away using the proximity detection function and then altering an operating condition of a network device located at at least one of the plurality of sites in response to a last user of the multiple users leaving the first zone.",
            "ZONE BASED ENERGY MANAGEMENT SYSTEM - A method of managing a site in a mobile environment including detecting an availability of at least one network device having an operating condition at a site. First and second boundaries of the site having respective first and second boundaries, which are different, are detected. A plurality of zones including an on-site zone having an area within the first boundary, a first zone including an area beyond the first boundary and within the second boundary, and a second zone including an area beyond the second boundary are each detected. A predetermined operating condition of the at least one network device at the site is implemented in response to detecting a relative location of the mobile device with respect to the on-site zone, the first zone and the second zone. An on-site operating condition corresponding to the on-site zone is implemented.",
            "MOBILE ENERGY MANAGEMENT SYSTEM - A system includes a network device installed at a site, the network device including an operating condition configured to be altered by an input initiated external to the site. The system also includes at least one multi-user configurable geographical boundary capable of being established about the site to alter the operating condition in response to a location based information of a user relative to the site and the geographical boundary. A method of managing a site includes detecting a network device installed at a site, the network device having an operating condition configured to be altered by an input initiated external to the site. The method also includes enabling configuration of at least one multi-user configurable geographical boundary capable of being established about the site to alter the operating condition in response to a location based information of a user relative to the site and the geographical boundary.",
            "ESTABLISHING PROXIMITY DECTECTION USING 802.11 BASED NETWORKS - A method includes presenting a set location setting within a graphical user interface (GUI) of a mobile device, and then detecting a selection of the set-location setting. The method proceeds by detecting at least one on-site network in communication with the mobile device in response to the selection of the set location setting, identifying a network name associated with the at least one on-site network, and associating the network name of the on-site network with an on-site zone of a site associated with the mobile device. The method then proceeds by altering an operating condition of a network device located at the site in response to a location of the mobile device relative to the on-site zone.",
            "ENERGY MANAGEMENT SYSTEM AND METHOD - A method of managing at least one network device at a site includes providing a web-based control selector to manage a detection module to control the at least one network device at the site. The method includes enabling the detection module in response to an enabled setting of the web-based control selector, and initiating a change in an operating condition of the at least one network device at the site in response to the enabled detection module and based on a detected presence of a user at the site. The method proceeds by disabling the detection module in response to the disabled web-based control selector."
        ],
        [
            "Published",
            "06-27-2013",
            "08-29-2013",
            "11-28-2013",
            "11-28-2013",
            "12-05-2013"
        ]
    ],
    "pageTitle": "Cottrell, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cottrell-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449081511,
    "recordOffset": 449044702,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John F. Cottrell, Austin, TX US 11-07-2013 METHOD AND APPARATUS FOR MANAGING INTERRUPTIONS FROM DIFFERENT MODES OF COMMUNICATION - Methods and apparatus for managing interruptions in a multiple communication mode environment are provided herein. For example, a method may include receiving at least first and second instances of communication data associated with first and second communication modes; obtaining first and attribute data related to the first and second instances of communication data; classifying the first and second instances of communication data into first and second categories based on the first and second attribute data using the interruption management device; and determining whether to interrupt a user by delivering the first instance of communication data or the second instance of communication data based on the first and second categories, respectively. The first category and the second category may be selected from a plurality of predetermined categories using a classification algorithm. The first communication mode may be different than the second communication mode. 20130295973 Published Description Patent application number John Christopher Cottrell, Raleigh, NC US 08-28-2008 Method And Apparatus For Site And Building Selection - A site/building decision facilitating apparatus including a database that correlates building characteristics with business driver factors, a processor linked to the database and running a program to perform the following acts: receiving business driver factor information for a first building project via an input device and identifying a subset of default building",
    "textAfterTable": "John Frederick Cottrell, Austin, TX US Patent application number Description Published 20110202185 ZONE BASED ENERGY MANAGEMENT SYSTEM - According to an aspect of the disclosure, a zone based energy management system includes controlling at least one network device at a site using the proximity detection of a mobile device which may be based upon the detection of a plurality of zones. The network device may be a thermostat associated with the HVAC system of the site or other energy consuming appliances. Each of the zones may be associated with a corresponding temperature set-point of the thermostat or other energy consuming device where the temperature set point corresponding to a zone may be different from the temperature set points corresponding with each of the other zones. 08-18-2011 20110214060 MOBILE ENERGY MANAGEMENT SYSTEM - According to an aspect of the disclosure, a mobile energy management system and method includes controlling at least one network device at a site using the proximity detection of a mobile device which may be based upon the detection of a plurality of zones. Various features may be presented on a graphical user interface of the mobile device including a proximity control feature for enabling and disabling proximity detection, a set location setting for associating the current location of the mobile device with the location of the site, a set travel distance feature enabling the user to enter a travel distance within the graphical user interface,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}