{
    "relation": [
        [
            "Patent application number",
            "20100031848",
            "20120272790"
        ],
        [
            "Description",
            "ALLOY NANOPARTICLES OF SN-CU-AG, PREPARATION METHOD THEREOF AND INK OR PASTE USING THE ALLOY NANOPARTICLES - The invention relates to Sn—Cu—Ag alloy nanoparticles, preparation method thereof and ink or paste using the alloy nanoparticles in which the alloy nanoparticles are suitable for metal ink having excellent electrical conductivity or solder materials having low calcinating temperature.",
            "ALLOY NANOPARTICLES OF SN-CU-AG, PREPARATION METHOD THEREOF AND INK OR PASTE USING THE ALLOY NANOPARTICLES - The invention relates to Sn—Cu—Ag alloy nanoparticles, preparation method thereof and ink or paste using the alloy nanoparticles in which the alloy nanoparticles are suitable for metal ink having excellent electrical conductivity or solder materials having low calcinating temperature."
        ],
        [
            "Published",
            "02-11-2010",
            "11-01-2012"
        ]
    ],
    "pageTitle": "Lee, Yuseong-Gu - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lee-yuseong-gu-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453242831,
    "recordOffset": 453216722,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hyuck-Mo Lee, Yuseong-Gu KR 06-28-2012 MICROPARTICLE DETECTION APPARATUS - A microparticle detection apparatus is provided. The microparticle detection apparatus includes a light emitting optical element, a converging optical system disposed in an advancing direction of light emitted from the optical element to converge the light, a particle path located in an advancing direction of the light having passed through the converging optical system so that the particle path intersects the light, a beam blocking unit to block direct light having passed through the particle path, a condensing lens disposed at the rear of the beam blocking unit, and a detector disposed at the rear of the condensing lens to detect light scattered by particles. A focal point of light formed by the optical element and the converging optical system may be located at the rear of the particle path. A focal point of light irradiated to the particles may be different from the introduction position of the particles. 20120162644 Published Description Patent application number Hyub Lee, Yuseong-Gu KR 10-09-2008 MOBILE MIDDLEWARE SUPPORTING CONTEXT MONITORING AND CONTEXT MONITORING METHOD USING THE SAME - Disclosed herein is mobile middleware, a context monitoring method, a context-aware system, and a context-aware service provision method, which support energy-efficient context monitoring. The mobile middleware receives a request for a CMQ from context-aware application programs, receives sensor data from sensors, monitors whether the CMQ is satisfied, and transmits an event to the",
    "textAfterTable": "Hyung Keun Lee, Yuseong-Gu KR Patent application number Description Published 20100203386 CATHODE ACTIVE MATERIAL FOR LITHIUM SECONDARY BATTERY - Disclosed is a lithium secondary battery, which is low in capacity loss after overdischarge, having excellent capacity restorability after overdischarge and shows an effect of preventing a battery from swelling at a high temperature. 08-12-2010 Hyunrok Lee, Yuseong-Gu KR Patent application number Description Published 20100153719 Lightweight Authentication Method and System for Low-Cost Devices Without Pseudorandom Number Generator - An algorithm or an authentication system for a low-cost authenticating device such as a radio frequency identification (RFID) tag, or a sensor node are provided, by which authentication is processed efficiently without requiring a random number. A claimant entity attempting to be authenticated and a verifying entity to authenticate the claimant entity, share a plurality of secret keys so that authentication is processed as the claimant entity responds to a challenge by the verifying entity. The verifying entity and the claimant entity perform authentication using Learning Parity with Noise (LPN) problem. The claimant entity may generate an encrypted value for use in the authentication, using a basic Boolean Exclusive OR and a logical AND operations. 06-17-2010 20100153731 Lightweight Authentication Method, System, and Key Exchange Protocol For Low-Cost Electronic Devices - An algorithm or an authentication system for a low-cost authenticating device such as a radio frequency identification (RFID) tag, or",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}