{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are the blue emergency alert poles everywhere, and campus police is always there, even when classes are not in session.",
            "-Young -New to city life -Not ready to move far away from home -Have a job, kids, or any other big responsibilites (Lots of classes offered throughout the whole day, including evenings)",
            "Great school if you're looking for simple, quiet, and just get through to get on to a University. They also offer plenty of two-year programs for those who lots of college isn't an option. Best of all, Del Mar is CHEAP!",
            "I work and unfortunately don't have the time to take advantage of all the clubs and intramural sports they have on campus, but they are always advertising them! I've even seen a flyer looking for some Ultimate Frisbee players--fun! Del Mar is in Corpus Christi which is hot most of the year, so you always have the beach! Bonfires and beach parties are thrown year-round. Make some friends and you'll see many!",
            "Not very many options, sad to say. Everyone can agree that junk-food is pretty delicious, but doesn't do to well for the body. (We don't need any help with the Freshman 15, or the Sophomore 20!) Although, on those days you forget to bring your lunch, they do have some healthy options, including tasty parfaits and wraps.",
            "Sorry, no dorms for Del Mar!",
            "I give Del Mar four stars. If for some reason you have difficulty understanding something from your professors, Del Mar offers MANY student instructors, tutors, study groups, and programs to keep you on task and get you through your work.",
            "Tip 1: Get your financial aid in early! Del Mar is notorious for withholding your money, and leaves many students in a bind when it comes to coughing up half of our tuition, on top of book expenses. Tip 2: Get to class! Most classes are small, and your professor WILL notice when you're not there. Tip 3: Avoid the Harvin Center from 12-1. It's a crowded, loud, nightmare! (Unless of course you're into that sort of thing) Tip 4: During registration, go as early as possible. The earlier, the better. After about 10 A.M., especially close to school starting, the lines are horrendous. Tip 5: I have three words for you: Stone Writing Center. They have a great reputation for helping out students with their papers. So if you're iffy about a paper, I definitely reccommend swinging by there and having them check your work. It's free and there for you, so take advantage of it!",
            "Del Mar is a great transition for students from highschool to college with small classrooms, cheap tuition, a good-sized campus, and many great, helpful and understanding professors. However, they seem to lack in the general area of staff that are supposed to help students find their way through college. The financial aid staff and the counselors are not very helpful when trying to register for classes, often send us students in circles, and don't have any genuine sense of urgency or concern regarding students attending the school."
        ]
    ],
    "pageTitle": "Del Mar College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Del-Mar-College/reviews?_escaped_fragment_=/show/18530",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899094159,
    "recordOffset": 899054256,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84921=I work and unfortunately don't have the time to take advantage of all the clubs and intramural sports they have on campus, but they are always advertising them! I've even seen a flyer looking for some Ultimate Frisbee players--fun! Del Mar is in Corpus Christi which is hot most of the year, so you always have the beach! Bonfires and beach parties are thrown year-round. Make some friends and you'll see many!, 35629=Del Mar is a nice environment to be in and to be involved in. The campuses are great, and easy to get around., 84519=Great school if you're looking for simple, quiet, and just get through to get on to a University. They also offer plenty of two-year programs for those who lots of college isn't an option. Best of all, Del Mar is CHEAP!, 156498=The education you receive from Del Mar is amazing. Classrooms are small so the professors will learn your name, and be able to work with you one on one if needed. Nice student life., 169026=© 2015, Cappex.com, LLC, 60399=Del Mar College encourages student to study and get tutoring or visit with them to figure out how they are studying and if it is working for them., 64327=Del Mar is a clean school. Del Mar is a small school. Del Mar is a competitive school., 57683=Del Mar is a prestige college that has many opportunities for the average person, determined to recieve their associates degree. There are various types of degrees that you may obtain at Del Mar. Del Mar is a well-rounded school that will help anyone gain two years of necessary education., 133178=After being out of school for 15+ years Del Mar made it easy for me to enroll and stay on track. The professors are generous with their time and have a can do attitude towards their students. I look forward to transferring but will miss the small classes that come with Del Mar., 10996=Whether you are interest in an Associates degree or a certificate of specialization in a subject, Del Mar College is the place for you. With over 100 certificates and degrees available, you aÂ?re sure to find an area of study to meet your interests. The first step in reaching your dream is to apply for admission. Del Mar offers a very affordable rate for college students, and also offers a wide range of options for financial aid, loans, grants, employment and work study., 57283=How rigorous a class is depends on the class itself and on a students individual ability to tackle certain tasks. At Del Mar, the kinesiology classes are not rigourous, but the science classes are extremely rigourous., 79278=Del Mar College is one of the most top rated community colleges in the nation., 131248=Del Mar College is a phenomenal college, every single professor has bent backwards to help as much as possible. There are several resources to ensure your success., 86541=I give Del Mar four stars. If for some reason you have difficulty understanding something from your professors, Del Mar offers MANY student instructors, tutors, study groups, and programs to keep you on task and get you through your work., 34791=Del Mar is the place to be, they have everything a student will ever need to succeed in their careers., 146845=School is always going to be expensive but considering everything that you get on this campus the money is will worth it. Classes are cheaper than most Universities at Del Mar but there is plenty of help to further your education like financial aid and scholarships. It is just up to you to take the time to apply and meet the requirements for these great opportunities., 81975=Del Mar is a wonderful college with plenty of resources for students. The learning labs are all helpful and the staff are very considerate. The cafeteria has fantastic food. The campus is close to home., 31587=Well, just check what classes you need, since Del Mar has 2 main Buildings, East and West Campus. Over at East Campus you take your basics, and over at West Campus, you take classes for your profession and others., 3433=Del Mar is about 20-80% cheaper than a university and definitely is worth it., 88032=Del Mar is a great transition for students from highschool to college with small classrooms, cheap tuition, a good-sized campus, and many great, helpful and understanding professors. However, they seem to lack in the general area of staff that are supposed to help students find their way through college. The financial aid staff and the counselors are not very helpful when trying to register for classes, often send us students in circles, and don't have any genuine sense of urgency or concern regarding students attending the school., 122197=Its great for low income students as Del Mar helps you pay for classes as long as ask for the help. They even have a payment plan which i have used before because everyone has hard times so its there if anyone needs it. Its also great for students who need to get there quick 2 year degree or transfer credits., 72225=Del Mar College is a great local school to attend at an affordable price. Its not to far and the campus is small so you never have to worry about being late to your next class. If you have children they also have a on campus daycare for the students at little to no cost to you with financial aid., 39719=del mar college doesn't have dorms because it a community college, 21983=The academics at Del Mar College are rigorous because the professors understand that you are most likely going to continue your education after your two or more years at Del Mar. They teach at the same levels as major universities such as A&M , UT, and Baylor so that you will be prepared and you won't be completely overwhelmed by the course load., 160603=Del Mar is a great place for people to start their college endeavors while staying at home. As a community college, it is much smaller than the universities and there are lots of resources for students if you need extra help and attention., 14545=Delmar is great for people who work or have families. Professors are very understanding of your situations., 56953=Currently, there are no dorms at Del Mar., 14944=Delmar is the most affordable schooling in all of corpus. It is well worth it., 46886=Del Mar College is a reasonably priced community college. Del Mar has great 2 year programs to earn your degree fast. I chose Del mar because both of my degree plans are two year programs here., 4114=Del Mar is one of the best community colleges in the country. Most of the teachers will teach you every detail that you need to know; I've been going since summer 2010 and I've learned more than most people learn in their 4 years of college., 86973=Tip 1: Get your financial aid in early! Del Mar is notorious for withholding your money, and leaves many students in a bind when it comes to coughing up half of our tuition, on top of book expenses. Tip 2: Get to class! Most classes are small, and your professor WILL notice when you're not there. Tip 3: Avoid the Harvin Center from 12-1. It's a crowded, loud, nightmare! (Unless of course you're into that sort of thing) Tip 4: During registration, go as early as possible. The earlier, the better. After about 10 A.M., especially close to school starting, the lines are horrendous. Tip 5: I have three words for you: Stone Writing Center. They have a great reputation for helping out students with their papers. So if you're iffy about a paper, I definitely reccommend swinging by there and having them check your work. It's free and there for you, so take advantage of it!, 126002=I rate Del Mar out of 5 stars a 3.5. Its lost alot of its accredidation after the whole nursing scandal that took place over last couple of years. Its a great shool, but it needs to regain its power once more for it to earn its great name again., 16810=Delmar is a wonderful school! Everyone is friendly and the campus is close to great places to eat. The campus is beautiful and full of diversity., 22530=Ask your older friends that attend or have attended Del Mar College about their perspective. Books are expensive, so don't be afraid to ask around to find books at a much lower price! Take advantage of all the resources available! There is FREE peer tutoring available as well as a computer lab and seminars on how to succeed in all of your classes. You can also check out calculators and laptops for FREE! Make sure to get there early because the laptops go fast and you may be put on a waiting list!, 125040=Academially i believe Del Mar is a bit rough. I dont know if its true but i have heard that its more difficult than A&M CC. But it has a good success rate. Again it all depends on the student and how hard you are willing to work to achieve your goal., 107006=Great for students who are ready to go into College but are avoiding the hassle of being in a crowded lecture room. The class sizes at Del Mar are just perfect., 42766=del mar has great teachers who really care about education. the hometown atmosphere is amazing. this college is very affordable!, 12500=As the largest institution of higher education in South Texas for over 75 years, Del Mar College offers a unique blend of academic programs to meet a broad range of career goals and educational aspirations., 132862=I have two high school children and I tell them now a days there is no reason not to succeed. Del Mar provides that can do attitude., 51719=Del Mar College is a good school for those who want to gently be put into a college atmosphere at a slow pace. It is a good beginner school for those that aren't quite ready to go into the big leagues, not to mention it is particularly cheap., 9293=Del Mar offers both Departmental GREEK affiliated clubs such as Alpha Beta Gamma, Phi Mu Alpha, and Phi Sigma, as well as Honory GREEK affiliated one such as Phi Theta Kappa that offers students the choice to join a international honor society of two-year colleges and academic programs (this GREEK honor society also includes Associates degree-granting programs offered by four-year colleges) and Alpha Beta Gamma-Alpha Psi which recognizes and promotes academic excellence among junior and community college students enrolled in business curriculum., 139707=I hear that Del Mar is harder and more challenging than the University here in corpus., 68335=My experience here at Del Mar College has been nothing but top notch. Everyone here is so eager to help in any way possible and I couldn't have asked for a better school to enroll in to better educate myself. I feel that this whole experience has helped renew my confidence levels to an all new extreme., 10625=All types of students are welcome to join and become a part of Del Mar College., 75513=I love this school. I have been fortunate enough to have some of the best teachers who want nothing more than to see you succeed. Del Mar college is a great school to start your future., 38684=del mar is good for the price your paying for college. classes are cheap and exciting, 21459=There aren't any dorms at Del Mar College meaning that you either live at home or with your friends and that's pretty great! I have heard rumors of dorms but I also heard that they look look they've been pulled out of a horror movie., 104547=Del Mar College is a great school if you like small classes. By having small classes it gives you the opportunity to communicate with your professor and ask for help. The professors will take time to help so you can understand the objective or topic., 77887=Del Mar College is cheaper than most 2 year colleges and the credits and very easy to transfer., 79823=Del Mar College is a diverse school that offers quality, affordable education that works around your life. The campus is in a central area that enables everyone to commute there without much of a hassel. The teachers and resources there help make the transition of going to college easy., 20157=College is expensive! It's not much of a secret. Del Mar is a less expensive option that will save you a lot of money in the long run! The cost for hours is about a third of what you would pay elsewhere! It's $91 a credit hour and the professors teach at the same level as top schools!, 135624=No dorms on this campus - Del Mar is a 2 year college., 64012=If you want a big, fast paced campus, Del Mar is not it. But if you want small, clean, and competitive you've found the right school, 158133=I don't know a lot about the quality of the many different programs at Del Mar, but the fine arts department is great! I am not any type of art major personally, but have taken an art class and have a friend who is an art major and one who is a music major. Both the art and music programs are amazing, and I've been told that the art department at Texas A&M Corpus Christi is rather disappointing compared to Del Mar's., 125490=I do encourage students to apply here at Del Mar and get classes done. It does have some great teachers who truly care about their students. Never believe what you hear about a college or a professor, because in the end it all depenndes on the student and how they want to learn and how far they will go to achieve there goals., 46320=Del Mar doesn't have dorms for students., 156194=Do not take granted that Del Mar is a community college, the curriculum is just as hard if not harder than a university., 37753=i think campus is pretty safe here at del mar college. not too many problems., 56342=The Harvin Center is the dining area at Del Mar. The Harvin Center has various types of food, so a student doesn't have to leave campus in order to recieve a delicious meal. Also, the Harvin Center has different forms of entertainment throughout the week. Socializing with fellow classmates is a major plus to the Harvin Center., 36030=Del Mar has a wide range of amiable and knowledgeable professors, that are willing to help you get through classes and to help get through the program any student may be interested in., 136357=Teachers make all the difference in the world and the professors at Del Mar are simply amazing. Even though I'm a non-traditional student, I feel inspired, motivated, and optimistic from the support and encouragement I've received from these educators. My 3.88 GPA comes not only personal efforts, but from the heart and soul of the college - the teachers., 46554=Affordable and great if your interested in a two or four year degree plan. Del Mar also offers lots of help and groups to help you pass your classes., 155935=You will have to work for an A, but it is achievable at Del Mar., 12101=Whether you are coming right out of high school, transferring in or returning to Del Mar you will find enthusiastic staff to help you with the application process or learn more about Del Mar's award winning programs., 129291=Del Mar College is a real exciting institution with a ready to learn atmosphere. Everyone is real helpful and wants you to succeed. There is more free tutoring than you will ever need., 8973=Del mar is a very safe campus and always available assistance from Campus Security. Officers are available 24 hours a day, every day of the week!, 35185=Although, Del Mar is a little pricey, the classes themselves are amazing, your will learn great things with all the exceptional teachers they have., 61002=The teachers are great and Del Mar College has a great nursing program. The people are nice and helpful. The tutors are very helpful and nice., 113339=This college is great for students who quickly want to get their license/certification or want to do their basics. I enjoy being a student here at Del Mar, and I'll miss it after I graduate.}",
    "textBeforeTable": "09/03/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 47 Joshua from Corpus Christi, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here One word...awesome Am learning a lot Del Mar is one of the best community colleges in the country. Most of the teachers will teach you every detail that you need to know; I've been going since summer 2010 and I've learned more than most people learn in their 4 years of college. Login to rate or flag the reviews Kels from Robstown, TX 11/08/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 47 Categories Comments Great for these types of students If you want to do something that can be done in two years it is great, but it is also good as a stepping stone to a four year. It is great to get you into the routine of college. Tips for prospective students The main thing is to study. Always go to class. I try",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}