{
    "relation": [
        [
            "Timestamp",
            "2012-01-21",
            "2012-01-21",
            "2011-10-29",
            "2011-10-29",
            "2011-03-18"
        ],
        [
            "Action",
            "Deleted",
            "Added",
            "Deleted",
            "Added",
            "Added"
        ],
        [
            "Category",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION"
        ],
        [
            "Detail",
            "The process which begins with venom being forced into an organism by the bite or sting of another organism, and ends with the manifestation of damage to the bitten organism.",
            "The process which begins with venom being forced into an organism by the bite or sting of another organism, and ends with the manifestation of some change or damage to the bitten organism.",
            "The process by which venom is forced into an organism by the bite or sting of another organism.",
            "The process which begins with venom being forced into an organism by the bite or sting of another organism, and ends with the manifestation of damage to the bitten organism.",
            "The process by which venom is forced into an organism by the bite or sting of another organism."
        ]
    ],
    "pageTitle": "GO:0035738 envenomation resulting in modification of morphology or physiology of other organism",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0035738",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431917691,
    "recordOffset": 431890498,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130017=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 130150=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "Usage of this term is subject to the following annotation guidelines: Annotation Guidance GO:0035738 Wiki Page GONUTS The process which begins with venom being forced into an organism by the bite or sting of another organism, and ends with the manifestation of some change or damage to the bitten organism. Definition Biological Process Ontology envenomation resulting in modification of morphology or physiology of other organism Name GO:0035738 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0035738: Relationship To GO:0035738 Child Term Child Term Name Has part GO:0035821 modification of morphology or physiology of other organism Is a GO:0044358 envenomation resulting in hemorrhagic damage to other organism Is a GO:0044398 envenomation resulting in induction of edema in other organism Is a GO:0044468 envenomation resulting in modulation of blood coagulation in other organism Is a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}