{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Engineering.",
            "I am the 2012 - 2013 Homecoming King.",
            "Apply early. Montana Tech is a great school but tough.",
            "Montana Tech is very hustle and bustle type of school. The professors take time with each student to make sure the student comprehends. People come from around the world to attend Montana Tech."
        ]
    ],
    "pageTitle": "Montana Tech Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Montana-Tech-/reviews?_escaped_fragment_=/show/62192",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907590835,
    "recordOffset": 907556093,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96182=I am the 2012 - 2013 Homecoming King., 114804=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 29 Ariel from Lolo, MT Check out reviews left by other students or leave your own review. You could win a free scholarship. Montana Tech Reviews Montana Tech › Montana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Tech is best for students who are serious about school, enjoy a challenge, and look forward to many job opportunities after graduation. Bang for the buck With as many scholarships as it gives out and its low rates, Montana Tech is usually pretty affordable for students and still offers the rigorous academics that should be the focus of a college like Tech. What to do for fun The residence life staff often have activities for the students, such as Thursday movie night, make-a-critter days, trips to old theaters in nearby towns, and other tours and such. Food and Dining The staff are generally polite and competent, but the cafeteria often lacks a healthy vegetarian option. It sometimes lacks any healthy option. As with all cafeteria food, sometimes unwelcome surprises (such as small pieces of cardboard) find their way into the food. Dorm Life Most freshmen are placed in a rather old building. Although well-kept for its age, it easily becomes sweltering in the summer and lets in strong winds through the poorly-insulated windows in winter. The residence life and cleaning and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}