{
    "relation": [
        [
            "Year",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8+"
        ],
        [
            "Percent",
            "7.00%",
            "7.00%",
            "6.00%",
            "5.00%",
            "4.00%",
            "3.00%",
            "2.00%",
            "0.00%"
        ]
    ],
    "pageTitle": "Annuities - Putnam Global Health Care Subaccount - Putnam Investments",
    "title": "",
    "url": "https://www.putnam.com/individual/annuities/portfolios/167",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 933842895,
    "recordOffset": 933820020,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19743=Investors should carefully consider the investment objectives, risks, charges, and expenses of a fund before investing. For a prospectus containing this and other information for any variable annuity or variable life product that invests in Putnam Variable Trust funds, contact your financial advisor for a contract prospectus and prospectus for the underlying funds. You may also call Hartford at 1-800-521-0538 or Allstate at 1-800-390-1277. Read the prospectuses carefully before investing., 20253=For the most recent month-end performance, please call Hartford at 1-800-521-0538 or Allstate at 1-800-390-1277., 87639=© 1998-2015, Putnam Retail Management}",
    "textBeforeTable": "Daily Pricing as of 07/31/15 Kelsey Chen Ph.D.  (Investing since 1999) Isabel Buccellati  (Investing since 1994) Management team Investing in the health-care sectorA dynamic sector: From biotech to pharmaceuticals, the fund seeks out companies that profit from the global demand for health care.A range of companies: The fund invests worldwide in businesses at different stages of growth, from rapidly growing newer companies to established global corporations.Actively managed: Unlike passively managed ETFs, Putnam global sector funds combine rigorous fundamental research and disciplined quantitative analysis with macroeconomic views. Sales Story The subaccount seeks to capitalize on the strength of the health-care sector, targeting companies of all sizes. Holdings encompass an array of industries, including pharmaceuticals, health-care services, and biotechnology. The fund seeks companies that offer strong long-term growth prospects, regardless of their size. Fund Description Expenses Holdings Performance Highlights The subaccount seeks capital appreciation. Putnam Global Health Care Subaccount Putnam Allstate Advisor Select another subaccount: Fixed Account George Putnam Balanced Fund Subaccount Putnam American Government",
    "textAfterTable": "Turnover (fiscal year end) 27% Net Assets $205M Inception Date 05/01/98 The fund concentrates its investments in one region or in one sector and involves more risk than a fund that invests more broadly. Variable annuities are long-term investments designed for retirement purposes. Withdrawals prior to age 59 1/2 may be subject to a 10% IRS penalty. Growth investing targets companies with above-average earnings that may be subject to price volatility if earnings expectations are not met. You can lose money by investing in a fund. Any given fund may not achieve its goal, and is not intended as a complete investment program. All funds have risk. The value and/or returns of a portfolio will fluctuate with market conditions. You may have more or less than the original amount invested when you redeem your shares. ‡ Lipper is an industry research firm whose rankings are based on total return performance, vary over time, and do not reflect the effects of sales charges. Past performance is not indicative of future results. Performance as of 06/30/15 Annual Cumulative",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}