{
    "relation": [
        [
            "Patent application number",
            "20140242956",
            "20140376745"
        ],
        [
            "Description",
            "SYSTEMS AND PROCESSES TO MANAGE MULTIPLE MODES OF COMMUNICATION - A computer-implemented system and method to manage the communication of a user are disclosed. In one embodiment, when a person tries to electronically convey a message to the user, the status of the user, the identity of the person, and the urgency of the message can be identified. The access priority of the person can be determined based on the person's identity. Then, the message can be managed using one or more rules and in view of the status of the user, the access priority of the person and the urgency of the message.",
            "HYBRID AUDIO DELIVERY SYSTEM AND METHOD THEREFOR - Methods and systems to produce audio output signals from audio input signals. In one embodiment, a first portion of the audio input signals can be pre-processed, with the output used to modulate ultrasonic carrier signals, thereby producing modulated ultrasonic signals. The modulated ultrasonic signals can be transformed into a first portion of the audio output signals, which is directional. Based on a second portion of the audio input signals, a standard audio speaker can output a second portion of the audio output signals. Another embodiment further produces distortion compensated signals based on the pre-processed signals. The distortion compensated signals can be subtracted from the second portion of the audio input signals to generate inputs for the standard audio speaker to output the second portion of the audio output signals. In yet another embodiment, noise can be added during pre-processing of the first portion of the audio input signals."
        ],
        [
            "Published",
            "08-28-2014",
            "12-25-2014"
        ]
    ],
    "pageTitle": "Cheung, HK - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cheung-hk-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438635271,
    "recordOffset": 438614856,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kwok Wai Cheung, Tai Po HK 01-15-2015 WIRELESS TWO-FACTOR AUTHENTICATION, AUTHORIZATION AND AUDIT SYSTEM WITH CLOSE PROXIMITY BETWEEN MASS STORAGE DEVICE AND COMMUNICATION DEVICE - A wireless two-factor authentication, authorization and audit system includes: a mass storage device being connected with a computer; a cloud-based authentication, authorization and audit server being connected with the Internet; and an authenticator device configured to establish wireless communication with the mass storage device, and to communicate with the authentication, authorization and audit server via the Internet. The mass storage device includes a processor connected with the computer, an RF frontend connected with the processor, and a memory storage connected with the processor. The processor is configured to encrypt data before the data is stored in the memory storage, to decrypt the data upon successful authentication, and to grant a user access to the data based on a passphrase, geographical location information, or proximity presence of the authenticator device. 20150020180 Published Description Patent application number Kwok Hung Cheung, Hong Kong HK 08-22-2013 COMPOSITE WALL PANEL WITH LOW THERMAL CONDUCTIVITY AND SUFFICIENT STRENGTH FOR STRUCTURAL USE - The present invention provides a composite wall panel with good thermal insulation and sufficient strength for structural use which is designed for the fabrication of energy efficient building. The composite wall panel of the present invention comprises a foamed concrete core with sufficient compressive strength and low thermal conductivity which is sandwiched between two",
    "textAfterTable": "Kwok Yau Cheung, Pat Heung HK Patent application number Description Published 20120022688 AUTONOMOUS ROBOTIC LIFE FORM - A robotic life form simulates a live creature responsive to a changing environment sensed by the robot, and has a robotic body that is articulated for motion around an upright axis and supported by at least two legs, each having at least two joints. The neck of the body terminates in a head provided with eyes and a mouth, and, in the illustrated creature, has a tail. Internal and external input sensors are located on the robotic body and responsive to touch, sound and lighting conditions, motion, food, temperature, voice commands, time of day, and obstacles and hazards, and include a head touch sensor, a plurality of touch sensors extending along a torso of the body, and a plurality of touch sensors on the feet. Actuators responsive to the input sensors control the eyes of the robot, opening and closing of its mouth, movement of the head, movement of the neck relative to the torso, and relative movements of the front and rear sections of the torso to cause the torso to pivot and twist and thereby provide lifelike responses to the sensed conditions. Drive index levels in accordance with priority criteria selected from a plurality of animation groups determine the drive index levels, and servo actuators associated with the body are responsive to dominant drive indexes causing the robot to execute animations resulting",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}