{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe-I have never had a problem and I even took a class during the summer.",
            "So many!!!",
            "CASA for classes you stuggle in",
            "There is an awesome Gym for working out either on equipment or yoga classes. The library is always open when I need it. The tech people can help you with an computer problem.",
            "There is the Ram Tram that will take you to the mall, movies, supermarkets etc. The student center has things going on you can sign up for. They always have movies playing, plays, musicals etc. on campus so check it out!",
            "The dining hall is great, so much to choose from. I never had a problem finding a seat. If you want something special they don't serve, just ask.",
            "My first room mate didn't work out, so I swithed and my new one was very nice. There is always something going on in the dorms to get you to meet people so get out of your room! Go to your RA with any issues and they can help you.",
            "Meet with professors in your classes, you will learn a lot that way. If you are having trouble, go to CASA, and they will help you out. Don't wait to get extra help if you are stuggling, its there you just have to get it!",
            "Join a club at school, it's a great way to make friends. Don't worry about room mates, you can easily switch if it doesn't work out. There is always something going on at campus, so don't stay in your room!",
            "FSU is the perfect size college for me. All of my classes are close to my dorm. I like that I can go home on the weekends if I want."
        ]
    ],
    "pageTitle": "Framingham State University (Framingham) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Framingham-State-University/reviews?_escaped_fragment_=/show/34109",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893542579,
    "recordOffset": 893508876,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{119953=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 1 of 30 Lauren from Wrentham, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Will learn a lot You can learn a lot from where ever you go as long as you put in the effort. Framingham provides the means, you have to provide the ends for yourself. Login to rate or flag the reviews Chanel from Methuen, MA 04/01/2011 Reviewer is A current student here. 1 out of 2 people found this review useful. 3 of 30 Categories Comments Great for these types of students The only department I know enough about it the fashion design and retailing mayor. At FSU you learn not only the design and construction aspect of fashion, but also the business side of it. Tips for prospective students 1. Be sure to make friends at the beginning of year first year 2. Get involved!!!! 3. Utilize all of the academic help resources and the amazing library 4. Connect with your professors 5. Get into the swing of college life for a good month or two before seeking a part time job. Starting college",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}