{
    "relation": [
        [
            "Parameter",
            "Gathering cut-off",
            "Trusted cut-off",
            "Noise cut-off"
        ],
        [
            "Sequence",
            "22.1",
            "22.1",
            "22.0"
        ],
        [
            "Domain",
            "22.1",
            "22.1",
            "22.0"
        ]
    ],
    "pageTitle": "Pfam: Family: PI-PLC-X (PF00388)",
    "title": "",
    "url": "http://pfam.xfam.org/family/PF00388",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 188231727,
    "recordOffset": 188189887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15860=Phosphoinositide phospholipase C (PLC) (EC 3.1.4.11, triphosphoinositide phosphodiesterase, phosphoinositidase C, 1-phosphatidylinositol-4,5-bisphosphate phosphodiesterase, monophosphatidylinositol phosphodiesterase, phosphatidylinositol phospholipase C, PI-PLC, 1-phosphatidyl-D-myo-inositol-4,5-bisphosphate inositoltrisphosphohydrolase) is a family of eukaryotic intracellular enzymes that play an important role in signal transduction processes.[1] These enzymes belong to a larger superfamily of Phospholipase C. Other families of phospholipase C enzymes have been identified in bacteria and trypanosomes. Phospholipases C are phosphodiesterases.}",
    "lastModified": "Sat, 01 Aug 2015 00:40:28 GMT",
    "textBeforeTable": "Model details: search method: hmmsearch -Z 80369284 -E 1000 --cpu 4 HMM pfamseq build method: hmmbuild -o /dev/null HMM SEED HMM build commands: HMM information 26.12 % Average coverage of the sequence by the domain: 41 % Average identity of full alignment: 145.10 aa Average length of the domain: 8386 Number in full: 112 Number in seed: Finn RD Author: Family Type: none Previous IDs: Prosite Seed source: Curation This section shows the detailed information about the Pfam family. You can see the definitions of many of the terms in this section in the glossary and a fuller explanation of the scoring system that we use in the scores section of the",
    "textAfterTable": "Model length: 145 Family (HMM) version: 15 Download: download the raw HMM for this family Species distribution Sunburst Tree Sunburst controls Show Weight segments by... number of sequences number of species Change the size of the sunburst Small Large Colour assignments Archea Eukaryota Bacteria Other sequences Viruses Unclassified Viroids",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}