{
    "relation": [
        [
            "Rōmaji",
            "Dōdō",
            "Kawada",
            "Kudama",
            "Minai",
            "Tsuzura",
            "Ubaguchi"
        ],
        [
            "Kanji",
            "百々",
            "西広門田",
            "国玉",
            "薬袋",
            "黒桂",
            "右左口"
        ],
        [
            "Location",
            "Minami-Alps",
            "Kōshū",
            "Kofu",
            "Hayakawa",
            "Hayakawa",
            "Kofu formerly Nakamichi"
        ]
    ],
    "pageTitle": "Wikipedia:WikiProject Japan/Place names with unusual readings - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:WikiProject_Japan/Place_names_with_unusual_readings",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871454183,
    "recordOffset": 871392357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1290=Founded March 18, 2006 (9 years, 4 months and 11 days ago), 34082=Since public education became standardized and uniform across the country beginning in the Meiji period (1868-1912), placenames that contain kanji outside of what is learned in standard schooling, or those that use pronunciations of kanji outside of the more usual or natural pronunciations, create difficulties.}",
    "lastModified": "Wed, 29 Jul 2015 03:03:45 GMT",
    "textBeforeTable": "Hokkaidō[edit] Each table has three columns. The Romaji column lists the reading of the place name. The Kanji column shows the kanji that are read as shown under Romaji. Most of these are within a larger place such as a ward, municipality, or district. The Location column names the larger ward, municipality or district where the place with the unusual reading is located. Explanation of table[edit] The place names listed below are from north to south by region and prefecture, and then alphabetical within each prefecture. Examples[edit] The town of Yonashiro, which used to be called Yonagusuku serves as an example of a placename that shifted to a more Japanese pronunciation. The former capital city of Shuri once bore a pronunciation closer to Sui. East (東) and West (西), higashi and nishi respectively in Japanese, are pronounced agari and iri in Okinawan. This shows up in the name of the island of Iriomote. The Okinawan word for \"castle\" (城) is gusuku, which is read in Japanese as shiro. This is frequently seen, expectedly, in the names for castles, and the towns and areas around them. Some examples",
    "textAfterTable": "Bannaguru 花畔 Ishikari Barato 茨戸 Kita-ku, Sapporo Bekanbeushi 別寒辺牛 Akkeshi Buima 冬窓床 Kushiro (town) Chanbetsu 茶安別 Shibecha Chippubetsu 秩父別 Chippubetsu Esashi 枝幸 Esashi Gokibiru 濃昼 Ishikari Goyōmai 珸瑤瑁 Nemuro Habomai 歯舞 Nemuro Hassamu 発寒 Nishi-ku, Sapporo Hattari 発足 Ishikari, Kyōwa Horomui 幌向 Iwamizawa Ichiyan 一已 Fukagawa Iohara-chō 庵原町 Hakodate Kamoenai 神恵内 Kamoenai Kitoushi 来止臥 Kushiro (town) Kunneppu 訓子府 Kunneppu Kunnui 国縫 Oshamanbe Kutchan 倶知安 Kutchan Makkari 真狩 Makkari Mareppu 稀布 Date Maruseppu 丸瀬布 Engaru Masarikappu 正利冠 Ishikari Mataitoki 又飯時 Kushiro (town) Moseushi 妹背牛 Moseushi Rōmaji Kanji Location Nanporo 南幌 Nanporo Neppu 熱郛 Kuromatsunai Niikappu 新冠 Niikappu Nikomanai 入境学",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}