{
    "relation": [
        [
            "Species",
            "Lake trout",
            "Landlocked salmon",
            "Trout"
        ],
        [
            "Open Season",
            "All year",
            "All year",
            "All year"
        ],
        [
            "Minimum length",
            "15\"",
            "Any size",
            "Any size"
        ],
        [
            "Daily limit",
            "3",
            "3",
            "5"
        ],
        [
            "Method",
            "Ice fishing permitted",
            "Ice fishing permitted",
            "Ice fishing permitted"
        ]
    ],
    "pageTitle": "Part 10: Sportfishing Regulations - NYS Dept. of Environmental Conservation",
    "title": "Brandreth Lake, East Pond, North Pond, and West Pond in Brandreth Park, Hamilton County",
    "url": "http://www.dec.ny.gov/regs/4026.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 403242211,
    "recordOffset": 403194245,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39091=(iii) From April 1st through August 31st, subdivision (a) of this section shall apply. For species not listed in subdivision (a) of this section, general angling regulations listed in section 10.1(b) of this Part shall apply., 205639=(iii) Angling is also prohibited between sunset and sunrise from April 1st through May 15th and October 1st through December 31st except for those stream sections listed in paragraph (4) of this subdivision. Angling is also prohibited between sunset and sunrise from Jan 1st through March 31st in Fall Creek in Ithaca, Tompkins County, from the downstream edge of the railroad bridge below Rt. 13 to Ithaca Falls., 235366=(8) In Oswego County, bullhead and suckers may be taken from January 1st through May 15th from Grindstone Creek (downstream of the dam at Fernwood), Little Salmon River (downstream from the bridge at Arthur), Ninemile Creek (downstream of Route 104A), Eightmile Creek (downstream of Route 104A), Salmon River (downstream of NY Route 3), Red Creek or Sunset Bay Creek, Otter Branch Creek, Sage Creek, and Snake Creek., 238413=(d) In Goodnow Flow in Essex County, black bass may be taken in any size and number from the third Saturday in April through October 15th; angling only permitted., 36468=(ii) From September 1st through March 31st of the following year, the following regulations shall apply:, 40184=(2) Salmon River (Oswego County). The special regulations set forth in this paragraph shall apply to the Salmon River from the mouth upstream to the County Route 52 Bridge in Altmar and all tributaries to that section., 236343=(a) On Chatiemac Lake in Warren County, no person shall take trout except from April 1st through November 30., 212788=(2) No person shall use ice fishing lines on the frozen waters of the State during the period from May 1st through November 14th., 208984=(6) Tioughnioga River from the Route 26 bridge to the Route 11 bridge in Broome County--closed March 16th until the opening of Walleye season in May;, 49425=(10) use sinking flylines, combination floating/sinking flylines, shooting heads, sinking leaders, metal leaders, supplemental weight or weighted flies other than from April 1st through April 30th and September 1st through November 30th in the Upper Fly Area, and from September 15th through April 30th in the Lower Fly Area. The combined weight of any supplemental weight (as defined in paragraph 9 of this subdivision) and fly not exceed one-eighth of an ounce., 233157=(b) Longbows may be used to take carp from May 15th through September 30th from any waters of the State where fishing is permitted., 209894=(11) Cowaselon Creek from its mouth upstream to Route 13 in Madison County-- closed from March 16th until the opening of Walleye season in May;, 46748=(g) Additional special fishing regulations for the Salmon River, Oswego County, from County Route 52 bridge upstream to Lighthouse Hill Reservoir. No person may fish at any time except from County Route 52 bridge in Altmar upstream to a marked boundary at Beaverdam Brook (Lower Fly Area) from September 15th through May 15th, and from a marked boundary upstream of the New York State Salmon River Fish Hatchery property upstream approximately 0.6 mile to a marked boundary at the Lighthouse Hill Reservoir tailrace (Upper Fly Area) from April 1st through November 30th. No person, while fishing in these places during these times, shall:, 210052=(12) Great Chazy River from Route 9B at Coopersville upstream to the dam at Perry's Mills in Clinton County--closed from March 16th until the opening of Walleye season in May;, 210603=(15) Chittenango Creek from mouth upstream to Conrail railroad line in Onondaga County--closed from March 16th until the opening of Walleye season in May;, 40699=(ii) From August 15th through April 14th of the following year, the following regulations shall apply:, 43253=(3) Any hooks on a floating lure, other than an artificial fly as defined in section 19.1(c) of this Title, must be attached thereto by a ring or swivel or from August 15th through October 31st, a bead chain attached to the lure with a ring., 209148=(7) All Lake George tributaries below the first barrier impassable to fish in Essex, Warren and Washington Counties--closed from October 1st through March 31st and from 10 p.m. to 5 a.m. from April 1st through May 15th;, 5743=[Last Amended April 1, 2015], 208158=(2) Indian Lake in Dutchess County--closed from 12 a.m. on April 1st to 6 a.m. on the third Saturday in April;, 233775=(3) In Otsego County, suckers may be taken from January 1st through May 15th from Herkimer Creek, Hyder Creek, Trout (Mink) Creek, Hayden Creek (mouth to Shipman Pond dam), Shadow Brook, Sand Hill Creek (mouth to Route 7 bridge), Otsdawa Creek (mouth to Route 7 bridge) and Mill Creek (mouth to Route 7 bridge)., 234370=(5) In Lake Champlain, bowfin, burbot, carp, freshwater drum, gar, redhorse and suckers may be taken from March 20th through September 30th., 208283=(3) Conesus Inlet Fish and Wildlife Management Area in Livingston County from Conesus Lake south to the dam, except the canal west of Conesus Inlet and that portion of the Inlet north of the canal; North McMillan Creek in Livingston County--closed from March 1st until the opening of Walleye season in May;, 43124=(2) Multiple single, double or treble hooks are permitted on floating lures from November 1st through August 14th., 209382=(8) Saranac River from Hough Brook at Union Falls Flow upstream to the dam at Franklin Falls Flow in Franklin County--closed March 1st through May 15th;, 211301=(19) Little Sandy Creek in Oswego County from the State Route 3 bridge downstream 850 feet to the intersection of the channelized area and upstream 1.0 mile from the bridge to the Public Fishing Rights section - closed from March 16th until the opening of walleye season in May., 234115=(4) In Clinton County, bowfin, burbot, carp, freshwater drum, gar, redhorse and suckers may be taken from March 20th through September 30th from Corbeau Creek and Scomotion Creek (from mouth upstream to Beekmantown town line)., 48944=(9) use other that a floating fly line, un-weighted leader and an un-weighted fly in the Lower Fly Area from May 1st through May 15th and from May 1st through August 31st in the Upper Fly Area. The use of sinking flylines, combination floating/sinking flylines, sinking leaders, metal leaders or supplemental weight including sinkers, split shot, twist-ons, swivels, attached to the leader, tippet, flyline or fly is also prohibited in both areas at these times; and, 235811=(9) In Wayne County, bullhead and suckers may be taken from January 1st through May 15th from Black Creek Bay and Red Creek Bay., 56113=(3) no person may engage in fishing in the North Branch Boquet River and its tributaries and Mill Brook (in Port Henry) from mouth to falls west of Route 22 from October 1st through December 31st., 233561=(2) In Montgomery County, suckers may be taken from January 1st through May 15th from Evas Kill, Flat Creek, Canajoharie Creek (mouth to dam one-half mile above mouth) and Caroga Creek., 46462=(f) Additional special fishing regulations for Spooner Creek and tributaries (Erie County) and the North Branch Clear Creek and tributaries (Erie County) from Taylor Hollow Road upstream to the outflow of Clear Lake; angling prohibited from January 1st through March 31st., 272042=Privacy Policy | Website Usage and Policies | Website Accessibility | Employment | Contact Us | Website Survey Copyright © 2015 New York State Department of Environmental Conservation, 238238=(2) On Green Lake and Panther Lake in Herkimer County, trout may be taken from April 1st through November 30th. Statewide size and bag limits apply., 210242=(13) Chittenango Creek from mouth upstream to Conrail railroad line in Madison County--closed from March 16th until the opening of Walleye season in May;, 246621=(d) Snatching and blind snatching are permitted with hooks having not more than two hook points to take whitefish in Piseco Lake from January 1st through November 30th., 210930=(17) Kayaderosseras Creek from Saratoga Lake upstream to first railroad bridge in Saratoga County--closed from March 16th until the opening of Walleye season in May; and, 41892=(e) Weight shall not be added to the line, leader, swivels, artificial fly or lure in any manner such that the weight hangs lower than the attached hook, artificial fly or lure when the line or leader is suspended vertically from the rod, except from Lake Ontario upstream to the Route 3 bridge from April 1st through August 14th., 245367=(c) Possession of snatch hooks is prohibited on all waters except those where fish may be taken by snatching. In waters other than tributaries to the Great Lakes, snatching but not blind snatching is permitted January 1st through May 15th only as follows:, 40859=(a) Fishing from ½ hour after sunset to ½ hour before sunrise is prohibited, except fishing is permitted from ½ hour after sunset to ½ hour before sunrise from Lake Ontario to the Route 3 bridge from April 1st through August 14th., 235968=(10) In Cayuga County, bullhead and sucker may be taken from January 1st through May 15th from Sterling Creek (downstream of Route 104A), Sterling Valley Creek (downstream of Route 104A), Eightmile Creek and Ninemile Creek., 45118=(iv) The following regulations shall apply from September 1st through March 31st of the following year:, 40460=(i) From April 15th through August 14th, subdivision (a) of this section shall apply. For species not listed in subdivision (a) of this section, general angling regulations listed in section 10.1(b) of this Part shall apply., 55171=(2) From June 15th through December 31st in the Saranac River from Catherine Street bridge upstream to Imperial Mill Dam, Ausable River from D &H Railroad bridge upstream to Rainbow Falls, North Branch Boquet River and tributaries from mouth to first upstream barrier, and Boquet River from mouth upstream to Wadhams Falls, no person may:, 209726=(10) Little Choconut Creek from its mouth to Goudey Station building in Broome County--closed from March 16th until the opening of Walleye season in May;, 208604=(4) Otselic River from its mouth to Whitney Point Reservoir dam in Broome County--closed March 16th until the opening of Walleye season in May;, 211114=(18) Susquehanna River in Binghamton between Rock Bottom Dam and Exchange Street bridge in Broome County--closed from March 16th until the opening of Walleye season in May., 205364=(ii) Angling is prohibited from January 1st through March 31st except for those stream sections listed in paragraph (4) of this subdivision and Fall Creek in Ithaca, Tompkins County, from the downstream edge of the railroad bridge below Rt. 13 to Ithaca Falls., 208762=(5) Susquehanna River in the Towns of Union and Vestal from the Erie Lackawanna railroad bridge downstream to Murphy's Island, in Broome County-- closed March 16th until the opening of Walleye season in May;, 45005=(iii) From April 1st through August 31st, only artificial lures or artificial flies shall be used., 211594=(20) Lake Pleasant outlet to mouth of the Kunjamuk River in Hamilton County - closed from March 16th until the opening walleye season in May., 62537=(1) Black bass and pickerel may be taken from 6 a.m. on the third Saturday in April to November 30th., 210410=(14) Fish Creek from Barge Canal upstream to junction of East and West Branches of Fish Creek in Oneida County--closed from March 16th until the opening of Walleye season in May;, 209549=(9) Canaseraga Creek from Route 31 bridge upstream to New York State Thruway in Madison County--closed from March 16th until the opening of Walleye season in May;, 234539=(6) In Franklin County, bowfin, burbot, carp, freshwater drum, gar, redhorse and suckers may be taken from March 20th through September 30th from Big Salmon River (from Canada upstream to the Route 37 Bridge in Fort Covington), Lawrence Brook (from county line upstream to County Route 6 west of Moira), Little Salmon River (from mouth upstream to County Route 32 in South Bombay), Pike Creek (from Canada upstream to State Route 95 west of Bombay), St. Regis River (from Canada upstream to dam at Hogansburg) and Farrington Brook (from mouth upstream to U.S. Route 11)., 235138=(7) In the Hudson River, carp, and suckers may be taken from March 20th through September 30th from Bakers Falls in the village of Hudson Falls upstream to confluence of Stony Creek in Warren County., 233377=(1) In Dutchess, Orange, Putnam, Rockland, Sullivan, Ulster and Westchester Counties, suckers may be taken in any stream from January 1st through May 15th., 210772=(16) Scriba Creek from mouth upstream to Fish Hatchery Dam in Oswego County--closed from March 16th until the opening of Walleye season in May;}",
    "textBeforeTable": "(j) On Brandreth Lake, East Pond, North Pond, and West Pond in Brandreth Park, Hamilton County, the following regulations shall apply: Ice fishing permitted 5 Any size April 1 through October 31 Trout Method Daily limit Minimum length Open Season Species Nicholas Pond in Essex County (i) On Nicholas Pond in Essex County, the following regulations shall apply: 10 Any size April 1 through October 31 Trout Daily limit Minimum length Open Season Species Sprite Club Pond in Fulton County (h) On Sprite Club Pond in Fulton County, the following regulations shall apply: 10 Any size All year Trout Daily limit Minimum length Open Season Species Lower Ausable Lake and the East Branch of the Ausable River from Russell Falls in Keene Valley upstream to lower Ausable Lake in Essex County (g) On lower Ausable Lake and the East Branch of the Ausable River from Russell Falls in Keene Valley upstream to lower Ausable Lake in Essex County, the following regulations shall apply: (f) On",
    "textAfterTable": "(k) On Little Simon Pond in the Town of Tupper Lake, Franklin County, the following regulations shall apply: Little Simon Pond in the Town of Tupper Lake, Franklin County Species Open Season Minimum length Daily limit Method Lake trout All year Any size 3 Ice fishing permitted (l) On Split Rock, Mink and Thumb Ponds in the Town of Minerva, Essex County, the following regulations shall apply: Split Rock, Mink and Thumb Ponds in the Town of Minerva, Essex County Species Open Season Minimum length Daily limit Method Trout April 1 through October 31 Any size 10 (m) On Salmon Pond, Town of Indian Lake, Hamilton County, the following regulations apply. Salmon Pond, Town of Indian Lake, Hamilton County Species Open Season Minimum length Daily limit Method All species Statewide Regulations Apply Ice fishing permitted §10.9 Snatching (a) Definitions. For purposes of this section, snatching means taking fish not attracted by bait or artificial lure with hooks, gangs",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}