{
    "relation": [
        [
            "Column (Field)",
            "Agent Name",
            "Precision Queue",
            "Attributes"
        ],
        [
            "Description",
            "Derived from: Person.LastName \",\" Person.FirstName The last and first name of the agent.",
            "Derived from: Precision_Queue.EnterpriseName The precision queues with which the agent is associated .",
            "The attributes used in the precision queue definition. The report shows only those attributes that are used."
        ]
    ],
    "pageTitle": "Report Template Reference Guide For Cisco Unified Intelligence Center Release 9.0(1) - Skill Group and Precision Queue Reports [Cisco Unified Intelligence Center] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cust_contact/contact_center/intelligence_suite/intelligence_suite_901/user/guide/CUIC_BK_CD5E4ED8_00_cuic-report-template-reference-guide/CUIC_BK_CD5E4ED8_00_cuic-report-template-reference-guide_chapter_0110.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369923287,
    "recordOffset": 369877791,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10356=Available fields for this report include the fields that display by default as Current. Additional Available fields for this template are populated from the Skill_Group_Interval and Bucket_Intervals tables as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html., 85505=Available fields for this report include the fields that appear by default as Current. In addition, most Available fields in this report are derived from the Router_Queue_Interval and Skill_Group_Interval table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html.}",
    "TableContextTimeStampAfterTable": "{1795=Additional Available fields in this report are populated from fields in the Agent_Skill_Group_Real_Time table as documented in the Database Schema Guide for Cisco Unified Contact Center Enterprise at http:/​/​www.cisco.com/​en/​US/​products/​sw/​custcosw/​ps1844/​tsd_​products_​support_​series_​home.html.}",
    "textBeforeTable": "The following current fields are listed in the order (left to right) in which they appear by default in the stock template. Current fields are those fields that appear by default in a report generated from the stock template. Current Fields in the Precision Queue Interval All Fields Grid View Sample Precision Queue Interval All Fields Report Available Fields in the Precision Queue Interval All Fields Grid View Current Fields in the Precision Queue Interval All Fields Grid View Skill_Group_Interval Router_Queue_Interval Precision_Queue Attribute Database Schema Tables from which data is retrieved: Value List: Precision Queue Grouping: This report is grouped by Precision Queue Name. Views: This report only has a grid view. Query: This report data is built from a Database Query. Use this report to evaluate Precision Queue performance and staffing. Precision Queue Interval provides key statistics per Precision Queue such as average speed of answer and contacts handled, as well as agent state times. The Precision Queue interval report is comparable to Peripheral Skill Group Historical. Precision Queue Interval All Fields",
    "textAfterTable": "Calls Queued Derived from: Router_Queue_Interval.QueueCalls. ASA Derived from: Skill_Group_Interval.AnswerWaitTime /Skill_Group_Interval.CallsAnswered. The precision queue average speed of answer in HH:MM:SS(hour, minutes, seconds) based on the time spent by callers in the queue and ringing at an agent desktop before the task is answered divided by the number of answered tasks. Service Level Service Level Service Level Type used to calculate Service level for the interval. Derived from: Router_Queue_Interval.ServiceLevel. SL Ans Derived from: Router_Queue_Interval.ServiceLevelCallsOffered. The number of calls that are routed to the precision queue or queued to the precision queue in the last interval. SL Aban Derived from: Router_Queue_Interval.ServiceLevelCallsAband. The number of calls that are abandoned within the precision queue service level threshold in the last interval. Completed Tasks Total Derived from: (Skill_Group_Interval.CallsHandled +",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}