{
    "relation": [
        [
            "Responder",
            "Harry Halpin",
            "Daniel Appelquist",
            "Michael Hausenblas",
            "Danny Ayers",
            "Alberto San José",
            "Toby Inkster",
            "Olga Revilla",
            "Renato Iannella",
            "Karl Dubost",
            "Jeffrey Sonstein",
            "Manrique Lopez",
            "Benjamin Nguyen",
            "Miquel Martin",
            "Powell Andy",
            "Maciej Kuszpa",
            "Timothee Anglade",
            "Matthew Rowe",
            "Santos Olga",
            "Krishna Sankar",
            "eva janeiro",
            "Sánchez González",
            "kaushik sethuraman",
            "Alexandre Passant",
            "John Breslin",
            "Bill Gauvin",
            "Christine Perey",
            "Davide Palmisano",
            "Michele Minno",
            "Michele Mostarda",
            "Francesco de Leo",
            "joaquin Salvachua",
            "Sam Critchley",
            "Claudio Venezia",
            "Fabien Gandon",
            "Ronald Reck",
            "Sören Preibusch",
            "Dan Brickley",
            "Oshani Seneviratne",
            "Peter Ferne",
            "Hans Constandt"
        ],
        [
            "Should we delete user experience task force?",
            "yes",
            "abstain",
            "abstain",
            "concur",
            "no",
            "abstain",
            "no",
            "yes",
            "abstain",
            "no",
            "no",
            "abstain",
            "yes",
            "no",
            "abstain",
            "no",
            "concur",
            "no",
            "concur",
            "no",
            "no",
            "concur",
            "abstain",
            "no",
            "no",
            "no",
            "no",
            "no",
            "concur",
            "abstain",
            "no",
            "no",
            "no",
            "concur",
            "concur",
            "yes",
            "abstain",
            "concur",
            "no",
            "no"
        ],
        [
            "Comments",
            "Is this mobile phone related? Not sure. If so, would keep a mobile focus deliverable.",
            "",
            "",
            "",
            "Just sent an email to the list, advocating for keeping UX in. I edited The UnifiedSocialWebXG charter to explain and expand the UX chapter: http://esw.w3.org/topic/UnifiedSocialXG#head-07d4989ef5f476b9d7daa953514658adf5cc0803",
            "",
            "",
            "",
            "",
            "",
            "I think this is one of the key points of this charter and it has an entity on itself.",
            "",
            "",
            "Consider merging with the Distributed Architectures task force.",
            "",
            "",
            "",
            "I think it is very relevant to explicitly keep the user side from the technical perspectives",
            "",
            "",
            "",
            "",
            "",
            "",
            "No, it's too early and the other task force will concentrate on specific aspects of user experience and ignore major factors which do not concern them.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "(Yes if there is not enough involvement)",
            "",
            "",
            "",
            "",
            "Another cross cutting issue but a vitally important and often under served one.",
            ""
        ]
    ],
    "pageTitle": "Results of Questionnaire Social Web XG: Organization of Charter - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "http://www.w3.org/2002/09/wbs/99999/SocialWebXGCharter/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 813115251,
    "recordOffset": 813095323,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2375=This questionnaire was open from 2009-02-18 to 2009-03-03.}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details (2 responses didn't contain an answer to this question) 14 Edit the new larger charter 24 Edit the original smaller charter Results All responders Choice Summary Most other W3C XGs have a single deliverable, a final report, although some groups have up to 3 deliverables. For examples of previous charters, see the W3C list of Incubator Charters. Note that deliverables are the contract of the Incubator Group to the W3C, and it is expected deliverables will be completed within the XG's time frame (1 year). One proposal is that the proposed charter may be too large, due to having too many deliverables (15). A smaller charter with (5) deliverables was written earlier. 1. Which charter and how many deliverables? If not a W3C Member, would your organization be interested in joining the W3C? If a W3C member, would you be sponsoring the Social Web XG? Is your organization a W3C member? Should we delete user experience task force? Should we delete contextual data task force? Should we merge business practices and landscape taskforce groups? Should we merge interoperability task force with distributed architectures? Do you wish to nominate yourself as an Editor? Which parts of the social web",
    "textAfterTable": "2. Should we stay one group or divide into task forces? Usually within the W3C a \"task force\" is meant to be set-up to operate between groups. However, it has been suggested that the Social Web XG divide into task forces based on interest, where task-forces are appointed when there is too much activity on distinct subjects and separate lists and telecons need to be set up. Should we start as a single group and divide into task forces as needed, or start the XG divided into task-forces? Summary Choice All responders Results Keep to one group, do not use task-forces unless absolutely necessary. 15 Use task-forces, even if activity is low. 17 Don't care. 8 Details Responder Should we stay one group or divide into task forces? Comments Harry Halpin Keep to one group, do not use task-forces unless absolutely necessary. Daniel Appelquist Use task-forces, even if activity is low. Michael Hausenblas Don't care. I'm missing a fourth option: create two or three XGs. Hence I *had* to choose don't care ... Danny Ayers Don't care.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}