{
    "relation": [
        [
            "Title",
            "Korean DBCS Rational Developer for System z v8.0 Quick Start Guide This guide is intended to get you started with a base configuration for IBM Rational Developer for System z.",
            "",
            "Korean Rational Developer for System z Unit Test v8.0 Quick Start Guide This guide is intended to get you started with a base configuration for IBM Rational Developer for System z Unit Test.",
            "",
            "Korean Rational Developer for System z Unit Test V8.0 USB Hardware Key Quick Start Guide This guide is intended to get you started with a base configuration for IBM Rational Developer for System z Unit Test USB Hardware Key.",
            "",
            "Korean DBCS Rational Developer for System z v8.0 Host Configuration Quick Start The Host Quick Start discusses the configuration of the IBM Rational Developer for System z functions. It includes brief instructions on how to configure IBM Rational Developer for System z and IBM Rational Developer for System z Common Access Repository Manager.",
            "",
            "Korean DBCS Rational Developer for System z v8.0 RSE Server Installation Guide: Linux on System z This guide provides RSE Server installation instructions on Linux for System z.",
            "",
            "Korean DBCS Rational Developer for System z v8.0 RSE Server Installation Guide: AIX and Linux This guide provides RSE Server installation instructions on AIX and Linux systems.",
            ""
        ],
        [
            "Order number",
            "GA30-4182-05",
            "",
            "GA30-4187-02",
            "",
            "GA30-4217-01",
            "",
            "GA30-4183-03",
            "",
            "GA30-4186-01",
            "",
            "SA30-4185-04",
            ""
        ]
    ],
    "pageTitle": "IBM Rational Developer for zEnterprise Library - United States",
    "title": "",
    "url": "http://www-01.ibm.com/support/docview.wss?uid=swg27038516",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258770635,
    "recordOffset": 258742803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{147072=Last updated: 31 May 2012, 147676=Last updated: 24 Oct 2011, 149657=Last updated: 07 Aug 2009, 150908=Last updated: 15 Jun 2012, 149042=Last updated: 31 Jul 2011, 164491=2015-01-28}",
    "lastModified": "Wed, 28 Jan 2015 15:31:49 GMT",
    "textBeforeTable": "Content IBM Rational Developer for zEnterprise is a unified development tool for application development on z/OS, CICS, IMS, IBM DB2, IBM WebSphere Application Server, and Power Systems.This page contains a collection of announcement letters, case studies, release notes, white papers, and product documentation for IBM Rational Developer for zEnterprise Abstract Product documentation Rational Developer for zEnterprise Library Search Site map IBM® Select a country/region: United States",
    "textAfterTable": "Languages     English German Spanish French Japanese Korean Traditional Chinese Simplified Chinese Brazilian Portuguese Note: Not all documents are available in all languages. Each country selects which documents to translate and provide in their native language.   English   Release Notes Title Order number Rational Developer for System z v8.5 Release notes This document provides information about this release of Rational Developer for System z. GI13-1509-04 Finding known problems for Rational Developer for System z This link launches a customized query of the Live Support Knowledge Base where known Developer for System z problems are documented in the form of individual technotes. These technotes often provide work arounds or solutions to the problems.   Back to top   Information Center",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}