{
    "relation": [
        [
            "Patent application number",
            "20090306309",
            "20100249342"
        ],
        [
            "Description",
            "POLYPHENYLENE SULFIDE RESIN COMPOSITION - A process for producing a polyphenylene sulfide resin composition includes melt-kneading about 99 to about 60 wt % of a polyphenylene sulfide resin (a) and about 1 to about 40 wt % of a polyamide resin (b), and about 0.1 to 10 parts by weight of a compatibilizing agent (c) per 100 parts by weight in total of the polyphenylene sulfide resin (a) and the polyamide resin (b), using a double screw extruder with two or more kneading portions at a temperature of the range from a melting peak temperature of the polyphenylene sulfide resin+10° C. to a melting peak temperature of the polyphenylene sulfide resin+70° C., wherein the polyamide resin (b) is excluded nylon 46 and has a relative viscosity of 1.5 or more measuring in concentrated sulfuric acid at a concentration of 1% and at 25° C., wherein the compatibilizing agent (c) is a compound having one or more types of groups selected from epoxy groups, amino group and isocyanate group, and wherein the resin composition has a morphology that the polyphenylene sulfide resin (a) in the resin composition forms a sea phase while the polyamide resin (b) in the resin composition forms an island phase, and the number average dispersed particle size of the polyamide resin (b) is kept at less than about 500 nm after the resin composition is melted and allowed to reside at 300° C. for 30 minutes.",
            "PROCESS FOR PRODUCTION OF POLYPHENYLENE SULFIDE RESIN - A process for producing a polyphenylene sulfide resin with properties of (1) 0.3 wt % or less in the amount of the volatile gas generated when heated and melted at 320° C. in vacuum for 2 hours, (2) 0.3 wt % or less in the ash content achieved when incinerated at 550° C., (3) 4.0 wt % or less in the residue amount achieved when a solution with 1 part by weight of the polyphenylene sulfide resin dissolved in 20 parts by weight of 1-chloronaphthalene is pressure-filtered by a PTFE membrane filter with a pore size of 1 μm at 250° C. for 5 minutes, and (4) higher than 500 g/10 min in melt flow rate (according to ASTM D-1238-70: measured at a temperature of 315.5° C. and at a load of 5000 g), by acid-treating a polyphenylene sulfide resin in an acid treatment step and subsequently treating it for thermal oxidation in a thermal oxidation step."
        ],
        [
            "Published",
            "12-10-2009",
            "09-30-2010"
        ]
    ],
    "pageTitle": "Saitoh, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/saitoh-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443297319,
    "recordOffset": 443257259,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kei Saitoh, Aichi JP //]]> BarDraw('3294451',['Patent applications by Kazuya Saitoh, Yasugi JP'],[[1,1,1]],['2005','2009','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3294451\" align=\"center\"></div> </div> <canvas id=\"bg3294451\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kazuya Saitoh, Yasugi JP</p> <div class=\"bar3294451\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-06-2013</td> <td><a href=\"/patents/app/20130143072\">Soft Magnetic Under Layer</a> - A soft magnetic under layer has a low antiferromagnetic coupling force and a high saturation magnetic flux density. The soft magnetic under layer includes two soft magnetic layers and a spacer layer. The soft magnetic layers are expressed by a composition formula as (Fe</td> <td>20130143072</td> <tr> </tr> <td>09-24-2009</td> <td><a href=\"/patents/app/20090238712\">METHOD OF PRODUCING A SPUTTER TARGET MATERIAL</a> - A sputter target material which is of a sintered material, wherein the sputter target material consists of 0.5 to 50 atomic % in total of at least one metal element (M) selected from the group of Ti, Zr, V, Nb and Cr, and the balance of Mo and unavoidable impurities, and has a microstructure seen at a perpendicular cross section to a sputtering surface, in which microstructure oxide particles exist near a boundary of each island of the metal element (M), and wherein the maximum area of the island, which is defined by connecting the oxide particles with linear lines so as to form a closed zone, is not more than 1.0 mm</td> <td>20090238712</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3294451\"> <h2>Kazuya Saitoh, Yasugi JP</h2> </table> </tbody>",
    "textAfterTable": "Patent applications by Kei Saitoh, Aichi JP Kei Saitoh, Chiba JP Patent application number Description Published 20090201257 Display Device - An image processing portion compares a preregistered fingerprint with a fingerprint sensed by a fingerprint-sensor-equipped key, and determines whether the fingerprints match with each other or not. When the fingerprints match with each other, a finger direction determining portion determines a direction of a finger from a displacement of the fingerprint. A main controller changes a direction of displayed contents of a display portion according to the direction of the finger determined by the finger direction determining portion. Therefore, a user can change the direction of the displayed contents of the display means by a simple operation. 08-13-2009 Kei Saitoh, Negoya-Shi JP Patent application number Description Published 20090041968 POLYPHENYLENE SULFIDE RESIN COMPOSITION, PROCESS FOR PRODUCING THE SAME, AND MOLDED ARTICLE - A polyphenylene sulfide resin composition including 100 parts by weight of a resin composition that consists of 99 to 60 wt % of a polyphenylene sulfide resin (a), and 1 to 40 wt % of at least one type of noncrystalline resin (b) selected from the group consisting of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}