{
    "relation": [
        [
            "Published Date",
            "Jul 19, 2013",
            "Apr 8, 2013",
            "Nov 2, 2012",
            "Oct 9, 2009",
            "Sep 11, 2008",
            "Apr 18, 2008"
        ],
        [
            "Version",
            "8 (current)",
            "7",
            "6",
            "5",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - METOPROLOL TARTRATE - metoprolol tartrate tablet, film coated",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=2b705cb6-cb75-4c2a-907a-4bd45d18bc2c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60178963,
    "recordOffset": 60140976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15887=Acute Toxicity Several cases of overdosage have been reported, some leading to death. Oral LD50’s (mg/kg): mice, 1158 to 2460; rats, 3090 to 4670., 58039=Mechanism of Action Metoprolol tartrate is a beta1-selective (cardioselective) adrenergic receptor blocker. This preferential effect is not absolute, however, and at higher plasma concentrations, metoprolol also inhibits beta2-adrenoreceptors, chiefly located in the bronchial and vascular musculature. Clinical pharmacology studies have demonstrated the beta-blocking activity of metoprolol, as shown by (1) reduction in heart rate and cardiac output at rest and upon exercise, (2) reduction of systolic blood pressure upon exercise, (3) inhibition of isoproterenol-induced tachycardia, and (4) reduction of reflex orthostatic tachycardia. Hypertension The mechanism of the antihypertensive effects of beta-blocking agents has not been fully elucidated. However, several possible mechanisms have been proposed: (1) competitive antagonism of catecholamines at peripheral (especially cardiac) adrenergic neuron sites, leading to decreased cardiac output; (2) a central effect leading to reduced sympathetic outflow to the periphery; and (3) suppression of renin activity. Angina Pectoris By blocking catecholamine-induced increases in heart rate, in velocity and extent of myocardial contraction, and in blood pressure, metoprolol reduces the oxygen requirements of the heart at any given level of effort, thus making it useful in the long-term management of angina pectoris. Myocardial Infarction The precise mechanism of action of metoprolol in patients with suspected or definite myocardial infarction is not known. Pharmacodynamics Relative beta1 selectivity is demonstrated by the following: (1) In healthy subjects, metoprolol is unable to reverse the beta2-mediated vasodilating effects of epinephrine. This contrasts with the effect of nonselective (beta1 plus beta2) beta-blockers, which completely reverse the vasodilating effects of epinephrine. (2) In asthmatic patients, metoprolol reduces FEV1 and FVC significantly less than a nonselective beta-blocker, propranolol, at equivalent beta1-receptor blocking doses. Metoprolol has no intrinsic sympathomimetic activity, and membrane-stabilizing activity is detectable only at doses much greater than required for beta-blockade. Animal and human experiments indicate that metoprolol slows the sinus rate and decreases AV nodal conduction. Significant beta-blocking effect (as measured by reduction of exercise heart rate) occurs within 1 hour after oral administration, and its duration is dose-related. For example, a 50% reduction of the maximum effect after single oral doses of 20, 50, and 100 mg occurred at 3.3, 5, and 6.4 hours, respectively, in normal subjects. After repeated oral dosages of 100 mg twice daily, a significant reduction in exercise systolic blood pressure was evident at 12 hours. When the drug was infused over a 10-minute period, in normal volunteers, maximum beta-blockade was achieved at approximately 20 minutes. Equivalent maximal beta-blocking effect is achieved with oral and intravenous doses in the ratio of approximately 2.5:1. There is a linear relationship between the log of plasma levels and reduction of exercise heart rate. However, antihypertensive activity does not appear to be related to plasma levels. Because of variable plasma levels attained with a given dose and lack of a consistent relationship of antihypertensive activity to dose, selection of proper dosage requires individual titration. In several studies of patients with acute myocardial infarction, intravenous followed by oral administration of metoprolol caused a reduction in heart rate, systolic blood pressure and cardiac output. Stroke volume, diastolic blood pressure and pulmonary artery end diastolic pressure remained unchanged. In patients with angina pectoris, plasma concentration measured at 1 hour is linearly related to the oral dose within the range of 50 to 400 mg. Exercise heart rate and systolic blood pressure are reduced in relation to the logarithm of the oral dose of metoprolol. The increase in exercise capacity and the reduction in left ventricular ischemia are also significantly related to the logarithm of the oral dose., 6250=Metoprolol Tartrate Tablets, USP are available as follows:   Tablets 25 mg are white round shaped, film coated tablets debossed with ‘C over 73’ on one side and deep break line on other side.                Bottles of 100         NDC 65862-062-01 (Child Resistant Closure)                Bottles of 1000       NDC 65862-062-99 (Non Child Resistant Closure) Tablets 50 mg are pink round shaped, film coated tablets debossed with ‘C over 74’ on one side and deep break line on other side.                Bottles of 100         NDC 65862-063-01 (Child Resistant Closure)                Bottles of 1000       NDC 65862-063-99 (Non Child Resistant Closure) Tablets 100 mg are light blue round shaped, film coated tablets debossed with ‘C over 75’ on one side and deep break line on other side.                Bottles of 100         NDC 65862-064-01 (Child Resistant Closure)                Bottles of 1000       NDC 65862-064-99 (Non Child Resistant Closure) Store at 20° to 25°C (68° to 77°F); excursions permitted to 15° to 30°C (59° to 86°F) [see USP Controlled Room Temperature]. Protect from moisture and heat. Dispense in a tight, light-resistant container as defined in the USP using a child-resistant closure. To report SUSPECTED ADVERSE REACTIONS, contact Aurobindo Pharma USA, Inc. at 1-866-850-2876 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch  Manufactured for: Aurobindo Pharma USA, Inc. 2400 Route 130 North Dayton, NJ 08810 Manufactured by: Aurobindo Pharma Limited Hyderabad-500 072, India Revised: 04/2013}",
    "textBeforeTable": "Number of versions: 6 METOPROLOL TARTRATE - metoprolol tartrate tablet, film coated View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close API MANUFACTURE(65862-062, 65862-063, 65862-064) 918917647 Aurobindo Pharma Limited Business Operations ID/FEI Address Name Establishment ANALYSIS(65862-062, 65862-063, 65862-064) , MANUFACTURE(65862-062, 65862-063, 65862-064) 918917642 Aurobindo Pharma Limited Business Operations ID/FEI Address Name Establishment Labeler - Aurobindo Pharma Limited",
    "textAfterTable": "RxNorm METOPROLOL TARTRATE - metoprolol tartrate tablet, film coated RxCUI RxNorm NAME RxTTY 1 866511 metoprolol tartrate 100 MG Oral Tablet PSN 2 866511 Metoprolol Tartrate 100 MG Oral Tablet SCD 3 866511 metoprolol tartrate 100 MG (as metoprolol succinate 95 MG) Oral Tablet SY 4 866514 metoprolol tartrate 50 MG Oral Tablet PSN 5 866514 Metoprolol Tartrate 50 MG Oral Tablet SCD 6 866924 metoprolol tartrate 25 MG Oral Tablet PSN 7 866924 Metoprolol Tartrate 25 MG Oral Tablet SCD Get Label RSS Feed for this Drug METOPROLOL TARTRATE - metoprolol tartrate tablet, film coated To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=2b705cb6-cb75-4c2a-907a-4bd45d18bc2c To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}