{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/01/23/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 697946627,
    "recordOffset": 697873139,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{39653=Docklands observation wheel won't open until the second half of 2013.}",
    "TableContextTimeStampAfterTable": "{246986=Linz the Global Vagabond, Jan 22, 2013, 10:37PM, 228364=Live tennis commentary: 2013 Australian Open, day eight, 119680=Each station has its own recipe for success in 2013., 99889=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 122781=January 28: Some say rock icons, others say music gods– the Big Day Out is booked for their stop in Oz., 181369=Jared Ingersoll is closing Waterloo's Danks Street Depot in February., 260117=January 22 2013, 123819=January 31: Acclaimed UK artist and former Pulp member brings his tour to Perth's Rosemount Hotel., 247921=Bill, Jan 22, 2013, 9:40PM, 121819=January 23: Weezer are bringing their Blue Album to the Perth Arena., 246253=I was in East Berlin (backpacker in those days) during 1982. I went down an alley which ... }",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Whatever the results on court, Channel Seven has worked itself into a winning situation with Lleyton Hewitt. Australian Open What's on TV Tonight One of Disney.Pixar’s most beloved films ever returns to the big screen. Win 'Monsters, Inc' prize packs Competition We've done the legwork to help you decide which shows to see. Line up your laughs Brisbane Comedy Festival Brisbane TV show looking for energetic kids. The handball's in your court",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}