{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Kettering University does occasionally have problems with campus safety. This is mostly because of the university's location in Flint, Michigan. However, the campus safety department does frequently patrol the area, including the parking lots, and will even offer to drive you to or from campus to a location within a mile.",
            "Kettering University has something on the order of 17 fraternities and sororities, all of which have a noticeable presence on campus. The fraternity and sorority houses are all fairly close to campus, and are always open to new members. They frequently have philanthropic and community support events.",
            "There are many clubs at Kettering University. We have an Asian-American Association, a chemical engineering club, Outdoors club, Dance club, fencing club, choir, band, mixed martial arts club, grilling club, off-road club, an ultimate frisbee team, a hockey team, a physics club, and even a chess club.",
            "Nerdy, science and math types are always welcome, as are students interested in cars and all things automotive. Students interested in computer science and engineering are always welcomed as well. The majority of the student body is composed of mechanical engineering majors.",
            "We have The Beach, which is a large courtyard on campus, on which is a statue of a bulldog which is painted every few days by student organizations and fraternities. We also have The Cribathon, which is a lecture hall where one used to be able to hang cheat-sheets or cribs, and the professor couldn't see them from where he stood.",
            "Kettering University is a fairly expensive school. This is because it is a small, privately funded university. However, the quality of education you get, and the work experience you gain through the cooperative education program is worth the cost.",
            "Kettering University has a diversity of clubs which meet regularly, including Dance Club, Fencing Club, Choir, Band, Outdoor Club, Physics Club, Chess Club, Off Road Club, and Aero Science Club. Kettering also has a Recreation Center on campus which features an indoor swimming pool, workout facility, tennis courts, running track, and yoga classes. There are also a few sports teams, such as ultimate frisbee and ice hockey.",
            "The dining facility was recently renovated and the quality of food was improved. The dining facility is close to the dorms. One can even use the tunnel to get there. The facility serves three meals per day in the Sunrise Room. One can purchase food items in the Sunset Room at any time.",
            "Kettering University has a single dormitory building. The rooms are singles and suites, which is somewhat desirable. There are many events aimed specifically at those who live in the dorms, often with free food. Tutors are often available for those who need extra help. One can rent movies from the front desk of the dorms. There is even a tunnel to the main academic building that allows one to go to class without going outdoors on bad weather days.",
            "Kettering University is fairly rigorous academically, depending on your intended major. Studying will likely be necessary for high marks. School terms are shorter than those at a traditional school, and as such, the pace at which classes move is higher.",
            "Prospective students should ensure they are well prepared for both academic rigor, and are able to keep a job, as a co-op job is a requirement for graduation.",
            "Kettering University is ranked highly for its academic programs and the cooperative education program is second-to-none. The requirements of this school are fairly high, and success here will take a lot of work. Kettering University has a small campus, with a friendly, everybody-knows-everybody atmosphere and plenty of opportunities for Greek life and post-graduation employment."
        ]
    ],
    "pageTitle": "Kettering University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Kettering-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912282223,
    "recordOffset": 912225291,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68314=While Kettering is expensive, they're very generous of their need and merit based aid. And when you budget your earnings from your co-op properly, there shouldn't be too much of an issue. As of 2012, there are now more jobs than students again., 224312=© 2015, Cappex.com, LLC, 192999=If you aren't sure you want to go into your degree field, don't attend Kettering. While it is a great school, it is hard to transfer out of and it isn't the cheapest place around. If you are looking for a ton of people, don't attend Kettering. We have maybe 1000 students on campus at a time, and that isn't for everybody. Don't think Kettering is like every other school, the faculty and staff expect more mature behavior because we are all employed by a company and therefore are held to a higher standard. Plus the classes are so small that they will notice if you aren't there. Visit the campus before you apply. You have to be comfortable here to succeed. I am very happy with my choice to attend this school, but I have seen people burn out from it and waste money and time that could have been spent somewhere else. Also, don't let anyone tell you that you can't go to Kettering just because you have a ton of money. Most of us are very dependent on our scholarships and co-op wages, so don't think you'll be the only one. Your work in high school does pay off in terms of scholarships and don't be afraid to ask questions, there are tons of people that are ready and willing to help., 48305=I'm from California and I visited Kettering in March when it was snowing and it was just beautiful. It ay have been cold, but the school is built for it. They have an underground tunnel-way where students can walk from building to building, underground, without getting wet or cold. The dorms are also small, but private, with one person to a room and they can be customized in almost any way that you want. You can also personalize the wall outside your room if you would like as long as you get permission from the school., 83008=It depends on the section you go. A-section school term starts in July and ends in September. B-section school term starts in October and goes till December. During the summer term for A-section, it's a blast. Everyone is outside grilling burgers and hot dogs. You can always find people playing beach volleyball or corn-hole. There are large fields where you can play soccer, football, softball, or ultimate frisbee. There is also a very nice recreational center with a pool, 2 full basketball courts, 2 full tennis courts, dance studio, all exercise machines, and running track.}",
    "textBeforeTable": "09/15/2009 Reviewer is A current student here. 12 out of 14 people found this review useful. 1 of 45 Zachary from Defiance, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Kettering University Reviews Kettering University › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot Kettering challenges you to be the best that you can be and has a curriculum specifically focused on engineering. You dive right into your engineering classes your freshman year! Login to rate or flag the reviews Brandon from Sterling Heights, MI 07/31/2009 Reviewer is A current student here. 7 out of 10 people found this review useful. 1 person found this inaccurate. 3 of 45 Categories Comments Great for these types of students Students who want real-world experience through a co-op job while learning material so that they can apply theory to real life. Tips for prospective students Be prepared to learn. Kettering student body is broken into two sections so that half can be in school and the other half can work at their co-op job. These sections switch every three months. Thus, each class is condensed from the typical full-year school year to just those three months. Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}