{
    "relation": [
        [
            "[N2O5], M",
            "5.00",
            "3.52",
            "2.48",
            "1.75",
            "1.23"
        ],
        [
            "time, s",
            "0",
            "500",
            "1000",
            "1500",
            "2000"
        ]
    ],
    "pageTitle": "C30: Questions from Previous Chemistry 116 Exams",
    "title": "",
    "url": "http://donkistry.tripod.com/c30KineticsExam116.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74729439,
    "recordOffset": 74703436,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{74056=Calculate the concentration (in M) of HI after 1100 seconds.}",
    "textBeforeTable": "Laughing gas, N2O, can be prepared (ha, ha!) from H2 and NO: H2(g) + 2 NO(g) --> N2O(g) + H2O(g) A study of initial concentration (ha, ha!) versus initial rate at a certain temperature yields the following data for this reaction (ha, ha!): The two diagrams below represent snapshots of a very small portion of a first-order reaction in which A molecules are being converted to B molecules (A --> B): Which of the following diagrams represents a snapshot of a very small portion of this system at t = 3 min? All of the above influence the rate. concentrations of reactants presence of a catalyst activation energy temperature Which of the following influences the rate of a chemical reaction performed in solution? A certain first-order reaction has a rate constant, k, equal to 2.1 x 10-5 s-1 at 355 K. If the activation energy for this reaction is 135 kJ/mol, calculate the value of the rate constant (in s-1) at 550 K. It is impossible to tell. decreasing the concentration of (CH3)3CCl decreasing the concentration of HCl increasing the concentration of HCl increasing the concentration of (CH3)3COH Consider the following reaction at 25oC, (CH3)3COH(l) + HCl(aq) --> (CH3)3CCl(l) + H2O(l) The experimentally determined rate law for",
    "textAfterTable": "Which of the following is the correct rate law for this reaction (ha, ha!)? Rate = k[H2][NO]2 Rate = k[H2][NO] Rate = k[NO]2 Rate = k[H2]2 Rate = k Iodine-131, a radioactive isotope of iodine, is used medicinally as a radiotracer for the diagnosis and treatment of illnesses associated with the thyroid gland. The half-life of iodine-131 is 7.0 x 105 seconds. If a patient is given 0.45 g of iodine-131, calculate how long it would take (in seconds) for 90.0% of the iodine-131 to decay. Recall: radioactive decay is a first-order process. Consider a reaction which is first-order in A and first-order in B,  A + B --> Products Rate = k[A][B] What are the relative rates of this reaction in the vessels shown below. Note: each vessel has the same volume. III > I = IV > II I > III > II > IV IV > II > III > I II > IV > I > III III > I > IV > II The complex ion, [Cr(NH3)5Cl]2+, reacts with OH- ion in aqueous solution, [Cr(NH3)5Cl]2+(aq) + OH-(aq) --> [Cr(NH3)5(OH)]2+(aq) + Cl-(aq) The following data were obtained for this reaction at 25oC, time, min [Cr(NH3)5Cl]2+, M 0 1.00",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}