{
    "relation": [
        [
            "Patent application number",
            "20080284651",
            "20080284652",
            "20090273505"
        ],
        [
            "Description",
            "RADAR SYSTEM - Embodiments of the invention are concerned with a radar system, and relates specifically to scanning radar systems that are suitable for detecting and monitoring ground-based targets.",
            "FREQUENCY SCANNING ANTENNA - Embodiments of the invention are concerned with frequency scanning antennas for transceiving radio frequency energy for use in detecting and monitoring ground-based targets.",
            "RADAR SYSTEM - A scanning radar system suitable for detecting and monitoring ground-based targets includes a frequency generator, a frequency scanning antenna, and a receiver arranged to process signals received from a target so as to identify a Doppler frequency associated with the target. The frequency generator generates sets of signals, each set having a different characteristic frequency, and includes a digital synthesiser arranged to modulate a continuous wave signal of a given characteristic frequency by a sequence of modulation patterns to generate one set of signals. The frequency scanning antenna cooperates with the frequency generator to transceive radiation over a region having an angular extent dependent on the generated frequencies. Digital synthesiser techniques capable of precise frequency generation and control are combined with passive frequency scanning and Doppler processing techniques, enabling accurate control of range and scan rates, and optimisation of range cell size for factors such as slow and fast target detection and Signal to Noise ratio, so that targets can be detected at distances considerably farther away than is possible with known systems having similar power requirements."
        ],
        [
            "Published",
            "11-20-2008",
            "11-20-2008",
            "11-05-2009"
        ]
    ],
    "pageTitle": "Pearson, GB - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/pearson-gb-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449112411,
    "recordOffset": 449088686,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Graham Pearson, Essex GB 12-02-2010 METHOD FOR PHOTODYNAMIC THERAPY AND APPARATUS THEREFOR - Photodynamic therapy is used in the treatment of orthopaedic infections. Particularly, it is used in the treatment of infections related to orthopaedic conditions and surgery and includes treatment of sites of deterioration or trauma, such as prior to and after prosthetic fixation such as joint replacement or treatment of trauma sites such as pinning of bone fractures. An orthopaedic disinfection apparatus includes a photosensitiser and a light delivery system capable of producing and delivering light at a wavelength which is capable of being absorbed by the photosensitiser. Methods of treatment of orthopaedic infections are also disclosed. 20100305494 Published Description Patent application number Gavin John Pearson, West Sussex GB 05-02-2013 Vaccination Method Using Microneedle Arrays 20130110078 Published Description Patent application number Frances Pearson, W.yorkshire GB 02-03-2011 METHOD AND APPARATUS FOR LINING A CONDUIT - An apparatus is disclosed for locating an instrument within a pipe. The apparatus may include body portion defining a cavity therein, a pipe engagement region for slideable engagement with a pipe, and an instrument retention portion for receiving at least a portion of an instrument therein and retaining the instrument in position relative to the body. A method is also disclosed including the use of the apparatus to locate an instrument within a pipe. 20110024515 Published",
    "textAfterTable": "Ian Pearson, Penrith GB Patent application number Description Published 20120240665 RHOMETER CONTROL SYSTEM - A rotary rheometer is disclosed that includes improved control logic. This logic can provide continuously sampled force control logic, compliance control logic, adaptive control logic, anti-windup logic, and/or inertial correction logic. 09-27-2012 James Pearson, Hammersmith London GB Patent application number Description Published 20140153902 METHOD AND APPARATUS FOR AUTOMATIC EDITING - The system provides for the automatic editing of a video comprised of a plurality of content segments. When two or more content clips are available at a particular moment in time, the system will automatically choose at least a portion of one of the clips pursuant to preference metrics determined by a user. The system contemplates the ability of the user to define specific metrics to control the editing, including frequency of edits, content of content clip, level of activity, and the like. In another embodiment, the system has a plurality of pre-defined editing modes that define various metrics for use in the automatic editing system, including guaranteed participation, speaker-centric, quality of clip, and the like. 06-05-2014 James Pearson, Surrey GB Patent application number Description Published 20110229054 PROCESSING OF IMAGES TO REPRESENT A TRANSITION IN VIEWPOINT - When mixing cutting between video cameras viewing a common scene from different viewpoints, geometric transforms that vary from",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}