{
    "relation": [
        [
            "Tag",
            "%Cl(xpos,ypos,maxwidth,maxheight,[horizontal alignment],[vertical alignment])",
            "%Cd",
            "%C"
        ],
        [
            "Description",
            "Define the picture settings. More details. Horizontal alignment can be 'l', 'r', or 'c', for left, right and center. Vertical alignment can be 't', 'b', or 'c', for top, bottom and center.",
            "Display the album art bitmap. More details",
            "Use in a conditional to check if album art has been loaded"
        ]
    ],
    "pageTitle": "CustomWPS < Main < Wiki",
    "title": "",
    "url": "http://www.rockbox.org/wiki/CustomWPS?sortcol=1%3btable=34%3bup=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 680076923,
    "recordOffset": 680042864,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Viewport Line Text Styles These need to be before any other tags after a %V() line or scrolling lines will not work as expected. start end and optional text colour for gradient coloured lines. %Vg(start, end [, text]) colour is used for the remainder of the viewports background colour. %Vb(colour) colour is used for the remainder of the viewports foreground colour. %Vf(colour) Description Tag Viewport Colours 6-digit RGB888 colours - e.g. FF00FF Colour in the range 0 (= black) to 3 (= white) Greyscale no colours. tag ignored Mono Colour values LCD type Set the Info Viewport to use the viewport labeled label",
    "textAfterTable": "clear restore the default style invert draw the line inverted color Draw the text coloured the value given in param. Functionally equivalent to using the %Vf() tag gradient Draw the next param lines using a gradient. by default the gradient is over 1 line. %Vg(gradient,2) will use 2 lines to fully change from the start colour to the end colour Viewport Draw Layer Tag Description %VB Draw on the backdrop layer Rockbox uses two framebuffers when it does a screen redraw. The bottom layer is used for the backdrop image (the static parts of the display behind text for example), and the upper layer (the text/images). Using this tag you can tell the skin engine to instead draw everything in this viewport onto the backdrop layer instead of the foreground layer. Don't draw text here as it may",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}