{
    "relation": [
        [
            "Date",
            "Sep 24, 2001",
            "Apr 8, 2009",
            "Jul 28, 2009",
            "Mar 18, 2013",
            "Dec 9, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "CC",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ANSON, DAVID L. A.;REEL/FRAME:012205/0562 Effective date: 20010918",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Owner name: MICROSOFT TECHNOLOGY LICENSING, LLC, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MICROSOFT CORPORATION;REEL/FRAME:034541/0001 Effective date: 20141014"
        ]
    ],
    "pageTitle": "Patent US20030061193 - Generating a focused data set from an original data set - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030061193?dq=U.S.+Patent+No.+4,528,643)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477753295,
    "recordOffset": 477724291,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0048] The present invention may be embodied in other specific forms without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive. The scope of the invention is, therefore, indicated by the appended claims rather than by the foregoing description. All changes which come within the meaning and range of equivalency of the claims are to be embraced within their scope. [0047]FIG. 4B also illustrates another advantage of the present invention by showing relationships between the focused lines as previously described. For example, many of the data sets that are processed by the analysis module occur or are created over time. Thus, the lines in the data set have a temporal relationship, meaning that the first lines of the data set occurred before later lines of the data set. When the user applies a filter, the lines that meet that filter are displayed to the user. When a second filter is applied to the data set, those lines are also displayed to the user along with the lines that satisfy the first filter. By displaying these lines simultaneously, the user is able to view the temporal relationship between the lines because they are displayed in the order they occurred in the original data set. This reasoning can be expanded to include all of the filters and markers such that",
    "textAfterTable": "Flexible multiple spreadsheet data consolidation system US8280896 * Dec 9, 2005 Oct 2, 2012 Microsoft Corporation Reporting row structure for generating reports using focus areas US20050034058 * Aug 4, 2003 Feb 10, 2005 Sbc Knowledge Ventures, L.P. Flexible multiple spreadsheet data consolidation system US20120143893 * Jun 7, 2012 Microsoft Corporation Pattern Matching Framework for Log Analysis CN100465949C * May 21, 2004 Mar 4, 2009 微软公司 System and method for identifying and storing table changes EP1617327A2 * May 23, 2005 Jan 18, 2006 Sap Ag Interface-controlled displaying of regions of a matrix * Cited by examiner Classifications U.S. Classification 1/1, 707/E17.058, 707/E17.082, 707/999.001 International Classification G06F17/30 Cooperative",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}