{
    "relation": [
        [
            "Date",
            "Apr 25, 1997",
            "Feb 1, 2000",
            "Jun 30, 2000",
            "Jun 30, 2000",
            "Jan 28, 2004",
            "Jul 8, 2004",
            "Jul 8, 2004",
            "Jan 14, 2008",
            "Jul 1, 2008",
            "Jul 1, 2008"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "REMI",
            "FPAY",
            "SULP",
            "REMI",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: WILK PATENT DELOPMENT CORPORATION, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WILK, PETER J.;REEL/FRAME:008470/0149 Effective date: 19950207",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "",
            "Year of fee payment: 11",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5533958 - Intrapericardial assist device and associated method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5533958?dq=U.S.+patent+number+7,325,728&ei=Y93TTteOAe702wW6uqi1BQ",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487401603,
    "recordOffset": 487378105,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21699=This application is a continuation-in-part of application Ser. No. 08/078,567 filed Jun. 17, 1993, now U.S. Pat. No. 5,385,528., 37814=The general use and structure of dilating device 52 is described in detail in allowed U.S. patent application Ser. No. 851,097 filed Mar. 13, 1992 and U.S. patent application Ser. No. 893,991 filed Jun. 5, 1992. The disclosures of those applications are hereby incorporated by reference.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of particular embodiments and applications, one of ordinary skill in the art, in light of this teaching, can generate additional embodiments and modifications without departing from the spirit of or exceeding the scope of the claimed invention. Accordingly, it is to be understood that the drawings and descriptions herein are profferred by way of example to facilitate comprehension of the invention and should not be construed to limit the scope thereof. As described hereinabove with reference to FIG. 4, the insertion of balloon 60 into the intrapericardial space may be implemented using hypodermic type needle 34. Needle 34 is inserted through a skin surface and into the intrapericardial space, balloon 60 being injected in the collapsed configuration through the needle into the intrapericardial space. As further discussed hereinabove with reference to FIGS. 7A-7C, dilating device 52 may be provided for facilitating the insertion of balloon 60 into the intrapericardial space. Needle 50 is partially inserted through the skin surface and into the intrapericardial space and a distal end portion of dilating device 52 is placed into the intrapericardial space via the needle upon the partial insertion thereof into the intrapericardial space. Dilating device 52 is subsequently expanded and balloon 60 inserted into the intrapericardial space through the expanded dilating device. The pacemaker type voltage may be applied after a defibrillating procedure as described hereinabove and after periodic cuff",
    "textAfterTable": "US6162168 * Jan 28, 2000 Dec 19, 2000 Myocor, Inc. Heart wall tension reduction apparatus US6165119 * Jan 4, 1999 Dec 26, 2000 Myocor, Inc. Heart wall tension reduction apparatus and method US6165120 * Apr 4, 2000 Dec 26, 2000 Myocor, Inc. Heart wall tension reduction apparatus and method US6183411 Sep 21, 1998 Feb 6, 2001 Myocor, Inc. External stress reduction device and method US6238334 Nov 3, 1998 May 29, 2001 Cardio Technologies, Inc. Method and apparatus for assisting a heart to pump blood US6260552 Jul 29, 1998 Jul 17, 2001 Myocor, Inc. Transventricular implant tools and devices US6261222 Feb 3, 2000 Jul 17, 2001 Myocor, Inc. Heart wall tension reduction apparatus and method US6264602 Mar 9, 2000 Jul 24, 2001 Myocor, Inc. Stress reduction apparatus and method US6299575",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}