{
    "relation": [
        [
            "Date",
            "Aug 13, 1998",
            "Sep 26, 2007",
            "Dec 12, 2011",
            "Apr 27, 2012",
            "Jun 19, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SONY CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HASENO, SHINICHI;REEL/FRAME:009382/0422 Effective date: 19980731",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20120427"
        ]
    ],
    "pageTitle": "Patent US6728476 - Apparatus and method for thumbnail picture data readout - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6728476?dq=6,243,373",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484574403,
    "recordOffset": 484549056,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations With the digital camera device 1, the main picture file associated with one of the six displayed thumbnails is read out from the magnetic disc 9 a based on the actuating signals of the actuating input unit 27. This main picture file is stored in a pre-set area of the DRAM 24 and expanded by the micro-computer 28 in accordance with the JPEG system for display subsequently on the LCD panel 11 to an enlarged size. This causes six thumbnails to be displayed on the LCD panel 11. Since there is no thumbnail picture file associated with 05.411, the filename of the main picture may be displayed in a grey picture having the same size as other photographed pictures. After all of the thumbnail picture files in the magnetic disc 9 a have been stored in the DRAM 24, the micro-computer 28 controls the DRAM controller 25 and the panel signal processing circuit 26 for displaying six thumbnails on the LCD panel 11. Reference is had at this time to the thumbnail management table in order to display the thumbnails on the LCD panel 11. Since the thumbnail picture file 005.411 has not been recorded in the magnetic disc 9 a, 006.411 is read after 004.411 in the pre-set area of the DRAM 24. Since there is the main picture file devoid of the thumbnail picture file on the magnetic disc 9 a, a blank image",
    "textAfterTable": "US5528293 Mar 27, 1995 Jun 18, 1996 Fuji Photo Film Co., Ltd. Digital electronic still camera and method of recording image data in memory card US5576757 Jul 29, 1993 Nov 19, 1996 St. Clair Intellectual Property Consultants, Inc. Electronic still video camera with direct personal computer (PC) compatible digital format output US5581311 Jul 24, 1995 Dec 3, 1996 Nikon Corporation Image storage system for a digital still camera US5656348 * Feb 8, 1995 Aug 12, 1997 Pioneer Electronic Corporation Optical recording medium and its recording apparatus and reproducing apparatus US5689303 Jun 5, 1996 Nov 18, 1997 Nikon Corporation Electronic still camera utilizing updatable frame catena information to maintain frame sequence US5724579 Mar 6, 1995 Mar 3, 1998 Olympus Optical Co., Ltd. Subordinate image processing apparatus US5793517 Jan 28, 1997 Aug 11, 1998 Hitachi, Ltd. Imaging and recording apparatus US5819261 * Mar 21, 1996 Oct",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}