{
    "relation": [
        [
            "Date",
            "27 Jun 1996",
            "8 Nov 2002",
            "13 Nov 2006",
            "12 Nov 2010",
            "22 Apr 2014",
            "24 Jul 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MCI COMMUNICATIONS CORPORATION, DISTRICT OF COLUMB Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LEONARD, TIMOTHY M.;MUMFORD, GREGORY L.;REEL/FRAME:008100/0345 Effective date: 19960626",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: VERIZON PATENT AND LICENSING INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCI COMMUNICATIONS CORPORATION;REEL/FRAME:032725/0001 Effective date: 20140409",
            "Owner name: VERIZON PATENT AND LICENSING INC., NEW JERSEY Free format text: CORRECTIVE ASSIGNMENT TO REMOVE THE PATENT NUMBER 5,835,907 PREVIOUSLY RECORDED ON REEL 032725 FRAME 0001. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNMENT;ASSIGNOR:MCI COMMUNICATIONS CORPORATION;REEL/FRAME:033408/0235 Effective date: 20140409"
        ]
    ],
    "pageTitle": "Patent US5903874 - System and method for electronic coupon management - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5903874",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475528539,
    "recordOffset": 475493645,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72197=Referring again to step 1004, if the message receiver 302 determines that the coupon status is not \"Available,\" the message receiver 302 proceeds to step 1008. In step 1008, the message receiver 302 determines whether the coupon status is \"Read-- Lock.\" A \"Read-- Lock\" status indicates that the specified coupon is currently in use. Therefore, a second customer 102 is locked out from using the coupon unless the coupon remains in the \"Read-- Lock\" state for an extended period of time or returns to an \"Available\" state. If the coupon status is \"Read-- Lock,\" the message receiver 302 proceeds to step 1010. In step 1010, the message receiver 302 determines whether the timestamp of the coupon is greater than a fixed interval. If the timestamp is greater than a fixed interval, this indicates that the coupon has been in the \"Read-- Lock\" state for an extended period of time. Processing continues to step 1012 in which the message receiver 302 returns the coupon status 112 of \"Available.\", 73345=Continuing to step 1016, the message receiver 302 updates both servers, the PCMS 118 and the SCMS 122, with a current timestamp. More specifically, the message receiver 302 of the PCMS 118 sends a transaction record 304 to the synchronizer 306. The synchronizer 306 then sends synchronization information and a transaction record 120 to the SCMS 122 to ensure that the SCMS 122 coupon file 422a-422n is updated with the correct timestamp for the specified coupon. Processing continues to step 1024 in which the processing of the request message terminates and control is returned to step 922 in FIG. 9., 81336=Referring again to step 1204, if the message receiver 302 determines that it is not to update the usage counter of the specified coupon, but is to unlock the coupon for another use, the message receiver 302 proceeds to step 1212., 82494=Referring again to step 1208, if the message receiver 302 determines that the number of times that the specified coupon has been used exceeds a maximum number of uses, the message receiver 302 proceeds to step 1210. In step 1210, the message receiver 302 changes the coupon status 112 to \"Used\" indicating that the coupon cannot be used for any more promotional discounts because it has been used a maximum number of times. After changing the coupon status 112, the message receiver 302 continues to step 1214. Step 1214 was described in detail above., 76638=Referring again to step 1104, if the message receiver 302 determines that the current date is not before the promotional start date, the message receiver 302 proceeds to step 1108. In step 1108, the message receiver 302 determines whether the current date is after the end date of the promotion for which the coupon was issued. If the current date is after the end date of the promotion, the message receiever 302 proceeds to step 1110. In step 1110, the message receiver 302 returns the coupon status 112 of \"Expired\" indicating that the customer 102 is attempting to use the coupon after the promotion is over. Processing continues to step 1120 in which the processing of the \"Available\" coupon terminates and control is returned to step 1006 in FIG. 10., 71493=FIG. 10 is a control flow diagram of step 922 for a server processing a request message from the operator console 108. Processing begins at step 1002 and immediately proceeds to step 1004. In step 1004, the message receiver 302 determines whether the coupon status of the coupon specified in the request message is \"Available.\" If the coupon status is \"Available,\" the message receiver 302 proceeds to step 1006. In step 1006, the message receiver 302 processes the \"Available\" coupon. Step 1006 is described in greater detail below. Continuing to step 1024, the processing of the request message terminates and control is returned to step 922 in FIG. 9., 74536=Referring again to step 1008, if the message receiver 302 determines that the coupon status is not \"Read-- Lock,\" the message receiver 302 proceeds to step 1018. In step 1018, the console application software 302 determines whether the coupon status is \"Used.\" If the coupon status is \"Used,\" the message receiver 302 proceeds to step 1020. In step 1020, the message receiver 302 returns the coupon status 112 of \"Used\" indicating that the coupon has been used and the customer 102 cannot use the coupon for the telephone call. Processing continues to step 1024 in which the processing of the request message terminates and control is returned to step 922 in FIG. 9., 75824=FIG. 11 is a control flow diagram of step 1006 for a server processing an \"Available\" coupon. Processing begins at step 1102 and immediately proceeds to step 1104. In step 1104, the message receiver 302 determines whether the current date is prior to the start of the promotion for which the coupon was issued. If the current date is before the start date of the promotion, the message receiver 302 proceeds to step 1106. In step 1106, the message receiver 302 returns the coupon status 112 of \"Before-- Date\" indicating that the customer 102 is attempting to use the coupon before the promotional start date. Processing continues to step 1120 in which the processing of the \"Available\" coupon terminates and control is returned to step 1006 in FIG. 10., 77434=In an alternate embodiment, the end date of a promotion, as used in step 1104, may be an actual end date plus a grace period. This embodiment provides a customer 102 with an extra period of time during which the coupon is still valid. It would be readily apparent to one skilled in the art to add a grace period to an actual end date of a promotion., 73967=Referring again to step 1010, if the message receiver 302 determines that the coupon timestamp is not greater than a fixed interval, the message receiver 302 proceeds to step 1014. In step 1014, the message receiver 302 returns the coupon status 112 of \"Read-- Lock\" indicating that the coupon is currently in use by another customer 102. Therefore, the coupon cannot be used at this time. Processing continues to step 1024 in which the processing of the request message terminates and control is returned to step 922 in FIG. 9., 81585=In step 1212, the message receiver 302 changes the coupon status 112 to \"Available\" indicating that the coupon can be used for another promotional discount. Continuing to step 1214, the message receiver 302 updates both servers, the PCMS 118 and the SCMS 122. More specifically, the message receiver 302 of the PCMS 118 sends a transaction record 304 to the synchronizer 306 including the new number of times that the coupon has been used for the promotional discount and the new coupon status 112. The synchronizer 306 sends synchronization information and the transaction record 120 to the SCMS 122 to ensure that the SCMS 122 coupon file 422a-422n is updated with the new number of uses and the coupon status 112 for the specified coupon. Processing continues to step 1216 in which the processing of the change message terminates and control is returned to step 926 in FIG. 9., 78844=Referring again to step 1112, if the message receiver 302 determines that the current day and time is within the day and time restriction of the promotion, the message receiver 302 proceeds to step 1116. In step 1116, the message receiver 302 returns the coupon status 112 of \"Available\" indicating that the coupon can be used for the telephone call., 75273=Referring again to step 1018, if the message receiver 302 determines that the coupon status is not \"Used,\" the message receiver 302 proceeds to step 1022. In step 1022, the message receiver 302 returns the coupon status 112 of \"Invalid\" indicating that the coupon is invalid for the telephone call. Therefore, the customer 102 cannot use the coupon for the telephone call. Processing continues to step 1024 in which the processing of the request message terminates and control is returned to step 922 in FIG. 9., 79224=Continuing to step 1118, the message receiver 302 updates both servers, the PCMS 118 and the SCMS 122, with a coupon status of \"Read-- Lock\" and a current timestamp. The \"Read-- Lock\" status will lock out other customers 102 from attempting to use the coupon while the current customer 102 completes the telephone call and uses the coupon. The timestamp resets the lock out period such that after a fixed time interval, the coupon status will revert back to an \"Available\" status. More specifically, the message receiver 302 of the PCMS 118 sends a transaction record 304 to the synchronizer 306. The synchronizer 306 then sends synchronization information and the transaction record 120 to the SCMS 122 to ensure that the SCMS 122 coupon file 422a-422n is updated with a new coupon status and a current timestamp for the specified coupon. Processing continues to step 1120 in which the processing of the \"Available\" coupon terminates and control is returned to step 1006 in FIG. 10., 77803=Referring again to step 1108, if the message receiver 302 determines that the current date is not after the promotional end date, the message receiver 302 proceeds to step 1112. In step 1112, the message receiver 302 determines whether the current day and time is within a day and time restriction of the promotion for which the coupon was issued. A day and time restriction limits a coupon in that a customer 102 can only use the coupon on a specific day and at a specific time. If the current day and time is not within the day and time restriction of the promotion, the message receiever 302 proceeds to step 1114. In step 1114, the message receiver 302 returns the coupon status 112 of \"Invalid-- Day-- Time\" indicating that the customer 102 is attempting to use the coupon outside of the day and time restriction of the promotion. Processing continues to step 1120 in which the processing of the \"Available\" coupon terminates and control is returned to step 1006 in FIG. 10., 80289=FIG. 12 is a control flow diagram of step 926 for a server processing a change message from the operator console 108. Processing begins at step 1202 and immediately proceeds to step 1204. In step 1204, the message receiver 302 determines whether the change message requests an update to the usage counter associated with a specific coupon or requests an unlocking of a coupon's status 112. The usage counter indicates the number of times that the specified coupon has been used. If the message receiver 302 determines that it is to update a coupon's usage counter, the message receiver 302 proceeds to step 1206. In step 1206, the message receiver 302 decrements the usage counter of the specified coupon. Continuing to step 1208, the message receiver 302 determines whether the number of times that the specified coupon has been used exceeds a maximum number of uses. If the number of uses does not exceed the maximum number of uses, the message receiver 302 proceeds to step 1212. Step 1212 is described in more detail below.}",
    "textBeforeTable": "Patent Citations While various embodiments of the present invention have been described above, it should be understood that they have been presented by the way of example only, and not limitation. It will be understood by those skilled in the art that various changes in form and details may be made therein without departing from the spirit and scope of the invention as defined in the appended claims. Thus, the breadth and scope of the present invention should not be limited by any of the above-described exemplary embodiments, but should be defined in accordance with the following claims and their equivalents. Conclusion A still further embodiment comprises the elimination of the need for an operator. The use of an actual human operator to communicate with a customer is for convenience purpose only. It would be readily apparent to one skilled in the relevant art to automate the communication between a customer and an operator console 108 of the present invention. A further embodiment comprises the electronic redemption of coupons for alternate telecommunication goods and services. Telecommunication goods and services include, but are not limited to, long distance telephony, computer access, internet access, wide world web access, etc. It would be readily apparent to one skilled in the art to apply the present invention to these alternate telecommunication goods and services. One alternate embodiment comprises the issuing of coupons to customers 102 electronically. For example, a service",
    "textAfterTable": "US5692182 * 5 Oct 1995 25 Nov 1997 International Business Machines Corporation Bufferpool coherency for identifying and retrieving versions of workfile data using a producing DBMS and a consuming DBMS US5708422 * 31 May 1995 13 Jan 1998 At&T Transaction authorization and alert system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6041309 * 23 Dec 1998 21 Mar 2000 Oneclip.Com, Incorporated Method of and system for distributing and redeeming electronic coupons US6076069 * 25 Sep 1998 13 Jun 2000 Oneclip.Com, Incorporated Method of and system for distributing and redeeming electronic coupons US6336098 * 11 Dec 1997 1 Jan 2002 International Business Machines Corp. Method for electronic distribution and redemption of coupons on the world wide web US6584448 * 9",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}