{
    "relation": [
        [
            "Citing Patent",
            "US7416914 *",
            "US7538374",
            "US7679112",
            "US7687305 *",
            "US7709916 *",
            "US7755120 *",
            "US8129762 *"
        ],
        [
            "Filing date",
            "Oct 7, 2005",
            "Sep 12, 2005",
            "Oct 31, 2007",
            "Mar 11, 2008",
            "Jan 13, 2006",
            "Jan 22, 2007",
            "Dec 31, 2008"
        ],
        [
            "Publication date",
            "Aug 26, 2008",
            "May 26, 2009",
            "Mar 16, 2010",
            "Mar 30, 2010",
            "May 4, 2010",
            "Jul 13, 2010",
            "Mar 6, 2012"
        ],
        [
            "Applicant",
            "Dongbu Electronics Co., Ltd.",
            "Dongbu Electronics Co., Inc.",
            "Samsung Electronics Co., Ltd.",
            "Dongbu Hitek Co., Ltd",
            "Stmicroelectronics S.A.",
            "Taiwan Semiconductor Manufacturing Co., Ltd.",
            "Taiwan Semiconductor Manufacturing Co., Ltd."
        ],
        [
            "Title",
            "Method of fabricating CMOS image sensor",
            "CMOS image sensor and method for fabricating the same",
            "Color image sensors having pixels with cyan-type and yellow-type color characteristics therein",
            "Image sensor and method for manufacturing the same",
            "Optical semiconductor device having photosensitive diodes and process for fabricating such a device",
            "Semiconductor device",
            "Image sensor"
        ]
    ],
    "pageTitle": "Patent US6964916 - Image sensor fabrication method and structure - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6964916?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478979695,
    "recordOffset": 478955338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29664=U.S. patent application Ser. No. 10/456,759, filed Jun. 6, 2003, is incorporated by reference in its entirety, as though set forth fully herein., 20982=This application is a continuation in part of U.S. patent application Ser. No. 10/456,759, filed Jun. 6, 2003.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of exemplary embodiments, it is not limited thereto. Rather, the appended claims should be construed broadly, to include other variants and embodiments of the invention, which may be made by those skilled in the art without departing from the scope and range of equivalents of the invention. show the configuration after formation of the microlenses 206. Following formation of the microlenses, heat is applied and the microlens material is reflowed. FIG. 9 has a planar top surface, which is advantageous for reducing the stripe defect in the microlenses 206. The step height between the top of spacer 204 b and the post-passivation pad portion 224 is substantially less than the sum of height 118 and height 119 between top of spacer 104 b and the bond pad 122 (4.5 μm+[1.5 μm to 2 μm]=6 μm to 6.5 μm) shown in FIG. 1C. FIG. 8 shows the steps of forming the color filter layers 211, 213 and the spacer layer 204 b. The spacer layer 204 b is formed of the same material as the planarization layer 204 a, and completely covers the color filter layer(s) 211, 213. In preferred embodiments, the spacer layer 204 b also covers the scribe line, so that only the post-passivation pad portion 224 is exposed. The resulting configuration shown in FIG. 8",
    "textAfterTable": "US6495813 Oct 12, 1999 Dec 17, 2002 Taiwan Semiconductor Manufacturing Company Multi-microlens design for semiconductor imaging devices to increase light collection efficiency in the color filter process * Cited by examiner Non-Patent Citations Reference 1 http://www.dpreview.com/news/0005/00051503tsmc_cmos.asp, 3 pages, visited Mar. 11, 2003. 2 Press Release, Hsin-Chu, Taiwan-(Business Wire)-May 1, 2000-\"TSMC begins volume production of CMOS image sensors\". Referenced by Citing Patent Filing date Publication date Applicant Title US7416914 * Oct 7, 2005 Aug 26, 2008 Dongbu Electronics Co., Ltd. Method of fabricating CMOS image sensor US7538374 Sep 12, 2005 May 26, 2009 Dongbu Electronics Co., Inc. CMOS image sensor and method for fabricating the same US7679112 Oct 31, 2007 Mar 16, 2010 Samsung Electronics Co., Ltd. Color image sensors having pixels with cyan-type",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}