{
    "relation": [
        [
            "Citing Patent",
            "US8112358",
            "US8170051",
            "US8429406",
            "US8467369",
            "US8488615",
            "US8503480",
            "US8510470",
            "US8520849 *",
            "US8700076",
            "US8930572",
            "US8989379 *",
            "US20100241869 *"
        ],
        [
            "Filing date",
            "Jan 7, 2008",
            "Jun 4, 2008",
            "Jan 7, 2008",
            "Jun 4, 2008",
            "Jun 4, 2008",
            "Jun 4, 2008",
            "Apr 23, 2008",
            "Sep 9, 2008",
            "May 23, 2011",
            "Apr 29, 2013",
            "Jan 9, 2008",
            "Sep 9, 2008"
        ],
        [
            "Publication date",
            "Feb 7, 2012",
            "May 1, 2012",
            "Apr 23, 2013",
            "Jun 18, 2013",
            "Jul 16, 2013",
            "Aug 6, 2013",
            "Aug 13, 2013",
            "Aug 27, 2013",
            "Apr 15, 2014",
            "Jan 6, 2015",
            "Mar 24, 2015",
            "Sep 23, 2010"
        ],
        [
            "Applicant",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Incorporated",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Atheros, Inc.",
            "Entropic Communications, Inc.",
            "Qualcomm Atheros, Inc.",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Karthik Chandrashekar Iyer"
        ],
        [
            "Title",
            "Authorizing customer premise equipment on a sub-network",
            "In-home coexistence network",
            "Authorizing customer premise equipment into a network",
            "Distributed scheduling",
            "Contention groups for hidden nodes",
            "Managing communications over a shared medium",
            "Path selection for routing traffic in a network",
            "Encryption by pixel property separation",
            "Clock synchronization among network stations",
            "Path selection for routing traffic in a network",
            "Network encryption key rotation",
            "Encryption By Pixel Property Separation"
        ]
    ],
    "pageTitle": "Patent US7826618 - Synchronization of encryption in a wireless communication system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7826618?dq=autodesk",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 18,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476460247,
    "recordOffset": 476426653,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6400=FIGS. 14 and 15 are block diagrams that further illustrate embodiments of encryption synchronization. In one embodiment, FIGS. 14 and 15 are a block diagram of the ACC function with respect to encryption synchronization. FIGS. 14 and 15 group the function into 3 sections: section 1402 is LCC message receipt from the CPU by the airlink DSP; section 1404 is traffic processing by the airlink DSP; and section 1502 is generation of the RC4 state box by a telephony TDM transceiver. The arrangement of functions and entities in the figures is exemplary, and other arrangements of functions and entities are contemplated within the scope of the invention.}",
    "TableContextTimeStampAfterTable": "{121894=Referring to traffic processing function 1404, when 120 bits of telephony data have been assembled, an ACC message byte is retrieved. ACC message bytes have priority as previously discussed. Only TCC messages can preempt LCC messages., 109995=The SetKeySize and SetKeySeed functions are callable by the TCH function module 1104 via direct control lines to perform voice encryption set up. The TCH function module, in the idle state, reacts to a TCH_CONN_REQ message, which requests a connection, by calling an encryption set up function 1108. The encryption set up function 1108 accesses the RC4 function module 1106 to set the encryption key size and to set the encryption key seed. When the idle state is reentered, an encryption tear off function 1116 is called, terminating the set up process., 110617=The PrepareKey and RC4 functions are callable by an ACC TDM management entity 1110 and an ACC traffic management entity 1112 of the ACC function module 1102. As seen as pseudo code in the ACC traffic management entity 1112, if the receive side of voiceSecure is on and the SABM/SABMUA message is detected, the entity 1112 can initiate synchronization of the cryptosystem by calling the PrepareKey and RC4 functions. In one embodiment, voiceSecure is a variable that indicates whose purpose is to signify when the encryption synchronization is complete so that a next block of data to be transmitted or received will be encrypted. As shown in the ACC CPU management entity 1114, if the SABM/SABMUA message is detected in the incoming message, RC4 synchronization can be started. The ACC CPU management entity 1114 communicates with the ACC TDM management entity 1110, which checks for voiceSecure on (master encryption switch on). The ACC TDM management entity 1110 further checks for an LCC airlink packet with a transmit flag on. If the transmit flag is on, the encryption synchronization counter is decremented. If the encryption synchronization counter is zero, the ACC TDM management entity 1110 initializes the encryption synchronization by calling the PrepareKey function and the RC4 function., 112079=The present state of an RC4 S-box depends on the keyseed and the length of the data stream (in bytes); an RC4 S-box can be any one of about 21700 states. Therefore, proper synchronization is to be maintained for the duration of a data channel. The RU to base synchronization is a well-behaved software package in most existing wireless networks, so only strict synchronization on data channel startup is required., 122604=In the other direction of transmission, upon receipt of a 132 bit airlink packet 1406 from the airlink, the ACC is parsed from the packet., 122782=If the master encryption switch is on and the ACC contains a SABM/SABMUA LCC message, then a receive state box is generated at block 1508, and the receive cryptosystem is considered synchronized. An LCC packet is created for transmission to the CPU., 124812=On the transmit end, telephony data from the base station is parsed. The 12 bits of ACC data “A” are sent to traffic processing 1404. If the master encryption switch is active and the encryption is synched, then the RD4 state box is generated, and the payload data is encrypted as previously described. If the If the master encryption switch is not active or the encryption is not synched, the payload data is not encrypted., 115641=At block 1204, it is determined whether the master encryption switch is active. The master encryption switch is set at call set up when the host directs a traffic channel to be started. In one embodiment, the DSP makes the determinations referred to. If the master encryption switch is not active, no encryption/decryption is currently required, and the LCC message is queued for traffic processing at block 1209. If the master encryption switch is active, it is then determined at block 1206 whether the message currently being sent is a SABM/SABMUA message. If the message is not a SABM/SABMUA message, the LCC message is queued for traffic processing at block 1209. The SABM/SABMUA messages occur at a recognizable point in connection establishment, and indicate when telephony data will be sent. In particular, the SABM/SABMUA message is the last message sent before the telephony data. The LCC message is not encrypted, but the telephony data is encrypted. Because data is transmitted in blocks, and because the size of the LCC message is variable, it is necessary to determine where the LCC message stops and the telephony data starts. The encryption synchronization counter is therefore loaded with the number of LCC message bytes to be transmitted, including the SABM/SABMUA message. When the encryption synchronization counter is zero, encryption/decryption can begin., 117500=Traffic processing begins with block 1208. When 120 bits of telephony (payload) data have been assembled, an ACC message byte is retrieved and prioritized at block 1208. These messages have priority, as previously described, and can preempt LCC messages. At block 1210, if the master encryption switch is on and the encryption synchronization counter is started, it is determined at block 1212 whether the message is an LCC message. If the message is not an LCC message, then processing passes to block 1220, where an airlink packet is created. If the message is an LCC message, the encryption synchronization counter is decremented by one at block 1213. If the encryption synchronization counter is zero at block 1214, an RC4 state box is generated at block 1216, using a current key. If the encryption synchronization counter is not zero at block 1214, an airlink packet is created at block 1220. When the RC4 state box has been generated, encryption has been synchronized and the system can begin encrypting and decrypting data. The encryption synchronization counter is stopped at block 1218, and an airlink packet is created at block 1220., 122168=If the master encryption switch is on and the encryption synchronization counter was started, then the encryption synchronization counter is decremented by one. If the encryption synchronization counter is zero, then a transmit RC4 state box is generated at block 1506, and the encryption is considered synched. The encryption synchronization counter is stopped, and an airlink packet is created., 35079=This application is a divisional of U.S. application Ser. No. 10/028,573, filed on Dec. 19, 2001 which claims the benefit of U.S. Provisional Patent Application No. 60/256,668, filed Dec. 19, 2000, which is incorporated herein by reference in its entirety., 117079=If the message is a SABM/SABMUA message, at block 1207 the number of LCC message bytes to transmit (including the size of the SABM/SABMUA message) is put into the encryption synchronization counter, and the encryption synchronization counter is started. This is the beginning of encryption synchronization. The LCC the message is queued for traffic processing at block 1209.}",
    "textBeforeTable": "Patent Citations While certain aspects of the invention are presented below in certain claim forms, the inventors contemplate the various aspects of the invention in any number of claim forms. For example, while only one aspect of the invention is recited as embodied in a computer-readable medium, other aspects may likewise be embodied in a computer-readable medium. Accordingly, the inventors reserve the right to add additional claims after filing the application to pursue such additional claim forms for other aspects of the invention. These and other changes can be made to the invention in light of the above detailed description. In general, the terms used in the following claims, should not be construed to limit the invention to the specific embodiments disclosed in the specification, unless the above detailed description explicitly defines such terms. Accordingly, the actual scope of the invention encompasses the disclosed embodiments and all equivalent ways of practicing or implementing the invention under the claims. Any references and U.S. patents and applications listed above are incorporated herein by reference. Aspects of the invention can be modified, if necessary, to employ the systems, functions and concepts of any patents and applications described above to provide yet further embodiments of the invention. The above detailed descriptions of embodiments of the invention are not intended to be exhaustive or to limit the invention to the precise form disclosed above. While specific embodiments of, and",
    "textAfterTable": "US5642421 Sep 15, 1995 Jun 24, 1997 International Business Machines Corporation Encryption of low data content ATM cells US5717689 Oct 10, 1995 Feb 10, 1998 Lucent Technologies Inc. Data link layer protocol for transport of ATM cells over a wireless link US5778075 * Aug 30, 1996 Jul 7, 1998 Telefonaktiebolaget, L.M. Ericsson Methods and systems for mobile terminal assisted handover in an private radio communications network US5825889 Oct 15, 1996 Oct 20, 1998 Ericsson Inc. Use of duplex cipher algorithms for satellite channels with delay US5844885 Jun 11, 1996 Dec 1, 1998 Qualcomm Incorporated Method and apparatus of providing bit count integrity and synchronous data transfer over a channel which does not preserve synchronization US5889781 Jun 11, 1996 Mar 30, 1999 Vlsi Technology Asynchronous timing generator US5930359 Sep 23, 1996 Jul 27, 1999 Motorola, Inc. Cascadable content addressable memory and system US5943425 Jul 29, 1996 Aug 24, 1999",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}