{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are always groups throwing events.",
            "Hobo days is a BLAST!!",
            "Sporting events, dances.",
            "Partying is not all that it is cracked up to be. There is plenty of time to enjoy yourself in college. Do not be the typical college student and rush into it all, there are ample ways to enjoy yourself here.",
            "South Dakota State is a wonderful university in a smaller town setting that is perfect for focusing on your studies. I have really enjoyed my time here and would highly recommend to anybody to enroll here. It has a wonderful melting pot of various backrounds and students."
        ]
    ],
    "pageTitle": "South Dakota State University (SD State) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/South-Dakota-State-University/reviews?_escaped_fragment_=/show/56556",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905845891,
    "recordOffset": 905767494,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23641=Although the dorm rooms are small, SDSU has made a conscious effort to increase not only the amount of dorms available to students, but also the quality. As of 2011, there were 3 brand new dorms on campus, and they are adding 3 more for this upcoming 2012 fall semester. You can choose to live either by yourself or with a roommate., 341065=Campus is generally pretty safe, but the security is not particularly responsive and the emergency contact points on campus are often out of order. While violence is uncommon on campus, there was a rapist who attacked on campus in 2009., 169281=South Dakota State University is an absolutely great school! The class sizes on average are about 25:1 except for lectures which are a bit bigger, but you still get to know the teachers very well and they are always willing to help out. Also campus activities are abundant, seriously there is something for everyone; from skydiving club to colleges against cancer, and intramural in just about every sport., 19178=There were a couple of attacks in 2010, but the man was caught and he was not an SDSU student. Since, they have started programs around campus to better campus security. The dorms are locked past a certain time and only residents of that dorm can get into the building, there are also escorts you can call to walk around campus with you after dark if you don't feel safe. Overall the campus is well lit and the student body is friendly., 110621=The food is really good! But the selection sometimes gets really repetitive. However, they are in the process of putting in 3 new eating places also to be completed by fall 2013. Also, we have the famous SDSU ice cream where they actually invented the flavor cookies'n'cream!, 194805=There are not many choices at SDSU and the options are limited. However, they are building two new eating places that will be opened in fall of 2013., 247352=As mentioned, the school has many clubs with many activities inside the clubs, but when winter comes (last from late November to early April), most have to take place inside, but they still manage to hold the activities well., 23098=SDSU has expanded the Student Union vastly since I first enrolled in 2010. There are coffee and bagel shops, cafeteria style as well as restaurant style dining options. As of this upcoming year they are also adding some popular fast food options to the Union., 268481=South Dakota State has a tradition of hobos. We have a whole week in October dedicated to our homecoming and it's name is: Hobo Week while the actual day of the football game is: Hobo Day. Many traditions live on through celebrating being a hobo and a Jack Rabbit. During Hobo Week, you are encouraged to dress in ratty clothes, grow a beard (for men), sleep over in cardboard houses and bum a meal with your friends. It's a fabulous tradition that will carry on for many years to come!, 151383=One unusual tradition that is celebrated here every year is hobo days. Everyone dresses up as a hobo and just has fun. We even have a statue of a hobo next to our union for everyone to share in the tradition. I haven't attended one yet, but it isn't until the end of October., 368233=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 82 Joshua from Madison, SD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Megan from Fordyce, NE 07/07/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 2 of 82 Categories Comments Great for these types of students The west edge of campus is devoted to the country kids, especially Hansen hall and the Animal Science unit. Midwestern kids will feel right at home in the small town atmosphere, but city kids will appreciate the variety of people and activities. Sports fanatics will love the Division I sporting events and dramatics should take note of our Performing Arts Center, which is world class and soon to be expanded. Tips for prospective students What makes SDSU such a great fit for me are the activities I am involved in. UPC, Student's Association, and being on the Women's Equestrian Team all keep me busy while providing me with the opportunity to meet new people all the time. The people on campus are exceptionally welcoming and open. Even the professors take an uncommon interest in their students. They are always available",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}