{
    "relation": [
        [
            "Kick-Off",
            "PowerGlove",
            "Vanden Plas",
            "Evergrey"
        ],
        [
            "Country of Origin",
            "USA",
            "Germany",
            "Sweden"
        ]
    ],
    "pageTitle": "ProgPower USA - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/ProgPower_USA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865622503,
    "recordOffset": 865592237,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26155=ProgPower USA VI took place on September 16–17, 2005 at Center Stage Atlanta (then called Earthlink Live) in Atlanta, GA., 29170=ProgPower USA VII took place on September 15–16, 2006 at Center Stage in Atlanta, GA., 82850=11. Reesman, Bryan. \"A Ride with Dream Theater's John Petrucci.\" Grammy.com. September 2013. Web. 28 Nov. 2013., 50261=The Mid-Week Mayhem took place on Wednesday September 14, 2010 at The Loft at Center Stage in Atlanta, GA., 57034=The Mid-Week Mayhem took place on Wednesday September 4, 2013 at The Loft at Center Stage) in Atlanta, GA., 37640=This Kick-Off for this year was billed as the Hellish Rock World Tour as Manticora, Gamma Ray and Helloween were on tour at the time and used the Showcase date as a regular tour stop. This event took place in the main Center Stage theater on Thursday September 25, 2008., 62645=ProgPower USA XVI is scheduled to take place on September 11–12, 2015 at Center Stage Atlanta in Atlanta, GA. (As announced at ProgPower USA XV), 38612=The first Mid-Week Mayhem at ProgPower USA was held at The Loft (above Center Stage on Wednesday September 24, 2008 in Atlanta, GA., 53233=Instead of a Kick-Off and Mid-Week Mayhem, Nightwish and Kamelot performed Wednesday and Thursday night before the festival, September 12–13, 2012., 53782=ProgPower USA XIV took place on September 6–7, 2013 at Center Stage Atlanta in Atlanta, GA., 35598=ProgPower USA IX took place on September 26–27, 2008 at Center Stage Atlanta in Atlanta, GA., 32128=ProgPower USA VIII took place on October 5–6, 2007 at Center Stage Atlanta in Atlanta, GA., 82694=10. Mendonca, Milton. \"Audio Interview with ProgPower USA Promoter, Glenn Harveston PART 1.\" YouTube. 12 November 2012. 28 Nov. 2013., 27938=The Showcase took place on Thursday September 15, 2005 at The Loft (above Center Stage) in Atlanta, GA., 41813=The Kick-Off took place on Thursday September 10, 2009 at Center Stage in Atlanta, GA., 3323=ProgPower USA is a progressive and power metal festival held annually in the United States since 2001.[1] Its most recent edition was held at Center Stage in Atlanta, Georgia on September 10 – September 13, 2014. ProgPower USA XVI is scheduled to take place September 9 – 12, 2015. The festival's band selection process focuses on quality over quantity.[2] In addition to the emphasis on the power and progressive metal genres, the festival has branched out into other genres with the inclusion of the \"oddball\" slot that doesn't fit the normal motif.[3] ProgPower USA gives bands that have never performed in the States a chance to test the waters so to speak, and it also allows them to interact with fans more than ever.[4] The festival has been described as a cultural experience for fans[5] with autograph signing sessions, guest appearances, reunions, and meet-and-greets.[6] The festival has hosted over 70 bands' USA debuts including Blind Guardian, Gamma Ray, Nightwish,[7] and Stratovarius., 65086=The Kick-Off is scheduled to take place on Thursday September 10, 2015 at Center Stage in Atlanta, GA., 20175=ProgPower USA IV was held on September 5–6, 2003 at Center Stage (then called Earthlink Live) in Atlanta, GA., 81154=3. Gromen, Mark. \"Onstage ProgPower VII.\" Metal Maniacs. February 2007: 108-109. Print., 23084=ProgPower USA V took place on September 17–18, 2004 at Center Stage Atlanta (then called Earthlink Live) in Atlanta, GA., 10224=Festival founder and promoter, Glenn Harveston's notion of ProgPower USA began over dinner among friends after attending the Powermad festival in Baltimore, Maryland.[9] As the festival progressed, the roster scope diversified with the intent of reaching a larger fan base.[10] The brand's international success is based upon an unofficial partnership with ProgPower Europe.[11] The festival overcame early hardship from an attendance perspective due to the tragic events of September 11 at ProgPower II[12] and flourished with multiple sell-outs over the next 13 years., 9413=ProgPower USA began in 2001. The very first festival was February 23–24, 2001, in Lansing, Illinois, just outside of Chicago, at J.J. Kelley's. The subsequent events have been held in Atlanta, Georgia, at Center Stage Atlanta (formerly Earthlink Live).[8], 30910=The Showcase took place on Thursday September 14, 2006 at The Loft (above Center Stage) in Atlanta, GA., 16992=ProgPower USA III was held at Center Stage (then called Earthlink Live) in Atlanta, GA on November 15–16, 2002, 83103=12. De Campos, Vanessa. \"ProgPower USA IX Atlanta, 26th September 2008.\" Fireworks. March/April 2009: 77-78. Print. Issue 35, 94744=28 Nov. 2013., 96202=November 2014, pages 48–50, ISSN 1825-7992, 82120=8. Ollila, Mape (2007). Once Upon a Nightwish: The Official Biography 1996 – 2006. Deggael Communications. p. 191. ISBN 9789529974924., 66013=The Mid-Week Mayhem is scheduled to take place on Wednesday September 9, 2015 at The Loft at Center Stage in Atlanta, GA., 82533=9. Murphy, Bill. \"Glenn Harveston: “I Think I Have Reached An Elite Level With This Festival”. Dark Rhapsody. December 2007. Web. 28 Nov. 2013., 60756=The Kick-Off took place on Thursday September 11, 2014 at Center Stage) in Atlanta, GA., 50876=ProgPower USA XIII took place on September 14–15, 2012 at Center Stage Atlanta in Atlanta, GA., 80778=1. EvilG. \"Heart of Steel: Interviews Glenn Harveston Organizer of ProgPower USA.\" Metal-Rules. March 2003. Web. 28 Nov. 2013., 24844=The Showcase took place on Thursday September 16, 2004 at the The Eleven50 Club., 49479=The Kick-Off took place on Thursday September 15, 2011 at Center Stage in Atlanta, GA., 58045=ProgPower USA XV took place on September 12–13, 2014 at Center Stage Atlanta in Atlanta, GA., 45185=The Kick-Off took place on Thursday September 9, 2010 at Center Stage in Atlanta, GA., 11994=ProgPower USA I was held at J.J. Kelley's in Lansing, Illinois on February 23–24, 2001., 14725=ProgPower USA II was held at Center Stage (then called Earthlink Live) in Atlanta, Georgia on November 9 & 10, 2001., 43049=ProgPower USA XI took place on September 10–11, 2010 at Center Stage Atlanta in Atlanta, GA., 22072=The ProgPower USA IV Pre-Show Party was held September 4, 2003 at The Riviera Club in Atlanta, GA, 34220=The Showcase took place on Thursday October 4, 2007 at Center Stage) in Atlanta, GA. From 2007 forward all Showcases (now called the Kick-Off) take place at the main Center Stage theater., 81775=6. Hicks, Taylor. \"ProgPower USA.\" Rock N Roll. December 2012: 50-51. Print., 61706=The Mid-Week Mayhem took place on Wednesday September 10, 2014., 19023=The ProgPower USA III Pre-Show Party was held Thursday November 14, 2002 at the The Riviera Club in Atlanta, GA., 39795=ProgPower USA X took place on September 11–12, 2009 at Center Stage Atlanta in Atlanta, GA., 47241=ProgPower USA XII took place on September 16–17, 2011 at Center Stage Atlanta in Atlanta, GA., 46170=The Mid-Week Mayhem took place on Wednesday September 8, 2010 at The Loft at Center Stage in Atlanta, GA., 56177=The Kick-Off took place on Thursday September 5, 2013 at Center Stage) in Atlanta, GA., 83250=13. Johnsen, Matt. \"ProgPower 2.0.\" Metal Maniacs. August 2002: 96-98. Print.}",
    "lastModified": "Sun, 26 Jul 2015 06:42:58 GMT",
    "textBeforeTable": "ProgPower USA I was held at J.J. Kelley's in Lansing, Illinois on February 23–24, 2001. February 2001[edit] Lineups[edit] Festival founder and promoter, Glenn Harveston's notion of ProgPower USA began over dinner among friends after attending the Powermad festival in Baltimore, Maryland.[9] As the festival progressed, the roster scope diversified with the intent of reaching a larger fan base.[10] The brand's international success is based upon an unofficial partnership with ProgPower Europe.[11] The festival overcame early hardship from an attendance perspective due to the tragic events of September 11 at ProgPower II[12] and flourished with multiple sell-outs over the next 13 years. ProgPower USA began in 2001. The very first festival was February 23–24, 2001, in Lansing, Illinois, just outside of Chicago, at J.J. Kelley's. The subsequent events have been held in Atlanta, Georgia, at Center Stage Atlanta (formerly Earthlink Live).[8] History[edit] 6 External links 5 Photo Galleries",
    "textAfterTable": "Zero Hour USA Reading Zero USA Ion Vein USA Destiny's End USA Jag Panzer USA Evergrey Sweden Pain of Salvation Sweden Symphony X USA November 2001[edit] ProgPower USA II was held at Center Stage (then called Earthlink Live) in Atlanta, Georgia on November 9 & 10, 2001. ProgPower USA II Country of Origin Superior Germany Balance of Power England Nightingale Sweden Spiral Architect Norway Steel Prophet USA Angel Dust Germany Ark Norway Evergrey Sweden Kamelot USA Symphony X USA 2002[edit] ProgPower USA III was held at Center Stage (then called Earthlink Live) in Atlanta, GA on November 15–16, 2002",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}