{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They notify you IMMEDIATELY when there is a crime on campus, which there almost never is. We also have our own police station and they are actual state officers.",
            "There's plenty of sororities and frats on campus, however there's no greek housing!",
            "There are way too many clubs/events to list!",
            "We have Starbucks!",
            "This college is a lot more affordable than most universities and you get, in my opinion, a better experience and education.",
            "There's a ton to do for fun here. You can join THON and help run the events the club hosts. Not to mention there's a ton of other clubs you can join. There's also baseball, basketball, volleyball games to attend and many on campus events such as the annual Carnival For A Cure or Big Man on Campus!",
            "Stacks (the campus cafeteria) is amazing, I live for their breakfast sandwiches. Also, Biscotti's serves Starbucks drinks, even specialty ones and you can pay with your meal plan! How awesome is that?",
            "I love living on campus and I love the housing. Not many colleges have the option of having your own room and I LOVE that being an option at Penn State Harrisburg.",
            "The academics are challenging but as long as you remain focused, you can get through it! College is not supposed to be easy.",
            "Some tips are: -Don't come here and think it will be like High School, this mindset will KILL your GPA -GO TO CLASS -DO YOUR WORK",
            "Penn State Harrisburg is honestly the best university. The professors are great and hands on. Your education will be a cut above the rest!"
        ]
    ],
    "pageTitle": "Pennsylvania State University-Penn State Harrisburg Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pennsylvania-State-University-Penn-State-Harrisburg/reviews?_escaped_fragment_=/show/7640",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909467187,
    "recordOffset": 909434122,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132131=© 2015, Cappex.com, LLC, 22587=Its a small campus (~5000 students with around 1000 living on campus) so there is not much to go wrong. The police are ALWAYS around (that's good and bad) but mainly its friends that watch out for each other., 46942=Kappas is the first fraternity to be at that campus. In the Fall of 2011, the Sigmas created a chapter there and has already stirred up some good campus events. Then, in the Spring of 2012 the Zetas started a chapter and has really brought some delight to the campus.}",
    "textBeforeTable": "11/03/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 30 Nailah from Upper Marlboro, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Pennsylvania State University-Penn State Harrisburg Reviews Pennsylvania State University-Penn State Harrisburg › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here The school is merely a dwarf in terms of student population of its cousin up in State College, PA. Therefore, students will not be crowded out of extracurricular activities. This was one of the main points that brought me to this campus. I assume that at very few public schools, that in the first three weeks I would be able to establish myself as the lead political writer for the school newspaper and the anchor for my own radio show. The only thing that I dislike about the school is that many of the teachers seem elitist. This was never the case at my previous school before I transferred. It seems like many teachers judge their students are lazy, unintelligent, degenerates even before meeting them. This leads to a prevailing disrespect to the students. To overcome this, make it a point to introduce yourself to and create a friendship with every teacher. Am learning a lot The course curricula here are challenging and fast. Students are expected to work hard and read much of the material on their own. The teachers are usually extremely knowledgeable, with either doctorate degrees or years of in the field experience. One of the best attributes of this school is the high proportion of graduate students. The reason for this is that Penn State Harrisburg",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}