{
    "relation": [
        [
            "ADVERBS",
            "The traditional terms, \"adverb\" or \"adverbial phrase\" have undergone some changes. Some words have been reassigned to other categories, such as Noun or Preposition. For details, see Huddleston 8 §6.3, Biber 2.3.4, and Swan 22.6.",
            "ADVERBS",
            "currently, presently, immediately, earlier, early, lately, recently, soon, formerly, subsequently ADV – We'll see you early / soon / subsequently. already, yet, still, any longer NP positive – We finishing our project already. (+ polarity) NP negative – We haven't our project yet. (- polarity) (Huddleston 6 §5.2, §7.1)",
            "ADVERBS OF FREQUENCY",
            "twice, always, sometimes, usually, etc. Frequency ADV– We usually arrive on time. (Adjunct –may be omitted) \"Adjuncts of frequency express quantification in the clause in a way which is comparable to that of quantifiers in the structure of NPs.\" (Huddleston 8 §9) He always falls. → He falls every time. (Swan 23.3)"
        ],
        [
            "OTHER",
            "An adverb may be a verb complement (a required element) \"The meeting is at noon.s or a verb adjunct (not required) \"The meeting will include a break at 2 p.m.\" The time may be an \"interval\" or a \"point\"; it may be \"perfective\" (completed) or \"imperfective\" (ongoing); It may have \"polarity\" (positive or negative context). For other aspects, see Huddleston 8 §6.3.",
            "PREPOSITIONS",
            "after, ago, at, before, between, by , during, in, into, on, since, toward PP+NP – in, on, at, during, by We'll see you in three weeks / in June / on Sunday / by dinner time / during the break. PP + Finite Clause – before, after, as, once, since: We'll see you after we arrive / before we leave. PP + Nonfinite Clause – before, after, between, on, once, since: We'll see you after arriving / before leaving. PP – after, before, now, since, then, throughout: We'll see you afterwards.",
            "NOUNS",
            "yesterday, today, tomorrow, tonight, Sunday, Monday, sometime, etc. morning, noon, evening, night, second, minute, moment, week, month, year NP – We'll see you tonight / this evening. (determiner + noun)"
        ]
    ],
    "pageTitle": "Adverbs for Time — English Exercises & Practice | Grammar Quizzes",
    "title": "",
    "url": "http://www.grammar-quizzes.com/adv_time.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483845743,
    "recordOffset": 483828576,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34904=Future practice pages:  Will / Might,  Present–Scheduled, Will / Would, May / Can,  Present–Scheduled, After, Before, When, Prepositions of time, By the time, \"Next Tuesday\"., 53934=PP+NP – in, on, at, during, by   We'll see you in three weeks / in June / on Sunday / by dinner time / during the break., 59197=Future practice pages:  Will / Might,  Present–Scheduled, Will / Would, May / Can,  Present–Scheduled, After, Before, When, Prepositions of time, By the time, 23071=A journalist was photographing the event from April to December. (time range), 33402=We will fly to Spain in January. (a plan for a future date), 43050=They have worked for twelve years / since 1998., 45357=They have been working for twelve years / since 1998. emphasizes ongoing, repetition , 21661=The volcano erupted on April 14 2010. (past event), 17668=in January (month)  / in 2006  (year) /, 37944=ever since then (Saturday, January, 2009, I met you) , 16806=at 6:00 AM(at noon, at midnight), 17280=on January 10 (Thursday), 31274=We will fly to Spain in January. (plan for a future date), 37154=since (exact time: 6:00 AM, noon, midnight, this morning, May 2012), 1273=on June 25 at 10 p.m., 61491=Julie Sevastopoulos — ESL / EFL / TEFL — English Grammar Reference / Resource — Practices & Exercises — Palo Alto, California USA —}",
    "lastModified": "Thu, 30 Jul 2015 16:17:28 GMT",
    "textBeforeTable": "Past Tense Sentences     several times (nonprogressive only) Also see  During / In   continuously (continually) rarely (seldom, hardly ever, not ever, never)   if he looked at it over the past few years (days, months) sometimes (occasionally, on occasion) anytime he looked at it² during the 1960s  (a period of time) often (frequently, half of the time) / whenever he looked at it² from Monday to Friday  (a span of time) usually (in general, normally) while he was looking at it¹ for three weeks (days, months, years) \"a quantity of time\" always (routinely, customarily, as a rule) when he saw it¹ A time with duration in the past    A time that reoccurred in the past    A time relative to another past activity DURATION FREQUENCY RELATIVE TIME  Past progressive verbs are used with adverbs specifying a past time, or expressing duration. The emphasis is on time. PAST & PAST PROGRESSIVE ADVERBS           in the 1960s (the 1800s,",
    "textAfterTable": "PAST PROGRESSIVE   Adverbs used with past progressive tense tend to emphasize frequency, duration or repetition. The volcano was erupting  for over month. (indefinite quantity of time) A journalist was photographing the event from April to December. (time range) People were often wondering  when it would stop. (emphasis on frequency) Airplanes were not flying  while it was happening. (relative time)   Past tense practice pages:   Past Complete,  Past Prog,  Would / Used to, Reporting Source, Past Series, After, Before, When              Future Adverbs Future and Future Progressive       Adverbs for Future FUTURE & FUTURE PROGRESSIVE Adverbs used with future tense tell us when a predicted or scheduled activity will occur.  Future tense focuses more on the activity rather than the exact time. AT, IN, ON NEXT THIS, THAT A specific time in the future A future time based on quantity or calendar units A future time after the current time  (near, far) at 6:00 AM(at noon, at midnight) next week( month, winter, year) ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}