{
    "relation": [
        [
            "Year",
            "2008",
            "2004",
            "2000"
        ],
        [
            "Dem.",
            "54.2%",
            "51.1%",
            "47.9%"
        ],
        [
            "GOP",
            "44.0%",
            "47.7%",
            "45.5%"
        ]
    ],
    "pageTitle": "Swing-State Map, List & Polls - POLITICO.com",
    "title": "",
    "url": "http://www.politico.com/2012-election/swing-state/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 649809243,
    "recordOffset": 649757757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110011=Updated: 7/2/13 7:59 AM EDT, 101151=Updated: 7/2/13 9:41 AM EDT, 116515=Updated: 7/2/13 1:41 AM EDT, 96258=In the 2000 and 2004 presidential races, the state was decided by fewer than 12,000 votes. But in 2008, Barack Obama won in a blowout. This year is likely to be much closer: GOP Gov. Scott Walker showed surprising strength in a June recall election with national implications., 111558=Updated: 7/2/13 12:36 AM EDT, 64633=The only state in New England where Mitt Romney has a real shot in November, New Hampshire went with the Democratic presidential nominee in 2008 and 2004 after voting for George W. Bush in 2000., 70980=Thanks to high African-American turnout and Democratic gains in the fastest-growing areas of the state, Barack Obama carried the North Carolina by the slimmest of margins in 2008 -- three-tenths of a percentage point., 115009=Updated: 7/2/13 8:03 AM EDT, 74329=This Rust Belt state has traditionally been a bellwether: It has voted with the winning candidate in every presidential election dating back to 1960. In 2010, the GOP posted big gains here., 105789=Updated: 7/2/13 12:32 AM EDT, 53385=The GOP presidential nominee hasn't carried Michigan since 1988, but Mitt Romney has high hopes of picking up the state because of its economic struggles and his personal ties -- he was born here and his father served as governor., 108444=Updated: 7/2/13 9:45 AM EDT, 26662=The most populous Mountain West state, Colorado has a growing Hispanic population and a politically active evangelical Christian community. Barack Obama was only the second Democratic nominee to carry the state since 1964., 33070=With 29 electoral votes, Florida is the nation's biggest battleground state. Home to large populations of senior citizens and Hispanics, the state voted for Barack Obama in 2008 and George W. Bush in 2004., 103431=Updated: 7/2/13 7:45 AM EDT, 62793=George W. Bush carried Nevada twice, but Democrats have made big voter registration gains since then and Barack Obama won by a 12-point margin in 2008. The state is one of those hit hardest by the home foreclosure crisis., 91339=Virginia has voted for the Democratic presidential nominee just twice since 1948. But the emergence of Democratic-leaning Northern Virginia as a political powerhouse has changed the equation, and the state's other metro areas have become increasingly competitive., 42438=Barack Obama carried Iowa easily in 2008, but the state was one of just two (the other was New Mexico) that voted for Al Gore in 2000 and George W. Bush in 2004. In both cases, the result was decided by less than a percentage point, 113578=Updated: 7/2/13 9:49 AM EDT}",
    "lastModified": "Tue, 02 Jul 2013 13:27:34 GMT",
    "textBeforeTable": "Alabama Historical Vote Additional Information Alabama 9 Electoral Votes Mitt Romney (R) Barack Obama (D) States Jump to State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming All State Polling Averages 270 of 538 Electoral Votes",
    "textAfterTable": "N/A N/A Alaska 3 Electoral Votes Additional Information Alaska Historical Vote Year Dem. GOP 2008 38.1% 59.7% 2004 35.6% 61.2% 2000 27.8% 58.8% N/A N/A Arizona 11 Electoral Votes Additional Information Arizona Historical Vote Year Dem. GOP 2008 45.1% 53.7% 2004 44.5% 54.9% 2000 44.7% 51.0% 45.0% 52.5% Arkansas 6 Electoral Votes Additional Information Arkansas Historical Vote Year Dem. GOP 2008 38.9% 58.7% 2004 44.5% 54.3% 2000 45.9% 51.3%",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}