{
    "relation": [
        [
            "",
            "Consolidated financial forecast for the fiscal year ending March 31, 2013",
            "Consolidated financial results for the fiscal year ended March 31, 2012"
        ],
        [
            "Sales and operating revenue",
            "6,600",
            "6,493.2"
        ],
        [
            "Operating income (loss)",
            "130",
            "(67.3)"
        ],
        [
            "Income (loss) before income taxes",
            "150",
            "(83.2)"
        ],
        [
            "Net income (loss) attributable to Sony Corporation's stockholders",
            "20",
            "(456.7)"
        ]
    ],
    "pageTitle": "Sony Corporation of America Announces Sale of 550 Madison Avenue Building | SYS-CON CANADA",
    "title": "",
    "url": "http://ca.sys-con.com/node/2517622",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37786959,
    "recordOffset": 37761925,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22719=NEW YORK, Jan. 17, 2013 /PRNewswire/ -- Sony Corporation of America (\"SCA\"), a wholly-owned subsidiary of Sony Corporation (\"Sony\"), today announced that it has entered into a contract to sell its U.S. headquarters building, located at 550 Madison Avenue in New York City, to a consortium led by The Chetrit Group, a New York-based owner of commercial properties in New York City and other major US real estate markets. , 23501=The sale price is $1.1 billion, and it is expected that the transaction will close in March 2013.  SCA and other Sony businesses (including Sony Music Entertainment, Sony/ATV Music Publishing and Sony Pictures Entertainment, among others) will remain in the building for up to three years under a leaseback arrangement with the purchaser., 45479=January 17, 2013 (EST), 51614=Consolidated financial results for the fiscal year ended March 31, 2012, 46726=6.                Outlook As mentioned above, Sony is currently reevaluating its forecast of the consolidated financial results for the current fiscal year ending March 31, 2013 to take into account this sale and other factors that might affect such forecast., 54034=Sony recorded consolidated annual sales of approximately $79 billion for the fiscal year ended March 31, 2012, and employs 162,700 people worldwide., 44433=January 18, 2013 (Japan Time), 38049=January 15, 2013, 49921=Consolidated financial forecast for the fiscal year ending March 31, 2013, 46518=March 15, 2013, 24236=Sony is currently reevaluating its forecast of the consolidated financial results for the current fiscal year ending March 31, 2013 to take into account this sale and other factors that might affect such forecast., 47109=(For reference)  Sony's consolidated financial forecast for the fiscal year ending March 31, 2013, which was announced on November 1, 2012, and its consolidated financial results for the fiscal year ended March 31, 2012}",
    "lastModified": "Sat, 01 Aug 2015 03:37:03 GMT",
    "textBeforeTable": "2.                Summary of assets to be sold 1.                Reasons for this sale Sony is undertaking a range of initiatives to strengthen its financial foundation and business competitiveness and for future growth.  At the same time, Sony is balancing cash inflows and outflows while working to improve its cash flow by carefully selecting investments, selling assets and strengthening control of working capital such as inventory.  This sale is made as a part of such initiatives. Eastdil Secured advised Sony on this transaction. Sony is currently reevaluating its forecast of the consolidated financial results for the current fiscal year ending March 31, 2013 to take into account this sale and other factors that might affect such forecast. After repaying debt related to the building and other transaction costs, it is expected that Sony will receive net cash proceeds of approximately $770 million.  Sony expects to realize a gain on the sale of approximately $685 million to be recorded as operating income. The sale price is $1.1 billion, and it is expected that the transaction will close in March 2013.  SCA and other Sony businesses (including Sony Music Entertainment, Sony/ATV Music Publishing and Sony Pictures Entertainment, among others) will remain in the building for up to three years under a leaseback arrangement with the purchaser. (Photo: http://photos.prnewswire.com/prnh/20130117/NY44753 ) NEW YORK, Jan. 17, 2013 /PRNewswire/ -- Sony Corporation of America (\"SCA\"), a wholly-owned subsidiary of Sony Corporation (\"Sony\"), today announced that it has entered into a",
    "textAfterTable": "Trade name Sony Corporation of America Address of head office 550 Madison Avenue, New York, NY 10022, the United States Name and title of representative Michael Lynton, CEO Business",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}