{
    "relation": [
        [
            "Option",
            "-ignore | -noignore",
            "-log | -nolog"
        ],
        [
            "Description",
            "Unless -ignore is specified, command execution will be aborted should one of the sub-commands generate an error.",
            "By default, each command is echoed to the terminal before being executed (the -log option). Specify -nolog to suppress this echo."
        ]
    ],
    "pageTitle": "Sub-Commands (Sun Java System Messaging Server 6 2005Q4 Administration Reference)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19796-01/819-2651/acmgq/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73100867,
    "recordOffset": 73092665,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21667=When the directory tree is scanned, each message file is opened to determine its size as measured in units of blocks (normally 1024 bytes). To suppress this behavior and speed up generation of the listing, specify -nofile_info., 18175=When the directory tree is scanned, each message file is accessed to determine its size as measured in units of blocks (normally 1024 bytes). To suppress this behavior and speed up generation of the listing, specify -nofile_info. When the queue cache database is used, the -nofile_info option is ignored as the size information is stored in the database., 13298=Displays the current time and date in RFC 822, 1123 format.}",
    "lastModified": "Thu, 27 Jan 2011 05:00:58 GMT",
    "textBeforeTable": "The options for this sub-command are: [-verbose | -noverbose] [channel] [-match=keyword] [-min_length=n] [-threads=n | -nothreads] [-database | -directory_tree] [-delete | -hold] [-ignore_zz] [-to=substring] [-domain_to=substring] clean [-content=substring] [-from=substring] [-subject=substring]   Available in both interactive and non-interactive modes. The clean sub-command holds or deletes message files containing specific substrings in their envelope From: address, Subject: line, or content. clean Sub-Commands  Next: imsimta qm Options Previous: imsimta qclean  Sun Java System Messaging Server 6 2005Q4 Administration Reference imsimta qm  > Sub-Commands Command Descriptions  > Chapter 2 Message Transfer Agent Command-line Utilities  > Sun Java System Messaging Server 6 2005Q4 Administration Reference  > Documentation Home  >",
    "textAfterTable": "-delete | -hold Specifies whether matching message files are held (-hold) or deleted (-delete). The -hold option is the default. -ignore_zz Ignores queued message files with file names beginning with “ZZ”. This option may be used to scan only those message files which represent queued messages which have failed at least one delivery attempt.  -match=keyword Controls whether a message file must contain all (-match=AND) or only one of (-match=OR) the specified substrings in order to be held or deleted. The substrings are specified by the -content, -env_from, and -subject options. The default is -match=AND. -min_length=n Overrides the length limit for each substring to be searched. By default, the limit is 24 bytes (-min_length=24). -threads=n | -nothreads Accelerates the searching on multiprocessor systems by dividing the work amongst multiple, simultaneous running threads. To run n simultaneous searching threads, specify -threads=n. The value n must be an integer between 1 and 8. The default is -nothreads. -verbose | -noverbose Requests that the utility displays operation information (-verbose). The default is -noverbose. channel",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}