{
    "relation": [
        [
            "Presenter",
            "Who Are You?",
            "Yvan Boily",
            "Jochai Ben-Avie"
        ],
        [
            "Title",
            "What Do You Do?",
            "Minion Beta",
            "Internet Policy Manager"
        ],
        [
            "Topic",
            "What are you going to talk about?",
            "Sign up for the Minion Beta!",
            "Update on U.S. Surveillance Reform"
        ],
        [
            "Location",
            "Where are you presenting from? (Moz Space, your house, space)",
            "Vancouver",
            "SF"
        ],
        [
            "Share?",
            "Will you be sharing your screen? (yes/no, other info)",
            "No",
            "No"
        ],
        [
            "Media",
            "Links to slides or images you want displayed on screen",
            "n/a",
            "n/a"
        ],
        [
            "More Details",
            "Link to where audience can find out more information",
            "https://etherpad.mozilla.org/minionbeta",
            "https://blog.mozilla.org/netpolicy/2015/05/27/us-surveillance-reform-nearing-the-finish-line/"
        ]
    ],
    "pageTitle": "mozillaproject « Meeting Notes",
    "title": "",
    "url": "https://blog.mozilla.org/meeting-notes/archives/tag/mozillaproject",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859529231,
    "recordOffset": 859501260,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27180=Amira Dhalla, Brooklyn: Our fourth-annual Maker Party starts this Wednesday (July 15): mzl.la/makerparty, 83216=Content Services will hold a Brownbag for Suggested Tiles at Whistler on Friday June 26, 10:30 – 11:30am. Please visit Sched for location details. All are invited!}",
    "textBeforeTable": "The limit is 3 minutes per topic. It’s like a lightning talk, but don’t feel that you have to have slides in order to make a presentation. If you plan on showing a video, you need to contact the Air Mozilla team before the day of the meeting or you will be deferred to the next week. Speakers Windows 10 launches this week! Majority of our work lands in 40, Aug 11. Speaker Location: Vancouver – Remote (mmayo) Firefox and Cloud Services Project Status Updates (voice updates) More info: De/Meetings. German-speaking community bi-weekly meeting, 9pm CEST (7pm UTC, 12pm PT) AirMozilla, IRC: #deMeeting Thursday, 30 July Any questions? See the wiki page for details or join IRC: http://indiewebcamp.com/irc/today?beta#bottom Join a community with like-minded interests. Bring friends that want a personal site! Create or update your personal web site! Share what you’ve gotten working, ask for help where you’re stuck. 18:30-19:30 IndieWeb meetup & hack night 17:30-18:30 Writing Hour San Francisco (@MozSF), Portland (@ Beulahland), and Göteborg in Germany! (@ Steampunk Bar) Be independent with your web browser and your web site. Homebrew",
    "textAfterTable": "Tantek Çelik Web Standards Lead Social Web Acid Test v0 milestone at IndieWebCamp 2015 SF No Video after I give a short intro: https://archive.org/details/SWAT0-live-demo_201507/ For more details (open source and open standards used) see: User flow and permalinks from #IndieWeb #SWAT0 achievement Chris Manchester Automation and Tools Engineer mach try SF No http://chmanchester.github.io/blog/2015/07/26/introducing-mach-try/ Welcome! Let’s say hello to some new Mozillians! If you are not able to join the meeting live, you can add a link to a short video introducing yourself. Introducing New Volunteers New Volunteer Introduced by Speaker location New Volunteer location Will be working on Who is the new volunteer? Who will be introducing that person? Where is the introducer? Where will the new person be contributing from? What will the new person be working on? Introducing New Hires New Hire Introduced by Speaker location New Hire location",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}