{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The security officers seem to just pick on people because not much goes on. The parking lot is dangerous because they built shrubs and trees on every corner blocking your view of oncoming traffic. People don't stop at the stop sign at the crosswalk.",
            "Super smart, independent, or super social.",
            "West campus is extremely confusing to get around, it gives you the feeling of deja vu. The bridge between campus is not covered... This is Minnesota.",
            "Just no.",
            "There's a little beach area on campus that looks like fun. The Nest is the social area, but you have to know someone to even go there and have fun.",
            "The cafeteria always smells bad in the morning, but we do have caribou!",
            "There are no dorms.",
            "The teachers don't offer much help, are always late to class and cancel often.",
            "Find friends as soon as possible.",
            "Shady environment. Older crowd. Staff without hospitality."
        ]
    ],
    "pageTitle": "Century College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Century-Community-and-Technical-College/reviews?_escaped_fragment_=/show/33656",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908449975,
    "recordOffset": 908419614,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{444=I have been going to century college since 2006. Century college is a great school to start out from it saves you money and lets you decide on what you really want to with your educational career. It has who campuses the east and the west campus. the east campus is basically the technical side of the college and the west campus consists mostly of the general classes. I was given me the opportunity to earn college credits while still in high school through NE Metro 916 at Century college and introduced me to HOSA: Health Occupation Students of America. An organization dedicated to fuel the pipeline of healthcare professionals with more than 81,000 members nationwide. My dedication to HOSA has led me to compete at state level placing 3rd in extemporaneous writing against more than 80 and moving on to the national level held in Florida. I became the Vice-President representing our state of Minnesota for the school year off 2007-2008. Today i have graduated as a dental assistant from century college and im moving on to pursue my greater educational goals. Century has been the solid stepping stone to my future. The faculty at century is incredible, i highly recommend that you begin your college journey at century college because not only do you save a ton of money, you can take advantage of the smaller class sizes that it has to offer. It has a huge parking lot so that you are guaranteed a parking spot everyday that you go to class without having to pay for parking every day. The class schedules are very flexible, therefore you will always have a class time available to fit your busy schedule. Century college also has a large scholarship foundation which helps many century students financially. I personally recieved two scholarships which helped me pay for school. If you are considering to go to century college i would not think twice. Century is a great school., 122681=© 2015, Cappex.com, LLC, 116314=I went to Century College right after i graduated from High School in 2009. Century College is a great school to start with because i was undecided on my education career. One thing that i love most about Century College is they have plenty of resources to help me pay for school.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 30 Gladys from Minneapolis, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Great for these types of students People who want to achieve their AA degree or a degree in the technical area such as dentistry or automotive, for a cheaper price then most colleges. Tips for prospective students Apply early to get in before classes fill up. Bang for the buck Tuition is also fairly managable in comparison to other colleges. Am enjoying being here There are many clubs and activities that take place often within the college and the facilities available to students such as the writing lab and computer lab and such are amazing! Staff is willing to help and capable as well. Am learning a lot Many of these classes have small managable class sizes. The teachers are also willing and eager to help. Login to rate or flag the reviews Laurie from St. Paul, MN 01/25/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 4 of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}