{
    "relation": [
        [
            "Garden",
            "Security",
            "Other"
        ],
        [
            "Swimming Pool",
            "Club House",
            ""
        ],
        [
            "Play Area",
            "Tennis Court",
            ""
        ],
        [
            "Maintenance Staff",
            "Community Hall",
            ""
        ]
    ],
    "pageTitle": "Residential Projects by Arattukulam Developers | Find Properties by Arattukulam Developers in Bangalore",
    "title": "",
    "url": "https://www.commonfloor.com/all-projects-by-arattukulam-developers-in-bangalore/bpc-ma1o00-70",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899180403,
    "recordOffset": 899110132,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1067=Aratt Adora ARATT ADORA consists of 100 3BHK flats having the range of 1370-1502sqft. Flats in off Sarjapur Road, Bangalore   Aratt Adora is a 10 floor building with an unmatched carpet area of 80%, and exclusive facilities. Aratt Adora is so designed that all electrical and sanitary lines pass through internal ducts, enhancing aesthetic value and making the apartments leak proof. Thoughtful, meticulous and detailed planning with due respect to all civic regulations (BDA / BBMP) makes this venture a convenient place to stay and good asset to acquire. Special care has been taken in designing these apartments to receive good ventilation with ample flow of  fresh air and sunlight.}",
    "TableContextTimeStampAfterTable": "{324170=Project is Ready to Occupy and was delivered around Jan 2013, 174954=Project is Ready to Occupy and was delivered around Feb 2008, 310630=Project is Ready to Occupy and was delivered around Jun 2010, 362321=Project is Ready to Occupy and was delivered around Dec 2011, 272424=Project is Ready to Occupy and was delivered around Apr 2011, 198329=Project is Ready to Occupy and was delivered around Jan 2012, 89120=Expected completion is around Jun 2017}",
    "textBeforeTable": "Amenities Map HDFC Bank, Axis Bank, LIC Housing Finance Ltd, State Bank of India, All Leading Bank Home Loans providers include Project is known to be approved by BBMP, BDA Project Approving Authorities Approvals 68.50L - 79L 1370-1527 sq.ft 3bhk Apartments Price Area Bedrooms Property Type Unit Types Aratt Adora ARATT ADORA consists of 100 3BHK flats having the range of 1370-1502sqft. Flats in off Sarjapur Road, Bangalore   Aratt Adora is a 10 floor building with an unmatched carpet area of 80%, and exclusive facilities. Aratt Adora is so designed that all electrical and sanitary lines pass through internal ducts, enhancing aesthetic value and making the apartments leak proof. Thoughtful, meticulous and detailed planning with due respect to all civic regulations (BDA / BBMP) makes this venture a convenient place to stay and good asset to acquire. Special care has been taken in",
    "textAfterTable": "Jogging Track Amphi Theatre About Builder “Aratt” is a company with vision, creativity, and proven ability, having most of its residential and commercials projects in South Bangalore, which is a prominent and emerging market location for real estate business in Bangalore. “Aratt” is the brand name of Arattukulam Group’s real estate business. “Aratt” is in the business of development of Land, Construction and development of residential and commercial properties. Bangalore’s growth has been influenced by its excellent climate, quality infrastructure and cosmopolitan culture. More and more people are making a conscious choice to settle down in Bangalore. Since home is family’s biggest investment, it’s important to choose a builder whose experience and pride of craftsmanship are reflected in each home the company builds. “Aratt” is a company with vision, creativity and proven ability. 1 PHOTO Aratt Milano  in Sarjapur Road, Bangalore",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}