{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a movie theater nearby and also many malls and places to eat like frozen yogurt.",
            "There is a cafeteria that has a wide selection of foods and always has good deserts and brunch on the weekends. Then there is the campus center mall like food set up that has many decisions including Chik fil a , Jonny Rockets, Homestyle (hot home cooked foods), and Primos Pizza, and Mondo Subs.",
            "As a freshmen you live in a three floor building. I live on the third floor with about 18 other girls. One side of the hallway is single rooms and the other side is doubles with one triple. You have a resident assistant who also lives on your floor who you can go to for any needs and they also decorate the floor and coordinate small floor programs for you.",
            "Depending on the course you take and your strengths and weaknesses you may find some classes hard and others easier and someone may disagree with you depending on their personal strengths and weaknesses academically.",
            "I am a speech pathology major and I would recommend anyone that is in that field to this school. It is a small school and the education here is very good.",
            "The class sizes are small, which makes for a better learning experience. The professors are all extremely helpful and are a big part of our success. The new campus center building is very impressive and a highlight for the school."
        ]
    ],
    "pageTitle": "Stockton University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Stockton-University/reviews?_escaped_fragment_=/show/16890",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897743195,
    "recordOffset": 897670430,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{383431=© 2015, Cappex.com, LLC, 51321=With all the new building, if you are commuting be sure to come early, there is litterally no parking after 9:30 am., 31599=It's important to have good grades and SAT score in order to be eligible to receive financial aid in the very first year (currently, the Presidential Scholarship with an SAT Critical Writing and Math total score of at least 1400 and a rank in the top five percent of your class, Provost's Scholarship with 1250 and in the top ten percent, and the Dean's Scholarship with 1150 and in the top 15 percent; it's all on the website) as well as to review all of your major options once you're a student -- there are many fields of study available at Stockton, so it's good to check them all out before declaring your major(s) and/or minor(s). And once you've enrolled at Stockton, remember to join at least one or two clubs, organizations, or sports teams. :), 81359=Stockton is a great college to attend if your not quite sure what direction your headed in. It will help you explore many areas of study and you'll have a great time doing so. Recently in 2011, Stockton opened up a new campus center which is great to hang out in with friends to play games, study, relax and watch t.v., or get some food.}",
    "textBeforeTable": "01/31/2010 Reviewer is A current student here. 13 out of 15 people found this review useful. 1 of 87 Maria from Beachwood, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Colleen from Ringwood, NJ 12/20/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 2 of 87 Categories Comments Great for these types of students Stockton College is a GREAT science school. It is also a good business school. I would also recommend Stockton for anyone who doesn't want to enter a huge college. Stockton is on the small side, and is very comfortable. It has changed my life, and I wouldn't want to be anywhere else. Tips for prospective students I would definitely recommend on going to the SOAR program the weekend before school starts. I met three of my best friends during that program. I would also recommend going to all the activities they have during the first week of school. It really helps you feel more comfortable in your new surroundings. Take classes you think you will enjoy, but also take classes you've never really heard of. College is all about experiencing new things, and Stockton definitely gives every student that opportunity. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}