{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Other - See seller's payment instructions",
            "Credit card"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Victorian/Edwardian CAPE & HAT fancy dress one size | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Victorian-Edwardian-CAPE-HAT-fancy-dress-one-size-/280495496590?pt=UK_Clothes_Children_sFancyDress_RL&hash=item414ed59d8e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430159471,
    "recordOffset": 430109821,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1145=PLEASE E MAIL OR CONTACT OUR CUSTOMER SERVICE HELP DESK 01978 661046}",
    "TableContextTimeStampAfterTable": "{68777=Crazyladies do not hold any responsibility for goods once sent. We always send by recorded delivery and will always provide tracking numbers if & when requested, however tracking the parcel and finding out when it was or will be delivered is your responsibility. We are not to blame if parcels are left with neighbours or sent back to sorting offices because a signature was not provided or the parcel was not picked up by the customer. All deliveries are Royal Mail if you require additional postal services or you are needing your costume in a hurry please ring our Crazyladies Customer Service line 01978 661046 Mon-Fri 9 am-5pm where we will be happy to assist you.}",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Tue. 11 Aug. and Mon. 17 Aug. Estimated between",
    "textAfterTable": "Seller's payment instructions CRAZYLADIES DO NOT HOLD ANY RESPONSIBILITY FOR GOODS SENT ONCE THEY HAVE LEFT THE PREMISIS.IF YOU WOULD LIKE US TO SEND YOUR GOODS BY SPECIAL DELIVERY PLEASE CONTACT US , 01978 661046 Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}