{
    "relation": [
        [
            "Timestamp",
            "2010-09-12",
            "2009-02-25",
            "2009-02-25",
            "2009-02-25"
        ],
        [
            "Action",
            "Added",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "RELATION",
            "RELATION",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "is a GO:0051240 (positive regulation of multicellular organismal process)",
            "is a GO:0051130 (positive regulation of cellular component organization)",
            "positively regulates GO:0034372 (very-low-density lipoprotein particle remodeling)",
            "is a GO:0010901 (regulation of very-low-density lipoprotein particle remodeling)"
        ]
    ],
    "pageTitle": "GO:0010902 positive regulation of very-low-density lipoprotein particle remodeling",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0010902",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 408403291,
    "recordOffset": 408381390,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121129=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 121262=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:0010902 Wiki Page GONUTS Any process that increases the rate, frequency or extent of very-low-density lipoprotein particle remodeling. Very-low-density lipoprotein particle remodeling is the acquisition, loss or modification of a protein or lipid within a very-low-density lipoprotein particle, including the hydrolysis of triglyceride by hepatic lipase or lipoprotein lipase and the subsequent loss of free fatty acid. Definition Biological Process Ontology positive regulation of very-low-density lipoprotein particle remodeling Name GO:0010902 ID Term Information Dataset Web Services Term Basket",
    "textAfterTable": "Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0010902: Term has no children Protein Annotation Display ID Mapping Filter",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}