{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "non-existent",
            "Smith has a many different dining halls, so if you don't like what is being served, you can go somewhere else. Also, Julia Child Day is awesome!",
            "I love my house!",
            "Classes are difficult, but fun! Professors are always willing to help. Stay on top of your reading!",
            "Apply early! You can get more financial aid and accepted into super cool programs, the earlier you apply the better!",
            "Smith is a liberal women's college in Northampton MA. It's a competitive community of women, ready to take on the world. Come to Smith!"
        ]
    ],
    "pageTitle": "Smith College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Smith-College/reviews?_escaped_fragment_=/show/12312",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912896119,
    "recordOffset": 912848657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{158133=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/24/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 30 Veronica from Plymouth, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. Smith College Reviews Smith College › Massachusetts › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Women/female-bodied, motivated, academically curious, interested in the sciences, interested in women's studies, opinionated, bold, passionate, driven, eclectic. Tips for prospective students -Visit if you can. You'll learn a lot about the campus if you can just walk around by yourself, away from tour groups. -Talk to current students. Most Smithies will tell you everything they like and don't like about the school--we're very opinionated. -Smith has a fairly sizeable and visible LGBTQ population. Sometimes the school does not emphasize this in their admissions propaganda, but it's definitely true and something to be aware of. We take treating everyone with respect very seriously here. -Smith also has a lot of liberals and moderates-- but that doesn't mean that conservatives aren't welcome. Some of us like having someone to argue with. ;) -Some Smith students are men. We have transpeople on campus, and graduate students who are men. -Just because you go to a women's school does NOT mean you won't ever see men. Guys from other schools take classes here, people from town are on campus, there are male teachers, etc. -Some Smithies are non-traditional aged students called Ada Comstock Scholars. They're pretty cool, and bring a unique perspective to whatever they do. Some of them live on campus, and some life off-campus. -Explore NoHo. It's pretty cool. -If you go to Herrell's Ice Cream",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}