{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are so many organizations that you can easily find one for anything you like, from Chocolate Club, to Cardio Hula-Hooping, to SnowBums. And if you do not find one you like you only need 6 friends to start a new one!",
            "Main St. is mainly restaurants, so you can eat your heart out. The mall is 15 minutes away, but 45 if you take the bus. There is a bowling alley on Main St., but for the most part you and your friends have to entertain yourselves.",
            "The food in the dining hall is like what you would expect, very starch oriented and they cannot cook vegetables at all. But the other options, such as the PODs and student centers offer better options, but at a price.",
            "The dorms do a good job of organizing events and working to get people to know each other. That being said, most of the freshman dorms are not in the best condition, but they are currently working to improve that!",
            "I am in the Honors College at UD, so the classes that I am taking honors are definitely challenging. But the non-honors courses have their fair share of work too, and the professors expect you to do the work and be prepared for class.",
            "Visit! Make sure you come and take a tour and learn about the university first hand. The campus is beautiful, and it is truly a college town. I was hesitant before I visited but I fell in love once I did. But this can also work the other way, colleges may look great on paper but not have the right feel when you take a tour. Most of the time, you know once you visit whether a school is right for you.",
            "UD wants its students to succeed, and there is a great balance between research opportunities (which there are a lot of!) and education (the teachers care about their students, not just their research). The university is big enough to offer almost everything under the sun, but not so big that you feel like you are just a number. From my experience, if you have a desire to pursue something, they will help you achieve it."
        ]
    ],
    "pageTitle": "University of Delaware (UD) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Delaware/reviews?_escaped_fragment_=/show/88998",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898033843,
    "recordOffset": 897910204,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219491=Most of the dorms on campus are fabulous, and at the end of the Spring 2015 semester, the school is closing down it's two oldest freshmen complexes, and a new one will be opened in the Fall of 2015, so there's no need to worry about getting stuck in an old, run-down building., 216701=The Candle Lighting Ceremony during 1743 Welcome Days weekend is moving and exciting. Proud to be a Blue Hen!, 426449=Starting with the class of 2016, there is a candlelight ceremony for the freshmen on South Green initiating their college experience., 230758=New d-hall coming 2015. It is supposed to be largest on East Coast!!!!!!, 571379=there are a BILLION different clubs- go to Activities night during 1743 days and use stUDent Central to find others., 215291=There are so many different clubs and activities on campus. There is no reason to spend all of your free time sitting in your dorm. During 1743 Welcome Weekend, there will be events where student organizations and clubs set up tables in the student centers, and freshman can walk through, ask questions, and sign up to join clubs. There's a club for everything. Everything., 615935=Being from Delaware, University of Delaware (UD) was the last school I was interested in attending because like so many others I wanted an out-of-state adventure. But upon starting at UD in the fall of 2013, I not only fully embrace my new hometown university but also cringed at the idea of experiencing college at any other academic institution. The University of Delaware has stolen my heart with its beautiful campus, excellent professors and various study abroad options, and the amazing extracurricular/greek/social options., 376108=Most of the dorms are nearly new and very nice inside! There are a few old dorms that are currently being remodeled and should be finished by the summer of 2013., 563635=In 2015, almost all the freshman dorms will be very new, but it honestly doesn't matter where you live on campus because everyone loves their dorm. I'm a freshman and I live in one of the oldest dorms on campus and I wouldn't trade it for the world. I love it. Wherever you live on campus, students are guaranteed a great time., 624246=© 2015, Cappex.com, LLC, 229774=1743 days Kirkbride jesus Grottos, 547470=Like most universities, the University of Delaware has it's share of unusual things around campus. One of these would be the Techno Bus Driver. If you ever ride the bus around campus there is a chance that you could ride of his bus. Another unusual thing at the University would be Kirkbride Jesus. This guy stands right outside Kirkbride lecture hall and preaches the word of God every Wednesday at 1:00 p.m. Many enjoy siting and listening to him as well as the people just walking by. There are many others, but to know them you will have to become a Blue Hen to find out!}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 of 130 David from Fairfield, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students Music students, those who enjoy peer encouragement/feedback on their work, honors students. I just wanted to write a message for people who are concerned that Delaware is a party school...on any given weekend (probably weeknight, for that matter) lots of people will be interested in going out and drinking, and lots of parties are available nearby to cater to that. But really, if you're being true in your friendships, you'll find people who prefer watching a movie or playing board games, and you'll find school-sponsored activities or performances to enjoy. While I don't consider myself a partier and spend a lot of my weekends in, I do appreciate that if I do want to go out, I can easily find a party. And I feel no pressure to drink. It's just a matter of finding a group of friends who enjoy the same activities that you do. Tips for prospective students Apply to the honors program; I'm currently in it and am enjoying the challenging and engaging classes. Honors students all live together, and it's really nice that on weeknights or Sundays, when we have to buckle down, we either sit in the hallway or the lounge and study together. We all might be stressed about classes and wanting to put off our work, but the fact that everyone around you is studying makes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}