{
    "relation": [
        [
            "POSITION",
            "C",
            "1B",
            "2B",
            "3B",
            "SS",
            "CI",
            "MI",
            "OF",
            "OF",
            "OF",
            "OF",
            "OF",
            "UT",
            "P",
            "P",
            "P",
            "P",
            "P",
            "P",
            "P",
            "P",
            "P",
            "BE",
            "BE",
            "BE"
        ],
        [
            "PLAYER",
            "Salvador Perez",
            "Mark Trumbo",
            "Jason Kipnis",
            "Manny Machado",
            "Jed Lowrie",
            "Jose Abreu",
            "Anthony Rendon",
            "Andrew McCutchen",
            "Adam Jones",
            "Wil Myers",
            "Matt Holliday",
            "Austin Jackson",
            "Wilson Ramos",
            "Chris Sale",
            "Gio Gonzalez",
            "Glen Perkins",
            "Zack Wheeler",
            "Chris Tillman",
            "Jim Henderson",
            "Chris Archer",
            "Ubaldo Jimenez",
            "Jose Quintana",
            "Nick Castellanos",
            "Rajai Davis",
            "Brad Miller"
        ],
        [
            "ROUND",
            "12",
            "7",
            "3",
            "11",
            "14",
            "9",
            "20",
            "1",
            "2",
            "5",
            "6",
            "16",
            "13",
            "4",
            "8",
            "10",
            "15",
            "17",
            "18",
            "19",
            "23",
            "25",
            "21",
            "22",
            "24"
        ]
    ],
    "pageTitle": "Fantasy Baseball 2014: Full 12-Team, 25-Round Mock Draft, Version 2.0 | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/1988479-fantasy-baseball-2014-full-12-team-25-round-mock-draft-version-20",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 25653935,
    "recordOffset": 25576493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132515=If I'm being honest here, I was about to take Justin Verlander over Sale, who was queued up at the top of my next-to-draft list when the clock struck 0:00. It's not that I didn't want Sale—again, I had him queued up for a reason—but I'm buying in on a Verlander return to form, which could make him a top-three SP in 2014., 275789=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 213719=Archer is very much in the same mold as Zack Wheeler—a young, hard-throwing righty who was a top prospect with some promising success in his first real taste of the bigs in 2013. I don't expect the 25-year-old to match the 3.22 ERA or 1.13 WHIP he put up in 23 starts last year, but if he can maintain the control he showed (2.7 BB/9), there's a lot to like about him as my SP5 with the upside of an SP3/4., 155771=Gonzalez is an easy top-20 starter—heck, he's in my top 15—so to grab him in Round 8 of a draft where a ton of pitching was taken early is a coup. He's a 200-strikeout arm who will post an above-average ERA and WHIP, and the Nationals have to be better this year, which means he should top last season's 11 wins—even if he doesn't exactly match the 21 wins he recorded in 2012. He'll slot in just fine behind Sale., 208798=Despite having no real experience closing games in the majors until a month into 2013, this hard-throwing 31-year-old proved he could do the job by sporting great numbers (2.70 ERA, 1.13 WHIP, 11.3 K/9) and converting 28-of-32 attempts. I like Henderson about as much as Neftali Feliz, who went one pick earlier, and much more than John Axford—the man Henderson replaced last year—who went five picks earlier., 223820=The 22-year-old Castellanos was impressive in an aggressive assignment to Triple-A in 2013 (.276 BA, 18 HR, 76 RBI), and he has been flashing more pop this spring. With the Opening Day third base gig in a still-potent Tigers lineup all but locked up, Castellanos can be my fill-in until Machado is ready. After that, he could be shiny-new-toy trade bait if he gets off to a hot start, or simply a solid backup at both 3B and OF., 107563=This mock draft was held on March 11 via ESPN Fantasy Baseball's mock draft lobby. As opposed to the whopping 15 teams picking 23 players each for a total of 345 last time around, this time there were 12 teams drafting over 25 rounds for 300 players in all., 149990=In need of a first baseman, and figuring that a little more power (OK, a lot more power) never hurt a fantasy owner, I snatched Trumbo, who has mashed at least 29 homers in each of his first three full seasons, including a career-high 34 in 2013. I'd bet another 30-homer campaign is on the docket, and with his move from pitcher-friendly Angel Stadium to hitter-friendly Chase Field, Trumbo could set another career-best mark in 2014., 218885=As it turns out, Rendon, a 23-year-old former top prospect who looked capable as a rookie (.265 BA, 40 R, 7 HR, 35 RBI in 351 AB), could be a pretty nice late-round gift. Injuries have always been a concern for the 2011 No. 6 overall pick, but if he stays healthy, Rendon's bat could turn him into a fringe top-10 2B., 233674=Still searching for some quality and quantity on the SP front, I found Jimenez readily available and enticing enough at this late stage to take a flyer on him. If he looks good early, he could be an SP2/3, much like he was over the second half of 2013 (1.82 ERA, 1.14 WHIP, 10.7 K/9). If he turns back into an enigmatic pumpkin, it's not going to cost me much in Round 23., 144814=Josh Donaldson was a great story in 2013, but he'll have to be an even better story in 2014 in order for him to be worth pick No. 63 overall. If you buy into the whole 27-year-old-break-out thing, that's your prerogative, but I see a solid player who is better in real life than fantasy, because he might not be better than slightly above average in any category., 188893=To recover, I went with the safe and somewhat versatile Jed Lowrie, who should be fine as my starting SS, even though his upside might be a repeat of his solid 2013 campaign. If he can come close to repeating that production, though, then the way all this played out might not sting so much in the end.}",
    "textBeforeTable": "Carlos Osorio/Associated Press Round 1 Next » 30 of 4 « Prev Mock on! Oh, and yours truly scored the fifth overall pick, which turned out rather well out of the gate when a certain someone fell to that slot. Got all that? Again, there were 25 rounds, and the lineup positions are as follows: one each for catcher, first base, second base, third base, shortstop, middle infield, corner infield and utility; five outfielders; nine pitchers of any sort (starters and relievers); and three bench spots. As for other information you should know, this mock was set up for a make-believe league that uses standard 5x5 rotisserie scoring: BA, R, HR, RBI, SB for hitters; W, ERA, WHIP, K, SV for pitchers. After leading the majors in homers and RBI last year, Chris Davis has turned into a first-rounder. Gene J. Puskar/Associated Press",
    "textAfterTable": "14 Yu Darvish SP Team moore 15 Edwin Encarnacion 1B Team Fiorella 16 Carlos Gomez OF Team Costa 17 Adam Wainwright SP Team hughes 18 Robinson Cano 2B Team O'Connell 19 Troy Tulowitzki SS Team Catania 20 Adam Jones OF Team Calixto 21 Felix Hernandez SP Team Young 22 Bryce Harper OF Team Giusti 23 Joey Votto 1B Swervin Lane 2 Lane 24 Yasiel Puig OF   Analysis My Pick: Adam Jones, OF I was shocked when Robinson Cano dropped out of Round 1...and then continued to fall and fall. As a result, I started to get excited with the possibility that I could land a legitimate first-rounder—which Cano clearly is—in the middle of Round 2. Alas, he went two picks prior to mine, but I was more than happy to get Jones, who gives me a second uber-productive outfielder who will go big in runs, homers and RBI while also helping in average and steals. I also debated taking Bryce Harper or Joey Votto, who each went within two of the next three picks after mine.   Other Picks It's interesting to see Ryan Braun climbing up draft boards this month now that he's shown once again that he can, you know, hit. I have no problem with an owner grabbing him anywhere in Round 2, but I wouldn't want to risk taking him with",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}