{
    "relation": [
        [
            "",
            "Four In Scope Facilities",
            "a. age 1 equivalent fish lost",
            "b. # lbs lost to landed fishery",
            "c. $ value of loss (2001$)"
        ],
        [
            "Impingement",
            "",
            "1 mil/yr",
            "27,000 lbs/yr",
            "$0.80 mil-$0.82 mil/yr"
        ],
        [
            "Entrainment",
            "",
            "19 billion/yr.",
            "56 million lbs/yr.",
            "$20.0 mil-$20.9 mil/yr."
        ]
    ],
    "pageTitle": "Federal Register | National Pollutant Discharge Elimination System-Proposed Regulations to Establish Requirements for Cooling Water Intake Structures at Phase II Existing Facilities",
    "title": "Exhibit 18.—Baseline Impacts (Annual Average) for Tampa Bay Back to Top",
    "url": "https://www.federalregister.gov/articles/2002/04/09/02-5597/national-pollutant-discharge-elimination-system-proposed-regulations-to-establish-requirements-for",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920833695,
    "recordOffset": 920604092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27234=A Notice by the Reclamation Bureau on 07/31/2015, 8537=The Draft Environmental Impact Statement implementing the 2008 U.S. Fish and Wildlife Service Biological Opinion and the 2009 National Marine Fisheries Service Biological Opinion is ready for public review and comment.}",
    "TableContextTimeStampAfterTable": "{268539=EPA is proposing performance ranges rather than a single performance benchmark because of the uncertainty inherent in predicting the efficacy of a technology on a site-specific basis. The lower end of the range is being proposed as the percent reduction that EPA, based on the available efficacy data, has determined that all facilities could achieve if they were to implement available technologies and operational measures on which the performance standards are based. (See Chapter 5, “Efficacy of Cooling Water Intake Structure Technologies,” of the Technical Development Document for the Final Rule for New Facilities, EPA-821-R-01-036, November 2001). The baseline for assessing performance is a Phase II existing facility with a shoreline intake with the capacity to support once-through cooling and no impingement or entrainment controls. The lower end of the range would take into account sites where there may be more fragile species that may not have a high survival rate after coming in contact with fish protection technologies at the cooling water intake structure (i.e., fine mesh screens). The higher end of the range is being proposed as a percent reduction that available data show many facilities can and have achieved with the available technologies on which the performance standards are based. Some facilities may be able to exceed the high end of the performance range, though they would not be required to do so by today's proposed rule. In specifying a range, EPA anticipates that facilities will select technologies or operational measures to achieve the greatest cost-effective reduction possible (within today's proposed performance range) based on conditions found at their site, and that Directors will review the facility's application to ensure that appropriate alternatives were considered. EPA also expects that some facilities may be able to meet these performance requirements by selecting and implementing a suite (i.e., more than one) of technologies and operational measures and/or, as discussed below, by undertaking restoration measures. EPA invites comment on whether the Agency should establish regulatory requirements to ensure that facilities achieve the greatest possible reduction (within the proposed ranges) that can be achieved at their site using the technologies on which the performance standards are based. EPA also invites comment on whether EPA should leave decisions about appropriate performance levels for a facility to the Director, provided that the facility will achieve performance that is no lower than the bottom of the performance ranges in today's proposal., 906536=Finally, in August 21, 2001, EPA staff participated in a technical symposium sponsored by the Electric Power Research Institute in association with the American Fisheries Society on issues relating to the definition and assessment of adverse environmental impact for section 316(b) of the CWA., 842697=The information collection requirements in this proposed rule have been submitted for approval to the Office of Management and Budget (OMB) under the Paperwork Reduction Act, 44 U.S.C. 3501 et seq. EPA has prepared an Information Collection Request (ICR) document (EPA ICR No. 2060.01) and you may obtain a copy from Susan Auby by mail at Collection Strategies Division; U.S. Environmental Protection Agency (2822); 1200 Pennsylvania Ave., NW.; Washington, DC 20007, by e-mail at auby.susan@epamail.epa.gov, or by calling (202) 260-49011. You also can download a copy off the Internet at http://www.epa.gov/icr. The information collection requirements relate to existing electric generation facilities with design intake flows of 50 million gallons per day or more collecting information for preparing comprehensive demonstration studies, monitoring of impingement and entrainment, verifying compliance, and preparing yearly reports., 841021=Under Executive Order 12866 (58 FR 51735, October 4, 1993), the Agency must determine whether the regulatory action is “significant” and therefore subject to OMB review and the requirements of the Executive Order. The order defines a “significant regulatory action” as one that is likely to result in a rule that may:, 498826=EPA included restoration measures in Track II to the extent that the Director determines that the measures taken will maintain the fish and shellfish in the waterbody in a manner that represents performance comparable to that achieved in Track I. Applicants in Track II need not undertake restoration measures, but they may choose to undertake such measures. Thus, to the extent that such measures achieve performance comparable to that achieved in Track I, it is within EPA's authority to authorize the use of such measures in the place of Track I requirements. This is similar to the compliance alternative approach EPA took in the effluent guidelines program for Pesticide Chemicals: Formulating, Packaging and Repackaging. There EPA established a numeric limitation but also a set of best management practices that would accomplish the same numeric limitations. See 61 FR 57518, 57521 (Nov. 6, 1997). EPA believed that section 316(b) of the Clean Water Act provided EPA with sufficient authority to allow the use of voluntary restoration measures in lieu of the specific requirements of Track I where the performance is substantially similar under the principles of Chevron USA v. NRDC, 467 U.S. 837, 844-45 (1984). In section 316(b) of the Clean Water Act, Congress is silent concerning the role of restoration technologies both in the statute and in the legislative history, either by explicitly authorizing or explicitly precluding their use. In the context of the new facility rule EPA also believes that appropriate restoration measures or conservation measures that are undertaken on a voluntary basis by a new facility to meet the requirements of that rule fall within EPA's authority to regulate the “design” of cooling water intake structures. Bailey v. U.S., 516 U.S. 137 (1995) (In determining the meaning of words used in a statute, the court considers not only the bare meaning of the word, but also its placement and purpose in the statutory scheme.), 1004564=66. Decision Memorandum from the Deputy Chief Financial Officer of EPA to the Administrator, December 18, 2001., 245415=San Onofre Nuclear Generating Station. The San Onofre Nuclear Generating Station (SONGS) is located on the coastline of the Southern California Bight, approximately 2.5 miles southeast of San Clemente, California. [36] The marine portions of Units 2 and 3, which are once-through, open-cycle cooling systems, began commercial operation in August 1983 and April 1984, respectively. [37] Since then, many studies evaluated the impact of the SONGS facility on the marine environment., 912589=7 U.S.C. 135 et seq., 136-136y; 15 U.S.C. 2001, 2003, 2005, 2006, 2601-2671, 21 U.S.C. 331j, 346a, 348; 31 U.S.C. 9701; 33 U.S.C. 1251 et seq., 1311, 1313d, 1314, 1318, 1321, 1326, 1330, 1342, 1344, 1345 (d) and (e), 1361; E.O. 11735, 38 FR 21243, 3 CFR, 1971-1975 Comp. p. 973; 42 U.S.C. 241, 242b, 243, 246, 300f, 300g, 300g-1, 300g-2, 300g-3, 300g-4, 300g-5, 300g-6, 300j-1, 300j-2, 300j-3, 300j-4, 300j-9, 1857 et seq., 6901-6992k, 7401-7671q, 7542, 9601-9657, 11023, 11048., 133537=The Federal Water Pollution Control Act, also known as the Clean Water Act (CWA), 33 U.S.C. 1251 et seq., seeks to “restore and maintain the chemical, physical, and biological integrity of the nation's waters.” 33 U.S.C. 1251(a). The CWA establishes a comprehensive regulatory program, key elements of which are (1) a prohibition on the discharge of pollutants from point sources to waters of the U.S., except as authorized by the statute; (2) authority for EPA or authorized States or Tribes to issue National Pollutant Discharge Elimination System (NPDES) permits that regulate the discharge of pollutants; and (3) requirements for EPA to develop effluent limitations guidelines and standards and for States to develop water quality standards that are the basis for the limitations required in NPDES permits., 478999=EPA invites public comment on the standard that would be included in any site-specific final rule for determining best technology available for minimizing adverse environmental impact, including the appropriate role for a consideration of costs and benefits. EPA invites comment on whether the long-standing “wholly disproportionate” cost-to-benefit test is an appropriate measure of costs and benefits in determining best technology available for minimizing adverse environmental impact. EPA also invites comment on the use of the “significantly-greater” cost to benefit test in today's sample site-specific rule. EPA also invites comment on whether a test based on the concept that benefits should justify costs would be more appropriate, as is used in various other legal and regulatory contexts (see, e.g., Safe Drinking Water Act Section 1412(b)(6)(A) and Executive Order 12866, Section 1(b)(6)). EPA also invites public comment on whether variances are appropriate and, if so, what test or tests should be used for granting a variance., 992976=34. Metcalf Eddy. 1992. Brayton Point station monitoring program technical review. Prepared for USEPA., 985460=16. EPRI. 2000. Review of entrainment survival studies: 1970-2000. Prepared by EA Engineering Science and Technology for the Electric Power Research Institute, Palo Alto, CA., 241309=Further, studies of entrainment at five Hudson River power plants during the 1980s predicted year-class reductions ranging from six percent to 79 percent, depending on the fish species. [30] An updated analysis completed in 2000 of entrainment at three of these power plants predicted year-class reductions of up to 20 percent for striped bass, 25 percent for bay anchovy, and 43 percent for Atlantic tom cod, even without assuming 100 percent mortality of entrained organisms. [31] The New York Department of Environmental Conservation concluded that these reductions in year-class strength were “wholly unacceptable” and that any “compensatory responses to this level of power plant mortality could seriously deplete any resilience or compensatory capacity of the species needed to survive unfavorable environmental conditions.” [32], 998482=52. EPA's 2000 Section 316(b) Industry Survey identified 539 facilities that are subject to this proposed rule. EPA applied sample weights to the 539 facilities to account for non-sampled facilities and facilities that did not respond to the survey. The 539 analyzed facilities represent 550 facilities in the industry., 486521=These levels of burden are of particular concern to the Agency and to some State permitting agencies given the heavy permit workloads, pressure on resources available to permitting agencies, and the complexity of finalizing permits required to address 316(b) requirements. Recent data indicate that most States are struggling to meet their major permits issuance targets set for decreasing the permit backlog. For example, these data indicate that for major facilities engaged in the generation, transmission and/or distribution of electric energy for sale (SIC 4911), the permit backlog is 30.3 percent [64] , that is, higher than other categories of major permits (data indicate a backlog of 23.1 percent for major permits in general), [65] In 1998, the EPA Office of Inspector General identified the backlog in issuance of National Pollutant Discharge Elimination System permits as a material weakness pursuant to the Federal Managers' Financial Integrity Act (FMFIA). As part of its Fiscal Year 2001 FMFIA Report, EPA recommended that the permit backlog be identified as a continuing material weaknesses in its programs. EPA's Office of Water is examining strategies to correct this weakness. [66] The evidence does not, however, establish that section 316(b) determinations are a factor in the backlog in issuance of National Pollutant Discharge Elimination System permits., 897939=Executive Order 13132 (64 FR 43255, August 10, 1999) requires EPA to develop an accountable process to ensure “meaningful and timely input by State and local officials in the development of regulatory policies that have federalism implications. Policies that have federalism implications” are defined in the Executive Order to include regulations that have “substantial direct effects on the States, on the relationship between the national government and the States, or on the distribution of power and responsibilities among the various levels of government.”, 222654=Average Daily Cooling Water Intake in 1998. Of the estimated 129 nonutility plants that are potentially subject to this proposed rule, EPA estimates that in 1998, 4 plants had an average intake of not more than 10 million gallons per day (MGD), 12 had an average intake more than 10 MGD and not over 50 MGD, 20 had an average intake more than 50 MGD but not over 100 MGD, and 90 had an average intake over 100 MGD (three had zero or unreported intake). Note that coverage under the rule is based on design intake, not average intake flow. Of the 420 utility plants that are potentially subject to this proposed rule, EPA found that in 1998, 8 plants had an average intake of not more than 10 million gallons per day (MGD), 59 had an average intake more than 10 MGD and not over 50 MGD, 58 had an average intake more than 50 MGD but not over 100 MGD, and 288 had an average intake over 100 MGD (seven had zero or unreported intake)., 892672=(1)(i) That is a significant regulatory action under Executive Order 12866 or any successor order, and, 293656=EPA examined the annualized post-tax compliance costs of the proposed rule as a percentage of annual revenues, for each of the 550 facilities subject to this proposed rule. [52] The revenue estimates are facility-specific baseline projections from the Integrated Planning Model (IPM) for 2008 (see Section VIII. Economic Analysis of this document for a discussion of EPA's analyses using the IPM). The results of this analysis show that the vast majority of facilities subject to the proposed rule, 409 out of 550, or approximately 74 percent, would incur annualized costs of less than 1 percent of revenues. Of these, 331 facilities would incur compliance costs of less than 0.5 percent of revenues. Eighty-two facilities, or 15 percent, would incur costs of between 1 and 3 percent of revenues, and 46 facilities, or 8 percent, would incur costs of greater than 3 percent. Eleven facilities are estimated to be baseline closures, and for one facility, revenues are unknown. [53] Exhibit 2 below summarizes these findings., 994905=40. Swarbrick, S. and R.F. Ambrose. 1989. Technical report C: entrapment of juvenile and adult fish at SONGS. Prepared for Marine Review Committee., 996014=43. Lawler, Matusky Skelly Engineers. 1998. Lovett Generating Station Gunderboom system evaluation program 1998., 929627=Clean Water Act, 33 U.S.C. 1251 et seq.; unless otherwise noted., 863812=EPA estimated total annualized (post-tax) costs of compliance for the proposed rule to be $182 million ($2001). Of this total, $153 million is incurred by the private sector and $19.6 million is incurred by State and local governments that operate in-scope facilities. [82] Permitting authorities incur an additional $3.6 million to administer the rule, including labor costs to write permits and to conduct compliance monitoring and enforcement activities. EPA estimates that the highest undiscounted cost incurred by the private sector in any one year is approximately $480 million in 2005. The highest undiscounted cost incurred by government sector in any one year is approximately $42 million in 2005. Thus, EPA has determined that this rule contains a Federal mandate that may result in expenditures of $100 million or more for State, local, and Tribal governments, in the aggregate, or the private sector in any one year. Accordingly, EPA has prepared a written statement under § 202 of UMRA, which is summarized below., 993263=35. Gibson, M. 1995 (revised 1996). Comparison of trends in the finfish assemblages of Mt. Hope Bay and Narragansett Bay in relation to operations of the New England Power Brayton Point station. Rhode Island Division of Fish and Wildlife, Marine Fisheries Office., 186669=EPA focused its data collection activities on traditional utilities and nonutility power producers. Based on the 1982 Census of Manufacturers, these industries account for more than 90 percent of cooling water use in the United States. Traditional utilities and nonutility power producers that use cooling water were further limited to those plants that generate electricity by means of steam as the thermodynamic medium (steam electric) because they are associated with large cooling water needs. Other power producers generate electricity by means other than steam (e.g., gas turbines) and typically require only small amounts of cooling water, if any., 210701=The screener survey focused on nonutility and manufacturing facilities. EPA developed the sample frame (list of facilities) for the screener questionnaire using public data sources as described in the Information Collection Request (DCN 3-3084-R2 in Docket W-00-03). Facilities chosen for the screener questionnaire represented a statistical sample of the entire universe of nonutility and manufacturing facilities potentially subject to cooling water intake regulations. EPA did not conduct a census of all facilities (i.e. send a survey to all facilities) for the screener questionnaire because of the burden associated with surveying a large number of facilities. Rather, EPA refined the industry data using industry-specific sources to develop sample frames and mailing lists. EPA believes the sample frame was sufficient to characterize the operations of each industrial category. EPA sent the screener questionnaire to 2600 facilities identified in the sample frame as follows: (1) All identified steam electric nonutility power producers, both industrial self-generators and nonindustrial generators (1050 facilities, of which 853 responded); (2) and a sample of manufacturers that fell under four other industrial categories: Paper and allied products, chemical and allied products, petroleum and coal products, and primary metals (1550 facilities, of which 1217 responded). EPA adjusted the sample frame for the screener questionnaire to account for several categories of non-respondents, including facilities with incorrect address information, facilities no longer in operation, and duplicate mailings. Through follow-up phone calls and mailings, EPA increased the response rate for the screener questionnaire to 95 percent. The screener questionnaire was not sent to utilities, all of which were believed to be identified accurately using the publically-available data described above., 374629=The Palisades Nuclear Plant. Located in Covert, Michigan, the Palisades Nuclear Plant is a 812 MW (nameplate, steam capacity) facility with a pressurized water reactor, utilizing a mechanical draft wood cooling tower to condense the steam load of the plant. The reactor began operation in 1972 utilizing a once-through cooling system and subsequently converted to a closed-cycle, recirculating system at the beginning of 1974., 290399=Big Bend Power Station. Situated on Tampa Bay, Big Bend is a 1998 MW (nameplate, coal-fired steam) facility with 4 generating units. The facility first began operations in 1970 and added generating units in 1973, 1976, and 1985. Big Bend supplies cooling water to its once-through cooling water systems via two intake structures. When the facility added Unit 4 in 1985, regulators required the facility to install additional intake technologies. A fish handling and return system, as well as a fine-mesh traveling screen (used only during months with potentially high entrainment rates), were installed on the intake structure serving both the new Unit 4 and the existing Unit 3., 145657=The 1977 section 316(b) draft guidance suggests a general process for developing information needed to support section 316(b) decisions and presenting that information to the permitting authority. The process involves the development of a site-specific study of the environmental effects associated with each facility that uses one or more cooling water intake structures, as well as consideration of that study by the permitting authority in determining whether the facility must make any changes for minimizing adverse environmental impact. Where adverse environmental impact is present, the 1977 draft guidance suggests a stepwise approach that considers screening systems, size, location, capacity, and other factors., 891763=Executive Order 13211 on “Actions Concerning Regulations That Significantly Affect Energy Supply, Distribution, or Use” requires EPA to prepare a Statement of Energy Effects when undertaking regulatory actions identified as “significant energy actions.” For the purposes of Executive Order 13211, “significant energy action” means (66 FR 28355; May 22, 2001):, 980070=1. Proposed § 125.93 defines “existing facility” as any facility that commenced construction before January 17, 2002 and certain modifications and additions to such facilities., 461812=(b) Should the final rule adopt the 1977 Draft Guidance approach to defining adverse environmental impact as any entrainment or impingement damage caused by a cooling water intake structure?, 53069=Posted by Ben Jordi on June 22, 2015, 905304=EPA received more than 2000 comments on the Phase I proposed rule and NODA. In some cases these comments have informed the development of the Phase II rule proposal., 998986=53. IPM revenues for 2008 were not available for 11 facilities estimated to be baseline closures, 10 facilities not modeled by the IPM, and 9 facilities projected to have zero baseline revenues. EPA used facility-specific electricity generation and firm-specific wholesale prices as reported to the Energy Information Administration (EIA) to calculate the cost-to-revenue ratio for the 19 non-baseline closure facilities with missing information. The revenues for one of these facilities remained unknown., 1005813=69. In re Tennessee Valley Authority John Sevier Steam Plant, NPDES Permit No. TN0005436 (1986); In re Florida Power Corp. Crystal River Power Plant Units 1, 2, 3, NPDES Permit FL0000159 (1988); Chalk Point, MDE, State of Maryland, Discharge Permit, Potomac Electric Power Co., State Discharge Permit No. 81-DP-0627B, NPDES Permit No. MD0002658B (1987, modified 1991); Draft NJDEP Permit Renewal Including Section 316(a) Variance Determination and Section 316(b) BTA Decision: NJDEP Permit No. NJ0005622 (1993)., 153302=In January, 2001, EPA also attended technical workshops organized by the Electric Power Research Institute and the Utilities Water Act Group. These workshops focused on the presentation of key issues associated with different regulatory approaches considered under the Phase I proposed rule and alternatives for addressing 316(b) requirements., 360553=EPA requests comment on the cost-benefit provision in § 124.95. EPA placed several documents in the docket for the new facilities final rule (see docket items 2-034A and 2-034B) that summarized information from several States on the burdens of site-specific decisionmaking. To make section 316(b) determinations for large power plants in the Southeast in the late 1970s and early 1980s, EPA estimates a workload of as much as 650 person hours per permit and $25,000 contract dollars, with an additional (and potentially larger) resource investment by State permitting authorities. To reissue a permit to the Salem Nuclear Generating Station, the New Jersey Department of Environment Protection recently reviewed and considered a 36-volume permit application supported by 137 volumes of technical and reference materials. The facility filed its application in 1994; NJDEP made its decision in 2001. EPA invites comments on these burden estimates., 984472=13. EPRI. 2000. Review of entrainment survival studies: 1970-2000. Prepared by EA Engineering Science and Technology for the Electric Power Research Institute, Palo Alto, CA., 140305=Today's proposed rule partially fulfills EPA's obligation to comply with an Amended Consent Decree. The Amended Consent Decree was filed on November 22, 2000, in the United States District Court, Southern District of New York, in Riverkeeper Inc., et al. v. Whitman, No. 93 Civ 0314 (AGS), a case brought against EPA by a coalition of individuals and environmental groups. The original Consent Decree, filed on October 10, 1995, provided that EPA was to propose regulations implementing section 316(b) by July 2, 1999, and take final action with respect to those regulations by August 13, 2001. Under subsequent interim orders and the Amended Consent Decree, EPA has divided the rulemaking into three phases and is working under new deadlines. As required by the Amended Consent Decree, on November 9, 2001, EPA took final action on a rule governing cooling water intake structures used by new facilities (Phase I). 66 FR 65255 (December 18, 2001). The Amended Consent Decree also requires that EPA issue this proposal by February 28, 2002, and take final action by August 28, 2003 (Phase II). [2] The decree requires further that EPA propose regulations governing cooling water intake structures used, at a minimum, by smaller-flow power plants and factories in four industrial sectors (pulp and paper making, petroleum and coal products manufacturing, chemical and allied manufacturing, and primary metal manufacturing) by June 15, 2003, and take final action by December 15, 2004 (Phase III)., 448149=EPA's 1977 Draft Guidance assumes there will be adverse environmental impact whenever there is entrainment or impingement “damage” as a result of a cooling water intake structure, and focuses study on the magnitude of the impact to determine the appropriate technologies needed to minimize the impact. The evaluation criteria for assessing the magnitude of an adverse impact are broad and recommend consideration both in terms of absolute damage (e.g., numbers of fish) and percentages of populations. Although the UWAG and PSEG site-specific approaches contain different definitions of the term “adverse environmental impact,” there is general agreement among them that the focus should be on the health of critical aquatic populations or ecosystems, rather than on absolute numbers of fish and other aquatic organisms impinged or entrained by the cooling water intake structure. UWAG offered the most detailed and specific recommendations for making a determination of adverse environmental impact., 599203=EPA used an electricity market model, the Integrated Planning Model 2000 (IPM 2000), to identify potential economic and operational impacts of various regulatory options considered for proposal. Analyzed characteristics include changes in capacity, generation, revenue, cost of generation, and electricity prices. These changes are identified by comparing two scenarios: (1) The base case scenario (in the absence of Section 316(b) regulation); and (2) the post compliance scenario (after the implementation of Section 316(b) regulation). The results of these comparisons were used to assess the impacts of the proposed rule and two of the five alternative regulatory options considered by EPA. The following sections present EPA's economic analyses of the proposed rule and the alternative options., 984058=12. Mayhew, D.A., L.D. Jensen, D.F. Hanson, and P.H. Muessig. 2000. A comparative review of entrainment survival studies at power plants in estuarine environments. Environmental Science and Policy 3:S295-S301., 883085=Executive Order 12898 requires that, to the greatest extent practicable and permitted by law, each Federal agency must make achieving environmental justice part of its mission. E.O. 12898 provides that each Federal agency must conduct its programs, policies, and activities that substantially affect human health or the environment in a manner that ensures such programs, policies, and activities do not have the effect of excluding persons (including populations) from participation in, denying persons (including populations) the benefits of, or subjecting persons (including populations) to discrimination under such programs, policies, and activities because of their race, color, or national origin., 449322=In EPA's 1977 Draft Guidance, adverse environmental impact is defined as follows:, 622810=EPA used output from model run year 2008 to develop four measures used to identify changes in the economic and operational characteristics of the group of Phase II existing facilities. These measures include: (1) Total capacity, defined as the total available capacity of all facilities not identified as either baseline closures or economic closures resulting from the regulatory option; (2) total generation, calculated as the sum of generation from all facilities not identified as baseline closures or economic closures resulting from the regulatory option; (3) revenues, calculated as the sum of energy and capacity revenues; and (4) production costs per MWh of generation, calculated as the sum of total fuel and variable OM costs divided by total generation. Exhibit 8 presents the base case and post compliance results for each of these economic measures., 927374=Resource Conservation and Recovery Act, 42 U.S.C. 6901 et seq.; Safe Drinking Water Act, 42 U.S.C. 300f et.seq; Clean Water Act, 33 U.S.C. 1251 et seq.; Clean Air Act, 42 U.S.C. 7401 et seq., 525990=Facility B needs to make up for 15 percent of its share toward the estuary's performance standard for entrainment reduction. Again, using the standard assumption that entrained organisms behave like passive water molecules, the simplified 1:1 relationship between flow and entrainment from Facility A is also used for Facility B in this example. Therefore, Facility B needs to compensate for the environmental effects caused by 15 percent of its flow, or 52,500,000 gallons of resource use (0.15 * 350,000,000). Since Facility A has reduced entrainment 20 percent more than required, it has 150,000,000 gallons of resource use available for trading (0.20 * 750,000,000). A trade could be made between these two facilities because they are located on the same waterbody, they both must install entrainment controls, and the same species are present in their respective entrainment numbers. The average density ratio of organisms entrained multiplied by the gallons of resource use needed by Facility B would equal the gallons of resource use that Facility B would need to buy from Facility A in order to make up for the difference in the density of the species the two facilities entrain. Based on the discrepancy in the average density of organisms entrained as calculated above, in order to trade with Facility A, Facility B must purchase entrainment credits for 1.658 times as many gallons as it needs. Thus, Facility B needs to purchase 87,045,000 gallons of resource use from Facility A (1.658 * 52,500,000)., 510471=Entrainment and impingement are the main causes of adverse environmental impact from cooling water intake withdrawals. However, impingement reduction technologies are relatively inexpensive compared to entrainment reduction (see Chapter 2 of the Technical Development Document for the New Facility Rule, EPA-821-R-01-036, November 2001). Impingement reduction measures include decreasing intake velocities and installation of traveling screens with fish baskets and fish return systems. The implementation of a section 316(b) trading program for impingement may not justify the cost of monitoring susceptible species and administrating the program. EPA believes that a trading program that focuses on entrainment is more viable. However, EPA requests comment on whether to extend trading to include impingement of aquatic organisms., 217844=Since 1993, EPA has developed cooling water regulations as part of a collaborative effort with industry and environmental stakeholders, other Federal agencies, the academic and scientific communities as well as the general public. As such, EPA has reviewed and considered the many documents, demonstration studies, scientific analyses and historical perspectives offered in support of each phase of the regulatory process. For example, during the early stages of data gathering EPA created an internal library of reference documents addressing cooling water intake structure issues. This library currently holds over 2,800 documents, many of which were referenced in the rulemaking process and are contained in the record (see below for further information on the record). The library contains a thorough collection of a wide variety of documents, including over 80 316(b) demonstration documents, over 300 impingement and entrainment studies, over 100 population modeling studies, over 500 fish biology and stock assessment documents, over 350 biological studies commissioned by power generators, over 80 NPDES decisions and NPDES or SPDES-related documents, over 120 intake technology reports, over 10 databases on the electric power industry, and documents from interagency committees such as the Ohio River Valley Water Sanitation Commission (ORSANCO)., 886765=Executive Order 13045 (62 FR 19885, April 23, 1997) applies to any rule that (1) is determined to be “economically significant” as defined under Executive Order 12866, and (2) concerns an environmental health or safety risk that EPA has reason to believe might have a disproportionate effect on children. If the regulatory action meets both criteria, the Agency must evaluate the environmental health and safety effects of the planned rule on children, and explain why the planned regulation is preferable to other potentially effective and reasonably feasible alternatives considered by the Agency. This proposed rule is an economically significant rule as defined under Executive Order 12866. However, it does not concern an environmental health or safety risk that would have a disproportionate effect on children. Therefore, it is not subject to Executive Order 13045., 153691=On May 23, 2001, EPA held a day-long forum to discuss specific issues associated with the development of regulations under section 316(b) of the Clean Water Act. 66 FR 20658. At the meeting, 17 experts from industry, public interest groups, States, and academia reviewed and discussed the Agency's preliminary data on cooling water intake structure technologies that are in place at existing facilities and the costs associated with the use of available technologies for reducing impingement and entrainment. Over 120 people attended the meeting., 126297=Today's proposed rule is issued under the authority of sections 101, 301, 304, 306, 308, 316, 401, 402, 501, and 510 of the Clean Water Act (CWA), 33 U.S.C. 1251, 1311, 1314, 1316, 1318, 1326, 1341, 1342, 1361, and 1370. This proposal partially fulfills the obligations of the U.S. Environmental Protection Agency (EPA) under a consent decree in Riverkeeper Inc., et al. v. Whitman, United States District Court, Southern District of New York, No. 93 Civ. 0314 (AGS)., 740992=EPA's analysis of improvements in recreational fishing opportunities in the Tampa Bay Region relies on a subset of the 1997 Marine Recreational Fishery Statistics Survey (MRFSS) combined with the 1997 Add-on MRFSS Economic Survey (AMES) and the follow-up telephone survey for the Southeastern United States. The Agency evaluated five species and species groups in the model: drums (including red and black drum), spotted seatrout, gamefish, snapper-grouper, and all other species. Impingement and entrainment was found to affect black drum, spotted seatrout, and sheepshead which is included in the snapper-grouper species category., 404910=EPA also examined the annualized post-tax compliance costs of the waterbody/capacity-based option as a percentage of annual revenues to assess the economic practicability of this alternative option. This analysis was conducted at the facility and firm levels. The revenue estimates are the same as those used in the analysis in Section VI.A.3 above: facility-specific baseline projections from the Integrated Planning Model (IPM) for 2008. The results at the facility level are similar to those of the proposed rule: 355 out of 550 facilities, or 65 percent, would incur annualized costs of less than 0.5 percent of revenues; 60 facilities would incur costs of between 0.5 and 1 percent of revenues; 57 facilities would incur costs of between 1 and 3 percent; and 67 facilities would incur costs of greater than 3 percent. Nine facilities are estimated to be baseline closures, and for one facility, revenues are unknown. Exhibit 4 below summarizes these findings., 378608=EPA also considered an alternate technology-based option in which closed-cycle, recirculating cooling systems would be required for all facilities on certain waterbody types. Under this option, EPA would group waterbodies into the same five categories as in today's proposal: (1) Freshwater rivers or streams, (2) lakes or reservoirs, (3) Great Lakes, (4) tidal rivers or estuaries; and (5) oceans. Because oceans, estuaries and tidal rivers contain essential habitat and nursery areas for the vast majority of commercial and recreational important species of shell and fin fish, including many species that are subject to intensive fishing pressures, these waterbody types would require more stringent controls based on the performance of closed-cycle, recirculating cooling systems. EPA discussed the susceptibility of these waters in a Notice of Data Availability (NODA) for the new facility rule (66 FR 28853, May 25, 2001) and invited comment on documents that may support its judgment that these waters are particularly susceptible to adverse impacts from cooling water intake structures. In addition, the NODA presented information regarding the low susceptibility of non-tidal freshwater rivers and streams to impacts from entrainment from cooling water intake structures., 144449=Since the Fourth Circuit remanded EPA's section 316(b) regulations in 1977, NPDES permit authorities have made decisions implementing section 316(b) on a case-by-case, site-specific basis. EPA published draft guidance addressing section 316(b) implementation in 1977. See Draft Guidance for Evaluating the Adverse Impact of Cooling Water Intake Structures on the Aquatic Environment: Section 316(b) 92 (U.S. EPA, 1977). This draft guidance describes the studies recommended for evaluating the impact of cooling water intake structures on the aquatic environment and recommends a basis for determining the best technology available for minimizing adverse environmental impact. The 1977 section 316(b) draft guidance states, “The environmental-intake interactions in question are highly site-specific and the decision as to best technology available for intake design, location, construction, and capacity must be made on a case-by-case basis.” (Section 316(b) Draft Guidance, U.S. EPA, 1977, p. 4). This case-by-case approach also is consistent with the approach described in the 1976 Development Document referenced in the remanded regulation., 905516=In January, 2001, EPA also attended technical workshops organized by the Electric Power Research Institute and the Utilities Water Action Group. These workshops focused on the presentation of key issues associated with different regulatory approaches considered under the Phase I proposed rule and alternatives for addressing 316(b) requirements., 1003543=63. See communications from Mr. William McCracken, Chief of the Permits Section, Surface Water Quality Division, Michigan Department of Environmental Quality, January 24, 2002., 637722=This section presents the market level and Phase II existing facility level impacts of the alternative waterbody/capacity-based option. This option would require facilities that withdraw water from an estuary, tidal river, or ocean and that meet certain intake flow requirements, to reduce their intake capacity to a level that can be attained by a closed-cycle, recirculating cooling system. This requirement would be met within five to ten years of promulgation of the final rule (2004 to 2012) depending on when a permittee's first NPDES permit after promulgation expires. The impacts of compliance with this option are calculated using base case and post compliance results for model run year 2013. This run year reflects the long-term operational changes of the regulatory option with all in-scope facilities operating in their post compliance condition., 109478=Comments on this proposed rule and Information Collection Request (ICR) must be received or postmarked on or before midnight July 8, 2002., 911582=Dated: February 28, 2002., 484996=Some examples of the workload that can be required for permitting agencies to implement a site-specific approach follow. Since, 1999, EPA New England has devoted 0.6 full-time employees a year, including a permit writer, a biologist and attorney, to reissuance of a permit for the Pilgrim Nuclear Power Station (PNPS), [62] At the Seabrook Nuclear Power Station, EPA Region I has invested about one full-time employee per year over four years to determine the nature and degree of adverse environmental impacts and the appropriate permit conditions the permit renewal. The State of New York Department of Environmental Conservation's Division of Fish, Wildlife and Marine Resources spent $169,587 in 1997 and $167,564 in 1998 to review cooling systems at steam-motivated electricity generating facilities. The Division estimated a total effort expenditure of approximately 2.2 full-time employees in 1997 and 1998 and 4.3 full-time employees for 2001. These figures do not include the level of effort associated with review time spent by the Division of Environmental Permits, the Division of Water, or the Division of Legal Affairs. (See Docket W-00-03.) Because of workload concerns, some States have requested that EPA adopt regulations that set clear requirements specifying standards of performance, monitoring and compliance. [63], 655845=This section presents the market level and Phase II existing facility level impacts of the closed-cycle, recirculating wet cooling everywhere option. This option requires that existing facilities with a design intake flow 50 MGD or more reduce their total design intake flow to a level that can be attained by a closed-cycle recirculating cooling water system. In addition, facilities in specified circumstances would have to install design and construction technologies to minimize impingement mortality and entrainment. Existing facilities would be required to comply within five to ten years of promulgation of the final rule (2004 to 2012) depending on when a permittee's first NPDES permit after promulgation expires. The impacts of compliance with this option are calculated using base case and post compliance results for model run year 2013 in order to reflect the long-term operational changes of the rule with all in-scope facilities operating in their post compliance condition., 1011353=78. The comparison presented in Exhibit 7 includes information for facilities modeled in IPM 2000 only. Of the 539 existing facilities subject to the section 316(b) Phase II rule, nine are not modeled in the IPM 2000: Three facilities are in Hawaii, and one is in Alaska. Neither state is represented in the IPM 2000. One facility is identified as an “Unspecified Resource” and does not report on any EIA forms. Four facilities are on-site facilities that do not provide electricity to the grid. The 530 existing facilities were weighted to account for facilities not sampled and facilities that did not respond to the EAP's industry survey and thus represent a total of 540 facilities industry-wide., 1013970=83. The North American Industry Classification System (NAICS) replaced trhe Standard Industrial Classification (SIC) System as of October 1, 2000. The data sources EPA used to identify the parent entities of the facilities subject to this rule did not provide NAICS codes at the time of analysis., 979572=[FR Doc. 02-5597 Filed 4-8-02; 8:45 am], 925945=The Clean Water Act, 33 U.S.C. 1251 et seq., 990539=28. Watson, R. and D. Pauly. 2001. Systematic distortions in world fisheries catch trends. Nature 414-534-536., 985046=15. Mayhew, D.A., L.D. Jensen, D.F. Hanson, and P.H. Muessig. 2000. A comparative review of entrainment survival studies at power plants in estuarine environments. Environmental Science and Policy 3:S295-S301., 147182=On November 9, 2001, EPA took final action on regulations governing cooling water intake structures at new facilities. 66 FR 65255 (December 18, 2001). The final new facility rule (Phase I) established requirements applicable to the location, design, construction, and capacity of cooling water intake structures at new facilities that withdraw at least two (2) million gallons per day (MGD) and use at least twenty-five (25) percent of the water they withdraw solely for cooling purposes. EPA adopted a two-track approach. Under Track I, for facilities with a design intake flow more than 10 MGD, the capacity of the cooling water intake structure is restricted, at a minimum, to a level commensurate with that which could be attained by use of a closed-cycle recirculating system. For facilities with a design intake flow more than 2 MGD, the design through-screen intake velocity is restricted to 0.5 ft/s and the total quantity of intake is restricted to a proportion of the mean annual flow of a freshwater river or stream, or to maintain the natural thermal stratification or turnover patterns (where present) of a lake or reservoir except in cases where the disruption is determined to be beneficial to the management of fisheries for fish and shellfish by any fishery management agency(ies), or to a percentage of the tidal excursions of a tidal river or estuary. In addition, an applicant with intake capacity greater than 10 MGD must select and implement an appropriate design and construction technology for minimizing impingement mortality and entrainment if certain environmental conditions exist. (Applicants with 2-10 MGD flows are not required to reduce capacity but must install technologies for reducing entrainment at all locations.) Under Track II, the applicant has the opportunity to demonstrate that impacts to fish and shellfish, including important forage and predator species, within the watershed will be comparable to these which it would achieve were it to implement the Track I requirements for capacity and design velocity. This demonstration can include the use of restoration measures such as habitat enhancement or fish restocking programs. Proportional flow requirements also apply under Track II., 622055=This section presents the results of the facility impact analysis for the proposed rule, again using the IPM 2000 analysis of the alternative waterbody/capacity-based option for the four NERC regions where the compliance requirements of the proposed rule and the analyzed option are identical. [79] EPA used the IPM 2000 results to analyze two potential facility level impacts of the proposed section 316(b) Phase II Rule: (1) potential changes in the economic and operational characteristics of the group of Phase II existing facilities and (2) potential changes to individual facilities within the group of Phase II existing facilities., 989134=25. EPA Region IV. 1986. Findings and determination under 33 U.S.C. 1326, In the Matter of Florida Power Corporation Crystal River Power Plant Units 1, 2, and 3, NPDES permit no. FL0000159., 181934=New facility means any building, structure, facility, or installation that meets the definition of a “new source” or “new discharger” in 40 CFR 122.2 and 122.29(b)(1), (2), and (4) and is a greenfield or stand-alone facility; commences construction after January 17, 2002; and uses either a newly constructed cooling water intake structure, or an existing cooling water intake structure whose design capacity is increased to accommodate the intake of additional cooling water. New facilities include only “greenfield” and “stand-alone” facilities. A greenfield facility is a facility that is constructed at a site at which no other source is located, or that totally replaces the process or production equipment at an existing facility (see 40 CFR 122.29(b)(1)(i) and (ii)). A stand-alone facility is a new, separate facility that is constructed on property where an existing facility is located and whose processes are substantially independent of the existing facility at the same site (see 40 CFR 122.29(b)(1)(iii)). New facility does not include new units that are added to a facility for purposes of the same general industrial operation (for example, a new peaking unit at an electrical generating station)., 994590=39. Kastendiek, J. and K. Parker. 1988. Interim technical report: midwater and benthic fish. Prepared for Marine Review Committee., 273109=Several additional factors suggest that the performance levels discussed above and described in more detail in Chapter 5 of the Technical Development Document for the Final New Facility Rule can be improved. First, some of the performance data reviewed is from the 1970's and 1980's and does not reflect recent developments and innovations (e.g., aquatic filter barrier systems, sound barriers). Second, these conventional barrier and return system technologies have not been optimized on a widespread level to date, as would be encouraged by this rule. Third, EPA believes that many facilities could achieve further reductions (estimated at 15-30 percent) in impingement mortality and entrainment by providing for seasonal flow restrictions, variable speed pumps, and other operational measures and innovative flow reduction alternatives. For additional discussion, see section 5.5.11 in the Technical Development Document for the new facility rule., 602269=EPA used an electricity market model to account for the dynamic nature of the electricity market when analyzing the potential economic impacts of Section 316(b) regulation. The IPM 2000 is a long-term general equilibrium model of the domestic electric power market which simulates the least-cost dispatch solution for all generation assets in the market given a suite of user-specified constraints. [71] The impacts of compliance with a given regulatory option are defined as the difference between the model output for the base case scenario and the model output for the post-compliance scenario. [72], 131696=EPA and State permitting authorities should use existing guidance and information to form their best professional judgment in issuing permits to existing facilities. EPA's draft Guidance for Evaluating the Adverse Impact of Cooling Water Intake Structures on the Aquatic Environment: Section 316(b) (May 1, 1977), continues to be applicable for existing facilities pending EPA's issuance of final regulations under section 316(b). Two background papers that EPA prepared in 1994 and 1996 to describe cooling water intake technologies being used or tested for minimizing adverse environmental impact also contain information that could be useful to permit writers. (Preliminary Regulatory Development, Section 316(b) of the Clean Water Act, Background Paper Number 3: Cooling Water Intake Technologies (1994) and Draft Supplement to Background Paper Number 3: Cooling Water Intake Technologies.) Fact sheets from recent 316(b) State and Regional permits are another source of potentially relevant information. The evaluations of the costs and efficacies of technologies presented in the Technical Development Document for the Final Regulations Addressing Cooling Water Intake Structures for New Facilities, EPA-821-R-01-036, November 2001 may also be relevant on some cases, although costs for some technologies will differ between new and existing facilities. EPA and State decision-makers retain the discretion to adopt approaches on a case-by-case basis that differ from applicable guidance where appropriate. Any decisions on a particular facility should be based on the requirements of section 316(b)., 941567=Existing facility means any facility that commenced construction before January 17, 2002; and, 991427=30. Boreman J. and P. Goodyear. 1988. Estimates of entrainment mortality for striped bass and other fish species inhabiting the Hudson River Estuary. American Fisheries Society Monograph 4:152-160., 995552=42. Impingement and entrainment data were obtained from the 2000 Draft Habitat Conservation Plan for the Pittsburg and Contra Costa facilities. Please see EPA's Case Study Document for detailed information on EPA's evaluation of impingement and entrainment at these facilities., 603060=Due to the lead time required in running an integrated electricity market model, EPA first completed an electricity market model analysis of two options with costs higher than those in today's proposed option: the “Closed-Cycle, Recirculating Wet Cooling based on Waterbody type and Intake Capacity” Option (waterbody/capacity-based option) and the “Closed-Cycle, Recirculating Wet Cooling Everywhere” Option (all cooling towers option). Both of the analyzed options are more stringent in aggregate than the proposed rule and provide a ceiling on its potential economic impacts. Because of limited time after final definition of the rule as proposed herein, EPA was unable to rerun the IPM model with an analytic option that completely matches the proposed rule's specifications. As a result, EPA adopted a two-step approach for the aggregate impact analysis. First, EPA identified that for certain regional electricity markets that do not have any facilities costed with a closed-cycle recirculating cooling water system, the waterbody/capacity-based option, as analyzed, matches the technology compliance requirements of the proposed rule. [73] These are the North American Electric Reliability Council (NERC) regions that do not border oceans and estuaries: ECAR, MAIN, MAPP, SPP. [74] Accordingly, EPA was able to interpret the results of the IPM analysis for the waterbody/capacity-based option for these four NERC regions as representative of the proposed rule in these regions. As shown below, EPA found very small or no impacts in these NERC regions. Second, EPA identified and compared data relevant to determination of rule impacts for these four NERC regions and the remaining NERC regions for which the IPM analysis would not be indicative of the proposed rule. Finding no material differences in these underlying characteristics between the two groups of NERC regions, EPA concluded that the finding of no significant impacts from the IPM-based analysis of the four NERC regions identified above, could also be extended to the remaining six NERC regions. Therefore, EPA believes that the proposed option, which would apply the same requirements (e.g., based on technologies such as fine mesh screens, filter fabric barrier nets, or fish return systems) to facilities in all NERC regions, would, in total, have very small or no impacts. The remainder of this section presents an assessment of the impacts of the proposed rule using the market and Phase II existing facility-level results from the IPM 2000 analysis of the alternative waterbody/capacity-based option for these four NERC regions. A more detailed analysis of all NERC regions under the alternative waterbody/capacity-based option is presented in Section VIII.B.2 below., 992247=32. New York Department of Environmental Conservation (NYDEC). 2000. Internal memorandum provided to the USEPA on NYDEC's position on SPDES permit renewals for Roseton, Bowline Point 1 2, and Indian Point 2 3 generating stations., 110879=EPA has prepared an Information Collection Request (ICR) under the Paperwork Reduction Act for this proposed rule (EPA ICR number 2060.01). For further information or a copy of the ICR contact Susan Auby by phone at (202) 260-4901, e-mail at auby.susan@epamail.epa.gov or download off the internet at http://www.epa.gov/icr. Send comments on the Agency's need for this information, the accuracy of the burden estimates, and any suggested methods for minimizing respondent burden (including the use of automated collection techniques) to the following addresses. Please refer to EPA ICR Number 2060.01 in any correspondence., 593193=EPA's NPDES permitting regulations at 40 CFR 122.49 contain a list of Federal laws that might apply to federally issued NPDES permits. These include the Wild and Scenic Rivers Act, 16 U.S.C. 1273 et seq.; the National Historic Preservation Act of 1966, 16 U.S.C. 470 et seq.; the Endangered Species Act, 16 U.S.C. 1531 et seq.; the Coastal Zone Management Act, 16 U.S.C. 1451 et seq.; and the National Environmental Policy Act, 42 U.S.C. 4321 et seq. See 40 CFR 122.49 for a brief description of each of these laws. In addition, the provisions of the Magnuson-Stevens Fishery Conservation and Management Act, 16 U.S.C. 1801 et seq., relating to essential fish habitat might be relevant. Nothing in this proposed rulemaking would authorize activities that are not in compliance with these or other applicable Federal laws., 861825=Title II of the Unfunded Mandates Reform Act of 1995 (UMRA), Pub. L. 104-4, establishes requirements for Federal agencies to assess the effects of their regulatory actions on State, local, and Tribal governments and the private sector. Under section 202 of UMRA, EPA generally must prepare a written statement, including a cost-benefit analysis, for proposed and final rules with “Federal mandates” that may result in expenditures to State, local, and Tribal governments, in the aggregate, or to the private sector, of $100 million or more in any one year. Before promulgating an EPA rule for which a written statement is needed, section 205 of UMRA generally requires EPA to identify and consider a reasonable number of regulatory alternatives and adopt the least costly, most cost-effective, or least burdensome alternative that achieves the objectives of the rule. The provisions of section 205 do not apply when they are inconsistent with applicable law. Moreover, section 205 allows EPA to adopt an alternative other than the least costly, most cost-effective, or least burdensome alternative if the Administrator publishes with the final rule an explanation why that alternative was not adopted. Before EPA establishes any regulatory requirements that may significantly or uniquely affect small governments, including Tribal governments, it must have developed under section 203 of UMRA a small government agency plan. The plan must provide for notifying potentially affected small governments, enabling officials of affected small governments to have meaningful and timely input in the development of EPA regulatory proposals with significant intergovernmental mandates, and informing, educating, and advising small governments on compliance with regulatory requirements., 992661=33. Morningside College. 1982. Missouri River aquatic ecology studies. Prepared for Iowa Public Service Company, Sioux City, Iowa., 469746=EPA's draft 1977 draft guidance and development document provide guidance on how to select best technology for minimizing adverse environmental impact but are silent on the role of costs and benefits in determining best technology available for minimizing adverse environmental impact. In 1979, the U.S. Court of Appeals for the First Circuit found that cost is an acceptable consideration in section 316(b) determinations. Seacoast Anti-Pollution League v. Costle, 597 F.2d 306, 311 (1st Cir. 1979). Over the years, section 316(b) determinations have focused on whether the costs of technologies employed would be wholly disproportionate to the environmental gains to be derived from their use. See e.g., Seacoast Anti-Pollution League v. Costle; Decision of the General Counsel No. 63 (July 29, 1977); Decision of the General Counsel No. 41 (June 1, 1976)., 53708=Posted by Ben Jordi on June 4, 2015, 259574=EPA discussed these concepts in a Notice of Data Availability (NODA) for the new facility rule (66 FR 28853, May 25, 2001) and invited comment on a number of documents which may support a judgment that the reproductive strategies of tidal river and estuarine species, together with other physical and biological characteristics of those waters, which make them more susceptible than other waterbodies to impacts from cooling water intake structures. In addition to these documents, the NODA presented information regarding the low entrainment susceptibility of non-tidal freshwater rivers and streams to cooling water intake structure impacts. This information also may be relevant in determining whether tidal rivers and estuaries are more sensitive to cooling water intake structures than some parts of other waterbodies., 150528=In addition to outreach to industry groups, environmental groups, and other government entities in the development, testing, refinement, and completion of the 316(b) survey, [3] which has been used as a source of data for the Phase II proposal, EPA conducted two public meetings on 316(b) issues. In June 1998, in Arlington, Virginia (63 FR 27958) EPA conducted a public meeting focused on a draft regulatory framework for assessing potential adverse environmental impacts from impingement and entrainment. In September, 1998, in Alexandria, Virginia (63 FR 40683) EPA conducted a public meeting focused on technology, cost, and mitigation issues. In addition, in September 1998 and April 1999, EPA staff participated in technical workshops sponsored by the Electric Power Research Institute on issues relating to the definition and assessment of adverse environmental impact. EPA staff have participated in other industry conferences, met upon request on numerous occasions with industry representatives, and met on a number of occasions with representatives of environmental groups., 997971=50. Schmitt, R.J. and C.W. Osenberg. 1996. Detecting ecological impacts. Academic Press, San Diego, CA., 534980=The NPDES regulations that establish the application process at 40 CFR 122.21(d)(2) generally require that facilities currently holding a permit submit information and data 180 days prior to the end of the permit term, which is five years. If you are the owner or operator of a facility that is subject to this proposed rule, you would be required to submit the information that is required under 40 CFR 122.21(r)(2), (3), and (5) and § 125.95 of today's proposed rule with your application for permit reissuance. This section provides a general discussion of the proposed application requirements for Phase II existing facilities at the outset and then goes into more detail in subsequent subsections. The Director would review the information you provide in your application including the information submitted in compliance with 40 CFR 122.21(r) and § 125.95 and would confirm whether your facility should be regulated as an existing facility under these proposed regulations or as a new facility under regulations that were published on December 19, 2001 (66 FR 65256) and establish the appropriate requirements to be applied to the cooling water intake structure(s)., 1005486=68. This state budget outlook is supported by a report published on October 31, 2001, by the National Conference of State Legislatures (NCSL)., 53768=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 644816=The IPM 2000 results from model run year 2013 were used to analyze two potential facility level impacts associated with the alternative waterbody/capacity-based option: (1) Potential changes in the economic and operational characteristics of the group of Phase II existing facilities and (2) potential changes to individual facilities within the group of Phase II existing facilities. EPA analyzed economic closures and changes in production costs to assess impacts to all Phase II existing facilities resulting from the alternative option. Exhibit 11 below presents the results from this analysis, by NERC region., 766822=EPA determined urban and rural population by State by summing the 1999 county populations for the State's urban and rural counties respectively. EPA determined each county's urban/rural status using definitions developed by the U.S. Department of Agriculture (as included in NORSIS 1997). These index values are based upon the estimated number of angling days by residents living near the facility. The index value for each facility is a measure of the facility's share of the total angling days estimated at all in scope facilities located on a similar waterbody., 289703=Lovett Generating Station. A 495 MW facility (nameplate, gas-fired steam), Lovett is located in Tomkins Cove, New York, along the Hudson River. The facility first began operations in 1949 and has 3 generating units with once-through cooling systems. In 1994, Lovett began the testing of an aquatic filter fabric barrier system to reduce entrainment, with a permanent system being installed the following year. Improvements and additions were made to the system in 1997, 1998, and 1999, with some adjustments being accepted as universal improvements for all subsequent installations of this vendor's technology at other locations., 248459=Lovett Generating Station. The Lovett Generating Station is located in Tompkins Cove, New York, on the western shore of the Hudson River. As a method of reducing ichthyoplankton (free floating fish eggs and larvae) entrainment at the Lovett station, the Gunderboom Marine Life Exclusion System was installed in 1995 at the Unit 3 intake structure. Gunderboom is a woven mesh material initially designed to prevent waterborne pollutants from entering shoreline environments during construction or dredging activities. Since its initial installation, the Gunderboom system has undergone a series of tests and modifications to resolve problems with fabric clogging, anchoring, and the boom system. Data from testing in 1998 demonstrated that with the Gunderboom system in place, entrainment of eggs, larvae, and juveniles was reduced by 80 percent. [43], 897085=Executive Order 12866 and the President's memorandum of June 1, 1998, require each agency to write all rules in plain language. We invite your comments on how to make this proposed rule easier to understand. For example: Have we organized the material to suit your needs? Are the requirements in the rule clearly stated? Does the rule contain technical language or jargon that is not clear? Would a different format (grouping and order of sections, use of headings, paragraphing) make the rule easier to understand? Would more (but shorter) sections be better? Could we improve clarity by adding tables, lists, or diagrams? What else could we do to make the rule easier to understand?, 54376=Posted by Ben Jordi on June 1, 2015, 1000871=57. Fisher, A. and R. Raucher. 1984. Intrinsic benefits of improved water quality: Conceptual and empirical perspectives. Advances in Applied Micro-Economics. 3:37-66., 606911=Five measures developed from the IPM 2000 output are used to assess market level impacts associated with Section 316(b) regulation: (1) Total capacity, defined as the total available capacity of all facilities not identified as either baseline closures or economic closures resulting from the regulatory option; (2) new capacity, defined as total capacity additions from new facilities; (3) total generation, calculated as the sum of generation from all facilities not identified as baseline closures or economic closures resulting from the regulatory option; (4) production costs per MWh of generation, calculated as the sum of total fuel and variable OM costs divided by total generation; and (5) energy prices, defined as the prices received by facilities for the sale of electricity. Exhibit 6 presents the base case and post compliance results for each of these economic measures., 127094=Section 316(b) of the CWA provides that any standard established pursuant to section 301 or 306 of the CWA and applicable to a point source must require that the location, design, construction, and capacity of cooling water intake structures reflect the best technology available (BTA) for minimizing adverse environmental impact. Today's proposed rule would establish requirements, reflecting the best technology available for minimizing adverse environmental impact, applicable to the location, design, construction, and capacity of cooling water intake structures at Phase II existing power generating facilities that withdraw at least fifty (50) MGD of cooling water from waters of the U.S. Today's proposal would define a cooling water intake structure as the total physical structure, including the pumps, and any associated constructed waterways used to withdraw water from waters of the U.S. Cooling water absorbs waste heat rejected from processes employed or from auxiliary operations on a facility's premises. Single cooling water intake structures might have multiple intake bays. In 1977 EPA issued draft guidance for determining the best technology available to minimize adverse environmental impact from cooling water intake structures. In the absence of section 316(b) regulations or final guidance, the 1977 draft guidance has served as applicable guidance for section 316(b) determinations. See Draft Guidance for Evaluating the Adverse Impact of Cooling Water Intake Structures on the Aquatic Environment: Section 316(b) 92 (U.S. EPA, 1977). Administrative determinations in several permit proceedings also have served as de facto guidance., 296337=Facility-leval compliance costs are low compared to facility-level revenues. However, the firms owning the facilities subject to the proposed rule may experience greater impacts if they own more than one facility with compliance costs. EPA therefore also analyzed the economic practicability of this proposed rule at the firm level. EPA identified the domestic parent entity of each in-scope facility and obtained their sales revenue from publicly available data sources (the 1999 Forms EIA-860A, EIA-860B, and EIA-861; and the Dun and Bradstreet database) as well as EPA's 2000 Section 316(b) Industry Survey. This analysis showed that 131 unique domestic parent entities own the facilities subject to this proposed rule. EPA compared the aggregated annualized post-tax compliance costs for each facility owned by the 131 parent entities to the firms' total sales revenue. Based on the results from this analysis, EPA concludes that the proposed rule will be economically practicable at the firm level., 215231=From 1993 to the present, EPA has conducted site visits to numerous power generating stations around the country to observe cooling water intake structure design and operations and document examples of different cooling water intake structure configurations. EPA has visited the plants (each with either a once-through or closed-cycle, recirculating cooling system, except as noted) listed below:, 242404=In contrast, facilities sited on waterbodies previously impaired by anthropogenic activities such as channelization may demonstrate limited entrainment and impingement losses. The Neal Generating Complex facility, located near Sioux City, Iowa, on the Missouri River is coal-fired and utilizes once-through cooling systems. According to a ten-year study conducted from 1972-82, the Missouri River aquatic environment near the Neal complex was previously heavily impacted by channelization and very high flow rates meant to enhance barge traffic and navigation. [33] These anthropogenic changes to the natural river system resulted in significant losses of habitat necessary for spawning, nursery, and feeding. At this facility, fish impingement and entrainment by cooling water intakes were found to be minimal., 917085=The Clean Water Act, 33 U.S.C. 1251 et seq., 340133=Proposed § 125.94(e) provides that the Director could establish more stringent requirements relating to the location, design, construction, or capacity of a cooling water intake structure at a Phase II existing facility than those that would be required based on the proposed performance standards in the rule (§ 125.94(b)), or based on the proposed site-specific determination of best technology allowed under the rule (§ 125.94(c)), where compliance with the proposed requirements of § 125.94(b) or (c) would not meet the requirements of applicable Tribal, State or other Federal law. The relevant State law may include, but is not necessarily limited to, State or Tribal water quality standards, including designated uses, criteria, and antidegradation provisions; endangered or threatened species or habitat protection provisions; and other resource protection requirements. The term “other Federal law” is intended to denote Federal laws others than section 316(b), and could include, but not be limited to, the Endangered Species Act, 16 U.S.C. 1531 et seq., the Coastal Zone Management Act, 16 U.S.C. 1451 et seq., the Fish and Wildlife Coordination Act, 16 U.S.C. 661 et seq., the Wild and Scenic Rivers Act, 16 U.S.C. 1273 et seq., and potentially the Magnuson-Stevens Fishery Conservation and Management Act, 16 U.S.C. 1801 et seq. See 40 CFR 122.49 for a brief description of these and certain other laws. Note that these laws may apply to federally issued NPDES permits independent of this proposed rule., 726907=In conclusion, several issues and limitations in the impingement and entrainment data for the Ohio case study (e.g., the reliance on data for one year, nearly 25 years ago), and the many stressors that affect the river (especially in the 1977 time frame), suggest that the results obtained by EPA underestimate the benefits of the rule relative to current Ohio River conditions. The results are also likely to underestimate the benefits value of impingement and entrainment reductions at other inland river facilities., 993711=36. Southern California Edison. 1988. Report on 1987 data: marine environmental analysis and interpretation, San Onofre Nuclear Generating Station., 143574=In 1977, fifty-eight electric utility companies challenged these regulations, arguing that EPA had failed to comply with the requirements of the Administrative Procedure Act (APA) in promulgating the rule. Specifically, the utilities argued that EPA had neither published the Development Document in the Federal Register nor properly incorporated the document into the rule by reference. The United States Court of Appeals for the Fourth Circuit agreed and, without reaching the merits of the regulations themselves, remanded the rule. Appalachian Power Co. v. Train, 566 F.2d 451 (4th Cir. 1977). EPA later withdrew part 402. 44 FR 32956 (June 7, 1979). 40 CFR 401.14 remains in effect., 209908=In 1997, EPA estimated that over 400,000 facilities could potentially be subject to a cooling water intake regulation. Given the large number of facilities potentially subject to regulation, EPA decided to focus its data collection efforts on six industrial categories that, as a whole, are estimated to account for over 99 percent of all cooling water withdrawals. These six sectors are: Utility Steam Electric, Nonutility Steam Electric, Chemicals Allied Products, Primary Metals Industries, Petroleum Coal Products, and Paper Allied Products. There are about 48,500 facilities in these six categories. EPA believes that this approach provides a sound basis for assessing best technologies available for minimizing adverse environmental impacts., 990187=27. EPA Region IV. 1979. Brunswick Nuclear Steam Electric Generating Plant of Carolina Power and Light Company, historical summary and review of section 316(b) issues., 985819=17. Personal communication, D. Hart (EPA) and L. Kline (ASMFC), 2001., 889688=Executive Order 13158 (65 FR 34909, May 31, 2000) requires EPA to “expeditiously propose new science-based regulations, as necessary, to ensure appropriate levels of protection for the marine environment.” EPA may take action to enhance or expand protection of existing marine protected areas and to establish or recommend, as appropriate, new marine protected areas. The purpose of the Executive Order is to protect the significant natural and cultural resources within the marine environment, which means “those areas of coastal and ocean waters, the Great Lakes and their connecting waters, and submerged lands thereunder, over which the United States exercises jurisdiction, consistent with international law.”, 860703=EPA requests comments on the Agency's need for this information, the accuracy of the provided burden estimates, and any suggested methods for minimizing respondent burden, including through the use of automated collection techniques. Send comments on the ICR to the Director, Collection Strategies Division; U.S. Environmental Protection Agency (2822); 1200 Pennsylvania Ave., NW. Washington, DC 20460; and to the Office of Information and Regulatory Affairs; Office of Management and Budget; 725 17th Street, NW.; Washington, DC 20503, marked “Attention: Desk Officer for EPA.” Include the ICR number in any correspondence. Because OMB is required to make a decision concerning the ICR between 30 and 60 days after April 9, 2002, a comment is best assured of having its full effect if OMB receives it by May 9, 2002. The final rule will respond to any OMB or public comments on the information collection requirements contained in this proposal., 988210=22. Florida Power and Light Company. 1995. Assessment of the impacts at the St. Lucie Nuclear Generating Plant on sea turtle species found in the inshore waters of Florida., 989685=26. Thurber, N.J. and D.J. Jude. 1985. Impingement losses at the D.C. Cook Nuclear Power Plant during 1975-1982 with a discussion of factors responsible and possible impact on local populations. Special report no. 115 of the Great Lakes Research Division, Great Lakes and Marine Waters Center, University of Michigan., 109877=Public comments regarding this proposed rule should be submitted by mail to: Cooling Water Intake Structure (Existing Facilities: Phase II) Proposed Rule Comment Clerk—W-00-32, Water Docket, Mail Code 4101, EPA, Ariel Rios Building,1200 Pennsylvania Avenue, NW., Washington, DC 20460. Comments delivered in person (including overnight mail) should be submitted to the Cooling Water Intake Structure (Existing Facilities: Phase II) Proposed Rule Comment Clerk—W-00-32, Water Docket, Room EB 57, 401 M Street, SW., Washington, DC 20460. You also may submit comments electronically to ow-docket@epa.gov. Please submit any references cited in your comments. Please submit an original and three copies of your written comments and enclosures. For additional information on how to submit comments, see “SUPPLEMENTARY INFORMATION, How May I Submit Comments?”, 878056=EPA used publicly available data from the 1999 Forms EIA-860A and EIA-860B as well as information from EPA's 2000 Section 316(b) Industry Survey to identify the parent entities of electric generators subject to this proposed rule. EPA also conducted research to identify recent changes in ownership, including the current owner of each generator, and each owner's primary SIC code, sales revenues, employment, and/or electricity sales. Based on the parent entity's SIC code and the related size standard set by the SBA, EPA identified facilities that are owned by small entities., 465000=Under PSEG's approach, if a cooling water intake structure at an existing facility has previously been determined to employ best technology available based upon a diligent review of a section 316(b) demonstration that was conducted in conformance with the 1977 EPA Guidance, then the existing intake would continue to be determined to employ best technology available for the next permit cycle. The permit renewal application would have to include information sufficient to allow the permitting agency to determine that: (1) There has been no material change in the operation of the facility that would affect entrainment or impingement; (2) any in-place technologies have been properly operated, maintained, and are not allowing losses to occur in excess of the levels the agency considered in its prior determination; (3) any conservation or mitigation measures included in prior permits are in place and are producing the intended benefits; (4) the economics of applying a different technology have not changed; and (5) data and/or analyses show that fish species of concern are being maintained or that any declines in those species are not attributable to the cooling water intake structure., 197303=Opri Data Sources. Opri is a private firm located in Boulder, Colorado, that has compiled extensive databases related to the traditional steam electric utility industry. Opri's Electric Generating Plant Database includes plant-level data for privately-owned utilities, publicly-owned utilities, and cooperatives for 1988-1997. While these data are available from FERC, EIA, and RUS, these agencies do not make the information available in an easily accessible electronic format. As a consequence, EPA purchased plant-level data from Opri to support its economic analyses. Because the compilation of data in the Electric Generating Plant Database is proprietary, EPA has included a summary of the data utilized in its analyses in the public record., 990854=29. Jackson J.B.C., M.X. Kirby, W.H. Berger, K.A. Bjorndal, L.W. Botsford, B.J. Bourque, R.H. Bradbury, R. Cooke, J. Erlandson, J.A. Estes, T.P. Hughes, S. Kidwell, C.B. Lange, H.S. Lenihan, J.M. Pandolfi, C.H. Peterson, R.S. Steneck, M.J. Tegner, and R.R. Warner, 2001. Historical overfishing and the recent collapse of coastal ecosystems. Science 293(5530): 629-638., 981293=3. U.S. EPA, Information Collection Request, Detailed Industry Questionnaires: Phase II Cooling Water Intake Structures Watershed Case Study Short Questionnaires, Section 3, 1999., 887978=Executive Order 13175, entitled “Consultation and Coordination with Indian Tribal Governments” (65 FR 67249, November 6, 2000), requires EPA to develop an accountable process to ensure “meaningful and timely input by tribal officials in the development of regulatory policies that have tribal implications.” “Policies that have tribal implications” is defined in the Executive Order to include regulations that have “substantial direct effects on one or more Indian Tribes, on the relationship between the Federal government and the Indian Tribes, or on the distribution of power and responsibilities between the Federal government and Indian Tribes.”, 440853=The 1977 Section 316(b) Draft Guidance recommends a general process for developing information needed to support section 316(b) decisions and presenting that information to the permitting authority. The process involves the development of a site-specific study of the environmental effects associated with each facility that uses one or more cooling water intake structures, as well as consideration of that study by the permitting authority in determining whether the facility must make any changes to minimize adverse environmental impact. Where adverse environmental impact is occurring and must be minimized by application of best technology available, the 1977 guidance suggests a “stepwise” approach that considers screening systems, size, location, capacity, and other factors., 1000429=56. For a general discussion on different assessment procedures see The Process of Selecting a Wetland Assessment Procedure: Steps and Considerations, by Candy C. Bartoldus, Wetland Journal, Vol. 12, No. 4, Fall 2000., 1001805=59. Communication from Mr. Mark Stein, Office of Regional Counsel, US EPA Region I, Boston, MA, dated January 24, 2002. (See Docket for today's proposal.), 128818=Today, EPA proposes a national framework that would establish certain minimum requirements for the location, design, capacity, and construction of cooling water intake structures for large cooling water intake structures at Phase II existing facilities. In doing so, the Agency is proposing to revise the approach adopted in the 1977 draft guidance which was based on the judgment that “[t]he decision as to best technology available for intake design location, construction, and capacity must be made on a case-by-case basis.” Other important differences from the 1977 draft guidance include today's proposed definition of a “cooling water intake structure.” Today's proposal also would establish a cost-benefit test that is different from the “wholly disproportionate” cost-benefit test that has been in use since the 1970s., 606123=This section presents the results of the IPM 2000 analysis for the four NERC regions with no cooling tower requirements under the alternative waterbody/capacity-based option: ECAR, MAIN, MAPP, and SPP. [75] As indicated above, the compliance requirements of this analyzed option are identical to those of the proposed rule for these four regions. Given the similarity in compliance requirements and the limited electricity exchanges between NERC regions modeled in IPM 2000, EPA concludes that the impacts modeled for the alternative waterbody/capacity-based option would be representative of potential impacts associated with the proposed rule for each of these regions., 243608=Brayton Point Generating Station. The Brayton Point Generating Station is located on Mt. Hope Bay, in Somerset, Massachusetts, within the northeastern reach of Narragansett Bay. Because of problems with electric arcing caused by salt drift from an open spray pod design located near transmission wires, and lack of fresh water to replace the salt water used for the closed-cycle recirculating spray pod cooling water system, the company converted Unit 4 from a closed-cycle, recirculating system to a once-through cooling water system in July 1984. The modification of Unit 4 resulted in a 41 percent increase in coolant flow, amounting to a maximum average intake flow of approximately 1.3 billion gallons per day and increased thermal discharge to the bay. [34] An analysis of fisheries data by the Rhode Island Division of Fish and Wildlife using a time series-intervention model showed an 87 percent reduction in finfish abundance in Mt. Hope Bay coincident with the Unit 4 modification. [35] The analysis also indicated that, in contrast, finfish abundance trends have been relatively stable in adjacent coastal areas and portions of Narragansett Bay that are not influenced by the operation of Brayton Point station. Thus, overall finfish biomass and finfish species diversity declined in Mount Hope Bay but not in Narragansett Bay. There appear to be multiple, interacting factors that influence these declines including overfishing and climate change as well as temperature increases from thermal discharges and impingement and entrainment losses associated with the Brayton Point facility., 235583=In addition to ecosystem-level impacts, EPA is concerned about the potential impacts of cooling water intake structures located in or near habitat areas that support threatened, endangered, or other protected species. Although limited information is available on locations of threatened or endangered species that are vulnerable to impingement or entrainment, such impacts do occur. For example, EPA is aware that from 1976 to 1994, approximately 3,200 threatened or endangered sea turtles entered enclosed cooling water intake canals at the St. Lucie Nuclear Generating Plant in Florida. [22] The plant developed a capture-and-release program in response to these events. Most of the entrapped turtles were captured and released alive; however, approximately 160 turtles did not survive. More recently, the number of sea turtles being drawn into the intake canal increased to approximately 600 per year. Elevated numbers of sea turtles found within nearshore waters are thought to be part of the reason for the rising numbers of turtles entering facility waters. In response to this increase, Florida Power and Light Co. proposed installation of nets with smaller size mesh (5-inch square mesh rather than 8-inch square mesh) at the St. Lucie facility to minimize entrapment. [23], 764897=Angler days. The angler day variable the Agency used is based on data developed by the U.S. Fish and Wildlife Survey as part of its 1996 National Survey of Fishing, Hunting, and Wildlife-Associated Recreation. These data were interpreted within a GIS-based approach to estimate the level of recreational angling pursued by populations living within 120 miles of each facility (additional detail is provided in the EBA)., 158709=EPA is proposing to define the term “existing facility” as any facility that commenced construction before January 17, 2002 and (1) any modification of such a facility; (2) any addition of a unit at such a facility for purposes of the same industrial operation; (3) any addition of a unit at such a facility for purposes of a different industrial operation, if the additional unit uses an existing cooling water intake structure and the design capacity of intake structure is not increased; or (4) any facility constructed in place of such a facility if the newly constructed facility uses an existing cooling water intake structure whose design intake flow is not increased to accommodate the intake of additional cooling water., 200545=As discussed in part B of this Section, the section 316(b) Survey acquired technological and economic information from facilities for the years 1998 and 1999. With this information, the Agency established a subset of facilities potentially subject to this rule. Since 1999, some existing facilities have proposed and/or enacted changes to their facilities in the form of repowering that could potentially affect the applicability of today's proposal or a facility's compliance costs. The Agency therefore conducted research into repowering facilities for the section 316(b) existing facility rule and any information available on proposed changes to their cooling water intake structures. The Agency defines repowering as existing facilities either undertaking replacement of existing generating capacity or making additions to existing capacity. The Agency used two separate databases to assemble available information for the repowering facilities: RDI's NEWGen Database, November 2001 version and the Section 316(b) Survey., 1004238=65. NPDES Permit Backlog Trend Report: October 31, 2001, issued on November 30, 2001 by EPA's Water Permits Division, US EPA, Washington, DC., 201617=In January 2000, EPA conducted a survey of the technological and economic characteristics of 961 steam-electric generating plants. Only the detailed questionnaire, filled out by 283 utility plants and 50 nonutility plants, contains information on planned changes to the facilities' cooling systems (Part 2, Section E). Of the respondents to the detailed questionnaire, only six facilities (three utility plants and three nonutility plants) indicated that their future plans would lead to changes in the operation of their cooling water intake structures., 636723=As stated in Section VIII.A.2 above, EPA used the IPM 2000 electricity market model to assess impacts associated with the proposed rule and regulatory options. These impacts are assessed by comparing model output for the base case and post compliance scenarios for each regulatory option. In support of this rule, EPA completed an electricity market model analysis of two post compliance scenarios: (1) The “Intake Capacity Commensurate with Closed-Cycle, Recirculating Cooling System based on Waterbody Type/Capacity” Option (waterbody/capacity-based option) and (2) the “Intake Capacity Commensurate with Closed-Cycle, Recirculating Cooling System for All Facilities” Option (all closed-cycle option). This section presents the results of the IPM 2000 analysis of these two post-compliance scenarios., 1003904=64. Backlog counts for these facilities are based on permits expired as of November 21, 2001 or if the permit expired field in the database is blank., 75776=3 actions from April 9th, 2002 to July 2004, 375840=Jefferies Coal Units 3 4. Located in Moncks Corner, South Carolina, this facility has a combined, coal-fired capacity of 346 MW (nameplate, steam). The coal units came online in 1970 and operated for approximately 15 years utilizing once-through cooling. After the Army Corps of Engineers re-diverted the Santee Cooper River, thereby limiting the plant's available water supply, the cooling system was converted from once-through to recirculating towers. The plant conducted an empirical energy-penalty study over several years to determine the economic impact of the cooling system conversion., 994258=38. Swarbrick, S. and R.F. Ambrose. 1989. Technical report C: entrapment of juvenile and adult fish at SONGS. Prepared for Marine Review Committee., 991829=31. Consolidated Edison Company of New York. 2000. Draft environmental impact statement for the state pollutant discharge elimination system permits for Bowline Point, Indian Point 2 3, and Roseton steam electric generating stations., 621057=Exhibit 7 indicates that, on average, the percentage of total capacity is slightly higher and the percentage of facilities subject to the proposed rule is slightly lower in the four analyzed NERC regions compared to the other six regions. In addition, the average annualized compliance costs per MWh of generation is very similar in all NERC regions. Based on this comparison and the limited amount electricity exchanges between regions modeled in IPM 2000, EPA concluded that the analysis of impacts under the proposed rule for the four NERC regions is representative of likely impacts in the other NERC regions. As the analysis of the impacts of the alternative waterbody/capacity-based option revealed no significant impacts at the market level, EPA concluded that there would be no significant impacts on any NERC region associated with the proposed rule., 152855=EPA received many comments from industry stakeholders, government agencies and private citizens on the Phase I proposed rule 65 FR 49059 (August 10, 2000). EPA received additional comments on the Notice of Data Availability (NODA) 66 FR 28853 (May 25, 2001). These comments have informed the development of the Phase II proposal., 710022=EPA uses data for this case study from the Marine Recreational Fishery Statistics Survey (MRFSS), combined with the 1994 Add-on MRFSS Economic Survey (AMES). The study uses MFRSS information on angler characteristics and angler preferences, such as where they go fishing and what species they catch, to infer their values for changes in recreational fishing quality. EPA estimated angler behavior using a RUM for single-day trips. The study used standard assumptions and specifications of the RUM model that are readily available from the recreation demand literature. Among these assumptions are that anglers choose fishing mode and then the site in which to fish; and that anglers' choice of target species is exogenous to the model. EPA modeled an angler's decision to visit a site as a function of site-specific cost, fishing trip quality, presence of boat launching facilities, and water quality., 982296=8. EPA 2000. Detailed Industry Questionnaire: Phase II Cooling Water Intake Structures. U.S. Environmental Protection Agency, Office of Wastewater Management, Washington, DC. OMB Control No. 2040-0213., 1007221=72. The IPM model simulates electricity market function for a period of 25 years. Model output is provided for five user specified model run years. EPA selected three run years to provide output across the ten year compliance period for the rule. Analyses of regulatory options are based on output for model run years which reflect a scenario in which all facilities are operating in their post-compliance condition. Options requiring the installation of cooling towers are analyzed using output from model run year 2013. All other options are analyzed using output from model run years 2008. See the EBA document for a detailed discussion of IPM 2000 model run years., 439691=Since the Fourth Circuit remanded EPA's section 316(b) regulations in 1977, decisions implementing section 316(b) have been made on a case-by-case, site-specific basis. EPA published guidance addressing section 316(b) implementation in 1977. See Draft Guidance for Evaluating the Adverse Impact of Cooling Water Intake Structures on the Aquatic Environment: Section 316(b) 92 (U.S. EPA, 1977). This guidance describes the studies recommended for evaluating the impact of cooling water intake structures on the aquatic environment, and it establishes a basis for determining the best technology available for minimizing adverse environmental impact. The 1977 Section 316(b) Draft Guidance states, “The environmental-intake interactions in question are highly site-specific and the decision as to best technology available for intake design, location, construction, and capacity must be made on a case-by-case basis.” (Section 316(b) Draft Guidance, U.S. EPA, 1977, p. 4). This case-by-case approach also is consistent with the approach described in the 1976 Development Document referenced in the remanded regulation., 998143=51. EPRI. 1999. Catalog of assessment methods for evaluating the effects of power plant operations on aquatic communities. TR-112013, EPRI, Palo Alto, CA., 1002623=61. Drawing on the concept of “critical aquatic organisms”in EPA's 1977 draft guidance, UWAG would define a representative indicator species (RIS) as a species of commercial or recreational importance, a Federal or state threatened or endangered or specially designated species, an important species for ecological community structure or function, or on the basis of species and life stage vulnerability., 466242=In the Fact Sheet accompanying the draft permit, the permitting agency would be required specifically to: (1) Make a finding of fact that the prior section 316(b) determination had been based upon a demonstration conducted in conformance with the Agency's 1977 Guidance; and (2) identify the data and information that the permittee provided in support of the reaffirmance of its prior section 316(b) determination. Interested third parties as well as Federal, state and interstate resource protection agencies (e.g., National Marine Fisheries Service and the United States Fish and Wildlife Service) would have an opportunity to comment on the draft section 316(b) determination and to challenge the final determination if they were aggrieved by the agency's final decision., 988782=24. EPA Region IV. 1979. Brunswick Nuclear Steam Electric Generating Plant of Carolina Power and Light Company, historical summary and review of section 316(b) issues., 164088=This definition differs from the definition of “cooling water intake structure” that is included in the 1977 Draft Guidance. The proposed definition clarifies that the cooling water intake structure includes the physical structure and technologies that extend up to and include the intake pumps. Inclusion of the term “associated constructed waterways” is intended to clarify that the definition includes those canals, channels, connecting waterways, and similar structures that may be built or modified to facilitate the withdrawal of cooling water. The explicit inclusion of the intake pumps in the definition reflects the key role pumps play in determining the capacity (i.e., dynamic capacity) of the intake. These pumps, which bring in water, are an essential component of the cooling water intake structure since without them the intake could not work as designed., 291662=Chalk Point Generating Station. Located on the Patuxent River in Price George's County, Maryland, Chalk Point has a nameplate capacity of 2647 MW (oil-fired steam). The facility has 4 generating units and uses a combination of once-through and closed cycle cooling (two once-through systems serving two generating units and one recirculating system with a tower serving the other two generating units). In 1983, the facility installed a barrier net, followed by a second set of netting in 1985, giving the facility a coarse mesh (1.25″) outer net and a fine mesh (.75″) inner net. The barrier nets are anchored to a series of pilings at the mouth of the intake canal that supplies the cooling water to the facility and serve to reduce both entrainment and the volume of trash taken in at the facility., 842295=Pursuant to the terms of Executive Order 12866, it has been determined that this proposed rule is a “significant regulatory action.” As such, this action was submitted to OMB for review. Changes made in response to OMB suggestions or recommendations will be documented in the public record., 112376=For additional technical information contact Deborah G. Nagle at (202) 566-1063. For additional economic information contact Lynne Tudor, Ph.D. at (202) 566-1043. For additional biological information contact Dana A. Thomas, Ph.D. at (202) 566-1046. The e-mail address for the above contacts is “rule.316b@epa.gov.”, 1006967=71. For a more detailed description of IPM 2000 see the EBA document., 142118=In April 1976 EPA published a rule under section 316(b) that addressed cooling water intake structures. 41 FR 17387 (April 26, 1976), proposed at 38 FR 34410 (December 13, 1973). The rule added a new § 401.14 to 40 CFR Chapter I that reiterated the requirements of CWA section 316(b). It also added a new part 402, which included three sections: (1) § 402.10 (Applicability), (2) § 402.11 (Specialized definitions), and (3) § 402.12 (Best technology available for cooling water intake structures). Section 402.10 stated that the provisions of part 402 applied to “cooling water intake structures for point sources for which effluent limitations are established pursuant to section 301 or standards of performance are established pursuant to section 306 of the Act.” Section 402.11 defined the terms “cooling water intake structure,” “location,” “design,” “construction,” “capacity,” and “Development Document.” Section 402.12 included the following language:, 905909=On May 23, 2001, EPA held a day-long forum to discuss specific issues associated with the development of regulations under section 316(b). At the meeting, 17 experts from industry, public interest groups, States, and academia reviewed and discussed the Agency's preliminary data on cooling water intake structure technologies that are in place at existing facilities and the costs associated with the use of available technologies for reducing impingement and entrainment. Over 120 people attended the meeting., 159484=The term commence construction is defined in 40 CFR 122.29(b)(4) and January 17, 2002 is the effective date of the new facility rule. EPA has specified that any modification of a facility that commenced construction before January 17, 2002 remains an existing facility for purposes of this rule to clarify that significant changes to such a facility would not, absent other conditions, cause the facility to be a “new facility” subject to the Phase I rule. In addition, the proposed definition specifies that any addition of a unit at a facility that commenced construction before January 17, 2002 for purposes of the same industrial operation as the existing facility would continue to be defined as an existing facility. Further, any addition of a unit at a facility that commenced construction before January 17, 2002 for purposes of a different industrial operation would remain an existing facility provided the additional unit uses an existing cooling water intake structure and the design capacity of intake structure is not increased. Finally, under the proposed definition, any facility constructed in place of a facility that commenced construction before January 17, 2002, would remain defined as an existing facility if the newly constructed facility uses an existing cooling water intake structure whose design intake flow is not increased to accommodate the intake of additional cooling water., 375122=Canadys Steam Plant. This 490 MW (nameplate, steam capacity) coal-fired facility with three generating units is located in Colleton County, South Carolina. The first unit initially came online in 1962, the second in 1964, and the third in 1967. All three units operated with a once-through cooling water system for many years. The Canadys Steam plant was converted from a once-through to a closed-cycle recirculating cooling system in two separate projects. Unit 3 (218 MW) was first converted in 1972. Units 1 and 2, both with nameplate capacities of 136 MW, were converted from a once-through to a closed-cycle, recirculating cooling system in 1992., 1010004=76. In addition to the five impact measures presented in Exhibit 6, EPA utilized IPM 2000 to identify changes in other economic and operational characterisitcs, including revenues, average fuel costs, changes in repowering, and the number and capacity of facilities identfiied as economic closures. The IPM results showed no economic closures and no changes in repowering associated with compliance with the alternative waterbody/capacity-based option in any of the four NERC regions presented in Exhibit 6. For a detailed discussion of the results of the IPM 2000 analysis of the alternative waterbody/capacity based option see section VIII.B.2 and the EBA document., 1008074=73. While the compliance requirements are identical under the proposed rule and the alternative waterbody/capacity-based option, permitting costs associated with the proposed rule are higher than those for the alternative option analyzed using the IPM 2000. The cost differential averages approximately 30 percent of total compliance costs associated with the alternative option. Despite the higher permitting costs, EPA concludes that the results of the alternative analysis are representative of impacts that could be expected under the proposed rule., 765383=In developing the index, EPA used a GIS analysis to identify counties within a 120 mile radius of each facility. The area for each facility included the county the facility is located in and any other county with 50 percent or more of its population residing within 120 miles of the facility. EPA estimated angling activity levels for two types of angling days for each county: freshwater angling days and saltwater angling days. Estimated angling days for the appropriate waterbody type were summed across all counties in a facility's area to yield estimated angling days near the facility. For each type of angling, EPA estimated angling days by county residents as a percentage of the State angling days by residents 16 years and older reported in the 1996 National Survey of Fishing, Hunting, and Wildlife-Associated Recreation (USFWS, 1997). Angling days in each State were partitioned into days by urban anglers and days by rural anglers based on the U.S. percentages reported in the 1996 National Survey., 903219=EPA has made presentations on the section 316(b) rulemaking effort in general at eleven professional and industry association meetings. EPA also conducted two public meetings in June and September of 1998 to discuss issues related to the section 316(b) rulemaking effort. In September 1998 and April 1999, EPA staff participated in technical workshops sponsored by the Electric Power Research Institute on issues relating to the definition and assessment of adverse environmental impact. EPA staff have participated in other industry conferences, met upon request on numerous occasions with industry representatives, and met on a number of occasions with representatives of environmental groups., 154319=In August 21, 2001, EPA staff participated in a technical symposium sponsored by the Electric Power Research Institute in association with the American Fisheries Society on issues relating to the definition and assessment of adverse environmental impact under section 316(b) of the CWA., 459435=Under this alternative for determining adverse environmental impact, a facility would work with permit writers, resource managers, other appropriate technical experts, and stakeholders to determine what constitutes an “unacceptable” risk of adverse environmental impact in a water body. The process would be based on EPA's 1998 Ecological Risk Assessment Guidelines. The key steps would be as follows:, 662215=As with the alternative waterbody/capacity-based option analysis, the IPM 2000 results from model run year 2013 were used to analyze two potential facility level impacts associated with the alternative all cooling towers option: (1) Potential changes in the economic and operational characteristics of the Phase II existing facilities and (2) potential changes to individual facilities within the group of Phase II existing facilities. EPA analyzed economic closures and changes in production costs to assess impacts to all Phase II existing facilities resulting from the alternative option. Exhibit 14 below presents the results from this analysis, by NERC region., 507181=Restoration plans could potentially use a banking mechanism similar to those used in the CWA section 404 program, that would allow the permittee to meet requirements by purchasing restoration credits from an approved bank. For example, should wetlands restoration be an appropriate mechanism for offsetting the adverse impact caused by a cooling water intake structure, the permittee could purchase credits from an existing wetlands mitigation bank established in accordance with the Federal Guidance for the Establishment, Use and Operation of Mitigation Banks (50 FR 58605; November 28, 1995). As in the CWA section 404 program, public or private entities could establish and operate the banks providing mitigation for impacts under 316(b). EPA views the use of restoration banking for the purposes of this proposed rule as one way to facilitate compliance and reduce the burden on the permit applicant, while at the same time potentially enhancing the ecological effectiveness of the required restoration activities., 844023=The total burden of the information collection requirements associated with today's proposed rule is estimated at 4,251,240 hours. The corresponding estimates of cost other than labor (labor and non-labor costs are included in the total cost of the proposed rule discussed in Section VIII of this preamble) is $191 million for 539 facilities and 44 States and one Territory for the first three years after promulgation of the rule. Non-labor costs include activities such as capital costs for remote monitoring devices, laboratory services, photocopying, and the purchase of supplies. The burden and costs are for the information collection, reporting, and recordkeeping requirements for the three-year period beginning with the assumed effective date of today's rule. Additional information collection requirements will occur after this initial three-year period as existing facilities continue to be issued permit renewals and such requirements will be counted in a subsequent information collection request. EPA does not consider the specific data that would be collected under this proposed rule to be confidential business information. However, if a respondent does consider this information to be confidential, the respondent may request that such information be treated as confidential. All confidential data will be handled in accordance with 40 CFR 122.7, 40 CFR part 2, and EPA's Security Manual Part III, Chapter 9, dated August 9, 1976., 997625=49. Consumers Power Company. 1984, 1988, and 1992 reports of deterrent net performance, J.R. Whiting Plant. Prepared for the Michigan Water Resources Commission., 291145=Salem Generating Station. A 2381 MW facility (nameplate, nuclear), Salem is located on the Delaware River in Lower Alloways Creek Township, New Jersey. The facility has two generating units, both of which use once-through cooling and began operations in 1977. In 1995, the facility installed modified Ristroph screens and a low-pressure spray wash with a fish return system. The facility also redesigned the fish return troughs to reduce fish trauma., 995237=41. Kastendiek, J. and K. Parker. 1988. Interim technical report: midwater and benthic fish. Prepared for Marine Review Committee., 996876=46. U.S. Department of Energy. 1999. Form EIA-767 (1999). Steam-electric plant operation and design report. Edison Electric Institute., 895697=Section 12(d) of the National Technology Transfer and Advancement Act (NTTAA) of 1995, Pub. L. 104-113, Sec. 12(d) directs EPA to use voluntary consensus standards in its regulatory activities unless to do so would be inconsistent with applicable law or otherwise impractical. Voluntary consensus standards are technical standards (e.g., materials specifications, test methods, sampling procedures, and business practices) that are developed or adopted by voluntary consensus standard bodies. The NTTAA directs EPA to provide Congress, through the Office of Management and Budget (OMB), explanations when the Agency decides not to use available and applicable voluntary consensus standards.}",
    "textBeforeTable": "The following exhibit lists the types of entities that EPA is now aware potentially could be subject to this proposed rule. This exhibit is not intended to be exhaustive, but rather provides a guide for readers regarding entities likely to be regulated by this action. Types of entities not listed in the exhibit could also be regulated. To determine whether your facility would be regulated by this action, you should carefully examine the applicability criteria proposed at § 125.91 of the proposed rule. If you have questions regarding the applicability of this action to a particular entity, consult one of the persons listed for technical information in the preceding FOR FURTHER INFORMATION CONTACT section. This proposed rule would apply to “Phase II existing facilities,” i.e., existing facilities that both generate and transmit electric power or that generate electric power for sale to another entity for transmission; use one or more cooling water intake structures to withdraw water from waters of the U.S.; have or require a National Pollutant Discharge Elimination System (NPDES) permit issued under section 402 of the CWA; and meet proposed flow thresholds. [1] Existing electric power generating facilities subject to this proposal would include those that use cooling water intake structures to withdraw fifty (50) million gallons per day (MGD) or more and that use at least twenty-five (25) percent of water withdrawn solely for cooling purposes. If a facility that otherwise would",
    "textAfterTable": "If you want EPA to acknowledge receipt of your comments, enclose a self-addressed, stamped envelope. No faxes will be accepted. Electronic comments must be submitted as a WordPerfect 5.1, 6.1, 8, or 9 format, or an ASCII file or file avoiding the use of special characters and forms of encryption. Electronic comments must be identified by the docket number W-00-32. EPA will accept comments and data on disks in WordPerfect 5.1, 6.1, 8 or 9 format or in ASCII file format. Electronic comments on this notice may be filed on-line at many Federal depository libraries. Organization of This Document Back to Top I. Legal Authority, Purpose of Today's Proposal, and Background A. Legal Authority B. Purpose of Today's Proposal C. Background II. Scope and Applicability of the Proposed Rule A. What Is an “Existing Facility” for Purposes of the Section 316(b) Proposed Phase II Rule? B. What Is a “Cooling Water Intake Structure”? C. Is My Facility Covered If It Withdraws From Waters of the U.S.? D. Is My Facility Covered If It Is a Point Source Discharger Subject to an NPDES Permit? E. Who Is Covered Under the Thresholds Included in This Proposed Rule? F. When Must a Phase II Existing Facility Comply With the Proposed Requirements? G. What Special Definitions Apply to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}