{
    "relation": [
        [
            "First Name",
            "Brian",
            "Catherine",
            "Raymond"
        ],
        [
            "Last Name",
            "Henneberry",
            "Haggett",
            "Paul"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=CC6BB6C5-64F2-4700-ADD6-379341FAAA45&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223004283,
    "recordOffset": 222988062,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 29116=Oppose pricing of carbon H. R. 6338, To amend the Internal Revenue Code of 1986 to reduce greenhouse gas emissions by requiring a Federal emission permit for the sale or use of covered substances, reduce the deficit, and return funds to the American people, entire bill S.847, Safe Chemicals Act of 2011, To amend the Toxic Substances Control Act to ensure that risks from chemicals are adequately understood and managed, and for other purposes, entire bill S. 228, Defending America's Affordable Energy and Jobs Act, To preempt regulation of, action relating to, or consideration of greenhouse gases under Federal and common law on enactment of a Federal policy to mitigate climate change, entire bill H.R. 910, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill S. 231, EPA Stationary Source Regulations Suspension Act, To suspend, until the end of the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.R 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill S. 482, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill S. 3053, To require Regional Administrators of the Environmental Protection Agency to be appointed by and with the advice and consent of the Senate, entire bill S. J. RES. 37, To disapprove a rule promulgated by the Administrator of the Environmental Protection Agency relating to emission standards for certain steam generating units, entire bill H.R. 4480, To provide for the development of a plan to increase oil and gas exploration, development, and production under oil and gas leases of Federal lands under the jurisdiction of the Secretary of Agriculture, the Secretary of Energy, the Secretary of the Interior, and the Secretary of Defense in response to a drawdown of petroleum reserves from the Strategic Petroleum Reserve, entire bill H.R. 4471, To require analyses of the cumulative impacts of certain rules and actions of the Environmental Protection Agency that impact gasoline, diesel fuel, and natural gas prices, jobs, and the economy, and for other purposes, entire bill H. R. 6444, To amend the Clean Air Act to require the Administrator of the Environmental Protection Agency to establish a system for the certification of the validity of credits to be used for compliance with the renewable fuel program, and for other purposes, entire bill S . CON . RES . 61, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 144, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 142, Expressing the opposition of Congress to Federal efforts to establish a carbon tax on fuels for electricity and transportation, entire bill, 41035=H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill P.L. 112-141, To authorize funds for Federal-aid highways, highway safety programs, and transit programs, and for other purposes. S. 1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill Monitor legislation relating to oil and gas., 62269=S. 847, Safe Chemicals Act of 2011, To amend the Toxic Substances Control Act to ensure that risks from chemicals are adequately understood and managed, and for other purposes, entire bill, 70843=S. 473, Continuing Chemical Facilities Anti-terrorism Security Act of 2011, To extend the chemical facility security program of the Department of Homeland Security, and for other purposes, entire bill S. 1483, Incorporation Transparency and Law Enforcement Assistance Act, To ensure that persons who form corporations in the United States disclose the beneficial owners of those corporations, in order to prevent wrongdoers from exploiting United States corporations in ways that threaten homeland security, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations, and for other purposes, entire bill H.R. 3416, Incorporation Transparency and Law Enforcement Assistance Act, To amend title 31, United States Code, to ensure that persons who form corporations or limited liability companies in the United States disclose the beneficial owners of those corporations or limited liability companies, in order to prevent wrongdoers from exploiting United States corporations and limited liability companies for criminal gain, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations and limited liability companies, and for other purposes, entire bill S. 2105, Cybersecurity Act of 2012, To enhance the security and resiliency of the cyber and communications infrastructure of the United States, entire bill S. 2151, SECURE IT, To improve information security, and for other purposes, entire bill H.R. 3523, Cyber Intelligence Sharing and Protection Act of 2011, To provide for the sharing of certain cyber threat intelligence and cyber threat information between the intelligence community and cybersecurity entities, and for other purposes, entire bill H.R. 4263, SECURE IT Act of 2012, To improve information security, and for other purposes, entire bill H.R. 3674, PRECISE Act of 2011, To amend the Homeland Security Act of 2002 to make certain improvements in the laws relating to cybersecurity, and for other purposes, entire bill. H.R. 901, Chemical Facility Anti-Terrorism Security Authorization Act of 2011,To amend the Homeland Security Act of 2002 to codify the requirement that the Secretary of Homeland Security maintain chemical facility anti-terrorism security regulations, entire bill H.R. 908, Full Implementation of the Chemical Facility Anti-Terrorism Standards Act, To extend the authority of the Secretary of Homeland Security to maintain the Chemical Facility Anti-Terrorism Standards program, entire bill S. 709, Secure Chemical Facilities Act, To enhance the security of chemical facilities and for other purposes, entire bill, 12298=Energy Market Legislation Environmental Legislation H.R. 199, Protect America's Energy and Manufacturing Jobs Act of 2011, To suspend, during the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions, and for other purposes, entire bill H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill H.R 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill Renewable Fuels Reform, draft legislation S.1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill H. R. 4345, To provide liability protection for claims based on the design, manufacture, sale, offer for sale, introduction into commerce, or use of certain fuels and fuel additives, and for other purposes, entire bill S. 2264, To provide liability protection for claims based on the design, manufacture, sale, offer for sale, introduction into commerce, or use of certain fuels and fuel additives, and for other purposes, entire bill H. R. 4471, To require analyses of the cumulative impacts of certain rules and actions of the Environmental Protection Agency that impact gasoline, diesel fuel, and natural gas prices, jobs, and the economy, and for other purposes, entire bill H.R. 6091, Making appropriations for the Department of the Interior, environment, and related agencies for the fiscal year ending September 30, 2013, and for other purposes, entire bill H.R. 4480, To provide for the development of a plan to increase oil and gas exploration, development, and production under oil and gas leases of Federal lands under the jurisdiction of the Secretary of Agriculture, the Secretary of Energy, the Secretary of the Interior, and the Secretary of Defense in response to a drawdown of petroleum reserves from the Strategic Petroleum Reserve, entire bill H. R. 6444, To amend the Clean Air Act to require the Administrator of the Environmental Protection Agency to establish a system for the certification of the validity of credits to be used for compliance with the renewable fuel program, and for other purposes, entire bill S . CON . RES . 61, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 144, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 142, Expressing the opposition of Congress to Federal efforts to establish a carbon tax on fuels for electricity and transportation, entire bill, 58714=H.R. 10, Regulations From the Executive in Need of Scrutiny Act of 2011,To amend chapter 8 of title 5, United States Code, to provide that major rules of the executive branch shall have no force or effect unless a joint resolution of approval is enacted into law, entire bill Issues related to First Amendment rights, 77032=Agriculture FY2013 appropriations, draft language H.R.5855, Department of Homeland Security Appropriations Act, 2013, entire bill H. R. 8, To extend certain tax relief provisions enacted in 2001 and 2003, and for other purposes; entire bill H.R.6020, Making appropriations for financial services and general government for the fiscal year ending September 30, 2013, and for other purposes, entire bill H.R.5973, Making appropriations for Agriculture, Rural Development, Food and Drug Administration, and Related Agencies programs for the fiscal year ending September 30, 2013, and for other purposes, entire bill H. J. RES. 117, Making continuing appropriations for fiscal year 2013, and for other purposes, entire bill, 67448=​An affiliated organization, INVISTA S.a r.l., disclosed on 2009 Q1 Form LD-2, has an interest in the specific issue listed above., 25662=H. R. 2541, To amend the Federal Water Pollution Control Act to exempt the conduct of silvicultural activities from national pollutant discharge elimination system permitting requirements, entire bill Water transportation issues, 20499=Public Law 111-203, Dodd-Frank Wall Street Reform and Consumer Protection Act, proposed regulations implementing Title I and Title VII (Wall Street Transparency and Accountability). S. 1483, Incorporation Transparency and Law Enforcement Assistance Act, To ensure that persons who form corporations in the United States disclose the beneficial owners of those corporations, in order to prevent wrongdoers from exploiting United States corporations in ways that threaten homeland security, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations, and for other purposes, entire bill H.R. 3416, Incorporation Transparency and Law Enforcement Assistance Act, To amend title 31, United States Code, to ensure that persons who form corporations or limited liability companies in the United States disclose the beneficial owners of those corporations or limited liability companies, in order to prevent wrongdoers from exploiting United States corporations and limited liability companies for criminal gain, to assist law enforcement in detecting, preventing, and punishing terrorism, money laundering, and other misconduct involving United States corporations and limited liability companies, and for other purposes, entire bill, 36829=S. 711, Secure Water Facilities Act, To amend the Safe Drinking Water Act and the Federal Water Pollution Control Act to authorize the Administrator of the Environmental Protection Agency to reduce or eliminate the risk of releases of hazardous chemicals from public water systems and wastewater treatment works, and for other purposes, entire bill H.R. 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, To require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency, and for other purposes, entire bill H.R. 910, Energy Tax Prevention Act of 2011, To amend the Clean Air Act to prohibit the Administrator of the Environmental Protection Agency from promulgating any regulation concerning, taking action relating to, or taking into consideration the emission of a greenhouse gas to address climate change, and for other purposes, entire bill, 45996=S. 2155, A bill to amend the Farm Security and Rural Investment Act of 2002 to promote biobased manufacturing, To amend the Farm Security and Rural Investment Act of 2002 to promote biobased manufacturing, entire bill S. 1658, REFRESH Act of 2011, To reform and reauthorize agricultural programs, and for other purposes, entire bill Monitor Farm Bill progress and energy programs/subsidies H.R. 2682, Business Risk Mitigation and Price Stabilization Act of 2011, To provide end user exemptions from certain provisions of the Commodity Exchange Act and the Securities Exchange Act of 1934, and for other purposes, entire bill Biomass Crop Assistance Program (BCAP), Farm Bill Proposal H.R. 2779, To exempt inter-affiliate swaps from certain regulatory requirements put in place by the Dodd-Frank Wall Street Reform and Consumer Protection Act, entire bill S. 3240, To reauthorize agricultural programs through 2017, and for other purposes, entire bill H. R. 6083, To provide for the reform and continuation of agricultural and other programs of the Department of Agriculture through fiscal year 2017, and for other purposes, entire bill H. R. 8, To extend certain tax relief provisions enacted in 2001 and 2003, and for other purposes; entire bill, 51714=H.R. 1380, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill H.R. 1864, Mobile Workforce State Income Tax Simplification Act of 2011, To limit the authority of States to tax certain income of employees for employment duties performed in other States, entire bill S. 1863, New Alternative Transportation to Give Americans Solutions Act of 2011, To amend the Internal Revenue Code of 1986 to encourage alternative energy investments and job creation, entire bill Business Tax Reform Corporate and International Tax Reform, draft legislation H.R. 2735, To amend the Internal Revenue Code of 1986 to make permanent the look-through treatment of payments between related controlled foreign corporations, entire bill S. 3412, To amend the Internal Revenue Code of 1986 to provide tax relief to middle-class families, entire bill S. 2091, United States Job Creation and International Tax Reform Act of 2012, To amend the Internal Revenue Code of 1986 to reform the international tax system of the United States, and for other purposes, entire bill Potential legislation related to various tax provisions scheduled to expire 12/31/12. Potential legislation relted to various tax provision expired 12/31/11. H. R. 6338, To amend the Internal Revenue Code of 1986 to reduce greenhouse gas emissions by requiring a Federal emission permit for the sale or use of covered substances, reduce the deficit, and return funds to the American people, entire bill Oppose pricing of carbon S. 3485, To limit the authority of States to tax certain income of employees for employment duties performed in other States, entire bill S. 3521, To amend the Internal Revenue Code of 1986 to extend certain expiring provisions, entire bill H. R. 8, To extend certain tax relief provisions enacted in 2001 and 2003, and for other purposes; entire bill S . CON . RES . 61, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 144, Expressing the sense of Congress that a carbon tax is not in the economic interest of the United States, entire bill H. CON . RES . 142, Expressing the opposition of Congress to Federal efforts to establish a carbon tax on fuels for electricity and transportation, entire bill}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005-2099 Country USA 3. Principal place of business (if different than line 2) City  Wichita State  KS Zip Code  67220 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Ms.  Jenny Kim  2028798569  jenny.kim@kochps.com 5. Senate ID#  400390816-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}