{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2009-05-27T00:00:00",
            "2009-05-27T00:00:00",
            "2010-01-15T00:00:00",
            "2010-09-01T00:00:00",
            "2011-09-01T00:00:00",
            "2011-09-22T00:00:00"
        ],
        [
            "Description",
            "The ABGPS, IMU, and raw scans are integrated using proprietary software developed by Optech and delivered with the Optech ALTM Gemini System. The resultant file is in a LAS binary file format. The LAS file version 1.1 format can be easily transferred from one file format to another. It is a binary file format that maintains information specific to the LiDAR data (return#, intensity value, xyz, etc.). The resultant points are referenced to the Geographic NAD83 horizontal datum and NAVD88 vertical datum.",
            "The data is subjected to rigorous QA/QC according to the 3001 Inc. Quality Control Plan and procedures. Very briefly, a series of quantitative and visual procedures are employed to validate the accuracy and consistency of the data. Ground control is established by 3001, Inc. and GPS-derived ground control points (GCPs) points in various areas of dominant and prescribed land cover. These points are coded according to landcover, surface material, and ground control suitability. A suitable number of points are selected for calculation of a statistically significant accuracy assessment as per the requirements of the National Standard for Spatial Data Accuracy. A spatial proximity analysis is used to select edited LiDAR data points within a specified distance of the relevant GCPs. A search radius decision rule is applied with consideration of terrain complexity, cumulative error, and adequate sample size. Accuracy validation and evaluation is accomplished using proprietary software to apply relevant statistical routines for calculation of Root Mean Square Error (RMSE) and the National Standard for Spatial Data Accuracy (NSSDA) according to Federal Geographic Data Committee (FGDC) specifications.",
            "The Airborne Global Position System (ABGPS), inertial measurement unit (IMU), and raw scans are collected during the LiDAR aerial survey. The ABGPS monitors the xyz position of the sensor and the IMU monitors the orientation of the aircraft. During the aerial survey laser pulses reflected from features on the surface and are detected by the receiver optics and collected by the data logger. GPS locations are based on data collected by receivers on the aircraft and base stations on the ground. The ground base stations are placed no more than 20 km radius from the flight survey area.",
            "Metadata imported.",
            "The NOAA Coastal Services Center (CSC) received classified data (ASPRS LAS classifications) in las format. The files contained LiDAR intensity and elevation measurements. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were converted from NAVD88 heights to ellipsoid heights using Geoid03. 2. The LAS header fields were sorted by latitude and updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2009_USACE_Texas_m1063.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2009_USACE_Texas_m1063.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2009_USACE_Texas_m1063.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 611597710,
    "recordOffset": 611589508,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2009_USACE_Texas_m1063Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 3 3001 International Inc. LiDAR Department lidar@3001inc.com processor 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov publisher http://coast.noaa.gov 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}