{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2006-10-05T00:00:00",
            "2006-11-20T00:00:00",
            "2008-11-03T00:00:00",
            "2009-07-23T00:00:00"
        ],
        [
            "Description",
            "EarthData has developed a unique method for processing lidar data to identify and remove elevation points falling on vegetation, buildings, and other aboveground structures. The algorithms for filtering data were utilized within EarthData's proprietary software and commercial software written by TerraSolid. This software suite of tools provides efficient processing for small to large-scale, projects and has been incorporated into ISO 9001 compliant production work flows. The following is a step-by-step breakdown of the process: 1. Using the lidar data set provided by EarthData, the technician performs calibrations on the data set. 2. Using the lidar data set provided by EarthData, the technician performed a visual inspection of the data to verify that the flight lines overlap correctly. The technician also verified that there were no voids, and that the data covered the project limits. The technician then selected a series of areas from the data set and inspected them where adjacent flight lines overlapped. These overlapping areas were merged and a process which utilizes 3-D Analyst and EarthData's proprietary software was run to detect and color code the differences in elevation values and profiles. The technician reviewed these plots and located the areas that contained systematic errors or distortions that were introduced by the lidar sensor. 3. Systematic distortions highlighted in step 2 were removed and the data was re-inspected. Corrections and adjustments can involve the application of angular deflection or compensation for curvature of the ground surface that can be introduced by crossing from one type of land cover to another. 4. The lidar data for each flight line was trimmed in batch for the removal of the overlap areas between flight lines. The data was checked against a control network to ensure that vertical requirements were maintained. Conversion to the client-specified datum and projections were then completed. The lidar flight line data sets were then segmented into adjoining tiles for batch processing and data management. 5. The initial batch-processing run removed 95% of points falling on vegetation. The algorithm also removed the points that fell on the edge of hard features such as structures, elevated roadways and bridges. 6. The operator interactively processed the data using lidar editing tools. During this final phase the operator generated a TIN based on a desired thematic layers to evaluate the automated classification performed in step 5. This allowed the operator to quickly re-classify points from one layer to another and recreate the TIN surface to see the effects of edits. Geo-referenced images were toggled on or off to aid the operator in identifying problem areas. The data was also examined with an automated profiling tool to aid the operator in the reclassification. 7. The final DEM was written to an LAS 1.0 format and also converted to ASCII 8. The point cloud data were also delivered in LAS 1.0 format and also converted to ASCII.",
            "EarthData utilizes a combination of proprietary and COTS processes to generate intensity images from the lidar data. Intensity images are generated from the full points cloud (minus noise points) and the pixel width is typically matched to the post spacing of the lidar data to achieve the best resolution. The following steps are used to produce the intensity: 1) Lidar point cloud is tiled to the deliverable tile layout. 2) All noise points, spikes, and wells are deleted out of the tiles. 3) An EarthData proprietary piece of software, EEBN2TIF is then used to process out the intensity values of the lidar. At this point, the pixel size is selected based on best fit or to match the client specification if noted in the SOW. 4) The software then generates TIF and .TFW files for each tile. 5) ArcView is used to review and QC the tiles before delivery.",
            "The NOAA Coastal Services Center (CSC) received the files in las and ASCII format. The data were in Maryland State Plane Projection, NAVD88 vertical datum and the vertical units of measure were meters. CSC performed the following processing to the las data to make it available within Digital Coast: 1. The data were converted from Maryland State Plane coordinates to geographic coordinates. 2. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid 03. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_MD_m103.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_MD_m103.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_MD_m103.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 616410719,
    "recordOffset": 616399714,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2006_MD_m103Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 2006 Maryland Department of Natural Resources Lidar: Caroline, Kent and Queen Anne Counties 2006-10-05 1 Aerial Acquisition of Lidar Data for Kent, Queen Anne & Caroline Counties, MD 2006-11-08 1 Lidar QA/QC Report 2 None 1 North American Datum 1983 2007-01-19 1 Report of Survey for Caroline, Kent & Queen Anne's Counties 2006-07-12 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}