{
    "relation": [
        [
            "Patent application number",
            "20090037991",
            "20100332963"
        ],
        [
            "Description",
            "MANAGING TRANSFERS OF INFORMATION IN A COMMUNICATIONS NETWORK - The invention features various techniques for managing transfers of information in public packet switched communications networks. In one aspect, the invention provides a system for identifying updated items of network-based information, such as pages, to users in a network. A master server receives the data from each of a plurality of network servers and merges them into one or more master logs. The logs have entries that pertaining to creation of or changing of pages of information. Another aspect of the invention features a system for implementing security protocols. A proxy server translates links from a protocol incompatible with the network tool to a protocol compatible with the network tool and back-translates the link. Another aspect of the invention features a system for managing authenticating credentials of a user. A proxy server manages a user's authenticating credentials automatically on behalf of the user. Another aspect of the invention features a system for inducing advertisers to target advertisements to consumers. An advertising broker receives advertisements and messages indicating that users have read the advertisements, and causes an offer having monetary value to be executed. Another aspect of the invention features a system for extracting data from sources of network-based information in a communications network. An object embedding-program locates a script program and causes the script program to extract data from a page of information.",
            "Managing Transfers of Information in a Communications Network - The invention features various techniques for managing transfers of information in public packet switched communications networks. In one aspect, the invention provides a system for identifying updated items of network-based information, such as pages, to users in a network. A master server receives the data from each of a plurality of network servers and merges them into one or more master logs. The logs have entries that pertaining to creation of or changing of pages of information. Another aspect of the invention features a system for implementing security protocols. A proxy server translates links from a protocol incompatible with the network tool to a protocol compatible with the network tool and back-translates the link. Another aspect of the invention features a system for managing authenticating credentials of a user. A proxy server manages a user's authenticating credentials automatically on behalf of the user. Another aspect of the invention features a system for inducing advertisers to target advertisements to consumers. An advertising broker receives advertisements and messages indicating that users have read the advertisements, and causes an offer having monetary value to be executed. Another aspect of the invention features a system for extracting data from sources of network-based information in a communications network. An object embedding-program locates a script program and causes the script program to extract data from a page of information."
        ],
        [
            "Published",
            "02-05-2009",
            "12-30-2010"
        ]
    ],
    "pageTitle": "Ellis, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ellis-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432332779,
    "recordOffset": 432304235,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John R. Ellis, Woodside, CA US 06-24-2010 DETERMINATION OF PACKET LOSS LOCATIONS - In one embodiment, a system may determine receiver identifiers to identify affected receivers, where each of affected receivers failed to receive a packet identified within a packet stream. A loss signature may identify the packet. Each of the affected receivers may be identified by a corresponding one of the receiver identifiers. The system may also determine a packet loss location of the packet from a network topology tree. The network topology tree may include a model of a logical network over which the packet stream was transmitted from a stream source to the affected receivers. The packet loss location may correspond to a lowest common ancestor node of at least two of the affected receivers. 20100157788 Published Description Patent application number John Gwilym Ellis, Pleasanton, CA US 09-25-2014 LIPID THERAPY - A method including introducing into a blood stream a delipidated high density lipoprotein (HDL) and a bioactive agent. A composition including a delipidated high density lipoprotein (HDL) and an auxiliary agent in a form suitable for delivery into a blood vessel. A composition including Apo A1 comprising a hydrophobic ligand suitable to interact with cell surface binding sites. A composition including Apo A1 and an agent selected to one of increase the ATP-binding cassette protein 1 (ABCA1) transporter expression in macrophages and protect ABCA1 from thiol-mediated degradation. 20140287033 07-28-2011",
    "textAfterTable": "Patent applications by John R. Ellis, Woodside, CA US John R. Ellis, Del Mar, CA US Patent application number Description Published 20090112812 Spatially enabled content management, discovery and distribution system for unstructured information management - What is provided is a spatially-enabled content management system in which unstructured information is data mined for location or spatial references, with the search query including not only the spatial reference that has been provided by the data mining but also other search query terms, thus to provide an analyst with rapid geo-searching for unstructured information management 04-30-2009 Kendra Nicole Ellis, Piedmont, CA US Patent application number Description Published 20110027423 ICE CONTAINING PARTICLES FOR USE IN MAKING FROZEN ICE DRINKS - A process for preparing ice containing particles by preparing a liquid formulation that includes water, a glass transition temperature (Tg) elevating agent, a sweetener and a surfactant so that the formulation has a Tg of −5° C. to −15° C.; and spraying the liquid formulation into a cryogenicatmosphere that is at least 10° C. below the Tg of the formulation to form a frozen mass to form ice containing particles. These particles",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}