{
    "relation": [
        [
            "Milestone",
            "Substantive discussions regarding project",
            "Pre-feasibility study",
            "Feasibility study",
            "Bidding",
            "Bid Evaluations",
            "Bid Assignation (company)",
            "Bid Negotiation (with FLS as the winner)",
            "Signing of Turn key Bidding Contract",
            "Project development (including construction and/or setting up on-site offices, purchase of lands, etc.)",
            "Project operations (including starting management practices, distributing information, training, purchase of operating equipment, etc.)",
            "Sequestration or reduction of GHG emissions",
            "Project financing obtained",
            "Other (please specify)"
        ],
        [
            "Date Initiated (if applicable) (month/year)",
            "1991",
            "January 1992",
            "January 1994",
            "June 1996",
            "September 1996",
            "September 1996",
            "September 1996",
            "September 1997",
            "October 1997",
            "1997",
            "July 1999",
            "October 1999",
            "Not applicable"
        ],
        [
            "Date Completed (if applicable) (month/year)",
            "",
            "June 1993",
            "January 1994",
            "September 1996",
            "September 1996",
            "",
            "September 1997",
            "",
            "October 1999",
            "",
            "October 1999",
            "December 2011",
            ""
        ]
    ],
    "pageTitle": "CC:INFO/AIJ: REPORT",
    "title": "",
    "url": "http://unfccc.int/kyoto_mechanisms/aij/activities_implemented_jointly/items/1882txt.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258816227,
    "recordOffset": 258794113,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{17481=In the late 1970s, however, the government started a new dry process plant (called MAYA) to address the demand for cement production during those years. In light of major operational failures and labor difficulties since its early years, the government decided to privatize MAYA in 1993 through an open bidding process, which CESSA won. The acquisition was implemented smoothly and the MAYA plant, which CESSA modernized and expanded during 1994-1995, now operates satisfactorily., 72903=1997, 32642=First month of year 2001 to year 2013, 53383=Year 1= 1997, 36193=During the construction of the project, more than 1700 workers were at the field, most of them from Metapán, the city where the plant is located. Contractors from El Salvador were also hired to provide for civil works, mechanical and electrical installations by FLSmidth., 19910=FLSmidth was commissioned for this new line, and started operations since September 3rd, 1999. This project is financed by the IFC, and the Banco Multisectorial de Inversiones through Banco Agrícola Comercial (El Salvador). The main equipment in this new line includes a modification in the crusher to increase capacity, a new raw vertical mill, one new kiln with 5 stages preheater and with calciner and terciary air, one cement ball mill, civil infrastructure, belt transportation, etc., 16484=December 2010, 107463=January 1997, 41062=The previous scenario with the 3 wet process kilns (#1, #2 and #3) and the dry process (rotary kiln #4) at the CESSA factory, and the dry process (rotary kiln #1) at Maya factory, were showing a dusty operation at CESSA. The 3 wet process kilns were emitting a lot of dust into the atmosphere because they did not have electrostatic filters or a bag filter. Each kiln emitted about 1 mt/h of dust. With the rotary kiln #4, even with an electrostatic filter, emissions were about 4 mt/h of dust into the atmosphere. Since 1997 CESSA has worked on reducing dust emissions from kiln #4 by improving mechanical and electrical parts of the electrostatic filter. The project GREEN CESSA was developed and financed, and obtained from DANIDA., 20615=CESSA is planning to implement a second CO2 reduction by reforesting a maximum of 10 hectares every year, beginning in 2001 up to year 2011. Once CESSA is able to negotiate carbon credits from Project 1 it will be self supported for this second project. Several species will be used during reforestation: flor amarilla, llama del bosque, flor de fuego, leucaena, etc. The first year’s costs will be approximately US$1,200 per hectare and the following year’s maintenance will cost around US$750 per hectare., 6631=(503) 888 1736, 10273=1700 Connecticut Ave., NW, Suite 403, 43477=CO2 Calculation for year 1999 as it should be calculated:, 18466=Since 1993 Cemento de EL Salvador, S.A. de C.V. has been working in order to install a new cement kiln in the CESSA plant due to the increased rate of cement consumption in El Salvador., 108442=kiln #4 cessa 24.68 0.2810, 107530=December 1997, 16283=September 1997}",
    "textBeforeTable": "4. Participants: CESSA, S.A. de C.V. installed a new kiln at CESSA’s facility located in Metapán, Santa Ana, El Salvador. The installation of the new dry kiln will replace the wet kiln, which after replacement will be shut down. The old kiln used a wet process, which emitted about 1.14 MT of CO2 per metric ton of clinker, while with the new kiln only about 0.95 MT of CO2 are emitted per metric ton of clinker. This reduction of CO2 emissions is a result of the decrease in fuel oil consumption by the new dry kiln technology. The new kiln has a capacity of 2,200 mt per year, designed by F.L.Smidth. This system includes 5 stages, pre-calcination and tertiary air. A. Description of the AIJ project 1. Title of project: CESSA CO2 Reduction 2. Host country: El Salvador 3. Brief project description: ACTIVITIES IMPLEMENTED JOINTLY(AIJ) List of Projects USIJI Uniform Reporting Document: Activities Implemented Jointly Under the Pilot Phase  Your location: Home",
    "textAfterTable": "Fax (503) 243 7717 E-mail cessaof@es.com.sv World Wide Web-URL address http://www.cessa.com.sv/ Administrative Officer Responsible for the Project Surname Herrera First name, middle name Luis Mariano Job title Quality Control and Environment Manager Direct telephone (503) 888 1736 Direct fax (503) 442 0194 Direct e-mail mailto:cessateca@cessa.com.sv Contact Person for AIJ Activities (if different from the Administrative Officer) Surname Quevedo First name, middle name Marco Antonio",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}