{
    "relation": [
        [
            "Patent application number",
            "20130333100",
            "20140150168",
            "20140325745"
        ],
        [
            "Description",
            "FOOTBALL HELMET - A football helmet with shell, faceguard, padding and comfort liner system, has replaceable nose bumpers for connecting a top center of the faceguard to the shell, button and keyhole connectors connecting the liner to an inner surface of the padding and T-nut connectors for connecting the padding to an inner surface of the shell. Front portions of the comfort liner have harder foam cushions than other portions of the liner to improve impact absorption. Selected areas of the padding system contain pads with inner and outer molded thermoplastic urethane parts of different durometer, each including a sheet with plural alternating hollow protrusions. The faceguard has an upper bar with raised ends above a lower edge of the front portion of the shell that form a face opening and on either side of the nose bumper.",
            "Pivoting Dual Chin Strap Snap Feature for Football Helmet - A football helmet having a shell, and having a chin protector with chin cup and chin straps, has dual snaps on its chin strap buckles and dual snaps on each side of the helmet shell for improving the snap connection between the chin straps and the helmet to reduce the chances the helmet wearer will loose the helmet during play. Dual snaps on the sides of the helmet are carried on pivoting snap carriers to allow the chin protector to rotate with respect to the helmet shell.",
            "BATTING HELMET - A liner assembly for a protective helmet which includes a wrap-around pad designed to be engaged to the inner surface of a helmet. The wrap-around pad has multiple substantially circular cells spaced along a curved line around the inner surface. The assembly also has a crown pad and two jaw pads. Each jaw pad is an cell L-shaped cell. Each cell is made of an inner sheet, an outer sheet and multiple, outwardly-projecting hollow protrusions."
        ],
        [
            "Published",
            "12-19-2013",
            "06-05-2014",
            "11-06-2014"
        ]
    ],
    "pageTitle": "Erb, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/erb-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440334299,
    "recordOffset": 440316602,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Robert Erb, Plandome, NY US 01-17-2013 VENTILATED AIR LINER FOR A HELMETAANM Erb; RobertAACO USAAGP Erb; Robert USAANM Drake, JR.; Raymond J.AACI SalemAAST ILAACO USAAGP Drake, JR.; Raymond J. Salem IL USAANM Warmouth; CortneyAACI EdwardsvilleAAST ILAACO USAAGP Warmouth; Cortney Edwardsville IL USAANM VanHoutin; Louis AnthonyAACI LukaAAST ILAACO USAAGP VanHoutin; Louis Anthony Luka IL USAANM Long; Vincent R.AACI St. PetersAAST MOAACO USAAGP Long; Vincent R. St. Peters MO US - A helmet has a ventilated shell, ventilated padding and a ventilated liner of plural cells mounted to the padding for engaging a wearer's head. The liner has top and bottom flexible sheets fused around their perimeter, the bottom sheet having plural round or oval toroidal cells and plural round or oval closed cells, the openings in the toroidal cells extending through the top sheet. Foam at least partly fills each cell. Cells under a crown of the shell are connected in a first circuit with a valve for inflating these cells and a other cells under temporal and occipital portions of the shell are connected in a second inflation circuit with a valve for inflating the second plurality of the cells. Cells under the frontal portion not being inflatable and being substantially filled with foam padding. 20130014313 Published Description Patent application number Robert Erb US 11-04-2010 NONLINEAR MAGNETOPHORETIC SEPARATION OF BIOLOGICAL SUBSTANCES - A method of separating a target biological analyte from a mixture of substances",
    "textAfterTable": "Scott Erb, Alexandria, VA US Patent application number Description Published 20110080028 DYNAMIC FURNITURE - Dynamic furniture having platforms in dynamic attachment to an actuator assembly that in turn is in dynamic attachment to a base. Use of motional platforms supported by a motional actuator assembly permits an article of the furniture to conform to the many and varied body positions a user wants, and allows a user to more easily change body positions while remaining within the furniture, and in medical scenarios may obviate most needs to transfer a patient from one article of furniture to another. 04-07-2011 20130009436 DYNAMIC FURNITURE - Dynamic furniture having platforms in dynamic attachment to an actuator assembly that in turn is in dynamic attachment to a base. Use of motional platforms supported by a motional actuator assembly permits an article of the furniture to conform to the many and varied body positions a user wants, and allows a user to more easily change body positions while remaining within the furniture, and in medical scenarios may obviate most needs to transfer a patient from one article of furniture to another. 01-10-2013 20140091605 DYNAMIC FURNITURE - Dynamic furniture supports a seated or reclining user. The furniture includes a base, an actuator, a seat platform, and a back platform. The actuator is in circular connection to the base. The seat platform is in circular or excentric connection to the actuator assembly. The",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}