{
    "relation": [
        [
            "Pujols' postseason",
            "Division Series",
            "League Championship",
            "World Series"
        ],
        [
            "AB",
            "15",
            "28",
            "7"
        ],
        [
            "R",
            "4",
            "10",
            "1"
        ],
        [
            "H",
            "5",
            "14",
            "3"
        ],
        [
            "HR",
            "2",
            "4",
            "0"
        ],
        [
            "RBI",
            "5",
            "9",
            "0"
        ],
        [
            "Avg.",
            ".333",
            ".500",
            ".429"
        ]
    ],
    "pageTitle": "USATODAY.com - Cards' Pujols a professional hitter",
    "title": "",
    "url": "http://usatoday30.usatoday.com/sports/baseball/nl/cardinals/2004-10-26-pujols-feature_x.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 253851259,
    "recordOffset": 253828312,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75845=\"What you see so far in the postseason, he's had four years of that,\" said Cards manager Tony La Russa, after one of Pujols' many big nights in the October spotlight., 78773=\"The one thing people need to realize about Albert is he's as down-to-earth as you can get,\" said Larry Walker, who watched Pujols from the opposing dugout for 31/2 years before becoming a teammate in August. \"A lot of people who have had his kind of success in life, never mind sports, lose track of who they are, what they are. Albert hasn't.\", 79474=There he met his future wife, Deidre, a single mother with an infant daughter with Down syndrome. They were married in January 2000 and Pujols legally adopted Bella, now 6. They also have a son, AJ, 3, and the couple is active in the community raising funds for Down syndrome research.}",
    "textBeforeTable": "The Hall-of-Fame-to-be pitcher gets ahead in the count 1-2, busts Pujols inside with a fastball and watches as the Cards first baseman with lightning quick hands rifles a liner down the left-field line for a game-tying double. He isn't the only one surprised. \"Funny thing is, I said (before the pitch), 'If he throws him a fastball in, he's going to blow him up,' meaning he's going to blow up his bat,\" St. Louis pitcher Matt Morris said. \"Albert proved me wrong.\" Four seasons and 504 runs batted in after he jumped from Class A to major league stardom, Pujols continues to amaze even his teammates. \"It's pretty scary to think he has gotten better every year,\" Cards reliever Jason Isringhausen said. \"If he gets any better, I don't know what we're going to do.\" The 24-year-old native of the Dominican Republic is the best young player in the game and not far from removing the qualifying adjective. He enters Game 3 Tuesday with a .440 batting average over 13 postseason games, with six home runs and 14 runs batted in. \"What you see so far in the postseason, he's had four years of that,\" said Cards manager Tony La Russa, after one of Pujols' many big nights in the October spotlight. \"He is so focused on what he does. He wants to be the best player in the game, of all-time,\" Cardinals",
    "textAfterTable": "R H HR RBI Avg. Division Series 15 4 5 2 5 .333 League Championship 28 10 14 4 9 .500 World Series 7 1 3 0 0 .429 The maturity Pujols has demonstrated off the field is also apparent in his play. He works almost obsessively at his craft. \"He gets mad at himself. I've got the locker right next to him, so I hear him after games,\" Isringhausen said. Pujols constantly studies videotapes of his at-bats against upcoming pitching opponents and will hit as many as three sessions a day in the batting cage. \"He has no flaws in his mechanics,\" Houston first baseman Jeff Bagwell said. While the heart of the Cardinals lineup was stymied in the first two games of the World Series, Pujols continued to contribute. He went 0-for-3 in Game 1 but still reached base on an intentional walk and hit-by-pitch. Sunday, he had three of the Cards' five hits, including two doubles, to lift his Series average to .429 (3-for-7). After Pujols and Walker (4-for-9), the rest of the Cardinals team is batting .177 in the Series.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}