{
    "relation": [
        [
            "Citing Patent",
            "US8566577 *",
            "US20120137121 *"
        ],
        [
            "Filing date",
            "Nov 30, 2010",
            "Nov 30, 2010"
        ],
        [
            "Publication date",
            "Oct 22, 2013",
            "May 31, 2012"
        ],
        [
            "Applicant",
            "Blackberry Limited",
            "Research In Motion Limited"
        ],
        [
            "Title",
            "Method and device for storing secured sent message data",
            "Method and device for storing secured sent message data"
        ]
    ],
    "pageTitle": "Patent US8150923 - Schema hierarchy for electronic messages - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8150923?dq=7181427",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486741875,
    "recordOffset": 486685366,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{367760=Program code means comprising one or more program modules may be stored on hard disk 739, magnetic disk 729, optical disk 731, ROM 724 or RAM 725, including an operating system 735, one or more application programs 736, other program modules 737, and program data 738. A user may enter commands and information into computer system 720 through keyboard 740, pointing device 742, or other input devices (not shown), such as, for example, a microphone, joy stick, game pad, scanner, or the like. These and other input devices can be connected to the processing unit 721 through input/output interface 746 coupled to system bus 723. Input/output interface 746 logically represents any of a wide variety of different interfaces, such as, for example, a serial port interface, a PS/2 interface, a parallel port interface, a Universal Serial Bus (“USB”) interface, or an Institute of Electrical and Electronics Engineers (“IEEE”) 1394 interface (i.e., a FireWire interface), or may even logically represent a combination of different interfaces.}",
    "textBeforeTable": "Patent Citations The present invention may be embodied in other specific forms without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive. The scope of the invention is, therefore, indicated by the appended claims rather than by the foregoing description. All changes, which come within the meaning and range of equivalency of the claims, are to be embraced within their scope. is illustrative only and by no means represents even a small portion of the wide variety of environments in which the principles of the present invention may be implemented. FIG. 7 represents a suitable operating environment for the present invention, the principles of the present invention may be employed in any system that is capable of, with suitable modification if necessary, implementing the principles of the present invention. The environment illustrated in FIG. 7 While , input/output interface 746 and modem 754 facilitate the exchange of data with remote computer system 793 via link 752. Link 752 represents a portion of a network and remote computer system 793 represents a node of the network. FIG. 7 Likewise, computer system 720 includes input/output interface 746, through which computer system 720 receives data from external sources and/or transmits data to external sources. Input/output interface 746 is coupled to modem 754 (e.g., a standard modem,",
    "textAfterTable": "US5848415 * Dec 18, 1996 Dec 8, 1998 Unisys Corporation Selective multiple protocol transport and dynamic format conversion in a multi-user network US5911776 * Dec 18, 1996 Jun 15, 1999 Unisys Corporation Automatic format conversion system and publishing methodology for multi-user network US6112024 * Oct 2, 1996 Aug 29, 2000 Sybase, Inc. Development system providing methods for managing different versions of objects with a meta model US6134582 * May 26, 1998 Oct 17, 2000 Microsoft Corporation System and method for managing electronic mail messages using a client-based database US6212553 * Feb 4, 1998 Apr 3, 2001 Microsoft Corporation Method for sending and receiving flags and associated data in e-mail transmissions US6260050 Jun 30, 1999 Jul 10, 2001 Microstrategy, Inc. System and method of adapting automatic output of service related OLAP reports to disparate output devices US6324569 Jul 18, 2000 Nov 27, 2001 John",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}