{
    "relation": [
        [
            "Condition:",
            "Type:",
            "Color:",
            "Material:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Headband",
            "Brown",
            "Polyester"
        ],
        [
            "Gender:",
            "Size:",
            "Brand:",
            ""
        ],
        [
            "Girls",
            "One Size",
            "Handmade",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Brown-Headband-for-Baby-Girl-Newborn-Baby-Hair-/151228102062?hash=item2335e5b5ae",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422380343,
    "recordOffset": 422335748,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Feb 07, 2015 16:29:31 EST  Seller assumes all responsibility for this listing. 151228102062 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "Made To Order  This Flower headband is made of Lace, acrylic, Matte Tulle and , The Headband in 1.5 inch high crochet headband.A beautiful satin and tulle layered feathered flower puff measuring approximately 4\"  inches wide . Great for any age and occasion!  Thank you for viewing my listing please visit my store..for something for mommy! Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}