{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Very Cold",
            "Very Cold",
            "Moderately Cold",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Moderately Cold",
            "Moderately Cold",
            "Very Cold"
        ],
        [
            "Details",
            "This is the coldest month of the year and temperatures can dip down to extreme cold level. Hailstorms can be a frequent occurrence during this period. Favorable for tourist who enjoy chilly holidays. It is also a great month for taking up packages for honeymoon in Darjeeling. Heavy woolens are required and those tourists travelling with kids or old people need to take extra care.",
            "The weather is very cold in February month. The temperature starts to rise a little but still remains cold. Although the climate is chilly, February is one of the best times for visiting Darjeeling and enjoying the natural beauty. The time is also favorable for sighting attractions as well as other outdoor activities.",
            "The weather starts to warm up giving a new life to the natural beauty. Days are quite pleasant while nights are cold. It is the most beautiful month as spring dawns. The climate is favorable for indulging in sightseeing and outdoor activities. One of the ideal months for tourism in Darjeeling.",
            "The weather is pleasant with cool days and chilly evenings. Light woolens might be required at night. Good time for sightseeing, vacationing and enjoying the various adventure activities like hiking, rock climbing, camping and water sports.",
            "The weather starts to get warm and becomes very comfortable for outdoor activities. This is a high time for tourism as the weather is pleasant during the day and cool in the night. A perfect time for indulging in adventurous activities like hiking, camping and numerous watersports. Sighting attractions is very enjoyable during this period.",
            "This month is good for visiting but rainfall starts from the middle of this month and tourists need to carry rain protective gears. The intensity of rains varies but it is not a major cause of inconvenience. It is a popular tourist month.",
            "The monsoon truly arrives and heavy rainfall almost brings a halt to the lives of the people. Sometimes, rainfall is accompanied by lightning and thunder. July receives the highest amount of rainfall making it the wettest month of the year and enjoying outdoor activities might be a challenge. Seasonal waterfalls can be enjoyed but the due to rains the place is prone to landslides. Being off-season month, the prices of holiday packages as well as hotels are also lower in comparison to peak season.",
            "Monsoon continues and the place receives heavy rainfall accompanied by lightning and thunder. The climate is comfortable but rains can cause disruption to your holiday. Landslides are common occurrence in monsoon. Rainy season is not a best time for visit. However, in monsoon hotel rates are comparatively lower than peak months.",
            "Monsoon starts to shift but intermittent rainfall can occur, though it is not of much annoyance. The weather is pleasant with clear skies and bright days most of the time. It is the beginning of the official tourist season for Darjeeling. Tourist can roam around and enjoy the scenic breath-taking views of the hill-station.",
            "One of the best months for visiting Darjeeling as the natural beauty has blossomed to its maximum. The weather is cool during the days and chilly during the nights, making it a good time for tourist activities. One can take up Darjeeling tour package from Kolkata and enjoy all kinds of adventure and sightseeing.",
            "Temperature starts to dip down and winter season approaches. The weather becomes a bit cold but comfortable for tourism. The sky remains clear and blue for most of the time. It is one of the best months to enjoy sightseeing, adventure and other tourist activities.",
            "Winters start and the weather will get colder by the end of this month. A good time for sightseeing and other tourist activities, however extra precaution needs to be practiced if travelling with children or old people. Besides, carrying heavy woolens are recommended for this season."
        ]
    ],
    "pageTitle": "DARJEELING Weather, Temperature, Best Season, Darjeeling Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Darjeeling-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 605072363,
    "recordOffset": 605035411,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Darjeeling Weather Home  ›  Destinations  ›  West Bengal  ›  Darjeeling  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Sep - June Summer 19 to 37Â°C, Winter -2 to 24Â°C Best Season / Best time to visit Darjeeling Darjeeling has a moderate climate with all five distinct seasons in a year. The best season to visit the place is from September to June, take woolen clothes in winters. Winters (December to January) have a cool climate within the average range of 5 °C to 7 °C. Minimum temperature this season can be freezing â\u0080\u00932 °C. Snowfalls are not common during winters. It is an ideal time for honeymoon in Darjeeling. Spring (February to March) season is charming with moderate climate. This season is best with scenic beauties. Summers (April to June) are mild with maximum temperature never crossing 25 °C. the pleasant climate attracts lots of tourists during this season. The time is favorable for all tourist activities. Monsoons (July to August) are accompanied with intense torrential rain causing roadblocks. Autumn (September to November) is accompanied with intermittent showers and Darjeeling looks marvelous during this",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}