{
    "relation": [
        [
            "Release",
            "Release 3.7.2",
            "Release 3.9.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "L2VPN Address Family support was added."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router Routing Command Reference, Release 4.1 - BGP Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-1/routing/command/reference/b_routing_cr41asr9k/b_routing_cr41asr9k_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368994635,
    "recordOffset": 368861524,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{912347=(Optional) Size, in bytes, of the receive buffer in BGP. Range is 512 to 131072., 912027=Size, in bytes, of the receive-side socket buffer. Range is 512 to 131072., 281227=The following example shows that autonomous systems 1095, 1096, 1097, and 1098 belong to a single confederation:, 1017941=Size, in bytes, of the send-side socket buffer. Range is 4096 to 131072., 287915=suppress : 2000, 657802=The following example shows how to allow a BGP connection to neighbor 172.20.16.6 of up to 255 hops away:, 291340=The following example shows how to set the half-life value to 30 minutes, the reuse value to 1500, the suppress value to 10000, and the max-suppress-time to 120 minutes:, 270684=The following example shows how to divide the autonomous system into autonomous systems 4001, 4002, 4003, 4004, 4005, 4006, and 4007 with the confederation identifier 5. Neighbor 10.2.3.4 is a router inside the confederation. Neighbor 172.20.16.6 is outside the routing domain confederation. To the outside world, there appears to be a single autonomous system with the number 5., 1018259=(Optional) Size, in bytes, of the BGP process send buffer. Range is 4096 to 131072.}",
    "textBeforeTable": "Syntax Description accept-own no [inheritance-disable] accept-own To enable handling of self-originated VPN routes containing ACCEPT_OWN community attribute, use the accept-own command in neighbor VPNv4 or VPNv6 address family configuration mode. To disable this functionality, either use the no form of this command or use the command with inheritance-disable keyword. accept-own weight vrf (BGP) use update-source ttl-security timers bgp timers (BGP) table-policy speaker-id soft-reconfiguration inbound socket send-buffer-size socket receive-buffer-size site-of-origin (BGP) signalling disable shutdown (BGP) show protocols (BGP) show bgp vrf imported-routes show bgp update-group show bgp truncated-communities show bgp summary nsr show bgp summary show bgp sessions show bgp session-group show bgp route-policy show bgp regexp show bgp process show bgp policy show bgp paths show bgp nsr show bgp nexthops show bgp neighbors nsr show bgp neighbors show bgp neighbor-group show bgp l2vpn vpls",
    "textAfterTable": "Command Modes Neighbor address family VPNv4 Neighbor address family VPNv6 Command History Release Modification Release 4.1.1 This command was introduced. Usage Guidelines Task ID Task ID Operation bgp read, write Examples This example shows how to enable handling of accept-own community:  RP/0/RSP0/CPU0:router#configure RP/0/RSP0/CPU0:router(config)#router bgp 100 RP/0/RSP0/CPU0:router(config-bgp)#neighbor 10.2.3.4 RP/0/RSP0/CPU0:router(config-bgp-nbr)#address-family vpnv4 unicast RP/0/RSP0/CPU0:router(config-bgp-nbr-af)#accept-own additional-paths install backup Note Effective with Release 4.0.0, the additional-paths install backup command was deprecated and replaced by the additional-paths selection command. See the additional-paths",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}