{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "San Rafeal, CA is a beautiful area with lots to do. The campus is also very close to San Francisco, CA.",
            "Great food! Lots of healthy options to choose from.",
            "Do not plan on living in a dorm.",
            "Have not attended classes yet.",
            "Take a campus tour with a student ambassador. They are very helpful! It also gives you a completed look at the campus and a students idea of what the school is really like.",
            "The campus is absolutely beautiful! The admissions staff has been so helpful and really eager to guide you through the admissions process. The university offers a wonderful variety of opportunities to advance your education."
        ]
    ],
    "pageTitle": "Dominican University of California Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Dominican-University-of-California/reviews?_escaped_fragment_=/show/91933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915407703,
    "recordOffset": 915360704,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{184880=© 2015, Cappex.com, LLC, 141987=Dominican is a beautiful, lush campus that is welcoming for everyone. The teacher to student ration is about 1:15 which is great for learning and getting one-on-one help. The teachers and staff want you to succeed and will make it happen!}",
    "textBeforeTable": "08/03/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 41 Amber from El Sobrante, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Nina from Richmond, CA 12/29/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 41 Categories Comments Great for these types of students Its great for the type of students that enjoy a slower paced environment or students that need to truly focus on school such as myself. I know that if i was placed in a large school with plenty of partying and everything i would be completely distracted from my studies so Dominican is the perfect fit for me. Tips for prospective students The only thing that needs to be watched out for in Dominican is the fact that it is indeed a small school which means that it is easy to get caught up in rumors and high school drama but it is also easy to extricate yourself from all of those situations. The benefit of going to a small school is that you are actually a person to everyone rather than just a number or a student ID. Everyone is pretty close and its a real community. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}