{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "it's actually really good. if you don't feel safe at nights while walking to your car, you can actually call a security guy and they can walk you to your car. Plus they have cameras everywhere.",
            "assist to all the events that are in campus. they are really fun and entertaining.",
            "the cafeteria is really good. The food is great and fresh.",
            "Doesn't offer dorms.",
            "As everything in life, not everything is simple but if you try you're best, best results might come out at the end.",
            "Try to have a clear pattern. If you don't have one do research as much as possible. Even if you're not interest in completing an associates, try to finish one because that's better than no having anything.",
            "CCA is a great place to start. There's no need to spend a lot of money for the same education. the general studies can be learn in here and the teachers are really good."
        ]
    ],
    "pageTitle": "Community College of Aurora Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Community-College-of-Aurora/reviews?_escaped_fragment_=/show/17100",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908677099,
    "recordOffset": 908639572,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{969=yes I'm excited to go in august, 160933=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "04/30/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 4 people found this review useful. 1 of 40 Kendra from Aurora, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Great for these types of students CCA is a good start for anyone, but students who did not do so well in high school, who are returning after many years out of school, or who do not know what they want to do with there future will find their place at CCA. This institution has so much variety in course options, learning styles, and people to assist. CCA made me, the 27 year old mother of 10 years, who got a GED at 18 and could not decide on a major the 2 other times I attempted to go to school feel right at home, motivated, and capable. Tips for prospective students See a counselor, they are there to help and they are worth your time. Plan your classes ahead of time, even if you don't know what you will major in look at the grad requirements for a general education degree and plan as many classes in advance as you can. A lot of the best classes offered at CCA may only be available during certain semesters so always be aware of when they are offered. Know your options for payment, CCA is ready and willing to help pay for your experience at their facility so get involved and know what they can offer you. Finally, enjoy the ride, the professors at CCA are often more than just book worms, they have life experience and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}