{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "York Tech is a very safe environment. There is campus security readily available at all time. Campus security also patrols the campus on a regular basis.",
            "York Technical college does not have a greek chapter. They typically have clubs and organizations on campus but we do not have sororities or fraternities. As a tech school we focus more on student success in the classroom and less about the typical college scene like greek life.",
            "There are many clubs at York Tech that students can be apart of. There are also many organizations that the clubs volunteer with as part of community service around the Rock Hill area.",
            "York Tech is great for students who do better in smaller classes. Student's who strive to perform with as little distraction as possible will excel greatly here. Also if you are looking for a program to finish in a short amount of time, York Tech will provide you with the skills you need to be successful",
            "The newest building is the Science and Technology building. It is a more modern setting and has become a nice location on campus to study in the lobby. The courtyard is also a nice place to sit and relax after a long day of classes.",
            "York Tech has provided stellar faculty. The professors are always willing to stay after class and answer questions. They are super easy to get a hold of and typically resound back immediately. They truly focus more on student success rather than just fulfilling their daily classroom agenda.",
            "Due to it's smaller campus size most student will go to eat together in surrounding areas near campus. However, they have a dance party every wednesday in the student center. Students may also join some of the clubs on campus.",
            "York Technical College has provided a student center with food and drink on campus. It's always packed in the student center and the bookstore also offers food and drink for students. The dining hall is always open with friendly services to students.",
            "York Tech does not offer dorm rooms but there are many opportunities for housing due to its close proximity to Winthrop's University Village. Due to York Tech being a smaller technical college most students still reside with their parents or have their own residence. Therefore, the dorm life at York Tech is pretty non existent.",
            "The academic rigor is entirely up to the student's motivation. My professors have always set proficient deadlines for school work and were willing to adjust according to the classes needs. The smaller class sizes give a more intimate setting and allow for effective discussion.",
            "I would recommend that prospective students are aware of the out of state tuition requirements and are proactive about finding scholarships. Also prospective students should not be shy about meeting department heads and their potential professors before hand. It makes such a difference in your college experience when you get to know your instructors.",
            "York Technical College is 10 out of 10. This college was the perfect match for me as far as preparing me for my field of study. The staff and faculty are tremendous at helping you plan for your future effectively."
        ]
    ],
    "pageTitle": "York Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/York-Technical-College/reviews?_escaped_fragment_=/show/107216",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913074811,
    "recordOffset": 913047463,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110873=© 2015, Cappex.com, LLC, 40476=The Word 2010 Theory tests are rediculous and should be reconsidered.}",
    "textBeforeTable": "04/22/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 27 Tonia from Rock Hill, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am learning a lot The classes are great! The teachers are very knowledgeable about the topic and encouraging. Login to rate or flag the reviews Emillie from Rock Hill, SC 11/28/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 27 Categories Comments Campus Safety Excellent campus safety. Greek Life None. Clubs and Activities None. Great for these types of students It is a great place for students who do not know what they want to pursue or for older students coming back to recieve a degree. Share any unusual traditions or locations on campus none. Bang for the buck It is a great place to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}