{
    "relation": [
        [
            "Activity Cost Pool",
            "1. Purchasing & receiving",
            "2. Machining, power & maintenance",
            "3. Materials planning & handling",
            "4. Machine set-up"
        ],
        [
            "Annual Costs",
            "$5,000,000",
            "8,000,000",
            "2,000,000",
            "1,000,000"
        ],
        [
            "Activity Measure",
            "Number of purchase orders",
            "Number of machine hours",
            "Number of material dollars",
            "Number of machine set-ups"
        ]
    ],
    "pageTitle": "Management Accounting: Concepts, Techniques, and Controversial Issues - Chapter 7: Activity Based Product Costing",
    "title": "",
    "url": "http://maaw.info/Chapter7.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 157225143,
    "recordOffset": 157187948,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118962=16 These factors and trends are discussed in the CAM-I conceptual design. Also see Howell, R. A. and Stephen R. Soucy, 1987. The new manufacturing environment: Major trends for management accounting. Management Accounting (July): 21-27., 117930=13 See Callie Berliner and James A. Brimson, editors. 1988. Cost Management for Today's Advanced Manufacturing: The CAM-I Conceptual Design. Harvard Business School Press. (See the CAM-I Main page)., 116937=8 For the source of this distinction, see Brimson, J. A. 1991. Activity Accounting: An Activity-Based Approach (John Wiley & Sons): 121., 107263=The CMS program was organized in 1986 to improve management planning and control systems. To aid in the development and implementation of CMS, CAM-I published a conceptual design document in 1988 that focuses on managing costs through emphasis on the activities performed within a company.13 Thus, activity based accounting provides the foundation for the CMS conceptual design. The main goals of the CMS program are to help companies develop systems that are more proactive in the areas of planning, managing and reducing costs before the costs are incurred, as well as to develop systems that more accurately trace costs to products. To accomplish these goals, CAM-I's activity accounting system is developed around a data base concept where data is captured only once to satisfy multiple requirements. In addition to helping companies develop pilot ABC projects, CAM-I helps companies change from traditional management systems (purchasing, production and distribution) to just-in-time systems (JIT), then flexible manufacturing systems (FMS) and finally computer integrated manufacturing (CIM). These concepts and systems are discussed in the next chapter., 118497=15 See Hughes, S. B. and K. A. Paulson Gjerde. 2003. Do different cost systems make a difference? Management Accounting Quarterly (Fall): 22-30. (Summary). For an exception, see Mangan, T. N. 1995. Integrating an activity-based cost system. Journal of Cost Management (Winter): 5-13. (Summary)., 114526=1 The source of the term activity based costing is attributed to John Deere Company and appeared in a Harvard Business School Case (187-107) published in 1987. Robin Cooper and Robert Kaplan quickly adopted the ABC terminology and the rest of the world followed their lead. An older term used for the ABC approach is transaction costing. Although the terminology is relatively new, the ideas can be traced back to around 1910 in articles written by Alexander Hamilton Church. See Relevance Lost, Chapter 3 for a discussion of Church's ideas and references. (Relevance Lost Main). (See MAAW's ABC topic)., 48676=Assume that Company A produces two products, V1 and V2 with the annual production volumes and product characteristics presented in Exhibit 7-4.10 To emphasize the key issues involved without unnecessary complications, assume that the firm has only one production department so that all service department costs are allocated to this single department in stage 1 cost allocations.11 This simplifying assumption allows us to ignore the first stage allocations that would only distract from the issue that we want to examine. To further simplify the illustrations, we will also assume that the activity costs are perfectly correlated to the activity measures chosen. Of course this is an unrealistic assumption, but when there are only two products, it allows us to isolate the cost distortions caused by production volume differences and product size differences precisely., 115703=4 See Johnson, H. T. 1989. Professors customers and value: Bringing a global perspective to management accounting. Proceedings of the Third Annual Management Accounting Symposium, (American Accounting Association): 16. (Summary)., 115481=3 This idea is discussed in more depth by Cooper, R. and R. S. Kaplan. 1991. The Design of Cost Management Systems: Text, Readings and Cases. Prentice Hall: 275-276., 116668=7 For a more elaborate discussion of this cost classification scheme, see Cooper, R. 1990. Cost classification in unit-based and activity-based manufacturing cost systems. Journal of Cost Management (Fall): 4-14., 116222=6 This point is discussed by Cooper, R. 1989. The rise of activity costing - Part three: How many cost drivers do you need, and how do you select them? Journal of Cost Management (Winter): 34-46; and Kaplan, R. S. 1993. Research opportunities in management accounting. Journal of Management Accounting Research (5): 1-14. (Summary)., 119256=17 According to Johnson, this happened in the semiconductor industry. See Johnson, H. T. 1989. Managing costs: An outmoded philosophy. Manufacturing Engineering (May)., 118214=14 For example, see Martin, J. R. 1994. A controversial-issues approach to enhance management accounting education. Journal of Accounting Education (Winter): 59-75. (Summary)., 106636=CAM-I is an acronym that stands for Consortium of Advanced Management International. The consortium (pronounced, kan-sor-she-am) is made up of industrial organizations, government agencies, universities and professional accounting firms that formed in 1972 to work together in a variety of research programs. Although most of CAM-I's research programs are related to engineering and production, one program referred to as cost management systems (CMS) is related to accounting and more specifically to the material presented in this chapter.}",
    "lastModified": "Sun, 10 May 2015 14:43:18 GMT",
    "textBeforeTable": "The generalizations in the previous paragraphs are summarized in Exhibit 7-1. The effects of product volume differences and product sized differences are illustrated in the examples below. The effects of differences in product complexity are illustrated in some of the problems at the end of this chapter. Product complexity generally refers to product design complexity. Products with complex designs are likely to require more engineering work, more materials related support (e.g., purchasing and materials movement), perhaps longer machine setups and more inspections than less complex products. These additional demands on the various support activities generally cause relatively complex products to be undercosted and relatively simple products to be overcosted. In addition, products that require a relatively large number of parts, unique parts and relatively more, long or complex machine setups tend to be undercharged with overhead while products that require relatively few parts, common parts, relatively few setups, short or simple setups tend to be overcharged. Cost distortions from product differences occur when there are variations in product size and product complexity. Small products tend to require less production volume related input (such as direct labor time) than large products, although they do not require less support in proportion to their size. Therefore small products tend to be undercosted, while large products tend to be overcosted. Product Diversity Cost distortions from product volume differences occur when a company produces one, or more, high volume products (i.e., a relatively large number of units) and one, or more low volume products (i.e.,",
    "textAfterTable": "Product Complexity Complex design Undercost Simple design Overcost Product Materials Requirements Requires many, or unique parts, i.e., only used on a single product. Undercost Requires few, or common parts, i.e., same part used on many products. Overcost Product Machine Setup Requirements Requires many, long or complex machine setups. Undercost Requires few, short or simple machine setups. Overcost THE LOGIC OF ABC Activity based costing is based on the following ideas. First, designing, producing and distributing products and services requires many activities to be performed. Performing these activities requires resources to be purchased and used. Purchasing and using resources causes costs to be incurred. Restated in reverse order, the ABC logic is that resources generate costs, activities consume resources and products consume activities. Thus, a company's activities are identified, then costs are traced to these activities (or activity cost pools) based on the resources that they require. Then, costs are assigned, or traced from each of these activity cost pools to the company's products (or services) in proportion to the demands that each product (or service) places on each activity. In ABC, a measure of the relevant activity volume is used to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}