{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "I have not tasted the food.",
            "I have not seen the dorm.",
            "The academics from what I heard is hard but essential."
        ]
    ],
    "pageTitle": "Concordia University-Chicago Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Concordia-University-Chicago/reviews?_escaped_fragment_=/show/14897",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913605231,
    "recordOffset": 913564257,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{151692=As of 2014, CUC is ranked at the top of Illinois schools for education. As an Elementary Education major, I can attest to the fact that Concordia has knowledgeable professors and plenty of opportunities for teaching experience; they put you in the classroom during freshman year. I can't say that my teaching classes have been a breeze, but the experience is valuable and authentic. I definitely feel more prepared to enter the profession., 60951=With all the different places to get food on campus it is very convenient. Also the cafeteria is 'all you can eat' but the food in the cafeteria is 90% of the time is fried food, pizza, or burgers and after 7:00 the menu is 95% fried food. The best time to eat is from 5:00-7:00 and at the classic cuisine section of the cafeteria, which has healthier food., 161772=© 2015, Cappex.com, LLC, 78726=Usually within the first few months of being back, Concordia welcomes back various graduating classes. These classes range from anywhere between the graduating class of 1960 to the mid 2000s. It is awesome to come together as one with these alumni, to hear their stories and spend time with them. There are hymn sings on the front steps of Addison Hall-the main building on campus where most classes are held and it is the oldest building on campus on Sunday nights., 44741=There is a chapel that you can attend if you like. Also on Mondays classes don't start until 11:30.}",
    "textBeforeTable": "03/09/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 35 Heather from South St Paul, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "I knew choosing this school was right. I had only interacted with a few people for various visiting days, but now that I am a resident I am truly experiencing college. My friends and professors are amazing. Everyone is so friendly that I can say hello to a complete stranger and they will reply the same and even hold the door open for me. This college has such a perfect community I never saw such good things happening after high school. Everyone has left the high school drama behind and commenced a new higher knowledgeable life at the school. Everyone is willing to help one another including the professors to make sure that each student is learning to their highest ability with the writing center and personal tutors and questions answered directly from the professor. I don’t think I could ever ask for a better college to spend so much time at. Am learning a lot This college had provided me with the opportunity to take classes that no matter what the subject I learn a lot. My general courses and my specified classes are all very informational for life itself. The professors know how to relate life to the classes and then also to our Christian beliefs. I feel that I am learning things that will provide me with a good base foundation for life no matter where I might end",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}