{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "195,348",
            "67,781",
            "67,212",
            "23,940",
            "8,423",
            "4,004",
            "438,613"
        ],
        [
            "Congregations",
            "392",
            "12",
            "69",
            "57",
            "10",
            "8",
            "-"
        ]
    ],
    "pageTitle": "Suwanee, Georgia (GA 30024) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Suwanee-Georgia.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366767619,
    "recordOffset": 366623460,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25817=Elevation: 1013 feet, 7090=According to our research of Georgia and other state lists there were 18 registered sex offenders living in Suwanee, Georgia as of July 31, 2015. The ratio of number of residents in Suwanee to the number of sex offenders is 903 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{55902=2004 Presidential Elections Results, 36464=Carbon Monoxide (CO) [ppm] level in 2002 was 0.602. This is significantly worse than average. Closest monitor was 16.4 miles away from the city center., 13327=On 11/22/1992, a category F4 (max. wind speeds 207-260 mph) tornado 22.0 miles away from the Suwanee city center injured 46 people and caused between $5,000,000 and $50,000,000 in damages., 31314=Hotels: Days Inn (3103 Lawrenceville Suwanee Rd), Comfort Suites Suwanee (& I-85 Exit 111), Comfort Inn Suwanee (2945 Highway 317), Fairfield Inn Atlanta Suwanee (105 Gwinco Boulevard), Courtyard by Marriott (310 Gwinco Boulevard)., 52514=School Enrollment by Level of School (%) in 2013, 56474=2012 Presidential Elections Results, 83758=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 35817=Air Quality Index (AQI) level in 2012 was 74.3. This is about average., 190816=Total of 1279 patent applications in 2008-2015., 192126=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 40151=Lead (Pb) [µg/m3] level in 2012 was 0.00158. This is significantly better than average. Closest monitor was 22.5 miles away from the city center., 55616=2000 Presidential Elections Results, 39401=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.29. This is about average. Closest monitor was 6.2 miles away from the city center., 37200=Nitrogen Dioxide (NO2) [ppb] level in 2006 was 12.6. This is significantly worse than average. Closest monitor was 16.4 miles away from the city center., 56188=2008 Presidential Elections Results, 13613=On 4/3/1974, a category F4 tornado 26.5 miles away from the city center killed 6 people and injured 30 people and caused between $500,000 and $5,000,000 in damages., 52116=Educational Attainment (%) in 2013, 73432=8.69% of this county's 2011 resident taxpayers lived in other counties in 2010 ($35,247 average adjusted gross income), 75634=8.20% of this county's 2010 resident taxpayers moved to other counties in 2011 ($37,275 average adjusted gross income), 37945=Ozone [ppb] level in 2012 was 29.1. This is about average. Closest monitor was 16.4 miles away from the city center., 56758=Graphs represent county-level data. Detailed 2008 Election Results, 55330=1996 Presidential Elections Results, 38645=Particulate Matter (PM10) [µg/m3] level in 2012 was 15.2. This is better than average. Closest monitor was 15.8 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Suwanee city (based on Gwinnett County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (3%) Electricity (29%) Utility gas (68%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 125 Gwinnett County: 1.62 / 10,000 pop. Georgia: 1.91 / 10,000 pop. Number of supercenters and club stores: 14 This county: 0.18 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 51 Gwinnett County: 0.66 / 10,000 pop. Georgia: 0.86 / 10,000 pop. Number of convenience stores (with gas): 304 Gwinnett County: 3.94 / 10,000 pop. State: 5.12 / 10,000 pop. Number of full-service restaurants: 716 Here: 9.28 / 10,000 pop. State: 7.41 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}