{
    "relation": [
        [
            "COST STRUCTURE",
            "Cost of Goods Sold",
            "Operating Expense",
            "Administration",
            "Electricity",
            "Fuel, Parking, Toll & Retribution",
            "Land and Building Rental",
            "Repairs and Maintenance",
            "Staff Welfare Allowance",
            "Stationery & Inventory",
            "Utensils and Equipment"
        ],
        [
            "% OF SALES",
            "67.13",
            "21.5",
            "1.58",
            "0.66",
            "1.62",
            "2.74",
            "0.54",
            "1.38",
            "0.48",
            "1.24"
        ],
        [
            "COST STRUCTURE",
            "Gross Profit",
            "Profit (Loss) Before Tax",
            "Depreciation",
            "Freight",
            "Interest",
            "Marketing",
            "Service Fee",
            "Other Expenses",
            "Telephone",
            "Wages and Salaries"
        ],
        [
            "% OF SALES",
            "32.87",
            "11.36",
            "0.56",
            "1.99",
            "3.09",
            "2.69",
            "0.7",
            "0.92",
            "0.8",
            "0.5"
        ]
    ],
    "pageTitle": "Indonesia Agricultural Machine and Equipment Manufacturing Market Researchs",
    "title": "",
    "url": "http://www.disb2b.com/front/industryreport.php?klui=K3822",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 399854470,
    "recordOffset": 399838515,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The comprehensive study also examines details such as the barriers to entry, operating cost structure, technology & systems and domestic & international markets. Tables and statistics include: Industry revenue, exports, imports, wages and number of companies in the industry, Industry growth and geographic regional data. Major market segments are identified and also those forces affecting demand and supply within this industry. Performance analysis includes emerging industry trends as well as recent results and performance of each key company. Drawing on the depth of information DIS also provides 5 year forecasts for this industry. The Agricultural Machine and Equipment Manufacturing industry in Indonesia research report contain trend analysis, statistics, market size information, industry growth rates as well as major competitors. Report Content 0.20 Import Tax Advised to Increase 20-30 Percent 0.20 Agriculture Equipment and Machines Industry Prioritized for Development News 20.00 Key Factors 50.00 Key Competitors 50.00 Industry Performance",
    "textAfterTable": "1,114 1,010 1,109 Rp.Billion Domestic Demand 116,012 111,809 150,690 181,983 197,211 Rp.Billion The data above is sample data only COST STRUCTURE % OF SALES COST STRUCTURE % OF SALES Cost of Goods Sold 67.13 Gross Profit 32.87 Operating Expense 21.5 Profit (Loss) Before Tax 11.36 Administration 1.58 Depreciation 0.56 Electricity 0.66 Freight 1.99 Fuel, Parking, Toll & Retribution 1.62 Interest 3.09 Land and Building Rental 2.74 Marketing 2.69 Repairs and Maintenance 0.54 Service Fee 0.7 Staff Welfare Allowance 1.38 Other Expenses 0.92 Stationery & Inventory",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}