{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Luckily, I've had no issues with safety at RIC, but they have emergency blue lights all around campus.",
            "I'm a second degree student and part of a greek organization at another university so I can't speak much to the greek life at RIC. I see their recruitment flyers and activities being advertised all the time though.",
            "There is a club or activity for almost every type of student and the school does a really great job at financially supporting them so that they can offer their student a lot of options.",
            "Commuter and on-campus!",
            "I'm not aware of any- sorry!",
            "One of the best things about RIC is their Metropolitan rate. It's a discounted rate for students that live within a certain distance (I believe it's 50 miles) from the school. It lightens the financial load a commuter student like myself will end up having to pay and who doesn't love that?",
            "RIC is only a short 10-15 minute drive (if that) away from a huge shopping mall containing 3 stories of shops, restaurants and an IMAX theater. Not to mention that because of the number of colleges/universities in proximity to Providence a lot of the local places offer student discounts with an ID.",
            "For a small campus, the dining options are astonishing! There are facilities for every type of diet: vegetarians, organic-minded and the standard 'whatever is edible' eater. Plus they have Del's! It's a great way of incorporating local flavor.",
            "Honestly, I am a commuter student so I can't lend my opinion to this aspect of RIC beyond aesthetics. The dorms are close to all buildings which would make the trek to class in the dead of winter seem less grueling. Also, I've heard they're pretty snazzy on the inside too!",
            "Professors expect your best, because they know you can give it. They want you to succeed and give you the tools to do so.",
            "Get involved! There are groups and organizations for every type of student! Even as a commuter student there are enough opportunities to give you that college experience while still living off-campus.",
            "Small, but mighty! RIC has an incredible atmosphere, a ton of on-campus activities, organizations and friendly faces. Professors here love what they do and genuinely care about the success of their students."
        ]
    ],
    "pageTitle": "Rhode Island College (RIC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rhode-Island-College/reviews?_escaped_fragment_=/show/83315",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905082051,
    "recordOffset": 905034915,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79301=One thing I will state to students applying to this school is that it is mostly a commuter school. I came from NH and usually travelled back home every weekend. This may have changed, but from 2005-2009 it was mostly commuter students attending., 197961=© 2015, Cappex.com, LLC, 97765=free period on Wednesdays between 12:30 and 1. the students get a break from classes to have fun. Each Wednesday there is something else going on in the quad., 75585=I don't recall any greek life at Rhode Island College. This may have changed since 2009 though!, 112412=Rhode Island College does not have a great dorm life, being that oct of the students are commuters, there are few students who live on campus. The dorms are not that great either, but with the right friends you can still have a blast. If you are looking for a party school this is not the school for you., 172611=Pick classes that will fit into your schedule but also times that are appropriate for yourself. From my experience, my first semester I chose a 8:00 A.M. Monday-Thursday however I am not a morning person so it reflected my ability to focus in class. As long as you pay attention in class, the work is not that hard. Papers are usually given ahead of time so its best not to procrastinate and leave for last minute. Good luck to those who think about attending!, 11050=I started school at Rhode Island College in August, and from then on it has been a period of discovery. The resources available on campus are great, and everyone is so helpful. Although the tuition is inexpensive in comparison to other schools, parking is constantly crowded. This is a minor setback when your talking about getting a good educational experience. Socially, there are a lot of clubs and organizations you can join. Overall RIC gets 5 stars in my book.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 50 nescarly from Providence, RI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot I'm just finishing my first year at RIC and the best part of school has been the classes which is not what I wanted in the college experience. Some professors are helpful while others are rude and awful. Login to rate or flag the reviews Ashley from Pawtucket, RI 12/06/2009 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 50 Categories Comments Great for these types of students - Students looking for higher learning experience. - Inexpensive tuition for college. - An experience based not solely on social interaction. Tips for prospective students If you're interested in attending Rhode Island college, I suggest you first visit the website, www.ric.edu. Any question you may have will be answered on there. And, if it piques your interest, you might want to schedule a tour and visit the campus. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}