{
    "relation": [
        [
            "Product",
            "Product",
            "Crude Steel",
            "Rolled Products : Flat",
            "Rolled Products : Long"
        ],
        [
            "Production ( Lacs tons)",
            "Q3 FY'13",
            "20.94",
            "15.69",
            "4.83"
        ],
        [
            "",
            "Q3 FY'12",
            "19.39",
            "13.87",
            "3.70"
        ],
        [
            "",
            "Growth",
            "8%",
            "13%",
            "31%"
        ]
    ],
    "pageTitle": "JSW Steel Limited : Crude Steel production grew by 8% in Q3 FY\u009213 | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/JSW-STEEL-LIMITED-9059088/news/JSW-Steel-Limited--Crude-Steel-production-grew-by-8-in-Q3-FY13-15823116/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 273178623,
    "recordOffset": 273153897,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73122=JSW Steel Ltd., belonging to JSW group, part of the O P Jindal Group, is one of the lowest cost steel producers in the world. The group has diversified interest in mining, carbon steel, power, industrial gases, port facilities, Aluminium, Cement and Information Technology. JSW Steel Limited is engaged in manufacture of flat and long products viz. H R Coils, C R Coils, Galvanised/Galvalume products, Colour Coated Products, auto grade / white goods grade CRCA Steel, Bars and Rods. Incorporated in 1994, it has grown to about US $ 10 billion in less than two decades. JSW Steel Limited is one of the largest galvanizing and colour coating production capacity in the country and is the largest exporter of galvanized products with presence in over 100 countries across five continents. Media Contacts: Jayaraman Head- Corporate Communications, JSW Group, Mumbai. Ph: +91-22-23513000 Mithun Roy Corporate Communications, JSW Group, Mumbai (India) Mobile:+91 9819000967 Email: mithun.roy@jsw.in, 69216=14.01.2013}",
    "textBeforeTable": "JSW Steel Limited reported 8% growth in crude steel production in Q3 FY'13 compared to that of corresponding period of last fiscal year. The break-up of quarterly production is as below: Crude Steel production grew by 8% in Q3 FY'13 14.01.2013 PRESS RELEASE *Required fields Message : (You can enter multiple email addresses separated by commas) To* : From* : Name : Last Name : Send by mail: 01/14/2013 | 03:34am US/Eastern",
    "textAfterTable": "The capacity utilization was lower during the Q3 FY'13 as compared to Q2 FY'13 due to inadequate and poor quality of Iron ore available through E-Auction. The Company achieved Crude Steel production of 64.08 lacs tons in the first nine months of FY'13, showing a growth of 20% over the corresponding period of last year. The break-up of cumulative production for 9 months is as below: Product Production ( Lacs tons) Product 9M FY'13 9M FY'12 Growth Crude Steel 64.08 53.62 20% Rolled Products : Flat 46.32 38.72 20% Rolled Products : Long 13.63 10.57 29% JSW Steel Ltd., belonging to JSW group, part of the O P Jindal Group, is one of the lowest cost steel producers in the world. The group has diversified interest in mining, carbon steel, power, industrial gases, port facilities, Aluminium, Cement and Information Technology. JSW Steel Limited is engaged in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}