{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security guards are at the front of every building 24/7. You must swipe your i.d. to get into any building, and guests must be signed in and show i.d. Security is very tight at Poly, I always feel safe.",
            "There are a few fraternities on campus, and NYU has many.",
            "For being a small school there are a decent amount of clubs and activities to join. However, we are also allowed to join any club at NYU which has a ton of clubs and activities for any kind of student.",
            "Engineering students, students that are into gaming. Students that enjoy being in the city.",
            "There are a lot of fun things to do, most of which involve something off campus. Res life does host a lot of fun events, ie ice skating, broadway shows, etc. It's New York City thought! There are a million things to do, especially in Brooklyn. The new Barclays center where you can watch the nets play and tons of concerts is within walking distance from campus. Also NYU main campus which is a 10-15 minute train ride away has a lot to do.",
            "Poly's food is known for not being the greatest. We just opened up a sandwich shop that's pretty decent and you can use your meal plan on. For part of the semester we also had sushi chefs which were also pretty good, but other than that the food is subpar. Keep in mind though, that if you're willing to spend a little bit of your own money there are some amazing places to eat near campus.",
            "All first year and second year students are guaranteed housing at the on campus residence hall. There are two types of rooms, each are two, two person bedrooms, where you share a bathroom with those four people. The difference is that the more expensive option has a small kitchen as well as a common room for the four to share.",
            "School work can definitely be tough at times. But if you are interested in engineering, then you should probably expect this wherever you end up going. There are a good amount of resources to help you academically as well.",
            "If you aren't a big fan of math and science, then this probably isn't the place for you. Also, if you're not from the city (like myself) there is a big adjustment that has to be made to city life. We're also in the process of merging with NYU, so it would be wise to pay attention to those developments as a lot of changes are taking place.",
            "Great school for an engineering student or student studying a related field. Not your traditional campus feel, but being right in downtown Brooklyn is a neat experience all in its own. Student wise, it's a pretty small school, so you get to know your fellow students very well while still being in the big city."
        ]
    ],
    "pageTitle": "Polytechnic Institute of New York University (NYU-Poly) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Polytechnic-Institute-of-New-York-University/reviews?_escaped_fragment_=/show/16553",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907645415,
    "recordOffset": 907600302,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9603=Once again I wont bullshit you with personal anecdotal evidence as to why poly dorms suck. Resident life can do random room checks. They exercise this right, frequently. I'm not the person to ever have anything, however, it is rude to be woken up at 3 in the morning even worse to hear about your friends getting kicked out. Guest policies are equally useless, you have 2 a MONTH, and have to submit a form before 10:00. Signing in guests on a daily basis is an annoyance, but quintessentially living in New York. If you dissagree with everything I'm saying the one thing I can offer you is, 138019=1) Decide if you are more interested in technology or pure science. Poly is a fantastic incubator and collaboration center for technological and engineering endeavors; however, it is a poor substitute for a college of arts and sciences if you have a more theoretical or research interest in science. 2) Poly is a small school in a big city. New York City is one of the most incredible places I have ever experienced. Restaurants, clubs, parks, historical landmarks, beautiful Central Park, magnificent skyscrapers--the city environment is incredible. Poly is a pretty small school for those who enjoy the tighter community; however the expanded community of all the NYU schools is right at your disposal for those who wish to experience it, thus giving you pretty much the best of both worlds (small and large schools). 3) Calculate expenses. Poly is an expensive school so make sure you figure out your expenses before you reject your backup school. The financial aid and admissions officers are definitely on your side though, and they are pretty generous with their financial and merit aid. When I was accepted, I talked to them until I was able to get an extra $2000 grant from them to cover the rest of my tuition., 147360=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/12/2010 Reviewer is A current student here. 15 out of 17 people found this review useful. 1 of 32 Allison from Houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Clubs and Activities We are not allowed to participate in NYU's vibrant clubs, team sports, club sports (including ultimate Frisbee), or student government. Great for these types of students Foreign grad students who do not meet traditional college requirements. I wouldn't recommend this school to anyone looking to enjoy a typical, or even engineering school, college experience. Share any unusual traditions or locations on campus There is no campus to speak off. When you tour ask if you can spend some time on the 8th floor -which is where most of your labs will be- it's like the ghetto of the school so to speak. Other than that there are otherwise no green spaces or assembly rooms. Bang for the buck You get paid a lot when you get out. I noticed that they were stressing this in a lot of the pre-admission game. Everyone else did too. This kind of mentality has a perceptible feel What to do for fun NOTHING. Since there's no rating section I can justify a story here; there's a long running joke on my floor that poly is like having mono. No girls talk to you and you're always tired. If you want",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}