{
    "relation": [
        [
            "First Name",
            "Tom",
            "John"
        ],
        [
            "Last Name",
            "Altmeyer",
            "Snider"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=E40C1471-70A9-4186-BBBA-ABE5B3135B0B&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226960576,
    "recordOffset": 226952374,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25188=H.R. 1579, Robert C. Byrd Miner Safety Protection Act of 2011, All titles H.R. 522, Worker Protection Against Combustible Dust Explosions and Fires Act of 2011, All titles S. 153, Robert C. Byrd Miner Safety & Health Act of 2011, All titles MSHA Resource Allocation and Enforcement H.R. 2587, Protecting Jobs from Government Interference Act, All titles H.R. 927, The Secret Ballot Protection Act of 2011, All titles H.R. 3697, Mine Safety Accountability Protection Act, All titles S. 217, The Secret Ballot Protection Act of 2011, All titles NLRB's Quick-Snap Elections Rules NLRB's Notice Post Rule NLRB's Ambush Elections Rules Department of Labor Persuader Regulation MSHA Resipirable Dust Standard, 18650=H.R. 97, Free Industry Act, All titles H.R. 910, Energy Tax Prevention Act of 2011, All titles S. 228, Defending America's Affordable Energy and Jobs Act, All titles S. 482, Energy Tax Prevention Act of 2011, All titles H.R. 909, Roadmap for America's Energy Future, All titles H.R. 1868, Clean Coal-Derived Fuels for Energy Security Act of 2011, All titles H.R. 2036, American Alternative Fuels Act of 2011, All titles H.R. 2401, Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, All titles H.R. 10, Regulations from the Executive in Need of Scrutiny Act of 2011, All titles H.R. 2401, The Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, All titles H.R. 1540, National Defense Authorization Act for Fiscal Year 2012, All titles S. 757, A bill to provide incentives to encourage the developement and implementation to capture carbon dioxide from dilute sources on a significant scale using direct air capture technologies, All titles S. 937, American Alternative Fuels Act of 2011, All titles S. 299, Regulations From the Executive in Need of Scrutiny Act of 2011, All titles, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 35731=H.R. 2273, Coal Residuals Reuse and Management Act, All titles EPA Draft IRIS Assessment on Inorganic Arsenic, 15227=H.R. 960, Mining Jobs Act, All titles H.R. 2018, Clean Water Cooperative Federalism Act of 2011, All titles H.R. 3409, Coal Miner Employment and Domestic Energy Infrastructure Protection Act S. 468, Mining Job Protection Act, All titles Clean Water Act Jurisdictional Guidance CWA, Section 404 Permits Greenhouse Gas Regulation under CAA Navigable Waters Guidance Utility MACT Transport Rule under CAA Transport Rule EPA NAAQS for Particulate Matter H.R. 1633, Farm Dust Regulation Prevention Act, Multiple titles S.J. Res. 27, Disapproval Resolution of EPA Cross State Air Pollution Regulation, 28637=H.R. 302, Preserve Land Freedom for Americans Act of 2011, All titles H.R. 618, Rare Earths & Critical Materials Promotion Revitalization Act, All titles H.R. 758, National Monument Designation & Transparency Accountability Act, All titles H.R. 817, To Amend the Antiquities Act of 1906, All titles H.R. 845, Montana Land Sovereignty Act, All titles H.R. 952, Energy Critical Elements Renewal Act of 2011, All titles H.R. 1452, Uranium Resources Stewardship Act, All titles H.R. 3409, Coal Miner Employment and Domestic Energy Infrastructure Protection Act, All titles H.R. 3446, Fair Payment for Energy and Mineral Production on Public Lands Act, Titles V-VI S. 122, National Monuments Act of 2011, All titles S. 407, National Monument Designation and Transparency & Accountability Act, All titles S. 1113, Critical Minerals Policy Act of 2011, All titles S. 1087, Wilderness and Roadless Area Release Act of 2011, All titles S. 1844, Bureau of Land Management Review of Federal Register Notices, All titles DOI Wild Lands Policy SMCRA Permitting OSM Stream Protection Rule BLM Permitting Federal Coal Leasing Approvals, 32529=S. 26, The Elimination of Double Subsidies for Hardrock Mining Industry Act of 2011, All titles S. 164, Withholding Tax Relief Act of 2011, All titles Deficit Panel Recommendations The President's Plan for Economic Growth and Deficit Reduction H.R. 674, To Amend the Internal Revenue Service Code of 1986 to repeal the imposition of 3% witholding on certain payments made to vendors by government entities H.R. 3630, Temporary Payroll Tax Cut Continuation Act of 2011, Bonus Deprecation Draft legislation to modify section 45(Q) of the IRC, 44030=Waterways Are Vital for the Economy, Energy, Efficiency and Environment Act of 2012 H.R. 104, RAMP Act S. 412, RAMP Act, 12219=H.R. 2584 FY 2012 Interior and Environment Appropriations, Multiple Titles H.R. 2354 FY 2012 Energy and Water Appropriations, Multiple Titles FY 2012 Labor, HHS, and Education Appropriations Bill, MSHA Funding H.R. 2219 FY 2012 Defense Appropriations Bill, Contracting Authority, 526 Repeal, 41236=H.R. 1540, National Defense Authorization Act for Fiscal Year 2012 S. 981, National Defense Authorization Act for Fiscal Year 2012 Legislation to Repeal Section 526}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20037 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  THOMAS ALTMEYER  2023335265  taltmeyer@archcoal.com 5. Senate ID#  289955-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}