{
    "relation": [
        [
            "Postage and packaging",
            "£3.25",
            "£9.50"
        ],
        [
            "Each additional item",
            "£2.00",
            "£4.00"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Royal Mail International Standard (Small Packets)",
            "Royal Mail International Tracked"
        ],
        [
            "Delivery*",
            "Estimated delivery within 6-12 working days",
            "Estimated delivery within 4-9 working days"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Girls-Scarlet-O-Hara-Victorian-Costume-Children-Fancy-Dress-Historical-Book-Week-/201021057339",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428868791,
    "recordOffset": 428814609,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1677=• UK: Please see the postage and payments tab above to view the estimated delivery times and services available. You can select the appropriate service at the checkout stage. Please note there is no guarantee for our economy and standard services and at busier times of the year delivery may be considerably longer. To guarantee next day delivery please select Express Delivery. This guarantees delivery by 5pm to most parts of the UK Monday to Friday. Please see our delivery FAQ's for more information on this service. If you require your next day delivery on a Saturday please contact customer services on 01872 888132.}",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 0 items available. Please enter a number less than or equal to 0. -Select- Austria Belgium Canada Denmark Finland France Germany Greece Guernsey Hong Kong Ireland Jersey Luxembourg Monaco Netherlands New Zealand Norway Portugal Saint Pierre and Miquelon Singapore Spain Sweden Switzerland United Kingdom United States Change country: Excludes: Fiji, Papua New Guinea, Guadeloupe, Marshall Islands, Wallis and Futuna, Gambia, Malaysia, Mayotte, Taiwan, Poland, Suriname, Oman, Kenya, United Arab Emirates, Argentina, Middle East, Guinea-Bissau, Togo, Senegal, Armenia, Bhutan, Uzbekistan,",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Domestic dispatch time Will usually dispatch within same working day if paid before 14:00 BST (excludes weekends and holidays). Expected dispatch time may vary and is based on seller's order cut-off time. Payment details Payment method Preferred/Accepted   PayPal preferred   Postal order/Banker's draft Accepted  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}