{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-04301",
            "",
            "USCG-2015-0112"
        ]
    ],
    "pageTitle": "33 CFR Part 117 - DRAWBRIDGE OPERATION REGULATIONS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/33/part-117",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 425,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 921334275,
    "recordOffset": 921244173,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1005=Title 33 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{396826=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Norfolk Southern Railroad Drawbridge, across Trent River, mile 0.2, at New Bern, NC, to facilitate a rehabilitation project. This bridge presently opens on demand for navigation and is usually left in the open position only to close twice a day for train crossings. This deviation allows the bridge to remain closed to navigation from 8 a.m. Monday, December 15, 2014 until 7 p.m. Friday, December 19, 2014, so that necessary maintenance may be made. The deviation is necessary to facilitate removal and replacement of the rail lift joints., 47467=The Coast Guard has issued a temporary deviation from the operating schedule that governs the operation of the Loop Parkway Bridge, mile 0.7, across Long Creek, and the Meadowbrook State Parkway Bridge, mile 12.8, across Sloop Channel, both at Hempstead, New York. This temporary deviation is necessary to facilitate the 2015 Dee Snider's Ride to Fight Hunger on Long Island. This temporary deviation allows two bridges to remain in the closed position during this public event., 174990=The Coast Guard is removing the existing drawbridge operation regulation for the S64 drawbridge across Ontonagon River, mile 0.2, at Ontonagon, Ontonagon County, Michigan. The drawbridge was replaced with a fixed bridge in 2006 and the operating regulation is no longer applicable or necessary., 239495=The Coast Guard has issued a temporary deviation from the operating schedule that governs the operation of the Metro-North (Park Avenue) Bridge across the Harlem River, mile 2.1, at New York City, New York. This deviation is necessary to allow the bridge owner to perform electrical repairs at the bridge. This deviation allows the bridge to remain closed from March 13, 2015 through May 21, 2015., 511621=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Venice Avenue Bridge, Gulf Intracoastal Waterway, mile 56.6, Venice, FL. This temporary operating schedule will allow the bridge to not open to navigation including tugs with tows, during the Sarasota Iron Man Triathlon scheduled for the second Sunday of November, for the safety of the participants., 1051627=The Coast Guard proposes to change the operating schedule that governs the U.S. 101 highway drawbridge also known as Bullard's Drawbridge, near Coos Bay, Oregon. The proposed change would allow the drawbridge to permanently remain in the closed position, no longer opening for vessel traffic. While there is vessel traffic on this waterway, no one has requested a drawbridge opening since 1998. Oregon Department of Transportation (ODOT) owns the bridge and requested to update the operating schedule accordingly., 519838=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Loop Parkway Bridge, mile 0.7, across Long Creek, and the Meadowbrook Parkway Bridge, mile 12.8, across Sloop Channel, both at Hempstead, New York. This deviation is necessary to facilitate the 2014 Dee Snider's Ride to Fight Hunger on Long Island. The deviation allows the two bridges to remain in the closed position during this public event., 252050=The Coast Guard is adding a special operating regulation governing the State Route 3090 (SR 3090) swing span bridge across the Chevron Oil Company Canal, mile 0.05, at Fourchon, Louisiana. Since construction of the bridge in 1972, the bridge has operated on a customary schedule requiring a one-hour advance notice without having a special operating regulation in place. This rule codifies the current custom and operating schedule of the bridge as a special operating regulation., 585381=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2013 and June 2014, and that expired before they could be published in the Federal Register . This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible., 463399=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Carolina Coastal Railroad Bridge, at AICW mile 203.8, across Newport River in Morehead City, NC. This bridge is presently maintained in the open position except when closure is necessary for train crossings. This deviation allows the bridge to remain closed to navigation from 9 a.m. to noon and again from 1 p.m. to 3 p.m. every day, from November 3 through November 7, 2014, so that necessary maintenance may be made., 610953=The Coast Guard is modifying the operating schedule that governs the Hatchett Creek (US-41) Twin Bridges, Gulf Intracoastal Waterway mile 56.9, Venice, FL. Changing the operational schedule of the Hatchett Creek (US-41) Twin Bridges will allow the 8 hour, Sarasota Iron Man Triathlon to occur annually without being interrupted. This event is anticipated to be scheduled annually on the second Sunday of November, from 9 a.m. to 5 p.m., 373316=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Clinton Railroad Drawbridge, across the Upper Mississippi River, mile 518.0, at Clinton, Iowa. The deviation is necessary to allow the bridge owner time to perform preventive maintenance that is essential to the continued safe operation of the drawbridge. Maintenance is scheduled in the winter when there is less impact on navigation; instead of scheduling work in the summer, when river traffic increases. This deviation allows the bridge to open on signal if at least 24-hours advance notice is given. It further allows the bridge to open on signal if at least 72-hours advance notice is given from January 5, 2015 to February 13, 2015., 104341=The Coast Guard is removing the existing drawbridge operation regulation for the Wisconsin Central Railroad Bridge, mile 0.91, across Manitowoc River, at Manitowoc, Manitowoc County, Wisconsin. The drawbridge was removed in its entirety in 2012 and the operating regulation is no longer applicable or necessary., 230792=The Coast Guard has issued a temporary deviation from the operating schedule that governs the operation of the Smith Point Bridge across Narrow Bay, mile 6.1, at Suffolk County, New York. This deviation is necessary to provide public safety during a public event, the Smith Point Triathlon. This deviation allows the bridge to remain closed for two hours on Sunday August 2, 2015, to facilitate the Smith Point Triathlon., 989226=The Coast Guard proposes to change the operating schedule that governs the SR 175 Bridge across Lewis Channel and Black Narrows, mile 3.5 at Chincoteague, VA. The proposed change would eliminate the need for the current special operating schedule and return the bridge to open on demand. The proposed change does not include the last consecutive Wednesday and Thursday in July for the annual Pony swim., 546259=The Coast Guard is removing the existing drawbridge operation regulation for the Pinellas Bayway Structure “C” Bridge across the Gulf Intracoastal Waterway mile 114, St Petersburg Beach, Florida. The drawbridge was replaced with a fixed bridge in 2014 and the operating regulation is no longer applicable or necessary., 1084459=The Coast Guard announces a public meeting to receive comments on a notice of proposed rulemaking (NPRM) entitled “Drawbridge Operation Regulation; Illinois Waterway, Joliet, IL” that was published in the Federal Register on August 27, 2014. As stated in the NPRM, the Coast Guard proposes to modify the operating regulations for six drawbridges, located between river mile 285.8 and river mile 288.7, across the Illinois Waterway, at Joliet, Illinois. The NPRM proposes to consolidate the current operating regulation, which includes five on-site bridge tender control stations, into one centralized control point for all five drawbridges. The NPRM also proposes to add a sixth drawbridge that will also operate under the centralized control point. The proposed action is intended to improve navigational safety and operational efficiency in the Joliet area., 359493=The Coast Guard has issued a temporary deviation from the operating schedule that governs the NC Route 50-210 Highway Bridge, on the Atlantic Intracoastal Waterway, mile 260.7, in Surf City, NC. This drawbridge is presently regulated to open on signal for commercial vessels and pleasure vessels, except between 7 a.m. and 7 p.m. when the draw need only open on the hour for pleasure vessels. To facilitate necessary repairs, this deviation allows for the bridge to remain closed to navigation from 6 p.m. on February 22, 2015 to 6 p.m. February 24, 2015, except for two openings at 10 a.m. and 3 p.m. each day., 665042=Title 33 published on 2014-07-01, 60859=The Coast Guard is removing the existing drawbridge operation regulation for the drawbridge across the St. Marks River, mile 9.0, at Newport, Wakulla County, Florida. The drawbridge was replaced with a fixed bridge in 2001 and the operating regulation is no longer applicable or necessary., 265042=The Coast Guard is removing the existing drawbridge operation regulation for the drawbridge across the Passaic River, mile 11.8, at Rutherford, New Jersey. The drawbridge was converted to a fixed bridge in October 2010, and the operating regulation is no longer applicable or necessary., 602062=The Coast Guard has issued a temporary deviation from the operating schedule that governs the Royal Park and Southern Boulevard Bridges, Atlantic Intracoastal Waterway, mile 1022.6 and mile 1024.7, West Palm Beach, FL. These temporary operating schedules have been implemented in an effort to assist with the flow of vehicular traffic due to the Flagler Memorial Bridge being left in the open to navigation position., 143292=The Coast Guard is changing the operating schedule that governs the U.S. 101 highway drawbridge also known as Bullard's Drawbridge, near Bandon, Oregon. The change will allow the drawbridge to permanently remain in the closed-to-navigation position, no longer opening for vessel traffic. While there is vessel traffic on this waterway, no one has requested a drawbridge opening since 1998. Oregon Department of Transportation (ODOT) owns the bridge and requested to update the operating schedule accordingly., 559628=The Coast Guard has issued a temporary deviation from the operating schedule that governs The Broadway Bridge, across the Willamette River, mile 11.7, at Portland, OR. This deviation is necessary to accommodate the 2014 Pints to Pasta foot race event. This deviation allows the bridge to remain in the closed position to allow safe movement of event participants., 1025434=The Coast Guard proposes to temporarily change the operating schedule that governs the Simpson Avenue Bridge on the Hoquiam River, mile 0.5, at Hoquiam, Washington. The proposed rule change is necessary to accommodate Washington State Department of Transportation's (WSDOT) extensive maintenance and restoration efforts on that bridge. The bridge is currently scheduled to open on signal if at least one hour of notice is given. From April 1, 2015 to November 30, 2015, the Coast Guard proposes to only open half of the bascule, a single leaf, of the bridge when at least two hours of notice is given., 406344=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2014 and September 2014, and that expired before they could be published in the Federal Register. This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible.}",
    "lastModified": "Thu, 04 Jun 2015 03:28:24 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 31466 - Drawbridge Operation Regulation; Columbia River, Vancouver, WA 2015-06-03; vol. 80 # 106 - Wednesday, June 3, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 33. Title 33 published on 2014-07-01. 63 FR 35529117 1.05-133 U.S.C. 499 , June 30, 1998. appear at Nomenclature changes to part Editorial Note: CGD 82-025, 49 FR 17452, Apr. 24, 1984, unless otherwise noted. Source: ; and Department of Homeland Security Delegation No. 0170.1. ; 33 CFR Authority:",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Coast Guard Notice of deviation from drawbridge regulation. This deviation is effective from 9 p.m. to 11:59 p.m. on July 4, 2015. 33 CFR Part 117 Summary The Coast Guard has issued a temporary deviation from the operating schedule that governs the Interstate 5 (I-5) Bridges across the Columbia River, mile 106.5, between Portland, Oregon, and Vancouver, Washington. The deviation is necessary to facilitate the movement of heavier than normal roadway traffic associated with the Independence Day fireworks show near the I-5 Bridges. This deviation allows the bridges to remain in the closed-to-navigation position during the event. 80 FR 31467 - Drawbridge Operation Regulation; Lake Washington Ship Canal, Seattle, WA GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-13417 RIN Docket No. USCG-2015-0459",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}