{
    "relation": [
        [
            "Patent application number",
            "20120187430",
            "20130134459",
            "20130337592",
            "20140048832",
            "20140077235",
            "20140131747",
            "20140197430"
        ],
        [
            "Description",
            "Packaging Photon Building Blocks Having Only Top Side Connections in a Molded Interconnect Structure - Standardized photon building blocks are packaged in molded interconnect structures to form a variety of LED array products. No electrical conductors pass between the top and bottom surfaces of the substrate upon which LED dies are mounted. Microdots of highly reflective material are jetted onto the top surface. Landing pads on the top surface of the substrate are attached to contact pads disposed on the underside of a lip of the interconnect structure. In a solder reflow process, the photon building blocks self-align within the interconnect structure. Conductors in the interconnect structure are electrically coupled to the LED dies in the photon building blocks through the contact pads and landing pads. Compression molding is used to form lenses over the LED dies and leaves a flash layer of silicone covering the landing pads. The flash layer laterally above the landing pads is removed by blasting particles at the flash layer.",
            "Micro-Bead Blasting Process for Removing a Silicone Flash Layer - Using compression molding to form lenses over LED arrays on a metal core printed circuit board leaves a flash layer of silicone covering the contact pads that are later required to connect the arrays to power. A method for removing the flash layer involves blasting particles of sodium bicarbonate at the flash layer. A nozzle is positioned within thirty millimeters of the top surface of the flash layer. The stream of air that exits from the nozzle is directed towards the top surface at an angle between five and thirty degrees away from normal to the top surface. The particles of sodium bicarbonate are added to the stream of air and then collide into the top surface of the silicone flash layer until the flash layer laterally above the contact pads is removed. The edge of silicone around the cleaned contact pad thereafter contains a trace amount of sodium bicarbonate.",
            "MICRO-BEAD BLASTING PROCESS FOR REMOVING A SILICONE FLASH LAYER - Using compression molding to form lenses over LED arrays on a metal core printed circuit board leaves a flash layer of silicone covering the contact pads that are later required to connect the arrays to power. A method for removing the flash layer involves blasting particles of sodium bicarbonate at the flash layer. A nozzle is positioned within thirty millimeters of the top surface of the flash layer. The stream of air that exits from the nozzle is directed towards the top surface at an angle between five and thirty degrees away from normal to the top surface. The particles of sodium bicarbonate are added to the stream of air and then collide into the top surface of the silicone flash layer until the flash layer laterally above the contact pads is removed. The edge of silicone around the cleaned contact pad thereafter contains a trace amount of sodium bicarbonate.",
            "Micro-Bead Blasting Process for Removing a Silicone Flash Layer - Using compression molding to form lenses over LED arrays on a metal core printed circuit board leaves a flash layer of silicone covering the contact pads that are later required to connect the arrays to power. A method for removing the flash layer involves blasting particles of sodium bicarbonate at the flash layer. A nozzle is positioned within thirty millimeters of the top surface of the flash layer. The stream of air that exits from the nozzle is directed towards the top surface at an angle between five and thirty degrees away from normal to the top surface. The particles of sodium bicarbonate are added to the stream of air and then collide into the top surface of the silicone flash layer until the flash layer laterally above the contact pads is removed. The edge of silicone around the cleaned contact pad thereafter contains a trace amount of sodium bicarbonate.",
            "Substrate Free LED Package - A method of fabricating a substrate free light emitting diode (LED), includes arranging LED dies on a tape to form an LED wafer assembly, molding an encapsulation structure over at least one of the LED dies on a first side of the LED wafer assembly, removing the tape, forming a dielectric layer on a second side of the LED wafer assembly, forming an oversized contact region on the dielectric layer to form a virtual LED wafer assembly, and singulating the virtual LED wafer assembly into predetermined regions including at least one LED. The tape can be a carrier tape or a saw tape. Several LED dies can also be electrically coupled before the virtual LED wafer assembly is singulated into predetermined regions including at the electrically coupled LED dies.",
            "Packaging Photon Building Blocks Having Only Top Side Connections In A Molded Interconnect Structure - Standardized photon building blocks are packaged in molded interconnect structures to form a variety of LED array products. No electrical conductors pass between the top and bottom surfaces of the substrate upon which LED dies are mounted. Microdots of highly reflective material are jetted onto the top surface. Landing pads on the top surface of the substrate are attached to contact pads disposed on the underside of a lip of the interconnect structure. In a solder reflow process, the photon building blocks self-align within the interconnect structure. Conductors in the interconnect structure are electrically coupled to the LED dies in the photon building blocks through the contact pads and landing pads. Compression molding is used to form lenses over the LED dies and leaves a flash layer of silicone covering the landing pads. The flash layer laterally above the landing pads is removed by blasting particles at the flash layer.",
            "SUBSTRATE FREE LED PACKAGE - A method of fabricating a substrate free light emitting diode (LED), includes arranging LED dies on a tape to form an LED wafer assembly, molding an encapsulation structure over at least one of the LED dies on a first side of the LED wafer assembly, removing the tape, forming a dielectric layer on a second side of the LED wafer assembly, forming an oversized contact region on the dielectric layer to form a virtual LED wafer assembly, and singulating the virtual LED wafer assembly into predetermined regions including at least one LED. The tape can be a carrier tape or a saw tape. Several LED dies can also be electrically coupled before the virtual LED wafer assembly is singulated into predetermined regions including at the electrically coupled LED dies."
        ],
        [
            "Published",
            "07-26-2012",
            "05-30-2013",
            "12-19-2013",
            "02-20-2014",
            "03-20-2014",
            "05-15-2014",
            "07-17-2014"
        ]
    ],
    "pageTitle": "Kwon, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kwon-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446444495,
    "recordOffset": 446404373,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mike Kwon, Pleasanton, CA US 09-24-2009 Efficient method for implementing programmable impedance output drivers and programmable input on die termination on a bi-directional data bus - A combined input and termination circuit comprises a fixed portion of impedance and a programmable portion of impedance. The fixed portion is able to be fixed in a driver mode and a termination mode. The programmable portion is able to be configured to have a desired impedance in a driver mode or a termination mode while maintaining minimum associated capacitance. 20090237109 Published Description Patent application number Kookhwan Kwon, San Ramon, CA US 06-13-2013 Systems and Methods for Securing Mobile Computing Devices - Systems for securing mobile devices such as laptops are provided. Such systems are characterized by two end members, each with a male electrical connector, that engage opposite sides of mobile device, a crossbeam between the two end members that cradles the underside of the mobile device, and a mechanical linkage that is used to release the mobile device. In addition to a slim form factor, systems of the present invention can comprise registration posts to align a top edge of the mobile device to the crossbeam, a receptacle for a power adapter connector, and a locking mechanism to lock an end member to the crossbeam and optionally also lock the power adapter connector to the system. 20130148289 05-24-2012 Systems and Methods for Securing Mobile",
    "textAfterTable": "Patent applications by Mike Kwon, Pleasanton, CA US Mike Kwon, San Diego, CA US Patent application number Description Published 20110228765 TELEPHONY TERMINAL - Methods and apparatus implementing a telephony terminal for connecting a telephone to a data network. In one implementation, a telephony system includes: a phone connection for connecting to a telephone; a network connection for connecting to a network; and a controller connected to said phone connection and to said network connection; wherein said controller provides a phone service for processing information for said phone connection, said controller provides a network service for processing information for said network connection, and said controller provides a network voice service for converting information to and from a network voice format. 09-22-2011 20140169364 TELEPHONY TERMINAL - Methods and apparatus implementing a telephony terminal for connecting a telephone to a data network. In one implementation, a telephony system includes: a phone connection for connecting to a telephone; a network connection for connecting to a network; and a controller connected to said phone connection and to said network connection; wherein said controller provides a phone service for processing information for said phone connection, said controller provides a network service for processing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}