{
    "relation": [
        [
            "LSA",
            "4,000-5,299",
            "8,700-11,099",
            "11,100-14,099",
            "14,100-18,499",
            "18,500-24,999",
            "25,000-34,499",
            "34,500-53,999",
            "54,000-104,999",
            "105,000-4.1 mill."
        ],
        [
            "Count",
            "2",
            "2",
            "1",
            "1",
            "3",
            "3",
            "13",
            "21",
            "31"
        ],
        [
            "%",
            "2.6%",
            "2.6%",
            "1.3%",
            "1.3%",
            "3.9%",
            "3.9%",
            "16.9%",
            "27.3%",
            "40.3%"
        ]
    ],
    "pageTitle": "Cites & Insights 12:11 - Give Us a Dollar...commentary part 2",
    "title": "",
    "url": "http://citesandinsights.info/v12i11a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 46439555,
    "recordOffset": 46395070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7398=Give Us a Dollar and We’ll Give You Back Four (2012-13): Commentary, Part 2, 7292=This essay consists entirely of notes about Chapter 20 of Give Us a Dollar and We’ll Give You Back Four (2012-13), “Libraries by State”—but that’s almost half the book. (To be precise, it’s pages 129-256 of a 262-page book.) The chapter has 51 subsections, one for each state and the District of Columbia. Forty-nine of the subsections include nine actual tables each, presented as seven tables (as in Chapters 2-19, I save space on expense/budget tables by combining two sets of metrics into a single displayed table). The District of Columbia and Hawaii each have a single public library district, so I just provide the key figures for each one, not tables with all but one row on each table empty., 2881=The first table in each state subsection, breaking libraries down by expenditures per capita, adds one column to those in chapters 2-19: AdjBR. That’s the median Benefit Ratio (BenR) for libraries in that expenditure category—but adjusted by the state’s cost of living as I found it reported for 2010. Thus, if the cost of living was 135.1% (California), AdjBR would be 35.1% higher than BenR (e.g., the median adjusted Benefit Ratio for the 18 California libraries spending $26 to $30.99 is 4.13 rather than 3.06)., 6505=Why does this essay get its own issue? Because I’ve already written most of another essay (more words than this one, but possibly requiring fewer pages)—and that one really needs to appear with yet another one, much shorter. Both of those should be done some time in November and I want to get them out. The combined issue would be way too long—thus, a special short one-essay issue. (A quick note on layout: Because this essay contains so many short sections, I’m neither turning on vertical justification nor making any real effort to compress vertical space. Columns end irregularly—and tables break across columns but not pages.)}",
    "TableContextTimeStampAfterTable": "{942550=Comments should be sent to waltcrawford@gmail.com. Cites & Insights: Crawford at Large is copyright © 2012 by Walt Crawford: Some rights reserved., 941638=I believe the book should be useful to several thousand public libraries and could be useful to even more. I hope that a few hundred consultants and libraries will find it useful—and that more will ask for their data lines (so far, that’s still a single-digit number). We shall see: the book’s not going away until at least July 2013., 940762=These comments and those in the November 2011 Cites & Insights are both intended to augment the tables in Give Us a Dollar and We’ll Give You Back Four (2012-13). (As usual, that’s the $21.95 paperback. Here’s the $11.99 no-DRM PDF, and here’s the $31.50 hardbound.), 942150=Cites & Insights: Crawford at Large, Volume 12, Number 11, Whole # 155, ISSN 1534-0937, a journal of libraries, policy, technology and media, is written and produced irregularly by Walt Crawford.}",
    "lastModified": "Thu, 18 Oct 2012 17:01:16 GMT",
    "textBeforeTable": "Libraries by legal service area Only 21 libraries (none omitted)—but eight of the ten expenditure categories are represented (the top and bottom are missing). A few things stand out even with the small group of libraries—e.g., the best-funded library (the only one with at least $53 spending per capita, and just barely above that mark) has nearly twice the circulation of the median for any other expenditure category and two-thirds more than the next-best 75%ile. That library isn’t highest for any of the other metrics. Delaware Since there’s only one library system (serving 601,723 people), there’s not a lot to say. District of Columbia padding:0pc .45pc 0pc .45pc;height:12.75pt\"> border-left:none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 2.8% padding:0pc .45pc 0pc .45pc;height:12.75pt\"> 5 padding:0pc .45pc 0pc .45pc;height:12.75pt\"> 105,000-4.1 mill. 10.0pt\">2 padding:0pc .45pc 0pc .45pc;height:12.75pt\"> 7.9% padding:0pc .45pc 0pc .45pc;height:12.75pt\"> 14 padding:0pc .45pc 0pc .45pc;height:12.75pt\">",
    "textAfterTable": "Florida Like California (but more so), Florida has relatively few libraries and systems for its population: 80 (all in the tables, none omitted). Funding tends toward the low side, with only 5% in the top two brackets and 21% in the top four, compared to 30% in the bottom two brackets and 59% in the bottom four. Similarly, circulation per capita tends toward the low side, with only 11% having at least 10 circ per capita (38% overall)—and patron visits are similar, with 20% having six or more (42% overall). I could say that it’s noteworthy that the median circulation for libraries in the highest spending bracket is nearly twice that of the second highest—but with only two libraries in each of those two brackets, that’s not especially meaningful (although those are the only brackets where even the 75%ile is at least 10 circ per capita). Program attendance is quite low, with 65% having less than 0.3 attendance per capita (compared to 46% overall). The same goes for PC use: 16% with at least 1.7 uses per capita, compared to 30% overall. Libraries by legal service area LSA Count %",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}