{
    "relation": [
        [
            "ON-AIR PERSONALITY OF THE YEAR – MEDIUM MARKET",
            "Cash and Carey",
            "Jack Ryan",
            "Party Marty Mitchell",
            "Rowdy Yates, Sunny Leigh & Carly Rush",
            "Tom and Becky",
            "",
            ""
        ],
        [
            "",
            "KWEN-FM",
            "WMYL-FM",
            "WKMK-FM",
            "KVOO-FM",
            "WBBS-FM",
            "",
            ""
        ],
        [
            "",
            "Tulsa, OK",
            "Knoxville, TN",
            "Monmouth-Ocean, NJ",
            "Tulsa, OK",
            "Syracuse, NY",
            "",
            ""
        ]
    ],
    "pageTitle": "Nominations Announced For The 48Th Annual Academy Of Country Music® Awards | SYS-CON INDIA",
    "title": "",
    "url": "http://in.sys-con.com/node/2538544",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 119835247,
    "recordOffset": 119808622,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31401=Fan voting for New Artist of the Year and Entertainer of the Year begins on March 25, 2013 at 3:00 PM ET/12noon PT at VoteACM.com. Fan voting for New Artist of the Year will close at 5 p.m. PT on April 7, 2013 (before the LIVE show starts) and fan voting for Entertainer of the Year will close during the third hour of the LIVE broadcast., 97224=About the Academy of Country Music Awards The 48th Academy of Country Music Awards is dedicated to honoring and showcasing the biggest names and emerging talent in the country music industry.  The show is produced for television by dick clark productions and will be broadcast LIVE from the MGM Grand Garden Arena in Las Vegas Sunday, April 7, 2013 at 8:00 PM live ET/delayed PT on the CBS Television Network.  Allen Shapiro, Orly Adelson and R.A. Clark are executive producers.  Barry Adelman is producer, and Bob Bardo is the executive in charge of production. Bob Romeo is executive producer for the Academy of Country Music. , 49061=RADIO AWARDS – The following radio awards will be presented during the annual Radio Winners event held the day prior to the ACM Awards telecast, on April 6th in Las Vegas., 22620=ENCINO, Calif., Feb. 13, 2013 /PRNewswire/ -- Nominations were announced today for the 48th ANNUAL ACADEMY OF COUNTRY MUSIC AWARDS­, a star-studded event honoring country music's best and introducing the industry's hottest emerging talent. Produced for television by dick clark productions, the ACM Awards will be broadcast LIVE from the MGM Grand Garden Arena in Las Vegas on Sunday, April 7th, 2013 at 8:00 PM live ET/delayed PT on the CBS Television Network.}",
    "lastModified": "Sat, 01 Aug 2015 03:31:49 GMT",
    "textBeforeTable": "RADIO AWARDS – The following radio awards will be presented during the annual Radio Winners event held the day prior to the ACM Awards telecast, on April 6th in Las Vegas. Scotty Sanders Russ Pahl Greg Leisz Mike Johnson Dan Dugmore STEEL GUITAR PLAYER OF THE YEAR Ilya Toshinsky Bryan Sutton Jim Hoke Glen Duncan Eric Darken SPECIALTY INSTRUMENT(S) PLAYER OF THE YEAR Michael Rojas Steve Nathan Gordon Mote Charlie Judge John Jarvis PIANO/KEYBOARD PLAYER OF THE YEAR Brent Mason Rob McNelley Jay Joyce J.T. Corenflos Tom Bukovac GUITARIST OF THE YEAR Joe Spivey Hank Singer Aubrey Haynie Larry Franklin Glen Duncan FIDDLE PLAYER OF THE YEAR Greg Morrow Chris McHugh Chad Cromwell Matt Chamberlain Eddie Bayers PERCUSSIONIST/DRUMMER OF THE YEAR Glenn Worf Jimmie Lee Sloas Larry Paxton Kevin \"Swine\" Grantt Dennis Crouch BASS PLAYER OF THE YEAR F. Reid Shippen Steve Marcantonio Mills Logan Derek Bason Chuck Ainlay AUDIO ENGINEER OF THE YEAR",
    "textAfterTable": "Cornbread, Judi Diamond & Cap'n Mac WIL-FM St. Louis, MO Dr. Don Carpenter, Rachel, Grunwald & Jason the 300lb. Cowboy  WYCD-FM Detroit, MI Drew Walker WUSN-FM",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}