{
    "relation": [
        [
            "Poster",
            "jessehanes30218",
            "Just popping in Joined: 2003/12/5 From: Candian, TX Posts: 1",
            ""
        ],
        [
            "Thread",
            "Posted: 2007/8/3 15:44 Updated: 2007/8/3 15:44",
            "Re: Camp Jeep 2007 - Will They Build the JT? I would rather see something along the lines of the Brute. I also use my 03 Rubi more as a pu, and would be very interested in the JT. It def. needs drop tailgate, wish mine had it. Spare tire fit in storage bin under bed (JK has storage ben there now)? I agree, I would mount aftermarket items anyways: tires, bumpers, roll bars, etc. Roll cage, leave out. Make avail soft top or removeable hard top/modular(aka JK). What would it take to lengthen the chassis 12 to 18\"? Make bigger bed & poss more space underbed for spare. Most of all DIESEL! I'd buy a 4dr right now if one was available! I seen the JT in Moab this year out on the trail. It preformed well, but did notice cracks in top, possible cause more flex in chassis without the roll cage.",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=1648",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 540117615,
    "recordOffset": 540097861,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8989=ScramblerKen recently attended Camp Jeep 2007 and filed a series of reports for us. Here's his final installment. In my final article, I will present some information I got in an informal discussion with one of the product engineers that works in future development. At Camp Jeep, both the JT and AEV Brute were proudly positioned in the main walk-way of the Engineer tent. Many attendees took pictures of the vehicles (including some that jumped the rope to get a better picture!). Obviously, Jeep has something in mind. We have been teased with the prospect of a Jeep pick-up truck several times over the past years. The Egyptian military version of the Jeep (the TJL) made its appearance a few times, and occasionally at Camp Jeep as well: Besides the numerous rumors over the years, at a past camp Jeep (2002?) the 2-door Unlimited (before it was in production) was on display in both the multi-passenger configuration (which became the 2-door Unlimited) and a small pickup truck version. American Expedition Vehicles (AEV) produced the Brute, and for a brief time AEV was in negotiations to build a mass number of the Brutes at the old Plymouth Prowler plant. AEV continues to work with Jeep, and this was evident in the presence of the Brute at Camp Jeep: Jeep has also teased us with the Gladiator concept (a full size truck built off of a modified Dodge Ram 2500 frame) a few years ago: And now we have the JT (built with the JK 4-door frame and the TJL tub): It might seem like a no-brainer to build the JT, but there are a few issues. First this is a niche of a niche. The JT is a mini-truck, and the only vehicle close in size is the Ford Ranger. Will anyone want to buy a small personal truck? The good news is Jeep recognizes this, and they see the potential in this market, and they realize this is a special niche market. Because this is a small niche market, they would have to be clever in how they produce such a vehicle in such a way as to still make a profit and make the bean counters happy. To do this, they have to keep production and design costs down. Well, this seems simple. The vehicle can use the 4-Door JK platform. That actually sounds good, but there are a few problems. Do you use a swing gate like the current Wrangler, or do you switch to a traditional tail-gate like most pickup trucks. I, like most of you, would want a normal drop tail gate like the old CJ-7/8 had (but with the ability to open it from the outside). Since the JT only has a 5 foot pick-up bed, the added length you get from dropping the tail gate could make it easier to haul with. Granted, this is a personal truck, so your not going down to your local home improvement store and get 30 sheets of drywall, but you still want it to carry stuff. Ok, let\u0092s say you do use a drop down tail-gate, what about the spare tire? Granted, you could have the spare tire swing out to the side and then drop the tail gate right? No, this is not acceptable because the spare tire would now block the tail lights. Ok, do like most pickups, and put the tire under the pickup bed. Well this is not doable either, because the muffler is in the way, and there really is not any room to relocate the muffler. The other problem is because Jeep Wranglers are made for off-roading, you don\u0092t want to have much underneath that reduces the ground clearance. Here is a photo of the 4-door JK platform so you can get a better perspective: Ok, how about just putting the tire in the pickup-bed along the side similar to the spare that was in the Cherokee. Well, now you have a problem if you want to have a tonneau cover over the pickup bed to protect it from the elements. Additionally, if this was a \u0091space saver\u0092 tire would you accept that? Since most Jeep Wranglers are purchased not just for off-roading, the basic looks of the JT is a bit plain for many consumers. I know many would love to have the JT as it is, but frankly, most dealerships would be hard pressed to sell it like that. Additionally, even though the \u0091show bar\u0092 on the current Wrangler is not a true \u0091roll-bar\u0092, how safe would one feel off-roading with only the cab area having some protection? Most likely, I can see Jeep adding some roll bar similar to other pickup trucks, even if it is only for show. The overly plain look of the JT just won\u0092t sell, and to make a profit, you need to add some accessories. This is true of the Wrangler. The good news is like many die-hards do now; you still can buy a basic Wrangler, and strip out a lot to make it plainer. Ok, back to the spare tire issue. My thoughts were do something like the Gladiator, and mount the spare to the side. It maybe necessary to alter the pickup bed so there is an indentation to accommodate the spare, even if you use a space saver. Still, having the spare on the side gives it a more rugged look. The key is the spare can not stick out too far. I think the JT has a possibility of being produced, but there is concern of this being another Scrambler. As much as I like the old CJ-8, at only 27,000 units in 5 years, it was a sales flop. As far as Jeep producing the Gladiator, I got no indication Jeep has any intention of building that full size truck on any platform. The JT looks like the most likely candidate for Jeep to re-enter the pickup truck market. With the release of the Mercedes controls on Chrysler, who knows what Jeep might venture in to? How many of us ever thought Jeep would build the 2-door or the 4-door Wrangler Unlimiteds? The good news is the Jeep Engineers do surf the web, and they are aware of Mike\u0092s web site. My thought is if you like or dislike the JT, post your thoughts on: Would you buy a small convertible personal truck with great off-roading Wrangler capability? Which do you prefer - Swing-gate tail gate or a drop down tail gate? Would you want a roll bar in the pickup bed or no roll bar at all? Can you live with a space saver tire? Where would you put the spare tire? Other thoughts/comments\u0085 Happy Jeeping!!!!!}",
    "textBeforeTable": "You must login or register to post a comment. We aren't responsible for their content. The comments are owned by the poster. FlatThreadedNested Oldest FirstNewest First margin:3px;\"> //--> google_color_text = \"000000\"; google_color_url = \"006633\"; google_color_link = \"006699\"; google_color_bg = \"FFFFFF\"; google_color_border = \"006699\"; google_ad_channel =\"\"; google_ad_format = \"468x15_0ads_al\"; google_ad_height = 15; google_ad_width = 468; google_ad_client = \"pub-0495763959545387\"; Reader Reactions",
    "textAfterTable": "Poster Thread luvjeeping27444 Posted: 2007/8/15 9:42   Updated: 2007/8/15 9:42 Just popping in Joined: 2003/2/6 From: Posts: 1  Re: They better come out with something fast Jeep is behind in a small pickup market. A small personal Jeep pickup with good fuel economy as a daily driver and cargo hauler as well as an occasional weekend off-highway explorer is something missing since the demise of the Comanche in'92. As far as I am concerned, in order of preference would be: 1. Brute, 2. JT, 3. Gladiator. At this point in my rusting Comanche's life, ANY of the above would work as long as I can plow snow with it too! Side mounted spare, or the option of mounting inside or outside the swing down tailgate. Anything, we just need a small Jeep pickup truck! Poster Thread",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}