{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2008-10-18T00:00:00",
            "2008-11-02T00:00:00",
            "2008-11-02T00:00:00",
            "2009-01-15T00:00:00",
            "2009-01-16T00:00:00",
            "2009-03-20T00:00:00",
            "2009-05-25T00:00:00",
            "2009-05-26T00:00:00",
            "2009-05-27T00:00:00",
            "2009-06-18T00:00:00",
            "2013-02-01T00:00:00",
            "2013-04-25T00:00:00"
        ],
        [
            "Description",
            "System Calibration: Aero-Metric collected data over a previously surveyed area in Palmer, Alaska. Data was collected at the same settings as this project, using two intersecting perpendicular lines. Two GPS ground stations were operating on site in order to minimize GPS error. The data was classified in each line separately for ground and other common features between lines, such as building roofs. This data was processed in TerraMatch 8.001 (TerraSolid, Ltd.), to compute corrections for roll, pitch, heading, and mirror scale. These corrections were applied to the initial processing settings (.res file). The data was reprocessed to verify the corrections were applied properly. The corrected data was then compared to ground surveyed measurements in order to check for any consistent vertical bias. The final step in calibration verified there was minimal vertical noise due to changes in intensity. This was done by comparing elevations of points on the airport runway, one point on a runway stripe and another adjacent point on the pavement.",
            "Create a smoothed-best estimated trajectory (SBET) of the sensor at a rate of 200 Hz, by integrating the airborne GPS and IMU data. The basis of the GPS coordinates were computed using NGS OPUS, and were referenced to NAD83 (CORS96) with GEOID06 derived orthometric heights. The maximum baseline distance for this project was 30 km, the average base line length was 12 km. The mean GPS positional accuracy for this project was +/- 0.08 meters.",
            "Integrate SBET and raw laser data to produce point cloud data in LAS 1.1 format for each flight line.",
            "Compute the roll, pitch, heading, and mirror scale correction factors for each flight line, then apply corrections to the corresponding flight line.",
            "Automated classification of the bare-earth data from the lidar point cloud using a series of algorithms customized for the types of terrain encountered in the project.",
            "Manual classification of any data which appears to be bare-earth but was not properly classified using the automated methods.",
            "The shorelines of the lakes and port areas were determined using manual techniques, starting with digitized shorelines from the orthophotography of the project area. The lidar points then underwent an intensive manual edit to determine with greater accuracy the points which represented the water surface. For the final data products the mean elevation of the water on each lake was used to determine its fixed elevation. The port areas fixed elevation was determined using the highest water point in the port data set. This value was found to be 4.72 meters. All points below 4.72 meters in the port area were fixed to this elevation, as per the contract.",
            "Create point clouds in LAS 1.1 format for all returns.",
            "Data verified using survey control points, located throughout the area.",
            "The metadata was updated for Bounding coordinates, Spatial Reference info using FGDC template",
            "The NOAA Coastal Services Center (CSC) received topographic files in LAS 1.1 format. The files contained lidar elevation and intensity measurements. The data were received in projected coordinates of NAD83 UTM6N, meters and were vertically referenced to NAVD88 orthometric elevations using GEOID06(Alaska). The vertical units of the data were meters. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. LAS Classifications 11(first return only), 13(first of many returns), 14(second of many returns), 15(third of many returns), 16(last of many returns) were all placed into Class 1 (Unclassified) 2. The topographic las files were converted from Projected Coordinates (NAD83 UTM6N, meters) to Geographic Coordinates (NAD83, decimal degrees). 3. The topographic las files were vertically converted from orthometric elevations (NAVD88) to ellipsoidal elevations (NAD83) using GEOID06. 4. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Components NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2007_aerometric_valdez_m1466.xml",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2007_aerometric_valdez_m1466.xml&view=ISO19115Components-HTMLTable&title=Components%20NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ak2007_aerometric_valdez_m1466.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 621917051,
    "recordOffset": 621900657,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:ak2007_aerometric_valdez_m1466Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov publisher http://coast.noaa.gov 1 NOAA CSC(distributor) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov distributor http://coast.noaa.gov 1 NOAA CSC (processor) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov processor http://coast.noaa.gov 1 DOI/USGS > United States Geological Survey, U.S. Department of the Interior originator",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}