{
    "relation": [
        [
            "Date",
            "Sat., Nov. 23",
            "Sat., Nov. 23",
            "Sat., Nov. 23"
        ],
        [
            "Time",
            "12:30 p.m.",
            "12:30 p.m.",
            "1 p.m."
        ],
        [
            "Game",
            "Georgetown at Holy Cross",
            "Lafayette at (17) Lehigh",
            "(12) Fordham at Colgate"
        ],
        [
            "Network (Talent)",
            "Crusader Vision (Bob Fouracre, Tom Kelleher)",
            "WFMZ-TV/FCS Pacific (Steve Degler, Mike Yadush, Troy Hein)",
            "GoColgateRaiders.com (Eric Malanoski)"
        ]
    ],
    "pageTitle": "Mcall.com: Groller's Corner Blog",
    "title": "",
    "url": "http://blogs.mcall.com/groller/2013/11/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 31812559,
    "recordOffset": 31708043,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{60200=1/28/14   Saucon Valley Away                7:00PM, 65244=Key date: 1:15 p.m. Saturday, Jan. 4 at home vs. Emmaus., 61419=1/07/14   Pen Argyl Away                       7:00PM, 60387=1/23/14   Palisades Home                        7:00PM, 62839=12/13/13 Saucon Valley Home               7:00PM, 59654=2/07/14   So. Lehigh Away                      7:00PM, 62571=12/17/13 ND-GP Home                           7:00PM, 31322=One thing to note is that my wife went with me to the first Thanksgiving game I covered at Upper Perk. That's when we were dating and students at Penn State. I was actually not an employee of The Morning Call at that point (the only nine-month period since Sept. 1979 that I wasn't an employee). But then sports editor Paul Reinhard used me as a freelancer while I was home on my break from Penn State., 20794=What's to like: The fact that Allen is finally supposed to get in its own gym on Friday morning. \"I've had open gyms and now practice here at Trexler and I have had to carry around three bags of balls,\" Snyder said. \"I've had three bgas of balls in my car, and then it gets cold, so I have to bring them into my living room and then lug them back into the car. I've been like a nomad.\" The new Sewards floor costs $370,000 and is the result of leaky roof that revealed its holes during a major July storm., 59856=2/04/14   Wilson Home                           7:00PM, 62713=12/14/13 Northampton Away                  1:00PM, 60557=1/21/14   No. Lehigh Away                     7:00PM, 63135=12/06/13 Blue Mountain Home              7:00PM, 61238=1/10/14   Northwestern Home                 7:00PM, 56626=Last Dec. 1, a promising Saturday just like this one, Pen Argyl was pasted by Imhotep Charter 54-7 in Slatington in the state quarterfinals , while about 80 miles away at Northeast High School in Philadelphia, Parkland was throttled by La Salle 28-7., 30538=1981 -- Souderton 34, Upper Perk 21., 61795=1/03/14   Bangor Home                           7:00PM, 23862=The last couple of years Snyder (seen below surrounded by his team) has not had as much fun after that great District 11 championship team in 2010-11 led by Jalen Cannon. There have been a variety of internal problems and disciplinary issues, but that seems to be all gone. Snyder talked about having good kids in the summer and that has carried over into the start of the season., 61090=1/11/14   Pottsville Away                        5:00PM, 50811=Also during Belfield's stint, Dieruff made the 2000 District 11 4A finals and posted a PIAA first-round victory over heavily favored Harrisburg. Anthony Ross, current coach at Penn State-Lehigh Valley, led Dieruff that year. Ross thrived under Belfield, registering a school-record, 1,419 points. , 51050=He was more successful as the school's boys basketball coach from 1996-2002, posting a 76-76 mark in six seasons and leading Dieruff to the 1996-97 East Penn Conference championship., 51167=He then coached the Husky girls from 1988-92 and his teams went 35-81., 32135=And while I was just seven years old the last time the Konkrete Kids and Rough Riders played at Muhlenberg in 1968 and can't really remember whether I was at one of these games as I kid, I know my grandmother (Northampton, Class of 1934) definitely attended some games at Muhlenberg as did some of my other family members. So, there's a nostalgic boost to help get me through this very cold morning., 63015=12/10/13 Palisades Away                        7:00PM, 63632=\"We're going to play everybody in our division before Christmas so we have to start strong. We also play a tough nonleague schedule. We're playing in the Parkland Christmas tournament. We play Emmaus here on a Saturday in January and the following Saturday we play Pottsville up at Martz Hall. We also play Blue Mountain and Northampton. We're playing a lot of bigger schools, which will be good for us.\", 65389=Openers: Friday at home vs. Blue Mountain; league opener, Tuesday, Dec. 10 at Palisades., 60057=1/31/14   ND-GP Away                           7:00PM, 62184=12/21/13 So. Lehigh Home *                  1:15PM, 60902=1/14/14   Catasauqua Away                     7:00PM, 45738=Key date: Tuesday, Dec. 10 vs. Hazleton., 55038=Parkland becomes the first District 11 4A team since Liberty in its state championship year of 2008 to reach the state semifinals with a 34-21 win over St. Joe's Prep. Neshaminy next week figures to be a handful for the Trojans, but right now I am sure they'd love to have to worry about that game., 24561=Stopped in to see Doug Snyder and his Allen Canaries as part of our 18 teams in 18 days tour, but this was not at Sewards Gym. That gym has been out of commission since July., 47449=Whitehall is coming off a successful football season, and while Jones supports the Zephyrs football team, it may be a good thing for the basketball program that Whitehall is no longer involved in the state tournament because one of its key players, Chad Rex, plays both sports. He's seen below in the white uniformn chasing down the ball in a district playoff against Stroudsburg last February., 45865=Openers: At Freedom in the Yasso-Rothrock tournament on Sat., Dec. 7., 21767=Openers: Play Northampton at 3:30 Sat., Dec. 7 at Freedom in the Yasso-Rothrock event; host Pocono Mountain West on Dec. 7; host Emmaus on Dec. 14 at 3:30 in the Donmoyer floor dedication ceremony., 47713=The Zephyrs have been a solid program, but have had trouble getting back to that championship level where they were in 2004 and 2005 when they won back-to-back Lehigh Valley Conference and District 11 4A titles, the only LVC program to accomplish the feat., 51508=Belfield, who was one of the most iconic figures in Dieruff basketball history, was a 1975 Husky graduate and went on to play at Tennessee State under legendary coach Eddie Martin., 60732=1/17/14   Palmerton Home                      7:00PM, 61593=1/04/14   Emmaus Home *                      1:15PM, 62381=12/19/13 Wilson Away                            7:00PM}",
    "TableContextTimeStampAfterTable": "{162113=Key date: 1 p.m., Dec. 23 at Bangor., 53893=Position: Quarterback (1955 and 1956) and Halfback (1957), 171226=The inductees representing Easton in the 2013 class are players Chuck Amato (1963), Joe Parsons (1968), John Critelli (1976), and Frankie Lane (1986).  (Playerâ\u0080\u0099s senior football season is in parentheses.), 55838=Years Played: 1966, 1967 and 1968, 53100=Years Played: 1955 and 1956, 198230=7:45 p.m., 137067=The other day we laid out the formats for the various sports in the new high school league set to begin in the fall of 2014, the newly-expanded Lehigh Valley Conference or whatever it will be called., 104627=Scrimmages: 5 p.m., Tuesday Dec. 3 at Nazareth., 357274=Lafayette will enter next week's game, a 12:30 p.m. start at Goodman Stadium, also 3-1 in the league. The Leopards were set to play Fordham late Saturday afternoon at Fisher Stadium., 278483=Tuesday, Nov 26 -            Lehigh Basketball v. Howard or South Dakota State â\u0080\u0093 airs 6 or 9 pm, 271452=Opener: Dec. 7 at Bethlehem Catholic in Yasso-Rothrock Christmas City Classic., 397642=NFL: Top 24 Vegas Trends 49ers â\u0080\u0093 Coach Harbaugh vs. teams with a win percentage of .700 or better: 10-0 ATS Bears â\u0080\u0093 Second of back-to-back home games: covered only 1 of 14 Bengals (-6 hosting Browns) â\u0080\u0093 When Cincinnati plays Cleveland: Favorite has covered only 1 of last 13 Bills â\u0080\u0093 Home team in Buffalo games: 11-1 ATS Bills (-1 hosting Jets) â\u0080\u0093 First time favored this season Bills: Any team favored the week after playing Steelers: 13-33 ATS Browns, Bucs, Jets, Vikings â\u0080\u0093 Any team off win as home dog: 4-20 ATS the next game Bucs â\u0080\u0093 Last 42 home games, have not once covered two straight home games Bucs (+1 hosting Atlanta) â\u0080\u0093 As a home underdog: 5-19 ATS Cardinals (-8 at Jacksonville) â\u0080\u0093 Biggest road favorite for Arizona since 12/20/2009 Chiefs (+8 at Denver) â\u0080\u0093 First time any 9-0 or better team has been an underdog of any size in any game (since at least 1990) Chiefs â\u0080\u0093 Undefeated teams (4-0 or better) off a bye: 13-1 ATS Chiefs â\u0080\u0093 Coach Reid off a bye: 14-1 SU (11-4 ATS) Chiefs â\u0080\u0093 Coach Reid on the road in his career: 76-47 ATS (63%) Dolphins â\u0080\u0093 Any home team off a loss as a road favorite: 14-2 ATS the next game Eagles â\u0080\u0093 Have not covered a home game since 2011 (losing 12 straight ATS as well as 20 of last 23) Falcons â\u0080\u0093 Off loss by 6 or more points: 16-3 ATS the next game Falcons (-1 at Tampa Bay) â\u0080\u0093 Any team favored the week after playing Seattle: 4-18 ATS Packers â\u0080\u0093 20-9 ATS as underdogs Patriots â\u0080\u0093 Bill Belichick as an underdog: 36-18-1 ATS Patriots â\u0080\u0093 On Monday Night Football: 11-1 SU (9-3 ATS) Saints (-3 hosting 49ers) â\u0080\u0093 Only third time in four seasons New Orleans under Coach Payton is not bigger than a field goal favorite at home Saints â\u0080\u0093 Covered 14 straight at home under Coach Payton (odds of this happening randomly: 16,383 to 1) Steelers (+2.5 hosting Lions): Only 6th time Pittsburgh is a regular season home underdog since 2001, 52576=WILLIAM BOCK- CLASS OF 1948, 408456=District 11 statistician Duke Helm has all of the latest numbers for the 2013 season. We thank Duke for sharing his stats with the media., 168461= Dilts played three years on the interior line at tackle on both offense and defense from 1939 through 1941.  He was a powerful blocker on offense and could be depended upon to open holes for positive yardage.  Tenacious on defense, Dilts was a staunch run-stopper and a relentless pass rusher.  He scored three defensive TDs in his career.  As captain his senior year in 1941, he helped lead the team to an undefeated 7-0-3 season. The Stateliners showcased a defense that finished the season unscored upon, and the team was named New Jersey State Champions by the Jersey Journal.  He was named 1st Team All-State at tackle in 1941., 53061=LONNIE GILLESPIE- CLASS OF 1957, 181716=12:30 p.m., 123849=Scheduled for November 22nd of 2014 at Yankee Stadium., 358658=L--Lee Kurfis 6 pass from Nick Shafnisky (Pandy kick) 9:19 (Drive: 12 plays, 80 yds, 5:30), 178887=Sat., Nov. 23, 37426=9:56-9:57 â\u0080\u0093 Game Captains Announced at Midfield, 41315=Friday, Nov 29 -, 277982=Monday, Nov 25 -            Lehigh Basketball v. Texas Southern â\u0080\u0093 airs 6:00pm, 164223=Four months from now: Dieruff could be looking back at one of its best seasons since the 1990s and its first championship since winning the East Penn Conference crown in 1997., 426299=Sunday, Nov 17 -              Lehigh Basketball @ Houston â\u0080\u0093 airs 1:30pm, 112804=Scrimmages: Played Liberty and Hatboro on Saturday; Sat., Nov. 30 at 9 a.m. at Easton., 374292=While Kareem Williams had the big night and couldn't be stopped in the second half, it was the Parkland offensive line featuring David Barber, Mike Aboulhouda, Omar Haddad, Dominic Rossetti and Josh Walmer, plus tight end Nezar Haddad, who controlled the trenches, and thus, the game., 56369=Head Coach: Bill Kennedy (1965, 1966 and 1967) Dale Edwards (1968), 250079=McHale was injured against Holy Cross on Nov. 9., 36962=8:45-9:30 â\u0080\u0093 Football Teams Pre-Game, 35824=                                                8:15 â\u0080\u0093 Home and Away Band Buses Show Up, 358756=L--Pandy 36 FG 1:10, 119014=LE -- Tyler Coyle 10 pass from McHale (Randy Pandy kick) 14:07 (Drive: 3 plays, 10 yds, 1:22), 52496=Accomplishments: was a member of the 1944 Lehigh Valley League champions, 35281=2013 Varsity Football, 221353=(6) McNeese State at Lamar, 196201=12:21 p.m., 436735=He didn't get much time with the Jets and did have a key drop in the rain in a Thursday night game against the Patriots. Hopefully, that didn't have anything to do with it, but he was cut by the team on Oct. 5., 118544=He is the first Lafayette freshman to win the MVP since running back Tom Costello won the honor in 1988. , 119537=LE -- Tyler Coyle 7 pass from Nick Shafnisky (Pandy kick) 14:56 (Drive: 12 plays, 85 yds, 3:26), 182592=3:30 p.m., 214715=2:30 p.m., 124864= I have two more buses set up for the November 22, 2014 Lehigh-Lafayette football game at Yankee Stadium., 366729=Last meeting: Colgate 35-24 on Nov. 10, 2012 at Goodman Stadium., 41732=Monday, Dec 2 -, 99158=Evan talks about the games that were played 50 years ago on Thanksgiving, 1963, less than a week after the assasination of President John F. Kennedy., 244378=Key date: Dec. 21 at Parkland., 138685=Saturday Aug. 30, 172835= Critelli was a two-year starter at linebacker in 1975 and 1976 and was co-captain and started at fullback in 1976.  He led the team in tackles in both years as a starter.  His size made him a physical presence inside and his speed allowed him to roam sideline-to-sideline to make tackles and to be dependable in pass coverage.  In 1975 John was 1st Team Big 8 and 2nd Team Express All-Area at linebacker.  In 1976 he was namedAP 1st Team All-State and UPI 2nd Team All-State at linebacker.  He was chosen as a High School All-American (2nd Team) based on Athletic Ability, Scholarship, Leadership, and Sportsmanship.  He was also a Northampton County All-Star and was selected as 1st Team Express All-Area and 2nd Team East Penn Conference, all at linebacker., 169166=Snyder was a three-year letterman from 1952 through 1954, playing fullback.  He was a mixture of sheer power and elusiveness and could run over defenders or maneuver past them with equal ease.   In his first two years Snyder helped his team to 12 victories, and was the high scorer and top rusher in 1954, helping lead the Stateliners to an 8-1 record and a Big 4 Championship.  He established himself as the top fullback in New Jersey and was rewarded with 1st Team All-State honors., 37030=9:30-9:40 â\u0080\u0093 Catasauqua Band Performs, 168068=Hall of Fame Class of 2013, 37506=9:57-9:58 â\u0080\u0093 Coin Toss, 55473=Years Played: 1962, 1963, 1964 and 1965, 435093=One time at the weekly media sessions I asked Ryan about his father and he did tell me that he was inspired by him and always wanted to make him proud. However, I remember doing the story on Nov. 29, 2011, five years to the day that his father died., 54862=JAMES REED- CLASS OF 1964, 41415=Saturday, Nov 30 - , 425427=ESPN radio of the Lehigh Valley can be heard at AM 1230 and 1320:, 36179=                                                8:30 â\u0080\u0093 Home and Away Cheerleading Buses Show Up, 53301=Years Played: 1953, 1954, 1955 and 1956, 271587=Key date: Feb. 1 vs. Lower Merion at Parkland., 436217=And then he was at half-strength for a good portion of the 2012 season and even missed a couple of games battling pneumonia. Whatever came his way, he persevered., 54895=Years Played: 1960, 1961, 1962 and 1963, 358804=L--Kurfis 9 pass from Shafnisky (Pandy kick) 9:58 (Drive: 5 plays, 51 yds, 2:20), 118803=LA -- Ross Scheurman 1 run (Ryan Gralish kick) 12:33 (Drive: 3 plays, 32 yds, 1:27), 53816=BARRY STECKEL- CLASS OF 1958, 169689=Luke was a three-year varsity letterman at running back from 1992 through 1994, while also serving as co-captain in 1994.  He and Leonard Moore formed one of the greatest running back tandems in team history.  Luke rushed for 2155 yards and scored 164 points in his career, and had 10 games in which he rushed for 100 or more yards.  He ran for 1254 yards and scored 20 touchdowns in 1994.  Luke was a Wendyâ\u0080\u0099s High School Heisman regional finalist and Phillipsburgâ\u0080\u0099s National Football Foundation and College Hall of Fame Scholar Athlete., 55969=Head Coach: Bill Kennedy (1966 and 1967) Dale Edwards (1968), 191475=9:30 p.m., 270128=The goal for me is to go 18-for-18 and get to 18 different teams, or at the very least, visit with 18 different coaches, in the buildup to the start of the season. We won't get to everybody in the LVC, MVC or Colonial League, but we hope to get to a majority of the most intriguing teams entering the 2013-14 season., 55433=THOMAS BRZOZOWSKI- CLASS OF 1966, 53266=BOB WILLIAMS- CLASS OF 1957, 118246=It's the first time the Leopards have won an outright Patriot League title since 1994 and the first time they scored 50 points against Lehigh since 1994., 37560=9:58-9:59 â\u0080\u0093 Alma Mater Band, 54794=Accomplishments: Also coached football at CHS from 1964-1967, 52611=Years Played: 1944, 1945, 1946 and 1947, 37099=9:30-9:40 â\u0080\u0093 Honorary Captains Line up in Endzone, 162745=What's to like: The fact that 35 kids are in the progam, including 13 freshmen. The Huskies are very deep and unlike past years, Gabryluk is optimistic that the kids will do what it takes to stay involved with the program through the season. The Huskies showed a lot of quickness in the summer. Kohl, who is much leaner than he was at Notre Dame in 2010-11, has the talent to be one of the top two or three players in the area and how the rest of the guys react to him will be be critical to Dieruff's chances to compete for a title., 244285=Opener: Dec. 10 at Emmaus., 358892=C--DeCicco 24 run (Bowman kick) 4:49 (Drive: 12 plays, 72 yds, 5:02), 118894=LA -- Mark Ross 31 pass from Drew Reed (Gralish kick) 6:39 (Drive; 12 plays, 83 yds, 5:22), 129690=Openers: Friday, Dec. 6 vs. East Stroudsburg South; Saturday Dec. 7 at Liberty in Yasso-Rothrock Classic; Saturday, Dec. 14 vs. Allen on John Donmoyer ceremony day., 249923=After the season-ending injury to Brandon Bialkowski at Bucknell on Oct. 26, both junior Matt McHale and freshman Nick Shafnisky have started games., 52218=2013 TURKEY DAY FOOTBALL GAME, 160559=Tyler Kohl (pictured at right with ball in a Jan. 2011 game against Bangor) enrolled in the school last week. He was one of the best players in the Colonial League three seasons ago at Notre Dame when as a freshman he scored 402 points, the most for any freshman in local hoops history, and averaged 16.8 points per game., 202680=5:45 p.m., 119416=LA -- Scheuerman 1 run (Blake Searfoss run) 3:28 (Drive: 11 plays,  41 yds, 6:09), 138059=Now, however, things have been revised and a whole block of cross-division games has been moved up to Week 1, which, next year, will be Aug. 29-30. This was done to insure that everyone would have an equal number of home and away games. Former Northampton AD Mike Schneider is the scheduler and has done a masterful job laying things out., 276817=Friday, Nov 22 -                 Lehigh Wrestling v. Pitt â\u0080\u0093 airs 6:45pm, 56037=Accomplishments: Member of the 1966 team that ended the 21-game losing streak to Northampton. Senior year was the last game played at Muhlenberg College, 366617=Radio: ESPN Radio of LV (1230, 1320 AM)., 37620=9:59-10:00 â\u0080\u0093 National Anthem Band, 54303=Accomplishments: Was the only freshman on the varsity team during his freshman year. Was the teamâ\u0080\u0099s only captain during his senior year. Will be inducted into the Catasauqua High School Hall of Fame in January as a member of the Class of 2014., 9945=Passing: Nick Cook 91-171-4, 1180 yards, 9 TDs; Cory Croll 13-17-1, 166 yards, 1 TD., 46384=Openers: host Emmaus on Saturday, Dec. 7 in Yasso-Rothrock Christmas City Classic. Play at Becahi, Fri. Dec. 13., 138453=Friday, Aug. 29, 37180=9:40-9:54 â\u0080\u0093 Honorary Captains Announced at Midfield, 52308=PAUL BEHUM- CLASS OF 1947, 28460=Passing Yards (1000 minimum), 168222=  The inductees representing Phillipsburg in the 2013 class are players Joe Dilts (1941), George Snyder (1954), Joe Luke (1994), and Brandon Mason (2003).  (Playerâ\u0080\u0099s senior football season is in parentheses.), 104887=Key date: 1 p.m. Saturday, Dec. 14 vs. Moravian Academy at Allen's Sewards Gym as part of the John Donmoyer floor dedication doubleheader., 269977=I am not the best at math, but I count 18 days starting with Monday and leading into the basketball season openers on Friday, Dec. 6., 373030=Zephyrs will point out with pride, however, that Parkland's enrollment is more than twice that of Whitehall's (1288 to 540 for boys) and yet the Zephs usually find a way to compete in most sports., 63841=DL Alec May, Georgetown Jr., 55591=Head Coach: Burt Kuczynski (1962 and 1963) Bill Kennedy (1964 and 1965), 190576=Tues., Nov. 26, 36599=                                                8:45 â\u0080\u0093 Officials Meeting w/ Scoreboard Operator, 254204=Key date: Jan. 11 at Central Catholic, 5 p.m., 277140=Sunday, Nov 24 -              NFL: San Diego @ Kansas City â\u0080\u0093 airs 12:30pm, 119210=LE -- Lee Kurfis 9 pass from McHale (Pandy kick) 1:11 (Drive: 5 plays, 32 yds, 1:53), 52834=Years Played: 1948, 1949, 1950 and 1951, 393573=The Steelers are a home underdog in a regular season game for just the sixth time since 2001 as they take on the Lions this Sunday., 54155=Years Played: 1955, 1956, 1957 and 1958, 55239=Head Coach: Burt Kuczynski (1961, 1962 and 1963) Kennedy (64), 17865=2013 single game highs: ( ) is the week the player accomplished the stat , 178649=7:30 p.m., 113128=Key date: The league opener Tuesday, Dec. 10 vs.Wilson, 340529=Shafnisky led Lehigh to a second straight critical win by completing 11-of-21 passes for 134 yards and two touchdowns and rushing for 26 yards in the Mountain Hawksâ\u0080\u0099 31-14 victory at Colgate on Saturday. He threw both of his touchdown passes to Lee Kurfis, putting Lehigh up 14-7 in the second quarter and 24-7 in the third as the Mountain Hawks rallied from an early deficit. Shafnisky was 5-of-7 for 105 yards and a touchdown in the second half as Lehigh preserved the lead. He became the first freshman to start at quarterback for Lehigh since Phil Stambaugh in 1996, and earns a second straight Rookie of the Week award., 70748=Scrimmages: Had one on Monday against Moravian Academy; Tuesday, Dec. 3 at 4 p.m. vs. Jim Thorpe., 182302=1:30 p.m., 52341=Years Played: 1944, 1945 and 1946, 41061=Thursday, Nov 28 - , 102081=As we continue the preseason high school boys basketball \"18 teams in 18 days\" previews, looking for 18 of the most intriguing storylines entering the 2013-14 season, we spent Sunday night having a lengthy phone conversation with Kyle Hutnik., 37686=10:00 â\u0080\u0093 Kickoff, 130335=Key date: Tuesday, Dec. 10 vs. Stroudsburg., 119725=LA -- Demetrius Dixon 68 pass from Reed (Gralish kick) 8:29 (Drive: 1 play, 68 yards, 0:15), 52800=CARL RIEKER- CLASS OF 1952, 35469=                                                8:00 â\u0080\u0093 Home and Away Team Buses Show Up, 53647=Years Played: 1955, 1956 and 1957, 36542=8:30 â\u0080\u0093 Officials Show Up, 103238=Hutnik, age 31 at time of his hriing in June, is Pen Argyl's fourth head coach in four seasons and inherits a program that has won just 16 games over the last four seasons and hasn't had a winning year since 2004-05., 172071=Parsons was a three-year starter at linebacker from 1966 through 1968 and was a co-captain and started at fullback in 1968.  Easton teams had a 28-1-1 record and were Big 5 and Big 6 Champions during his three years, sharing the Big 6 title in 1966. At fullback Parsons was a great lead blocker and a strong short yardage runner.  He was a rock on defense at linebacker and known for his physical play.  In 1968 Joe was UPI 3rd Team All-State and AP Honorable Mention All-State at fullback, Big 33 at linebacker, 1st Team Big 6 at linebacker and 2nd Team Big 6 as a back, and was chosen as a Northampton County All-Star at running back.   He was named the Most Valuable Player of the Easton-Phillipsburg game., 375267=He would be a huge addition to a very quick Dieruff team that advanced to the Stellar Summer League finals in August., 358995=L--Sherman 3 run (Pandy kick) 8:19 (Drive: 7 plays, 76 yds, 2:59), 41524=Sunday, Dec 1 -, 253195=The 18-for-18 series previewing 18 boys basketball teams entering the 2013-14 season continues with a look at the Bangor Slaters., 425500=Thursday, Nov 14 -          NFL: Indianapolis @ Tennessee â\u0080\u0093 airs 8:00pm, 178593=Thurs., Nov. 21, 202988=6:30 p.m., 201789=2:05 p.m., 161843=Scrimmages: 10 a.m., Nov. 30 at Pottsville Nativity; Dec. 3 vs. Pottstown, Quakertown., 192944=10:30 p.m., 244153=Scrimmages: 9 a.m., Nov. 30 vs. Whitehall; 6 p.m., Dec. 4 at Hazleton., 171451=Amato was a two-year starter at linebacker in 1962 and 1963, was a tri-captain in 1963 and also started at fullback.  In his junior year the Rovers were Big 5 Co-Champions. He was outstanding at linebacker, quick to read plays, flow to the ball and make punishing tackles and was also a workhorse at fullback, getting the tough yards when needed.  In 1963 Chuck was named AP Honorable Mention All-State and a 1st Team East Penn Conference All-Star at linebacker, and Big 33 Honorable Mention at both fullback and linebacker.  He was also a 1964 PIAA State Wrestling Champion at 165 lbs., 68553=Snyder is used to not getting his kids until after Thanksgiving. This year, Catty is playing two days after Thanksgiving against Imhotep in the state playoffs and if, somehow, some way, the Roughies shock the Philadelphia charter school, they might still be playing in the state finals on Dec. 14 in Hershey., 358483=C--Demetrius Russell 2 run (Jonah Bowman kick) 9:00 (Drive: 10 plays, 82 yds, 4:48), 159610=Dieruff used to be one of the premier boys basketball programs in the area. But lately the only time the Huskies have shown some bite has been in the summertime. In fact, they won the Stellar Summer League title in 2012., 254094=Opener: Dec. 6 host East Stroudsburg North., 41010=ESPN radio is available on AM-1230 and 1320, 276679=Thursday, Nov 21 -          NFL: New Orleans @ Atlanta â\u0080\u0093 airs 8:00pm, 70902=Openers: Friday, Dec. 6 at Nazareth; Tuesday, Dec. 10 at Palmerton., 434816=When he was at Lehigh, Ryan (seen in photo at left in the 2010 FCS playoffs against Delaware) wanted to focus on his career. As Lehigh's beat reporter for The Morning Call, I knew he had lost his father during his high school career but certainly not the circumstances., 191679=Fri., Nov. 22, 60144=2013 All-Patriot League Football Team, 155377=NFL: Top 16 Vegas Trends 49ers â\u0080\u0093 On Monday Night Football: 37-12 ATS (76%) Bears â\u0080\u0093 Have not covered once in the last 9 games before playing Minnesota Chiefs â\u0080\u0093 Have not been favored against San Diego since 2005 Chiefs â\u0080\u0093 When favored in division: 1-10 ATS Cowboys - Underdog has covered 71% of Dallas games (41-17 ATS the last 4 seasons) Cowboys â\u0080\u0093 Any team off 30+ point loss before bye: 15-4 ATS Dolphins, Steelers â\u0080\u0093 Any team following a win as a home underdog: 5-23 ATS Lions â\u0080\u0093 Any team favored the week after playing Mike Tomlinâ\u0080\u0099s Steelers: 13-33 ATS Packers â\u0080\u0093 In division: 12-2 ATS Panthers â\u0080\u0093 Covered 6 straight, beating the spread by a combined 82 points Patriots â\u0080\u0093 First time underdogs in back-to-back games since 2006 Patriots â\u0080\u0093 As an underdog following a loss: 15-2 ATS Patriots â\u0080\u0093 First time home underdogs since 11/7/2005 (2938 days ago!) There have been 708 home underdogs since. Rams have been home dogs 45 times during this span. Patriots â\u0080\u0093 Have won 35 of 38 regular season games at home Redskins â\u0080\u0093 Home underdogs on Monday Night Football have covered only 42% of the time since 2001 Steelers: Last time Pittsburgh was an underdog vs. Cleveland: 2003 (the time before that: 1994) --, 271295=Scrimmages: Nov. 26 vs. Trinity at Parkland (6); Sat., Nov. 30 vs. Notre Dame at Parkland (10 a.m.)., 358574=L--Tim Newton 2 fumble recovery (Ryan Pandy kick) 2:58, 56197=RUSTY HAINES- CLASS OF 1969, 253938=Scrimmages: Saturday at St. Joe's Prep, 10 a.m.; Nov. 30, vs. Holy Cross at Bangor, 11:30 a.m., 55128=Years Played: 1961, 1962, 1963 and 1964, 276993=Saturday, Nov 23 -           Lehigh Football v. Lafayette â\u0080\u0093 airs 11:30am, 129511=Scrimmages: Today at 1 p.m., tri-scrimmage at Blue Mountain including Pottsgrove; Sat. Nov. 30 at Scranton., 170270=Mason was an outstanding player on both sides of the ball as a starter in 2002 and 2003, serving as captain his senior year.  At running back he rushed for a school record 1880 yards and scored 24 touchdowns as Phillipsburg went 9-1 and captured the 2003 Skylands Conference Championship.  Averaging 188 yards a game, Brandon eclipsed the 100-yard mark in 9 of 10 games that year, including a school record 305 yards and four TDs against Franklin.  A superb defensive back, he collected five interceptions and four fumble recoveries in his career.  In 2003 he was chosen as 1st Team All-State at defensive safety and 2nd Team All-State at running back.  He was also selected as New Jerseyâ\u0080\u0099s Gatorade Player of the Year, the Express-Times Player of the Year, and Offensive MVP of the Phillipsburg-Easton game. , 104736=Openers: Saturday, Dec. 7 vs. Notre Dame-East Stroudsburg; Tuesdsay, Dec. 10 vs. Northwestern., 161986=Opener: Dec. 7 vs. Easton at Becahi in Yasso-Rothrock Tournament., 52956=Head Coach: Bob Mushrush (1948 and 1949) and Champ Storch (1950 and 1951), 37264=9:54-9:55 â\u0080\u0093 Away Team (Catasauqua) Enters Field, 56232=Years Played: 1965, 1966, 1967 and 1968, 427142=Monday, Nov 18 -            NFL: New England @ Carolina â\u0080\u0093 airs 8:00pm, 435939=Spadola went through a lot of adversity in what was largely a stellar career at Lehigh. You might remember \"Tweetgate\" during the 2011 playoffs when he was suspended for the playoff game at North Dakota State for retweeting a tweet that included a racial slur., 384393=For example, in 2009, South defeated Liberty in the quarterfinals but lost by a lopsided margin to Easton in the semis., 387733=Parkland 21, Whitehall 14 -- These two, in my opinion, are the two best teams in the area and it's sort of a shame one will be packing up the uniforms come Saturday. I will be at Zephyr Stadium with colleague Stephen Miller and will have Twitter updates. Just like in the game above, there's very little to pick from here. Both are better teams than they were when they met in late September. Both sides have playmakers, but Parkland has a slightly better defense and that's where I give the Trojans the edge., 276485=This is what's coming up on ESPN radio of the Lehigh Valley (AM 1230 and 1320):, 282038=The show can be seen at 8 p.m. Monday on Service Electric TV2 and is shown twice on RCN-4 at 6 p.m. Tuesday and at 5:30 on Thursday., 54600=Years Played: 1957, 1958 and 1959, 384985=The bottom line is this: No MVC team has won a district title since 1995 when East Stroudsburg and James Mungro won the gold. To put that in perspective, most kids who graduated from high school this past June were born in 1995., 112947=Openers: Friday, Dec. 6 vs. Upper Perk in Solehi Tip-Off tournament, will play either Quakertown in Harriton on Dec. 7., 426155=Saturday, Nov 16 -           Lehigh Football @ Colgate â\u0080\u0093 airs 12:00pm, 53611=RONALD BROSKY- CLASS OF 1958, 37344=9:55-9:56 â\u0080\u0093 Home Team (Konkrete Kids) Enter Field, 54562=RAYMOND LAUBACH- CLASS OF 1960, 119640=LE -- Keith Sherman 13 run (Pandy kick) 8:49 (Drive: 9 plays, 53 yards, 3:27), 55802=JOSEPH BARCZY- CLASS OF 1969, 68869=And if that's the case, then most of the Roughies basketball team won't be in place until Christmas, and not in sync until mid-January, and by then the season is two-thirds over. Such is life at a small school where athletes must be shared. Snyder (seen looking pensive in photo) has dealt with it many times before, but this year is at an extreme level., 425641=Friday, Nov 15 -                 Lehigh Basketball @ Fordham â\u0080\u0093 airs 6:30pm, 119115=LA -- Justin Adams 4 pass from Reed (Gralish kick) 12:22 (Drive: 6 plays, 65 yds, 1:45), 46553=Key date: Host Reading at 2 p.m. on Saturday, Feb. 1, 55093=DOUG COLEMAN- CLASS OF 1965, 276572=Wednesday, Nov 20 -     Lehigh Basketball @ Pitt â\u0080\u0093 airs 7:00pm, 256692=Jeremy Ringland (left) stood tall against Wilson in the Colonial League title game and will have to do so all season for the Slaters in 2013-14., 202368=3:05 p.m., 54116=EDWARD HARTRANFT- CLASS OF 1959, 173813= Lane was a major contributor in 1985 and co-captain and starter in 1986.  Rover teams in those two years had a 19-4 record and were East Penn League Co-Champions in 1986.  In 1985 he was the teamâ\u0080\u0099ssecond leading rusher and was named Honorable Mention Express All-Area at running back. In 1986, â\u0080\u009cFrankieâ\u0080\u009d barely came off the field, gaining 1148 yards at running back on 200 carries and scoring 10 TDs.  He started on defense at monster back, returned kicks, and snapped for punts and placekicks.  In 1986 he was chosen as1st Team East Penn Conference and 1st Team Express All-Area at running back, and was also selected as the newspaperâ\u0080\u0099s Player of the Year.}",
    "textBeforeTable": "American Athletic From the National Football Foundation: Television Football, Categories: Total People in Discussion: 0 Complete weekend college football TV schedule, including tonight's games November 21, 2013 Digg It Add to del.icio.us | Linking Blogs | Trackbacks | Comment | Permalink | I just wrote about Frank Lane, the former Easton running back who is now a Parkland assistant. Frank is most proud of the fact that he will be inducted into the Phillipsburg/Easton Hall of Fame on Thursday morning at 9 a.m. at Fisher Stadium, prior to the 107th meeting between the Red Rovers and Stateliners in one of local sports' greatest rivalries. Lane is one of eight inductees who will be saluted inside Lafayette Collegeâ\u0080\u0099s Kirby Sports Center, This Hall of Fame class includes four players or coaches from each school.  After careful research, inductees were selected from a long list of eligible candidates.  Membership is based",
    "textAfterTable": "Sat., Nov. 23 7 p.m. Connecticut at Temple ESPN3 (Dave Weekley, KC Keeler) Sat., Nov. 23 7 p.m. SMU at USF ESPN3 (Drew Fellios, Doug Graber) ACC Date Time Game Network (Talent) Sat., Nov. 23 12 p.m. Citadel at (7) Clemson ESPN3 (Jim Barbar, John Bunting, Angela Mallen) Sat., Nov. 23 12 p.m. Virginia at Miami (Fla.) ESPNU (Tom Hart, John Congemi) Sat., Nov. 23 12 p.m. Old Dominion at North Carolina RSN (Wes Durham, Brian Stann, Jenn Hildreth) Sat., Nov. 23 12 p.m. Duke at Wake Forest ESPN2 (Beth Mowins, Joey Galloway2, Paul Carcaterra) Sat., Nov. 23 12:30 p.m. East Carolina at N.C. State ACC Network (Mike Hogewood, Riley Skinner, Dwayne Ballen) Sat., Nov. 23 12:30 p.m.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}