{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's quiet and there is security patrolling the lots.",
            "There's a variety of clubs on campus, and they're really accessible.",
            "There is the rec center. You can lift weights or just go to the workout room to use their equipment. There's a selection to it. Also there is own gym in available days. They provide a schedule fort you to view.",
            "Good is okay. I early order from the cafeteria, but they have a good selection.",
            "I live nearby, so I can not speak to this. But ice heard from other classmates that it's nice to live across the street from school.",
            "If there are any struggles with your studies here at inverhills, they have help available. Tutors and some online help as well. Most of the time they are your own classmates.",
            "Parking can some times be hectic, so come early. The earlier you are, the more study time you get, and the better the parking.",
            "The staff here is great, they can almost always make time and take the effort to meet with you after class. Community is small, and not crowded. They have just upgraded their library and computer room and it gives us students now space to work with."
        ]
    ],
    "pageTitle": "Inver Hills Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Inver-Hills-Community-College/reviews?_escaped_fragment_=/show/60336",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891775599,
    "recordOffset": 891746508,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39937=Connect with your professors--I have not been a student there since winter of 2010 and I still keep in touch with some of my favorite professors. One has wrote me a letter of recommendation to study abroad in Australia., 63226=Take speech and writing 1108 the first term, even if you dislike English. These classes will set you up for future sucess for the remainder of your college years. Most every class I had taken required some sort of 3 to 7 page written paper. Many others required giving presentations to the class., 102559=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/26/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 27 Jessica from Farmington, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Great for these types of students busy people or parents Bang for the buck The tuition is the cheapest I have seen for a great quality of learning What to do for fun Free movie nights Food and Dining Food is a little spendy Dorm Life They do not have dorms. Tips for prospective students If you are busy and still would like a obtain further schooling, this is the school for you. The rates are reasonable and the teachers there treat you as an equal. In three sentences I rate this school a 10 out of 10 for having the fleixble hours, great rates and access to many academic resources. I appreciate that I am able to obtain my dream job qualifications while being a mother and working a full time job. This school has given me opportunity to do it all. Login to rate or flag the reviews Ashley from Burnsville, MN",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}