{
    "relation": [
        [
            "Date",
            "Mar 29, 2004",
            "Oct 22, 2012",
            "Mar 10, 2013",
            "Apr 30, 2013"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TAKAGI, HIRONOBU;ASAKAWA, CHIEKO;REEL/FRAME:014469/0765 Effective date: 20040317",
            "",
            "",
            "Effective date: 20130310"
        ]
    ],
    "pageTitle": "Patent US7502995 - Processing structured/hierarchical content - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7502995?dq=5,583,822",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474397827,
    "recordOffset": 474345497,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6356=The processing apparatus 18 for the structured/hierarchical contents of FIG. 2 generates the matching pattern based on the past structured/hierarchical contents (contents of which URLs are the same as that of the target content) with respect to the target content. However, the processing apparatus 18 can also generate the matching pattern based on the structured/hierarchical contents adjacent to the target content. The generation of the matching pattern based on the adjacent structured/hierarchical contents may be implemented (a) only when there are no past content portions with respect to the target content or (b) regardless of the existence of the past content portions with respect to the target content. For example, the business article page on the home page of Asahi Shimbun (www.asahi.com) includes a date in the URL as follows, and can be browsed together with up-to-date business articles for a predetermined period including the present. Note that, in the example below, the business article is dated as of October 19.}",
    "TableContextTimeStampAfterTable": "{79464=(a) Only a portion recognized as a date in the URL differs from that of the target content. In the above-described example of the business article of Asahi Shimbun, the relevant portion is “1019.”(b) Only a portion used as numbering in the URL differs from that of the target content. In the above-described example of the bisiness article of asahi shimbun, the relevant portion is “002.html.”(c) Only the above-described (a) and (b) differ from those of the target content., 38536=Japanese Patent Laid-Open No. 2002-245068, 38792=CHIP[I] Ito “Construction method of distributed applications by integration of GUI parts and WEB services,” Japan Society for Software Science and Technology WISS 2001 Proceedings, 79971=(a) Only a portion recognized as a date in the URL differs From that of the target content. In the above-description Example of the business article of Asahi Shimbun, the Relevent portion is “1019.”, 33585=(2) Dynamic Annotation Matching Method Using XPath Set as Key (Japanese Patent Application No. 2001-333260 not Yet Laid-Open at the Time of Preparing this Specification):, 38411=Japanese Patent Laid-Open No. 2002-55872}",
    "textBeforeTable": "Patent Citations It is noted that the foregoing has outlined some of the more pertinent objects and embodiments of the present invention. This invention may be used for many applications. Thus, although the description is made for particular arrangements and methods, the intent and concept of the invention is suitable and applicable to other arrangements and applications. It will be clear to those skilled in the art that modifications to the disclosed embodiments can be effected without departing from the spirit and scope of the invention. The described embodiments ought to be construed to be merely illustrative of some of the more prominent features and applications of the invention. Other beneficial results can be realized by applying the disclosed invention in a different manner or modifying the invention in ways known to those familiar with the Thus the invention includes an article of manufacture which comprises a computer usable medium having computer readable program code means embodied therein for causing a function described above. The computer readable program code means in the article of manufacture comprises computer readable program code means for causing a computer to effect the steps of a method of this invention. Similarly, the present invention may be implemented as a computer program product comprising a computer usable medium having computer readable program code means embodied therein for causing a a function described above. The computer readable program code means in the computer",
    "textAfterTable": "Method and apparatus for transcoding multimedia using content analysis US7315981 * Feb 28, 2003 Jan 1, 2008 International Business Machines Corporation XPath evaluation method, XML document processing system and program using the same US7437664 * Jun 18, 2002 Oct 14, 2008 Microsoft Corporation Comparing hierarchically-structured documents US20040010752 * Jul 9, 2002 Jan 15, 2004 Lucent Technologies Inc. System and method for filtering XML documents with XPath expressions US20040103091 * Jun 13, 2003 May 27, 2004 Cerisent Corporation XML database mixed structural-textual classification system US20060004817 * Dec 7, 2004 Jan 5, 2006 Mark Andrews Method and/or system for performing tree matching US20070168327 * Dec 6, 2006 Jul 19, 2007 Mark Logic Corporation Parent-child query indexing for xml databases US20080092034 * Oct 11, 2006 Apr 17, 2008 International Business Machines Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}