{
    "relation": [
        [
            "Harga",
            "Status Harga",
            "Kondisi",
            "Kilometer"
        ],
        [
            ":",
            ":",
            ":",
            ":"
        ],
        [
            "",
            "55000000",
            "Mobil Bekas",
            "km"
        ]
    ],
    "pageTitle": "Bursa Mobil Bekas Toyota Corona Absolute - Page 1",
    "title": "",
    "url": "http://www.mobilbekas.co.id/bursa_mobil_bekas_t.php?s_model=765=Toyota%20Corona%20Absolute",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 578491711,
    "recordOffset": 578477954,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47723= Dijual Corona Absolute 1997. An, Sendiri. AB Sleman. Pajak Masih Lama. Kondisi Bagus. Jarang dipakai. Terawat. Bisa pinjam KTP. MOnggo Langsung Hubungi saya  Sugiyanto 085228278400, 43190=Dijual mobil Toyota Corona Absolute 2.0L DOHC EFI/Injection 16 Valve (ST191), tahun 1996 Desember, Manual, Warna Silver, Surat2 sangat lengkap., 82851=Dijual Toyota Corona Absolute 2.0 G 1996 Manual Hitam Mesin: # Kering, tidak ada rembes oli Halus dan sehat # Manual transmission tidak ada masalah Interior: # Beludru original dari pabrik (tidak ada sobek) # Power window, central lock, electric mirror berfungsi baik # Ac dingin # Full sound system Eksterior: # Warna: Hitam Solid # Full Kaleng, tidak ada yg kropos Kaki - kaki: # Ban Baru # kaki kaki nyaman, tidak ada bunyi Kelengkapan lain: # STNK, BPKB, Faktur lengkap # Tangan ke 2 Secara keseluruhan kondisi mobil siap pakai,dan tidak bekas banjir ataupun tabrakan Harga: Rp. 54jt (cash) nego dan kami memberikan diskon harga Rp. 51jt untuk pembayaran kredit, dengan simulasi sbb TDP: 18.448.125 Angsuran: 2.010.000 × 23 Untuk info hubungi : \"EBONY MOBILINDO\" CP: Nindi 081282345616 Randi 08170141233 *Jln.Kejaksaan raya No.18 B Pdk.Bambu Jaktim(Masuk Dari  Sebelah RS.Yadika Pondok Bambu Didepan Pom bensin) *Dapat diakses melalui \"Google Map\" keysearch \"Ebony Mobilindo\", 72711=dijual corona absolute tahun 1996 2.0 G AT transmisi, dengan spek sebagai berkut :- warna COKLAT METALIK- mesin 2000cc irit 4selinder,matic bagus boleh test, Mesin Kering Suara halus- power steering, steer enteng ga rembes ga bocor.- tilt steering ( steer bisa di atur tinggi rendah)- power windows- central lock- alarm- electrik mirror, Spion Lipat- mesin halus bertenaga- ac dingin- audio JVC TV monitor- ac dingin- pajak kelewat bulan 07- plat B jakarta - velg original (kaleng + dop)- bagasi luas- panel dasboard masih normal- belum pernah overheat, temperatur mesin normal- interior masih original (beludru)- lampu - lampu masih terang, nyala semua.- kelistrikan normal - panel speedometer jalan semua (bensin,temperatur,speedometer,rpm,lampu-lampu)- bensin cukup premium no tipu tipu..BU CEPAT harga 50jt nego sampe jadi.TAMBUN Lokasi : Griya Asri 2 Telp : 081213451629}",
    "textBeforeTable": "",
    "textAfterTable": "Home Pasang Iklan Mobil Cara Pasang Iklan Iklan Mobil Terkini Berita Otomotif Join Facebook Daftar Mobil Dicari Contact Us Pencarian Semua Merk Mobil Audi Bentley BMW Chery Chevrolet Chrysler Citroen Daewoo Daihatsu Datsun Dodge Ferrari Fiat Ford Hino Holden Honda Hummer Hyundai Infiniti Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus MAN Maserati Mazda Mercedes-Benz Mini Mitsubishi Nissan Opel Peugeot Porsche Proton Rolls-Royce",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}