{
    "relation": [
        [
            "تفاصيل المشروع",
            "الترجمة التحريرية حجم: 0days تمت Jan 2010 Languages: أنجليزي إلى عربي",
            "الترجمة التحريرية حجم: 0days تمت Nov 2009 Languages: أنجليزي إلى عربي",
            "الترجمة التحريرية حجم: 0days تمت Nov 2008 Languages: عربي إلى أنجليزي"
        ],
        [
            "موجز المشروع",
            "4640 words (agriculture) الزراعة",
            "3037 words (Tourism) السياحة والسفر",
            "15.000 words (Education/Um Al-Quran University website)) التربية والتعليم \\ علم أصول التدريس"
        ],
        [
            "تأكيدات",
            "إيجابي Lingua Franca: I want to thank Muhammad for his perfectionism, kind and easy communication and simply perfect translation of a tricky project. Thank you Muhammad.",
            "لا تعليق",
            "لا تعليق"
        ]
    ],
    "pageTitle": "Mohamed A. Moustafa - أنجليزي إلى عربي مترجم. خدمات الترجمة في عام \\ محادثات \\ تحيات \\ خطابات - Arabic, software localization, website localization, education, consumer, human rights, political science, IT, media, health, literature, parenting, journalism, business, legal, islamic studies, academic papers, book reviews, history, cultures, official documents, personal documents, product details, technical specifications, construction, urban development, travel industry, hotels, resorts, jihad, islam, fatwa, sharia, scholarly, documentary, financial, legal, websites, machine, creative, transcript, diploma, certificate, quran, sunnah, fiqh, seerah, sirah, aqeedah, aqidah, translation, editing, proofreading, teaching, training, mentoring, translator, editor, proofreader, professional translator, accurate translation, precise, detail-oriented, punctual, islamweb, islamway, islamonline, islam story, acting and directing, advertising, agriculture, agronomy and crop science, aircraft, animal sciences, anthropology, aquaculture, archaeology, architecture, art, aviation, banking and financial, bible and biblical studies, biostatistics, biotechnology, botany, broadcast journalism, buildings, business general, business marketing, ceramics arts and ceramics, child care, civil engineering, computer and information sciences, criminology, culinary arts, data communications, data processing, design and applied arts, ecology, education, entomology, environmental science, ethnic and cultural studies, fibre, textile and weaving, finance, fire protection, fishing and fisheries sciences, food sciences, forestry, general, geology, health, heating, air condition and refrigeration, history, hospitality, humanities and humanistic studies, information sciences and systems, internet, islamic studies, journalism and mass communication, literature, medicine, nursing, medicine, psychiatry, medicine, public health education and promotion, medicine — social psychology, medicine (general), military technologies, patent translation, philosophy, photography, political science, psychology, religion, religion and religious studies, sociology, sport and fitness, taxation, telecommunications, textile sciences and engineering, theology and theological studies, tourism and travel, transportation, veterinary, women studies, immigration, medication, medicare, physical education, skype, hotmail, yahoo, google, bing, orbit, downloader, applications, faculty of languages and translation, translation agency, translation office, wordweb, onelook, windows vista, wordfast classic, wordfast pro, court, teaching fellow, teaching assistant, reliable, fast, quick, good rate, kudos, points, facebook, dedicated, committed, manual, brochures, document, image, scanned, faxed, emailed, webpage, homepage, orientalism, occidentalism, literary criticism, cultural adaptation, classical Arabic, modern standard Arabic, colloquial Arabic, everyday Arabic, MSA, Egypt, Sudan, Libya, Algeria, Tunisia, Morocco, Saudi Arabia, Iraq, Syria, Palestine, Jordan, United Arab Emirates, Bahrain, Kuwait, Yemen, Qatar, Oman, Russia, USA, UK, Spain, MS Word, MS Excel, MS Powerpoint, ASP, DOC, DOCX, HTM, HTML, INX, JSP, MIF, PDF, PPT, RTF, TTX, TXLT, TXML, TXT, XLS, XLSX, properties files, watching america, proz, translators cafe, Arab professional translators society, golbtra.",
    "title": "",
    "url": "http://ara.proz.com/translator/860995",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 10835579,
    "recordOffset": 10795241,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "3 المشاريع المُدْخَله    1 رأيٌ إيجابي من المتعاقدين الخارجيين سجل المشاريع الماضية نقاط مستوى المحترفين: 529, الأسئلة المُجابة: 333, الأسئلة المطروحة: 75 أنشطة كدوز (PRO) USD العملة المفضلة Less More التغذية العلوم العسكرية \\ الدفاع الطب: الرعاية الصحية القانون: براءات الاختراع، العلامات التجارية، حقوق الملكية تكنولوجيا المعلومات الأعمال\\التجارة عموما يعمل أيضاً في:",
    "textAfterTable": "More Less Payment methods accepted حوالة مصرفية, حوالة مالية, فيزا, Skrill, شيك, باي بال حافظة نماذج من النصوص المُترجمة: 6 أنجليزي إلى عربي: IT Detailed field: تكنولوجيا المعلومات لغة نص المصدر - أنجليزي Increased use of mobile phones to access the Internet has created a need to adapt the way in which broadband connectivity is measured. Since 2000, the OECD has collected and reported broadband data to capture and record significant changes in the markets for Internet access. While some wireless broadband technologies (such as fixed wireless and satellite) were included from the outset, they have accounted for only a small percentage of total connections. In fact, even as of December 2008, less than 2 per cent of all reported broadband subscriptions were wireless. Due to speed limitations and difficulties determining actual use, however, Internet-enabled mobile phones were not included in the OECD broadband statistics. In recent years, however, telecom operators have invested large amounts in the upgrading of mobile networks (such as HSDPA, CDMA2000 upgrades and WiMAX) to allow for higher speed connectivity. This has made",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}