{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security guards from law enforcement program on campus.",
            "none",
            "disc design etc.",
            "Non-traditional students, students who work (i.e. online classes)",
            "Not really sure.",
            "I am a non-traditional student who turned his life around and is on track to graduate in Spring '14.",
            "Our football team is consistently at the top of there conference. There is open gym at the regional sports center on campus, disc golf club, design club, and a whole lot more!",
            "There is the student cafeteria on the third floor, it comes in handy. The layout of it is very relaxing, conducive for a good study place.",
            "No dorms.",
            "I love my classes, they are challenging but i have learned a lot.",
            "Enroll early so you get a seat in the classes you want to take! Use the Learning Center!",
            "I like this school because the classes are small and your instructors are available. I like this school because of the Learning Center, where you can get help from math coaches and for your other classes as well. I like all the computer labs here, too."
        ]
    ],
    "pageTitle": "Rochester Community and Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rochester-Community-and-Technical-College/reviews?_escaped_fragment_=/show/3175",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891950031,
    "recordOffset": 891906951,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{158293=There are many clubs and activities. Some of which are, Student Senate, Lions Roar, Yellow Jackets, Women's Volleyball Team, Football Team. These clubs can also serves as a time off school and a time to forget about the stress due to works of school load. I became a member of the Student Senate on the 24th of September 2013; i have learned about Students Health Insurance status at our school and more. Such clubs gives you the opportunity to know inside issues that go on behind the scenes in your school., 159340=The hallway outside the book store. I named this hallway rock and roll Jazz. Every time you walk through this hallway music turns on and accompany you until you exit. Apart from this unusual location on campus, I would like to acknowledge the our Trio special basket of quotes. This basket is full of strips of papers of quotes, Every morning i walk into the office just to pick my quote of the day hoping for a new and invigorating inspiration. These pieces of paper may seem ordinary, but the words written on them have made a difference in every hour i spend at Rochester Community College. For example last Friday the 27th 2013, i picked a piece of paper that read live today with harmony; throughout the day i contemplated on these words no matter the circumstances to live the day in peace and harmony instead of stress., 106165=The academic Rigor in Rochester Community College is by pushing yourself beyond what is easy. We have a study place in school called the learning center, were students go to do their homework's and tutors are there for any questions. People who go to the learning center get good grades more than students who don't go there at all. I was never good in Math. With the help of the learning center of RCTC, I was able to get a Chemistry tutor and ended up doing well in the class with 88.9% in the class. I was nervous going through the class but I never gave up. My academic performance had improved immensely, I manage to be on the Dean List of RCTC of fall 2011., 212565=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 2 people found this review useful. 1 of 51 lauren from Rochester, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "rctc is a great place to go. it is cheaper than the 4 year schools and you can get the generals done a little cheaper. What to do for fun just hanging out is pretty fun. college sports are an awesome thing to do for fun. playing x-box is always an option. Food and Dining live with in your budget. eat healthy and make good choices. learn how to cook before you get to college. Dorm Life hang out with people that make smart choices and have goals. respect other people and their stuff. enjoy the togetherness. Academic Rigor go to class. get to know your teachers. don't be afraid to ask for help if you think you need it. Tips for prospective students have a goal. stay on top of your classes. enjoy your new adventure. In three sentences i love it at rctc! the classes are awesome. i have met so many awesome new friends since i started school. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}