{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "A total pain sometimes but they do their job well and if you call them they'll escort you back to the dorm at night (so you don't have to worry).",
            "Tons of clubs that like to have fun!",
            "In between Buller and Harrigan is a little swing (like a porch swing).",
            "I'm getting a really good price, but if you aren't set up for good scholarships or subsidy, I'd look elsewhere. Pretty expensive.",
            "You're close to Notre Dame and pretty close to Chicago as well. There isn't a lot to do in the immediate area, but if you go 20 minutes away there's lots.",
            "The food is good, but they're so worried about making it organic/healthy that they charge you $8.25 for lunch and dinner.",
            "Curfews, required dorm living, and worship requirements can be really annoying but the deans are always there to listen.",
            "It's not the most difficult college you could go to, but the professors do expect you to think, something many high school teachers don't really want.",
            "I went to a high school that was focused on preparing you for college. I did very well on my ACT/SAT and transitioning to Andrews wasn't very difficult, but it is a transition. Be flexible when you first get here. I spent my entire freshman year working and studying, so I didn't have many friends. Don't do that! Don't worry so much that you miss out on the relationships. They matter too.",
            "Andrews has been great for me academically. It is the only Adventist university in the top 200 and it was also given a most underrated college award. It's a good school and the faculty is always willing to help you understand a subject better."
        ]
    ],
    "pageTitle": "Andrews University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Andrews-University/reviews?_escaped_fragment_=/show/608",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890370987,
    "recordOffset": 890331949,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134801=© 2015, Cappex.com, LLC, 122728=Almost Anything Goes. Every year in September the classes battle each other for a trophy.}",
    "textBeforeTable": "12/26/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 31 Danika from Hamburg, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Alana from Maplewood, MN 01/06/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 31 Categories Comments Great for these types of students Andrews is great for those who are looking for a very diverse college. It is a good school for those who have a major within communication. And it is also a good school for those that want to strengthen their relationship with God. Tips for prospective students It is a good idea to get involved in something on campus; it can be a club, sports team, or an outreach ministry. It is good to get involved because it gives you something constructive to do when you're not studying, and it is a good way to make friends. I also recommend that new students apply for jobs on campus, especially jobs within their major. That way they are gaining some experience and networking at the same time. If you are shy, really push yourself to branch out and meet new people. If you are a really dedicated student, that's great, but make sure that you make some time",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}