{
    "relation": [
        [
            "Patent application number",
            "20120025961",
            "20120081914"
        ],
        [
            "Description",
            "SADDLE RIDING VEHICLE - A saddle riding vehicle includes a storage box and an anti-theft system. The storage box is openable in a vehicle horizontal direction. The anti-theft system is configured to measure position information on the vehicle and to send the position information via radio, the anti-theft system being attached to an undersurface of a ceiling of the storage box. Preferably, the anti-theft system is rotatably attached to the undersurface of the ceiling of the storage box by a hinge and the anti-theft system is attached to the tray member.",
            "WIRING STRUCTURE OF REAR COMBINATION LIGHT - A wiring structure of a rear combination light of a vehicle includes a light-side wire, a vehicle-body-side wire holding portion, a stay, a light-side wire holding portion and a wire coupler. The vehicle-body-side wire holding portion is mounted on a rear surface of the vehicle body to hold an intermediate portion of a vehicle-body-side wire. The light-side wire holding portion is mounted on the stay to hold an intermediate portion of the light-side wire on a distal end portion of the stay. The wire coupler is arranged between the rear surface of the vehicle body and a back surface of the rear combination light. The light-side wire is connected to the vehicle-body-side wire via the wire coupler in a state where the rear combination light is mounted on the rear portion of the vehicle body."
        ],
        [
            "Published",
            "02-02-2012",
            "04-05-2012"
        ]
    ],
    "pageTitle": "Hojo, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hojo-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428223027,
    "recordOffset": 428197788,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masayuki Hojo, Wako JP 10-03-2013 Silicone Resin Container - A container made of silicone resin is sufficiently compactable in a collapsed state. The container includes a tubular barrel portion, a bottom portion having a flat surface, a mouth portion having an opening, and a lid portion sealing the opening of the mouth portion, with at least the barrel portion and the bottom portion formed by molding. One end of a binder is attached to the mouth portion and can hold the rolled-up barrel portion and the bottom portion. 20130256310 Published Description Patent application number Masaru Hojo, Tokyo JP 01-22-2009 Delamination development preventable structure for sandwich panel - A delamination development preventable structure is provided to prevent the development of delamination in a sandwich panel including a core and surface plates attached to the opposite surfaces of the core with respect to the thickness of the core. 20090022935 Published Description Patent application number Masaki Hojo, Kyoto-Shi JP 12-27-2012 SIGNAL PROCESSING DEVICE AND MOVING IMAGE CAPTURING DEVICE - A frame skipping process suited to a scene is achieved by providing an encoder which encodes input image data, an encoding determination unit which compares image movement information with a threshold to determine whether or not encoding is to be performed, a frame skipping controller which performs a frame skipping control if encoding is not to be performed,",
    "textAfterTable": "Masayuki Hojo, Saitama JP Patent application number Description Published 20090242312 Combined heat shield and wire-holding structure for a saddle-type vehicle - A combined heat shield and wire-holding structure for a saddle-type vehicle, where the vehicle includes a pair of right and left frame sections extending in a vehicle longitudinal direction, and a fuel tank disposed above the vehicle body frame sections. The combined heat shield and wire-holding structure comprises a heat shield, which is disposed below the fuel tank and which extends between the right and left body frame sections. The combined heat shield and wire-holding structure includes a wire-holding portion which extends in the vehicle longitudinal direction outside of the vehicle body frame, and the wire-holding portion holds a wiring harness routed through an inside portion of the vehicle. 10-01-2009 Miho Hojo, Osaka-Shi JP Patent application number Description Published 20120103020 APPARATUS FOR REFINING SILICON AND METHOD FOR REFINING SILICON - The present invention is a silicon refining apparatus including, in a reduced pressure vessel: a crucible capable of holding molten silicon; a heat-retaining lid capable of being placed over the crucible; and a heating device. The crucible has a lateral outer-circumferential portion provided with a first thermal-insulation material. The heat-retaining lid is a plate-like member made of carbon felt and provided with a carbon composite material at least on opposed main surfaces. The heat-retaining lid has opposed main surfaces",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}