{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have great public safety.",
            "Simmons is one big sorority",
            "I have kept myself busy with several different clubs ; like minds, the Body Project, Alliance and Hall counsel",
            "Students who are interested in Nursing the Sciences, Communication and Women and Gender Studies.",
            "Right by the Fenway, lots of attractions near Simmons and things to do in the city.",
            "It is expensive but you learn so much just being in the environment.",
            "The campus is filled with opportunities and the city is your playground.",
            "Good food for a cafeteria",
            "There are lots of things to get involved with on campus, everyone can find their niche.",
            "It's challenging but my classes were all relatively reasonable and the faculty want to help students.",
            "Do not be afraid of the women's college aspect, great women thrive at Simmons College.",
            "Simmons college is a great school. Simmons has provided several networking opportunities for its students. The transition into my first year of college was smooth because of how helpful, welcoming and inclusive Simmons is."
        ]
    ],
    "pageTitle": "Simmons College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Simmons-College/reviews?_escaped_fragment_=/show/24145",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906787687,
    "recordOffset": 906738344,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{178657=We have a harvest dinner in the fall, and a winter wonderland dinner at the end of fall semester which is catered and has a theme. In the spring semester we have a formal and May Day at the very end of the year., 147740=Every Spring Semester there is the Carnival held on the Res Campus. In March, Vagina Monologues is performed-AMAZING! Winter there is the Winter Wonderland theme, the dorms are lit up with winter lights. And at the end of the semester one night the dining hall has a themed event opened til 12pm., 217368=© 2015, Cappex.com, LLC, 141053=Public safety is pretty bomb. There is always someone on the residence campus. After 10:30, all the gates get closed except for the one by Simmons Hall. You tap into the buildings with your ID card. I have never had a problem with safety. (But remember to lock your doors).}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 46 Anne from Philadelphia Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "Login to rate or flag the reviews Katrina from East Dennis, MA 07/06/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 46 Categories Comments Great for these types of students Simmons is great for a person who is looking for a small liberal arts college that provides a great amount for their students. Tips for prospective students Go on campus and take a tour or even spend the night with a current Simmons student to get the feel of the school. Am enjoying being here Simmons College is in the perfect location because it is in a city without feeling as though it is in a city. There are tons of opportunities to expand oneself at Simmons. Am learning a lot All of my classes have been instructed by extremely knowledgeable professors and they are always available for outside questions.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}