{
    "relation": [
        [
            "Patent application number",
            "20090247429",
            "20090247432",
            "20110207633",
            "20120028855",
            "20120220807"
        ],
        [
            "Description",
            "SHALE HYDRATION INHIBITION AGENT(S) AND METHOD OF USE - A water-based drilling fluid and method of using same are presented in this disclosure, which fluid is used in drilling wells through a formation containing a shale that swells in the presence of water. The drilling fluid comprises an aqueous based continuous phase; a weighting material; and a shale hydration inhibition agent (SHIA) selected from the group consisting of propylamine derivatives, hydrogenated poly(propyleneimine) dendrimers (HPPID), and polyamine twin dendrimers (PTD). In some embodiments, the SHIA of this disclosure is not hydrolyzed at a temperature in the range of from about 100° F. to about 500° F. The drilling fluid may further comprise a fluid loss control agent, an encapsulating agent, other additives, and combinations thereof. A method of reducing shale swelling during wellbore drilling is also described. The method comprises circulating in the subterranean well a water-based drilling fluid comprising an aqueous based continuous phase, a weighting material, and a SHIA.",
            "DEEP EUTECTIC SOLVENTS AND APPLICATIONS - A method of solubilizing/removing cellulose or chemically-modified cellulosic polymers utilized in subterranean drilling operations such as fracturing. The method involves introducing a deep eutectic solvent (DES) into a subterranean region. Deep eutectic solvents useful as cellulose solvents include quaternary ammonium compounds, including choline chloride and chlorcholine chloride, reacted with a compound selected from amides, amines, carboxylic acids alcohols, and metal halides. The DES material can be pumped downhole after fracturing operations to remove cellulosic material used, for example, to thicken fracturing fluid which is left behind in the created fractures, on the face of the formation, along the wellbore, or elsewhere within the subterranean region. The DES can be used alone or in a sequential treatment protocol, whereby the DES is introduced into the subterranean region, followed by post-treatment introduction of water, caustic, acid or anhydride into the subterranean as a flush.",
            "DEEP EUTECTIC SOLVENTS AND APPLICATIONS - A method of solubilizing/removing cellulose or chemically-modified cellulosic polymers utilized in subterranean drilling operations such as fracturing. The method involves introducing a deep eutectic solvent (DES) into a subterranean region. Deep eutectic solvents useful as cellulose solvents include quaternary ammonium compounds, including choline chloride and chlorcholine chloride, reacted with a compound selected from amides, amines, carboxylic acids alcohols, and metal halides. The DES material can be pumped downhole after fracturing operations to remove cellulosic material used, for example, to thicken fracturing fluid which is left behind in the created fractures, on the face of the formation, along the wellbore, or elsewhere within the subterranean region. The DES can be used alone or in a sequential treatment protocol, whereby the DES is introduced into the subterranean region, followed by post-treatment introduction of water, caustic, acid or anhydride into the subterranean as a flush.",
            "SHALE HYDRATION INHIBITION AGENT(S) AND METHOD OF USE - A method of using water-based drilling fluid in a subterranean formation containing shale which swells in the presence of water by circulating a water-based drilling fluid into the formation. The drilling fluid is made of an aqueous based continuous phase, a weighting material, and a shale hydration inhibition agent (SHIA) comprising deep eutectic solvents (DES) formed by the reaction of a first compound comprising an ammonium compound, and a second compound comprising at least one of amides, amines, diamines, cyclic amines, cyclic diamines, and combinations thereof. The SHIA is present in an amount sufficient to reduce shale swelling. A method of reducing shale swelling during wellbore drilling that includes providing a water-based drilling fluid comprising an aqueous based continuous phase, a weighting material, and a SHIA comprising DES formed by the reaction of a quaternary ammonium compound, and a diamine; and circulating the drilling fluid into the subterranean formation.",
            "a-OLEFIN / VINYL PYRROLIDINONE COPOLYMERS AS ASPHALTENE DISPERSANTS - An additive comprising, dissolved in a solvent, an asphaltene dispersant selected from the group consisting of α-olefin/vinyl pyrrolidinone copolymers. The copolymer can comprise at least one α-olefin selected from the group consisting of mono-α-olefins, at least one α-olefin selected from the group consisting of linear α-olefins and/or at least one α-olefin is selected from the group consisting of 1-hexadecene, 1-octadecene, 1-eicosene, 1-docosene, 1-tetracosene, 1-hexacosene, 1-octacosene and 1-triacontene. The additive can comprise a copolymer of 2-pyrrolidinone, 1-ethenyl monomer. The copolymer can have a Hansen Solubility Parameter (HSP), δ, of greater than 16, 17 or 18 MPa"
        ],
        [
            "Published",
            "10-01-2009",
            "10-01-2009",
            "08-25-2011",
            "02-02-2012",
            "08-30-2012"
        ]
    ],
    "pageTitle": "Richard F. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/richard-f-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428256819,
    "recordOffset": 428223756,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Richard F. Miller, Humble, TX US 04-21-2011 ION IMPLANTER WITH VARIABLE APERTURE AND ION IMPLANT METHOD THEREOF - An ion implanter and an ion implant method are disclosed. The ion implanter has an aperture assembly with a variable aperture and is located between an ion source of an ion beam and a holder for holding a wafer. At least one of the size and the shape of the variable aperture is adjustable. The ion beam may be flexibly shaped by the variable aperture, so that the practical implantation on the wafer can be controllably adjusted without modifying an operation of both the ion source and mass analyzer or applying a magnetic field to modify the ion beam. An example of the aperture assembly has two plates, each having an opening formed on its edge such that a variable aperture is formed by a combination of these openings. By respectively moving the plates, the size and the shape of the variable aperture can be changed. 20110089334 03-12-2009 Compound sliding seal unit suitable for atmosphere to vacuum applications - The present invention is a compound sliding seal unit of markedly reduced size and height dimensions which is employed as a discrete assembly for both the passage across and the at-will height adjustment of a mounted, rotatable shaft which extends from the atmospheric environment portion into the vacuum environmental portion of an ion implanter apparatus. The extended, rotatable shaft is typically fashioned as either a rotatable",
    "textAfterTable": "Patent applications by Richard F. Miller, Humble, TX US Richard F. Mithen, Norwich GB Patent application number Description Published 20140075590 BRASSICA OLERACEA PLANTS WITH IMPROVED NUTRITIONAL VALUE - The invention provides compositions and methods relating to the elevation of glucoraphanin compared to standard 03-13-2014 20140189905 GENETIC MARKERS FOR Myb28 - The present invention relates to a method for determining the genotype of a Cruciferous vegetable plant for a plant with an increased glucosinolate level, comprising obtaining a sample of nucleic acids from said plant or a portion thereof and detecting in said nucleic acids a polymorphism at the Myb28 locus that is genetically linked to an increased glucosinolate level. The polymorphism may comprises at least one of: a) a single nucleotide polymorphism (SNP) at a position corresponding to nucleotide 83, 136, 226, 563, 610, 830, 995, 1116, 1513, 1577, 1606, 1620, 1825, 1863, 1877 or 2026 of SEQ ID NO: 1, or b) a polymorphism in the number of nucleotides present between nucleotides 323 and 332, between nucleotides 521 and 524, between nucleotides 783 and 786, between nucleotides and 909 and 914, between nucleotides 1365 and 1369, between 1811 and 1821, or between nucleotides 2046",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}