{
    "relation": [
        [
            "Name",
            "Kilkuyruk",
            "Kılkuyruk"
        ],
        [
            "Sources",
            "World Register of Marine Species (WoRMS)",
            "World Register of Marine Species (WoRMS)"
        ],
        [
            "Status",
            "Trusted",
            "Trusted"
        ]
    ],
    "pageTitle": "Common Names for Northern Pintail (Anas acuta) - Encyclopedia of Life",
    "title": "",
    "url": "http://www.eol.org/pages/1048943/names/common_names",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421506764,
    "recordOffset": 421491101,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "English marks the preferred name for each language. Common names listed by language 4 synonyms 84 common names 2 related names 9 classifications Many people know organisms only by the common names, or \"vernacular\" names. Unlike scientific names, common names are almost always different for speakers of different languages. They may also vary regionally within a language. This tab shows all the common names provided to EOL for this organism from a variety of providers, including EOL curators. Currently we can only set one preferred common name per language on a given EOL page, but all the names should be searchable. Updates Literature Resources Community Names 11 Maps 521 Media Data Detail Overview Add to a collection Northern Pintail learn more about names for this taxon Anas acuta &mdash; Common names",
    "textAfterTable": "Common Pintail NCBI Taxonomy, uBio Trusted gray duck uBio Unknown kite-tail uBio Unknown Northern Pintail Anage Data, Animal Diversity Web Descriptions, BibAlex LifeDesk, BioKIDS Critter Catalog, Birds of DC Brief Summary Database, IUCN Red List, Integrated Taxonomic Information System (ITIS), JELA All Categories Full Species List January 2013, Katja Schulz, NCBI Taxonomy, NatureServe resource, Phthiraptera, PlanetScott.com images, South African Vertebrates, Species 2000 & ITIS Catalogue of Life: April 2013, Taxonomic Hierarchy of COL-China 2012, World Register of Marine Species (WoRMS), uBio Trusted peak-tail uBio Unknown pheasannt duck uBio Unknown picket-tail uBio Unknown pied gray duck uBio Unknown pied wigeon uBio Unknown pigeon-tail uBio Unknown Pintail BibAlex LifeDesk, IUCN Red List, NCBI Taxonomy, South African Vertebrates, Taxonomic Hierarchy of COL-China 2012, Taxonomic Hierarchy of COL-China 2012 Lei Aves, World Register of Marine Species (WoRMS), uBio Trusted sea-pheasant uBio Unknown sharp-tail uBio Unknown spike-tail",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}