{
    "relation": [
        [
            "",
            "",
            "TOTAL VENITURI",
            "Curente",
            "A. Taxe",
            "A1. Taxe directe",
            "Taxa pe profit",
            "Taxa pe salarii",
            "Contributii la asigurarile sociale",
            "Altele",
            "A2.Taxe indirecte",
            "din care:",
            "Accize si taxe pe titei",
            "T.V.A.",
            "Taxe vamale",
            "Altele",
            "B. Venituri nefiscale",
            "Capital",
            "Altele",
            "TOTAL CHELTUIELI",
            "Curente",
            "Bunuri si servicii",
            "din care:",
            "Salarii",
            "Dobanzi la datoria publica",
            "Subventii si transferuri",
            "Subventii",
            "Transferuri",
            "Capital",
            "Imprumuturi minus rambursari"
        ],
        [
            "Medie",
            "1990-1991",
            "40.8",
            "39.2",
            "34.3",
            "23.2",
            "6.1",
            "7.2",
            "8.9",
            "1.0",
            "11.2",
            "",
            "10.0",
            "0.0",
            "0.6",
            "0.5",
            "4.8",
            "1.6",
            "0.0",
            "38.7",
            "31.8",
            "12.9",
            "",
            "7.4",
            "0.0",
            "20.7",
            "10.0",
            "10.7",
            "6.9",
            "0.0"
        ],
        [
            "Medie",
            "1992-1996",
            "33.1",
            "32.8",
            "29.7",
            "20.9",
            "4.0",
            "6.6",
            "8.6",
            "1.6",
            "8.9",
            "",
            "3.0",
            "3.7",
            "1.4",
            "0.9",
            "3.1",
            "0.3",
            "0.0",
            "35.7",
            "30.2",
            "12.6",
            "",
            "6.7",
            "1.1",
            "18.8",
            "8.7",
            "10.1",
            "4.9",
            "0.5"
        ],
        [
            "Modificare",
            "",
            "-7.8",
            "-6.4",
            "-4.6",
            "-2.3",
            "-2.0",
            "-0.5",
            "-0.3",
            "0.6",
            "-2.3",
            "",
            "-7.0",
            "3.7",
            "0.7",
            "0.4",
            "-1.8",
            "-1.4",
            "0.0",
            "-3.0",
            "-1.5",
            "-0.4",
            "",
            "-0.7",
            "1.1",
            "-1.9",
            "-1.3",
            "-0.6",
            "-2.1",
            "0.5"
        ],
        [
            "Medie",
            "1997-1999",
            "36.0",
            "33.8",
            "31.8",
            "19.6",
            "3.8",
            "6.0",
            "8.8",
            "1.0",
            "12.3",
            "",
            "2.5",
            "6.2",
            "1.6",
            "1.9",
            "2.0",
            "2.1",
            "0.1",
            "39.5",
            "35.3",
            "13.3",
            "",
            "5.8",
            "5.0",
            "16.8",
            "2.4",
            "14.4",
            "3.7",
            "0.5"
        ],
        [
            "Modificare",
            "",
            "2.9",
            "1.0",
            "2.1",
            "-1.3",
            "-0.2",
            "-0.7",
            "0.2",
            "-0.6",
            "3.4",
            "",
            "-0.5",
            "2.5",
            "0.3",
            "1.1",
            "-1.1",
            "1.8",
            "0.1",
            "3.8",
            "5.1",
            "0.7",
            "",
            "-0.9",
            "3.9",
            "-2.0",
            "-6.3",
            "4.3",
            "-1.2",
            "0.0"
        ],
        [
            "Medie",
            "1990-1998",
            "34.7",
            "33.8",
            "30.6",
            "20.6",
            "4.4",
            "6.5",
            "8.5",
            "1.2",
            "10.0",
            "",
            "4.4",
            "3.3",
            "1.2",
            "1.1",
            "3.3",
            "0.9",
            "0.0",
            "36.5",
            "30.9",
            "12.5",
            "",
            "6.5",
            "1.6",
            "18.4",
            "7.5",
            "10.9",
            "5.2",
            "0.4"
        ]
    ],
    "pageTitle": "Analiza pertinenta asupra datoriei externe a Romaniei in perioada 1990-2003",
    "title": "",
    "url": "http://www.scrigroup.com/finante/Analiza-pertinenta-asupra-dato51742.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 710075039,
    "recordOffset": 710014885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{76814=41822,1, 127938=1042, 143426=1991, 152373=O tendinta similara a fost inregistrata in toate tarile in curs de dezvoltare unde gradul de indatorare exprimat prin ponderea datoriei externe in produsul national brut al acestora a sporit de la 20% in anul 1980, la 40% in anul 1999, 63739=Pentru Romania, evolutia ponderii datoriei externe in PIB a fost marcata de nivelul redus de indatorare de la care s-a pornit in momentul trecerii la economia de piata si de accesul, in anumite perioade relativ limitat, la resursele financiare internationale, datorita insuficientei atractivitatii a mediului autohton pentru investitorii straini. De mentionat este faptul ca investitiile straine directe s-au situat, pana in anul 1997, sub un miliard de dolari pe an, in timp ce investitiile de portofoliu au avut valori mult mai scazute. Accelerarea proceselor de privatizare a stimulat fluxul de capital care, doar in anul 1998, a depasit 2 miliarde de dolari, media perioadei 1997-2000 plasandu-se ceva peste 1 miliard de dolari., 30212=2983, 179231=1992, 38142=1996, 110511=2176,4, 134728=1994, 117304=2000, 24656=2271.9, 116324=1287, 198709=1997, 38485=1995, 258249= in perioada 1990-2003, 197133=2002, 119230=2201, 178920=1994, 204783=Dupa inscrierea in procesul de tranzitie, tarile din Europa centrala si estica au urmat singura cale de inlaturare a decalajelor mari, care le separau de tarile dezvoltate, si anume aceea a dezvoltarii economice si sociale. Dar pentru realizarea acestui obiectiv, tarile in dezvoltare nu au avut destule resurse financiare-valutare proprii, astfel au fost nevoite sa atraga capitaluri straine, sa contracteze imprumuturi de la banci, furnizori si de la alti creditori. Nevoia de finantare externa nu a fost satisfacuta de investitii straine directe (ISD), acestea concentrandu-se cu predilectie in tarile dezvoltate, accentuand si mai mult decalajele dintre tarile bogate si cele sarace. Astfel, datoriile externe, dupa 1989, au luat avant in tarile est europene., 137623=1993, 189983=Surse: autoritatile romane si estimarile FMI, 17 septembrie 2003, 128918=1996, 30806=2010, 178299=1998, 279597=          Referitor la prezent, Romania a incheiat acorduri de imprumut pe perioada 2003 \u0096 2007 care urmeaza a fi utilizate pentru finantarea investitiilor din domeniul SPIG astfel:, 24953=2152.5, 43979=In graficul dinamicii datoriei externe pe maturitati releva ritmul mult mai alert de acumulare al datoriei externe pe termen mediu si lung. Se observa ca in anul 1999, acestea au scazut datorita rascumpararii obligatiunilor EUROBOND si SAMURAI., 177679=2001, 34864=2319, 198394=1998, 24012=2375.1, 39173=1993, 26139=1265, 37799=1997, 25547=1848.4, 39859=1991, 30509=2370, 125041=1553,3, 55841= La nivelul anului 1998, insa, datoria externa a Romaniei atinsese deja peste 9 miliarde dolari, in vreme ce in celelalte tari (cu exceptia Cehiei, unde volumul datoriei a crescut de peste 5 ori) s-a inregistrat fie o crestere mult mai modesta (cum este cazul Ungariei, cu un spor de 5,5 miliarde dolari) fie un regres (in Polonia cu peste 6 miliarde dolari \u0096 partial si pe seama stergerii unei parti din datoria externa- in Bulgaria cu aproape un miliard de dolari). Probabil, una din cauzele performantelor slabe de ansamblu ale economiei romanesti, dupa 1989, a constituit-o si slaba experienta in ceea ce priveste managementul datoriei publice si a deficitelor bugetare, 50063=2.      Perioada  1997-2000 Rata medie anuala de crestere a datoriilor externe s-a redus la numai 0,5 miliarde dolari. Astfel datoria din 2000 a devansat cu doar 1,9 miliarde de dolari nivelul atins in anul 1996., 123118=1998, 142937=1006, 126017=1997, 61966=Romania, cu un volum al datoriei inferior celor mai multe tari Central Europene si nivelului de 60% din PIB prevazut in criteriile de convergenta, raspunde cerintelor din tratatul de la Maastrich privind datoria publica si are un grad de indatorare care se incadreaza in limite cotate ne-riscante. Totusi, ritmul rapid de acumulare a datoriei ridica semne de intrebare cu privire la sustenabilitatea acesteia si  a politicii fiscale. De altfel, analistii financiari interni si internationali si-au manifestat, inca din a doua parte a anului 1998, retinerile privind abilitatea guvernului de a gestiona acest volum pentru a face fata nivelului record de 3,5 miliarde dolari al serviciului datoriei externe in anul 1999. Imbinarea politicii fiscale cu cea monetara si valutara in cadrul unui program coerent de iesire din criza a permis Romaniei sa faca fata varfului datoriei desi posibilitatile de finantare a deficitelor de pe piata internationala de capital au fost mult limitate. Ritmul destul de inalt de acumulare a datoriei publice reflecta o combinatie ineficienta intre deficitul fiscal primar si auto-sustinerea datoriei. Pentru  Romania, ca si pentru celelalte tari Central si Est Europene, angajate in procesul de formare si consolidare a reformelor impuse de trecerea la economiile de piata (prin liberalizarea pietelor, a comertului si eliminarea in etape a controlului fluxurilor de capital), managementul datoriei externe este elementul cheie al deciziilor de politica fiscala in termenii schimburilor comerciale, a variabilitatii ratei dobanzii ca si a volatilitatii fluxurilor de capital., 111491=2002, 39518=1992, 252791= In prezenta lucrare, dupa explicarea conceptului de datorie publica externa din prisma legii 81/1999, am incercat sa aflam daca \u0093mica datorie\u0094 chiar este mica sau de fapt \u0093mica datorie\u0094 este ingrijorator de mare, avand in vedere repartitia ei si raportarea la principalii indicatori macroeconomici, dar si alti factori., 197449=2001, 25250=2037.8, 140522=1992, 46668=3.  Perioada 2000-2004 Dupa experienta din \u009299, Romania a fost vazuta mai bine de creditori, reusind sa obtina rating tara mai bun. Astfel in 2000, deschizandu-se pietele internationale, datoria externa si-a reluat trendul crescator, mai accentuat decat cel din perioada 90-96. Astfel, in 2003 datoria externa publica a ajuns la valoarea 9560,7 milioane dolari., 36770=2000, 48707=Ca urmare a crizei financiare din Rusia au fost amanate noi emisiuni externe de titluri de stat si s-a pus sub semnul intrebarii posibilitatea rostogolirii unei parti a datoriei externe in 1999.  Agentiile internationale au acordat rating de tara mai slab, aducand drept argumente inrautatirea indicatorilor de sustenabilitate a datoriei, diminuarea resurselor de acumulare, a ratelor de economisire si de investire. De asemenea, accesul la resursele internationale a fost drastic restrans. In aceste conditii, ritmul de acumulare a datoriei interne a crescut, ponderea acesteia in produsul intern brut dublandu-se in intervalul 1996-1999 (de la 5%, in anul 1996, la respectiv 10% in 1999). Din cauza volumului platilor scadente in 1999 (aproximativ 2,9 miliarde dolari), exista pericolul unei crize financiare si intrarii in incapacitate de plata. In 1999,  Romania a fost inclusa  in grupul tarilor ce urmau sa experimenteze noul concept de \u0094burden-sharing\u0094, care ar fi insemnat reesalonarea datoriei fata de creditorii privati. Acest lucru a fost evitat prin transformarea datoria externa in datorie interna., 151440=Rata serviciului datoriei externe brute in volumul exportului a inregistrat, pe intreaga perioada analizata, niveluri mult sub cel critic de 25%, exceptie fiind anul 1999 cand valoarea indicatorului s-a apropiat de aceasta limita, ramanand totusi cu circa 5 puncte procentuale mai scazuta. Explicatia  apropierii de limita critica deriva managementul defectuos al datoriei externe, care ar fi putut avea efecte negative pe termen lung, compensat partial de dinamica accentuata a exporturilor de bunuri si servicii care a avut un impact pozitiv asupra eforturilor de acoperire a serviciului datoriei externe., 179541=1990, 114398=2001, 177369=2002, 44505=         Sursa: Date din Rapoartele anuale si Buletinele lunare ale BNR; pentru anul  2001 date pentru 9 luni, 113418=1107, 201724=§         Multe dintre tarile dezvoltate au datorii externe mult mai mari decat noi, exemplu SUA a avut o datorie de 500 miliarde $ in 1992., 43294=Analiza dinamicii datoriei externe pe componente pune in evidenta cresterii ponderii datoriei garantata de stat, aceasta dublandu-se in intervalul 1992-2000 (de la 10% la respectiv, 21%), nivelul maxim, de peste 24%, fiind atins in anii 1995 si 1999. Contractarea de angajamente externe garantate public a reprezentat o treapta inevitabila pentru castigarea increderii pietei financiare internationale si crearea unor legaturi directe. Volumul acestor credite a sporit de peste 7 ori in intervalul 1992-2001 (de la 309 milioane de dolari in anul 1992 la 2240 milioane de dolari in anul 2000 si 2375 milioane de dolari la sfarsitul lunii septembrie 2001), asa cum rezulta din datele tabelului de mai jos. Expansiunea acestor angajamente a introdus insa elemente ale hazardului moral intrucat, prin garantarea lor de catre stat, au fost trecute, in fapt, eventualele pierderi sectorului public, in timp ce profiturile realizate au ramas private., 140033=2199,1, 35159=1027, 37456=1998, 108560=2003, 112929=11385, 198079=1999, 37113=1999, 54953=Dinamica datoriei Romaniei, ca pondere in PIB, evaluata in dolari si respectiv in lei, este redata in graficul de mai jos unde Dt este datoria totala, DE este datoria externa iar DI datoria interna denominate in dolari, respectiv in lei. Acumularea datoriei s-a realizat in perioada 1990-1996, in principal, pe seama celei externe (cu un varf in anul 1993, cand a reprezentat 90% din total), spre deosebire de tarile dezvoltate, unde situatia este inversa. Ca urmare, volumul total al datoriei externe si-a marit ponderea in produsul intern brut de la 4,6% la sfarsitul anului 1990 la circa 24% in anul 1992, la 31% in 1996 si la 34 %  in anul  2000., 131821=1995, 45730=In graficul de mai sus, primul trend reprezinta dinamica datoriei guvernamentale, al doilea dinamica datoriei brute public si public garantate, iar cel mai de sus evolutia datoriei brute externe a tarii. Diferenta dintre cele doua curbe de jos semnifica datoria bruta intreprinderilor publice, iar ecartul dintre curbele de sus reprezinta datoria privata. In plus, pe ansamblul perioadei, se observa o tendinta de crestere a celor doua ecarturi, ceea ce inseamna ca datoria externa privata creste mai repede decat cea publica.  Se observa din grafic scaderea tuturor tipuri de datorii in perioada de recesiune \u009297-\u009299, si relansarea lor dupa 2000., 51100=Datoria publica si public garantata  pe termen mediu si lung a fost dominanta (peste 70%, cu exceptia anilor 1990-1992) in structura datoriei externe in prima jumatate a intervalului analizat datorita amplificarii nevoii de finantare in conditiile agravarii dezechilibrelor economice, a insuficientei resurselor interne  si a procesului lent de constituire a proprietatii private. Anul 1995 marcheaza valoarea maxima a datoriei publice (circa 78%), dar si inscrierea ei pe o traiectorie continuu descendenta (pana la 67%, la sfarsitul anului 2000), justificata de modificarea mix-ului politicilor de macrostabilizare  economica si a mediului international dupa crizele financiare din Asia., 40202=1990, 184104=§         O problema grava pentru Romania este dublul deficit al tarii: deficitul imens al contului curent, ce a crescut la circa 4,8% din PIB in 2003, si pe de alta parte deficitul fiscal de 2,5% din PIB in acelasi an. Aceste deficite conduc la o cerere ingrijoratoare de capital strain pentru finantare, de vreme ce economiile sunt scazute si creditele private sunt ridicate., 196818=2003 proiectie, 122138=1558,8, 56895=Inca din primii ani de tranzitie, Romania a inceput sa acumuleze un volum apreciabil de datorie extrerna. Astfel, la nivelul anului 1990, in vreme ce Romania avea o datorie externa practic nesemnificativa (230 milioane dolari), celelalte tari se confruntau deja cu datorii de mai multe miliarde de dolari (Ungaria \u0096 21,3 milarde dolari, Bulgaria \u0096 10,9 miliarde dolari, Cehia \u0096 4,4 miliarde dolari), iar in cazul Poloniei chiar cu un volum de aproape 50 miliarde dolari., 24359=2242.1, 38828=1994, 178610=1996, 25844=1560.1, 51905=1.      Perioada 1990-1996 Viteza de acumulare a datoriilor a fost mare, rata medie anuala de crestere a datoriilor externe fiind in jur de 1,2 miliarde de dolari., 177989=2000, 146329=1990, 197764=2000, 105631=Raportul dintre serviciul datoriei externe si produsul intern brut s-a aflat in perioada 1990-2001 intr-un interval cuprins  intre 0,3 % - 7,4%, mult sub limita critica datorita perioadelor mari de gratie acordate in cadrul contractelor multilaterale sau bilaterale incheiate cu institutiile financiare internationale, precum si nivelurilor relativ reduse ale dobanzilor la creditele oficiale, ce au dominat structura datoriei externe a tarii in perioada 1990- 2001., 120210=1999, 36361=2001, 238522=·         sumele rezultate din recuperarea creantelor statului roman, definite prin Legea nr. 29/1994 privind autorizarea Guvernului de a aproba negocierea in vederea recuperarii creantelor Romaniei provenite din activitatea de comert exterior si cooperare economica internationala, derulata inainte de 31 decembrie 1989, dupa deducerea cheltuielilor cuvenite agentilor economici exportatori, stabilite pe baza cursului de 15 lei pentru un dolar S.U.A. si a cotei de 25% pentru stimularea exporturilor, definite conform Ordonantei Guvernului nr.14/1995 privind unele masuri pentru stimularea realizarii de obiective complexe si a productiei cu ciclu lung de fabricatie, destinate exportului, aprobata prin Legea nr. 70/1995;}",
    "TableContextTimeStampAfterTable": "{45913=1994, 45286=1991, 88005=1997, 234160=politice de orientari diferite (in cazul Romaniei, coalitia din guvernarea 1997-2000 a grupat de la social-democrati si socialisti pana la liberali si alte formatiuni de dreapta), deoarece  politica bugetara pierde din coerenta. Invers, sansele aplicarii unui management eficient al datoriei publice sunt cu mult mai mari in cazul unui singur partid politic aflat la putere (sau a unor coalitii mai restranse sau omogene, cazul guvernelor din 1992-1996 si 2000)., 46122=1995, 87632=1996, 22705=Deficitul de cont curent, reprezinta o alta destinatie a datoriei externe. In primii ani ai tranzitiei, deficitul era finantat in proportii mai mari prin plati compensatorii, generatoare de datorii. Din 1994 FMI a incetat sa mai fie principalul finantator, cedand locul in favoarea BIRD. S-a facut astfel trecerea de la finantarea de urgenta la finantarea pe proiecte; de la finantarea pentru acoperirea unui deficit de cont curent pe termen scurt, la finantarea pentru programe de ajustare structurala, pe termen mediu si lung., 15183=In 1997, Romania a exportat in UE marfuri in valoare de 4,7 miliarde $ si a importat de 5,9 miliarde, inregistrand un deficit al balantei comerciale bilaterale de 1,2 miliarde $; in primele sase luni al lui 1998 tara noastra a exportat in U.E. marfuri in valoare de 2,6 miliarde $ si a importat in valoare de 3,1 miliarde $, deficitul bilateral pe primele 6 luni ale anului 1998 fiind de 500 millioane $, estimandu-se pana la sfarsitul anului un deficit cel putin egal cu cel al anului anterior .Un alt aspect important de mentionat este acela ca ponderea cea mai mare in cadrul importurilor romanesti din cadrul U.E. o au Germania, Italia si Franta., 88378=1998, 1778=Medie1992-1996, 252292=Adauga cod HTML in site <a href=\"http://www.scrigroup.com/finante/Analiza-pertinenta-asupra-dato51742.php\" target=\"_blank\" title=\"Analiza pertinenta asupra datoriei externe a Romaniei in perioada 1990-2003 - http://www.scrigroup.com/finante/Analiza-pertinenta-asupra-dato51742.php\">Analiza pertinenta asupra datoriei externe a Romaniei in perioada 1990-2003</a>, 46749=2000, 66909=2568, 62519=1089, 71735=2350, 123906=Din tabelul de mai sus se poate observa evolutia oscilanta a defitului fiscal, atingand un maxim de 4.6% din PIB in anul 1992. In 2000 deficitul inregistreaza valoarea de 3.7% din PIB., 43620=Din graficul anterior se observa diferenta uriasa intre nivelul datoriei publice externe si cea a investitiilor straine. De asemenea se observa ca din 1997 ISD au inceput sa creasca, odata cu privatizarea a patru mari companii  din sectorul metalurgic si constructor de masini. In ciuda privatizarii accelerate din 1997, guvernul nu a reusit sa-si indeplineasca obiectivele. In 1997 planul de privatizare includea peste 2700 de companii, printre car 263 erau intreprinderi industriale mari. La sfarsitul anului,  numai jumatate au fost vandute., 229412=pentru perioada 1993-1998*, 57326=1925, 88751=1999, 130184=1997-1999, 219074=a) Structura cheltuielilor bugetare s-a modificat dupa 1989 astfel: investitiile publice au scazut (de la 17.6% din PIB in 1989 la 3.9% in 1993). Subventiile au crescut substantial imediat dupa tranzitie (de la 0.4 la 5.5% din PIB in 93)., 69320=1875, 62326=1467, 87259=1995, 54890=1157, 13724=Dupa o relativa scadere in perioada 1990-1992 atat exporturile cat si importurile s-au situat pe o traiectorie ascendenta depasind inca din anul 2000 valorile prognozate in strategia nationala de dezvoltare economica a Romaniei pe termen mediu., 72507=1977, 123589=Sursa: RCEP/WP no. 28/May 2001Daniel Daianu, 74717=22479, 16305=In acest sens, U.E. prin institutiile sale reprezentative precum Banca Centrala Europeana, Banca Europeana pentru Reconstructie si Dezvoltare, sau alte institutii financiare reprezentative, ar putea crea un ,,sistem colectiv de creditare\u0092\u0092 asemanator celui coordonat de FMI in criza din 1982, sistem care ar putea cuprinde bancile centrale ale Germaniei, Italiei si Frantei, precum si banci comerciale, din aceste tari, interesate in mod direct in sustinerea relatiilor comerciale ale clientilor lor cu Romania., 54482=1041, 235944=Dupa 2000, inflatia a avut o evolutie descendenta datorita interventiilor BNR., 51991=1002, 238041=            Problema deficitelor fiscale si a datoriei a devenit mai pregnanta mai ales dupa 1980 cand ponderea datoriilor au crescut mult in tarile industriale. Multi economisti au incercat sa raspunda la intrebari despre impactul deficitelor si al datoriei asupra economiei si sustenabilitatii unei viitoare expansiuni a politicii fiscale? Despre efectul datoriei publice s-a scris mult insa nu exista un consens in randul economistilor, 71542=1479, 233445=Miscarile politice au si ele un rol vizibil in evolutia datoriei externe. Dinamica datoriei totale din perioada 1990-2000 din tara noastra pare sa confirme prezenta unei corelatii destul de puternice intre omogenitatea coalitiilor aflate la putere si dinamica deficitelor. De regula, se constata  o amplificare a deficitelor in cazul unor coalitii formate dintr-un numar mare de formatiuni, 26068=Intrarile de Investitii Straine Directe cumulativ 1988-1999, 45495=1992, 85394=1990, 73751=2637, 47167=2002, 89123=2000, 2376=Medie 1997-2000, 45704=1993, 86140=1992, 62712=1561, 235046=Cursul de schimb si inflatia afecteaza marimea datoriei. Daca moneda nationala se depreciaza, adica devine mai ieftina in raport cu o moneda straina, atunci datoria in valuta devine mai scumpa. In timp de recesiune, intre inflatie si datorie  exista o relatie directa. Acest lucru se poate observa din graficul de mai jos: In anul 1997, cand datoria a inceput sa scada si inflatia a urmat acelasi trend., 71928=1144, 221627=            In 1998, produsul economiei oficiale reale a fost de 8.104 miliarde lei, in timp ce piata interna subterana a inregistrat 1.374 miliarde lei in valori actualizate. In acelasi an, nivelul importurilor in economia oficiala a fost de 2.371 miliarde lei, comparativ cu 2.653 miliarde, totalizand importurile subterane, sau cu 11,9% mai putin. Se estimeaza ca in 1998 activitatea economica subterana (piata interna si importurile) reprezinta 49% din economia oficiala si se afla in continua crestere., 46331=1998, 251996=Distribuie URL http://www.scrigroup.com/finante/Analiza-pertinenta-asupra-dato51742.php, 86513=1993, 128863=1990-1991, 72893=2440, 54686=1025, 86886=1994, 54278=2031, 71349=1462, 72700=1646, 55094=1106, 129306=1992-1996, 131062=1990-1998, 69127=1715, 57519=1579, 80962=\u0093Deficitul Cvasi-Fiscal s-a amplificat pe parcursul anului 2001, sub privirile blajine ale unui Guvern complice () Deficitul cvasi-fiscal (echivalentul \u0093varfului unui aisberg\u0094 ca si proportie \u0096 insa in acest caz \u0093sub apa\u0094) e greu de estimat cu acuratete, insa se afla la baza faptului ca Arieratele (\u0093aisbergul\u0094 in sine) s-au extins in 2001 de la 40% la un 45-50% din PIB \u0096 amenintand prin interzierile in platile dintre companii sa paralizeze intreaga economie !\u0085 \u0093 (Radu Limpede \u0096 aprilie 2002), 108367=Deficitul cvasi-fiscal a fluctuat in limite peste nivelul celui conventional, fiind finantat in cea mai mare masura prin emisiune monetara (Croitoru,1995). Pozitia guvernului de creditor net pentru sectorul financiar pe intregul interval 1991-1994 a contribuit la extinderea finantarii externe a deficitului sectorului public consolidat si la cresterea datoriei externe. Pe de alta parte, anul 1996 a marcat cel mai inalt nivel al deficitului cvasi-fis­cal care, pe baze cash a fost de 6,5 la suta, iar pe baze de angajamente de 8.4%   (OECD Economic Survey,1998)., 46540=1999, 14067=Ponderea exportului Romaniei in exportul mondial a inceput din 1993 sa creasca  ajungand la 0,16% in 1997,  pondere care se mentine in continuare., 248852=2.      \u0093Economie politica\u0094 Samuelson Nordhaus, Teora, 2000., 1201=Medie1990-1991, 60309=1865, 47376=Stocuri in 2002, 76075=In 1998-1999 Romania a fost aproape incapabila sa-si onoreze datoriile, datorita cresterii serviciului datoriei si faptului ca a nu a reusit sa aiba politici eficiente de transformare a intreprinderilor publice si de atragere a investitiilor straine, precum si de reducere a importului., 72314=2037, 248439=1.      \u0093Finante publice\u0094 Editia a IV-a, coordonator Iulian Vacarel, editura Didactica si Pedagogica, Bucuresti, 2003., 85767=1991, 46958=2001}",
    "textBeforeTable": "line-height:150%;mso-ansi-language:RO\">  Balanta de plati - miliarde dolari - Balanta de plati a Romaniei influenteaza datoria externa datorita deficitelor de comerciale si de cont curent. Dupa cum se vede in tabel, un procent foarte mare din datoria externa este utilizata pentru echilibrarea balantei. Lipsa de competitivitate a economiei se reflecta in nivelul scazut al exporturilor, insuficient pentru a plati importul, adica consumul, sau serviciul datoriei externe. Strategia recomandata de economisti pentru a suporta datoria externa, este ca   normal\"> 59,6 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 61,5 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 59,4 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 71,1 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 76,8 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; 84,2 mso-border-top-alt:solid windowtext .5pt;mso-border-left-alt:solid windowtext .5pt; none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt;",
    "textAfterTable": "none;border-bottom:solid windowtext 1.0pt;border-right:solid windowtext 1.0pt; mso-border-top-alt:solid windowtext .75pt;mso-border-left-alt:solid windowtext .75pt; mso-border-alt:solid windowtext .75pt;padding:0in 5.4pt 0in 5.4pt;height: 33.2pt\"> - 8.5 15.8 11.5 6.2 4.9 11.8 12.2 7.0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}