{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $21.70",
            "US $30.51",
            "US $53.79"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (UPS Ground)",
            "Expedited Shipping (UPS 3 Day SelectSM)",
            "Expedited Shipping (UPS 2nd Day Air®)",
            "Express Shipping (UPS Next Day Air Saver®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 4-5 business days",
            "Estimated within 3-4 business days",
            "Estimated within 2 business days"
        ]
    ],
    "pageTitle": "Prevue PET Products Penthouse Suites Crown TOP Bird Cage With Stand | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Prevue-Pet-Products-Penthouse-Suites-Crown-Top-Bird-Cage-with-Stand-/301039440905?pt=LH_DefaultDomain_0&hash=item4617595409",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410569323,
    "recordOffset": 410513381,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 112 items available. Please enter a number less than or equal to 112. -Select- Australia Austria Bahrain Belgium Brazil Bulgaria Canada Chile China Colombia Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominican Republic El Salvador Estonia Finland France Germany Greece Guatemala Honduras Hong Kong Hungary Indonesia Ireland Israel Italy Jamaica Japan Korea, South Kuwait Latvia Lithuania Malaysia Malta Mexico Netherlands New Zealand Norway Panama Philippines Poland Portugal Qatar Romania Russian Federation Saudi Arabia Singapore Slovakia Slovenia South Africa",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money Back The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}