{
    "relation": [
        [
            "",
            "Identity assurance for individuals",
            "",
            "Identity assurance for organisations and agents",
            "Standards",
            "Programme"
        ],
        [
            "April",
            "",
            "",
            "",
            "Transaction monitoring discovery complete",
            "Prior Information Notice [PIN] launched Market engagement event"
        ],
        [
            "May",
            "Verizon connect to the IDA hub",
            "Network connections migrate from Government Secure Intranet (GSi) to Public Service Network (PSN)",
            "Alpha complete",
            "",
            "£10m Cyber funding approval from HM Treasury"
        ],
        [
            "June",
            "View Driving Record connects to the IDA hub in private beta",
            "",
            "",
            "Publish Good Practice Guide 45 (Identity Proofing and Verification) v 2.3",
            ""
        ]
    ],
    "pageTitle": "GDS business plan April 2014 to March 2015 - GOV.UK",
    "title": "",
    "url": "https://www.gov.uk/government/publications/gds-business-plan-april-2014-to-march-2015/gds-business-plan-april-2014-to-march-2015",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903709295,
    "recordOffset": 903673635,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30284=This gives a total GDS budget of £58.345 million for financial year ending March 2015., 26158=The G-Cloud programme encourages use of cloud computing in the public sector and transforms the way IT services are bought. It benefits from the cost savings and flexibility of cloud computing. We estimate that G-Cloud will achieve savings of 50% for services bought through it. At the current rate of spending (£16 million per month), savings of around £200 million could be achieved in the financial year ending March 2015 by:, 4740=The Government Digital Service (GDS) is leading the digital transformation of government. GDS was set up following Martha Lane Fox’s report, Directgov 2010 and beyond: revolution not evolution, to make sure the government provides world-class digital services that meet people’s needs., 24803=At the exemplar level, benefits are shared almost equally between government and users – ie people and businesses. As the scope extends, benefits go mainly to government. By financial year ending March 2016 we estimate that the exemplars will have achieved about 70% of their potential benefits. These early benefits are influenced by certain benefits such as increasing tax collection and reducing EU fines., 69256=This table shows in which quarters services are planning to start using identity assurance in financial year ending March 2015., 25837=Publishing for all central government departments was moved over to GOV.UK in 2013. Agency and arm’s length bodies are following, and around 300 will be moved by December 2014. Assuming a 50% cost saving, this will achieve a 5 year saving of around £50 million., 156149=If the work plan remains constant, from June onwards, or when carrying vacancies, the team would be unable to work on new projects or more work without extra resources., 27165=G-Cloud has helped to grow the UK economy by creating new jobs. A survey carried out in May 2014 showed that 29 suppliers have created 356 new jobs as a result of work gained through G-Cloud., 67051=We will address this by talking to service providers about connecting useful data to the platform. The first cross government event is planned for 17 June 2014., 22280=GOV.UK has been live since early 2012, and gets over 1.5 million visits per day, saving at least £50 million per year., 2766=Published 4 July 2014, 22171=Twenty-five of government’s most important services will be digital by default by March 2015., 29334=At the last Spending Review it was agreed that the GDS budget would reduce from £21.1 million to £16.12 million between financial year ending March 2012 and the financial year ending March 2015., 78716=We will address this by making sure spending has been approved and a Head of Operations hired. We’re also hiring more staff, with new members of the operations team joining during 2014.}",
    "textBeforeTable": "April to June 2014 Milestones start a campaign to promote GOV.UK as the best place to find government services make sure that misleading websites mis-selling government services are minimised so that concerns about scamming and phishing don’t stop people using GOV.UK make sure that people who can’t use digital services have the help they need maximise use of government digital services so it reflects the proportion of UK adults that are online and able to use them work with public, private and voluntary sectors to help people go online, so that by April 2016, the number of people lacking basic digital capability is reduced by 25% publish a new G-Cloud supplier accreditation process that meets the new government security classifications publish guidance on the new marketplace increase awareness and use of the G-Cloud and Digital Services frameworks improve the G-Cloud and Digital Services frameworks build a new digital marketplace for the public sector to buy digital products and services find new ways to hire staff to make sure we get the best people quickly and easily help departments leave unsuitable IT contracts, improve technology departments, spend less, and get better value for money create a new Crown hosting service for non cloud hosting to provide IT systems and data centre services create a central architecture function, define open standards, and manage contracts improve technology in government through the technology leaders network help service providers move from Government Gateway to identity assurance by March",
    "textAfterTable": "Release 37 GOV.UK content dashboards on the Performance Platform Audited Savings published (financial year ending March 2014) Publish first iteration of Digital Inclusion scale Launch GDS user research lab Proposal to Civil Service Commission on new approach to permanent recruitment Government Digital Strategy - quarterly progress report G-Cloud 5 framework live Organisational design - discovery complete Publish GDS security policy Digital Marketplace - alpha G-Cloud Security process guidance - alpha release Annual staff performance assessments complete Publish cross government assisted digital user personas in the Service Design Manual Digital Marketplace Strategy - alpha release Review and report on final year end accounts Publish guidance on how to make sure services are built to help people go online Publish draft service complexity assessment for all 25 exemplars   E-petitions accreditation complete GOV.UK quarterly IT health check (ITHC)   Virgin migration - improve broadband capacity in Aviation House     Completed audit for year end savings   July to September 2014 July August September Prison Visit Bookings - live Land Registry - alpha complete Redundancy Payments - public beta View Driving Record - live HMRC will transition to GOV.UK PAYE for employees - public beta with IDA",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}