{
    "relation": [
        [
            "Attribute",
            "wavelength",
            "waveform"
        ],
        [
            "Example Value",
            "SensorCharacteristicContainer",
            "SensorCharacteristicContainer"
        ]
    ],
    "pageTitle": "GLAH09 Data Dictionary Template",
    "title": "",
    "url": "https://nsidc.org/data/docs/daac/glas_atmosphere/data-dictionary-glah09.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888033243,
    "recordOffset": 888005991,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{160715=Home | Contact Us © 2015, National Snow and Ice Data Center :: Advancing knowledge of Earth's frozen regions, 157910=Page last updated: 02/21/2013}",
    "textBeforeTable": "File-Level (Global) Attributes GLAH09 Product Data Dictionary Web pages Data Sets End Example Notices--> On Friday, 06 February 2015 from 8:00 a.m. to 5:00 p.m. (USA Mountain Time), we will be performing scheduled maintenance, which may cause temporary disruptions to our Web site, applications, and FTP. We apologize for any inconvenience this may cause you. On Thursday, 12 June 2014 from 3:00 p.m. to 4:00 p.m. (USA Mountain Time), our Web services will be unavailable due to NSIDC server maintenance. We apologize for any inconvenience this may cause you. The NSIDC Web site and data services are currently having intermittent problems and may be unavailable. We are working to restore these services as soon as possible and apologize for any inconvenience this may cause. Please contact NSIDC User Services for assistance. From 4:30 p.m. Wednesday, June 04 until noon Friday, June 06 (USA Mountain Time), our Web site will be unavailable due",
    "textAfterTable": "title GLAS/ICESat L2 Global Cloud Heights for Multi-layer Clouds (HDF5) comment The level 2 cloud layer height data with top and bottom heights, and ground heights are provided at a minimum of once per 4 seconds. Data granules will contain approximately 23 hours (14 orbits) of data. summary GLAH09 contains the cloud layer heights for researchers. Cloud layer height data consist of top and bottom heights for up to 10 layers below 20 km at 0.25 hz and 5 hz (40hz for below 4 km). Ground heights are provided at each resolution. Each GLAH09 file was created from an equivalent GLA09 binary file. The data used to create the GLAH09 values are contained in the equivalent GLAHxx files for the GLAxx files. See the provenance metadata for the creation of the GLA09. license http://nsidc.org/data/icesat/disclaimer.html references http://nsidc.org/data/docs/daac/glas_icesat_l1_l2_global_atmosphere.gd.html (Guide Document for this product at NSIDC), http://nsidc.org/daac/icesat/index.html (GLAS Product page at NSIDC) AccessConstraints Data may not be reproduced or distributed without including the CitationForExternalPublication for this product included in this Metadata. Data may not be distributed in an altered form without the written permission of the GLAS Science Team. CitationforExternalPublication The data used in this study were produced by the GLAS Science Team at the ICESat Science Investigator-led Processing System (I-SIPS) at NASA/GSFC. The data archive site is the NSIDC DAAC. contributor_role Data Originator, Investigator, Producer, Producer contributor_name David W. Hancock (David.W.Hancock@nasa.gov), Bob E Schutz (schutz@utcsr.ae.utexas.edu), Jay",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}