{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Have no fear Campus Saftey is there! Campus police is all around making sure people are safe.",
            "There is a wide variety of clubs and activities for all types of interests.",
            "Its a good school overall but wouldnt it be better if it was cheaper!",
            "Campus holds a lot fo activies. Recreational sports, swimming, watching tv in the lobbies with pool and more. There are the weekl parties if that's your style.",
            "Variety of food.",
            "Bring a variety of clothing. This was a strange winter. Comfortable shoes.",
            "Suny Oswego is a great School. The distance might be far and the weather not so certain but the people are quite friendly. The lake is a wonderful view and the teachers are so knowledgeable with a will to help."
        ]
    ],
    "pageTitle": "SUNY College at Oswego Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-College-at-Oswego/reviews?_escaped_fragment_=/show/18129",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900486339,
    "recordOffset": 900425802,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154804=SUNY Oswego is a great school with a great atmosphere. I am pursuing a dual major in meteorology and computer science. There is a nationally recognized meteorology program and in the fall of 2013 there will be a new state of the science complex for students to use., 246263=© 2015, Cappex.com, LLC, 193070=There seems to be millions of activities for students to do for fun at SUNY Oswego. There's sports teams, clubs & organizations, Greek life, academic clubs and so much more. Throughout the year, Oswego has activities such as May Day. At May Day there's rides to go on, lots of free food and obstacle courses. This is just one of the many fairs/fun days that goes at at Oswego annually., 239256=For the types of students who always like to study in the library there's a 24 hour room where you can literally stay all night and study if you want. Also for anyone who is really into science, Shineman which is our science building is practically brand new it opened in Fall of 2013 and its absolutely gorgeous in there., 125404=Bridge Street Run- which is a day where all the students on campus wear a white t-shirt and get together and go to bridge street and sign each others t-shirts. May Day Weekend- A weekend in May, well usually the end of April where there are a bunch of parties and events right before finals week. Whiteout- The biggest hockey game of the year where the hockey team plays a hockey game and everyone wears white to encourage the team., 160390=In addition to regular dining hall hours, Oswego has late night offered which runs from 8:30 to 11 and you can get any kind of food. Most of the dining halls are normal buffets but Mackin is a unique dining hall where you can order up to 6.75$ in food and they will make it for you. It is used as a meal on your plan. You can also order food from local restaurants online using your flex money on your id and they will deliver right to the dorms. I would suggest the unlimited meal plan.}",
    "textBeforeTable": "12/17/2009 Reviewer is A current student here. 16 out of 17 people found this review useful. 1 of 54 Sarah Check out reviews left by other students or leave your own review. You could win a free scholarship. SUNY College at Oswego Reviews SUNY College at Oswego › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students International students have a ball here. The campus is so diverse, it can make any type of student feel comfortable. Tips for prospective students The school is very secluded so try to make friends quick. Pick you're dorms wisely. Pack very deep. Bring lots of food. Always have a debit card ready for quick withdrawals. Most importantly, do not be intimidated by anyone. Everyone won't like you but the ones that do, stick with them. oh yeah STUDY very very hard. Am enjoying being here I've made a lot of friends by joining clubs and attending various events. The more you put yourself out there, the more people you will meet. Am learning a lot There are a lot of classes offered at Oswego. I learned a lot about subjects that were not even in my major's curriculum. Login to rate or flag the reviews Anonymous 01/13/2010 Reviewer is A current student here. 8 out of 9 people found this review useful.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}