{
    "relation": [
        [
            "Patent application number",
            "20100081018",
            "20100287012",
            "20110104578",
            "20120115062",
            "20120315565",
            "20130029245",
            "20140087286",
            "20140170516"
        ],
        [
            "Description",
            "Increasing thermal dissipation of fuel cell stacks under partial electrical load - A method of operating a high temperature fuel cell system containing a plurality of fuel cell stacks includes operating one or more of the plurality of fuel cell stacks at a first output power while operating another one or more of the plurality of the fuel cell stacks at a second output power different from the first output power.",
            "Method and system for measuring carbon dioxide reduction - A system and method is provided for managing energy data. The system includes a energy transformation device, a central energy data management system and a database containing carbon dioxide credit information. Managing the energy data includes measuring an amount of power produced or consumed by an energy transformation device, measuring an amount of carbon dioxide emitted, converted or sequestered by the energy transformation device, creating a dataset of the power produced or consumed and the amount of carbon dioxide emitted or sequestered, and transmitting the dataset and characteristic data to a central energy data management system. The method also includes, receiving energy measurements and characteristic data from an energy transformation device, obtaining carbon dioxide credit information and comparing the received energy measurements and the characteristic data with the received carbon dioxide credit information to obtain a carbon dioxide credit for the energy transformation device.",
            "SORFC System with Non-Noble Metal Electrode Compositions - A solid oxide regenerative fuel cell includes a ceramic electrolyte, a first electrode which is adapted to be positively biased when the fuel cell operates in a fuel cell mode and in an electrolysis mode, and a second electrode which is adapted to be negatively biased when the fuel cell operates in the fuel cell mode and in the electrolysis mode. The second electrode comprises less than 1 mg/cm",
            "FUEL CELL STACK COMPONENTS - An interconnect for a fuel cell stack includes a first set of gas flow channels in a first portion of the interconnect, and a second set of gas flow channels in second portion of the interconnect. The channels of the first set have a larger cross sectional area than the channels of the second set",
            "Fuel Cell Stack Components - An interconnect for a fuel cell stack includes a first set of gas flow channels in a first portion of the interconnect, and a second set of gas flow channels in second portion of the interconnect. The channels of the first set have a larger cross sectional area than the channels of the second set",
            "MEASUREMENT DEVICE FOR MEASURING VOLTAGES ALONG A LINEAR ARRAY OF VOLTAGE SOURCES - A measurement device for measuring voltages along a linear array of voltage sources, such as a fuel cell stack, includes at least one movable contact or non-contact voltage probe that measures a voltage of an array element.",
            "Systems and Methods for Bypassing Fuel Cells - Embodiment methods for bypassing a fuel cell in a fuel cell stack include identifying a fuel cell to bypass and connecting a conductive bypass to the fuel cell stack such that the bypass electrically connects a first interconnect in the fuel cell stack and a second interconnect in the fuel cell stack and electrically bypasses the identified fuel cell. Further embodiment methods include applying a conductive sealing material to the fuel cell stack such that the conductive sealing material seals a cathode inlet or outlet of the identified fuel cell and such that the conductive sealing material electrically bypasses the identified fuel cell.",
            "INCREASING THERMAL DISSIPATION OF FUEL CELL STACKS UNDER PARTIAL ELECTRICAL LOAD - A method of operating a high temperature fuel cell system containing a plurality of fuel cell stacks includes operating one or more of the plurality of fuel cell stacks at a first output power while operating another one or more of the plurality of the fuel cell stacks at a second output power different from the first output power."
        ],
        [
            "Published",
            "04-01-2010",
            "11-11-2010",
            "05-05-2011",
            "05-10-2012",
            "12-13-2012",
            "01-31-2013",
            "03-27-2014",
            "06-19-2014"
        ]
    ],
    "pageTitle": "Russell, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/russell-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433136239,
    "recordOffset": 433104115,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ian Russell, Sunnyvale, CA US 07-15-2010 COLLATERAL VALIDATION SYSTEM - The present invention is directed to a collateral validation system, and method providing an approach to automating valuation reconciliation. The collateral validation system is a fully automated validation of past and current valuations as well as allowing for forecasting future collateral values. It incorporates multiple independent opinions of value using a panel of experts approach employing multiple sub models along with housing price indices (HPIs), neighborhood level home price indices, premier data, external factors, analytics and predictive modeling, to enable a consensus approach, foreclosure trends, and external factors all user selectable and user weight adjustable for varying use configurations. As a result, a user may obtain a full and complete determination and validation of past and present value along with forecasted values coupled with statistical analyses in a fully customizable environment. 20100179911 Published Description Patent application number Heidi L. Russell, Oceanside, CA US //]]> BarDraw('2901422',['Patent applications by Gordon Russell, Redwood City, CA US'],[[2,1,2,1]],['2009','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2901422\" align=\"center\"></div> </div> <canvas id=\"bg2901422\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Gordon Russell, Redwood City, CA US</p> <div class=\"bar2901422\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-08-2012</td> <td><a href=\"/patents/app/20120279175\">ELECTROACTIVE POLYMER TRANSDUCERS</a> - Dielectric elastomer or electroactive polymer film transducers configured to minimize high electrical field gradients that can lead to partial discharge and corona.</td> <td>20120279175</td> <tr> </tr> <td>11-24-2011</td>",
    "textAfterTable": "Patent applications by Ian Russell, Sunnyvale, CA US J. Craig D. Russell, Playa Vista, CA US Patent application number Description Published 20110265150 MEDIA ASSET/CONTENT SECURITY CONTROL AND MANAGEMENT SYSTEM - A system, method, apparatus, and computer readable storage medium provide the ability to deliver media content in a secure manner in a computer system. A storage repository stores media content and marketing assets for the media content. A server computer is coupled to the storage repository and enabled to provide access to the media content and marketing assets via a website accessible on the Internet worldwide to a user. A digital advertising publicity repository (DAPR) enables an administrator to define first access rights for the user to access the website and second access rights for the user to access the DAPR. 10-27-2011 20120101904 CUSTOMIZED BILLBOARD WEBSITE ADVERTISEMENTS - A method, apparatus, system, and computer program product provide the ability to deliver an advertisement. Customization attributes for displaying billboard advertisements are defined. Each billboard advertisement comprises an advertisement for media content. A user requests access to a website and the server computer transmits the website that includes or provides access to the advertisements. Based on the customization attributes,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}