{
    "relation": [
        [
            "Date",
            "2010-10-06 10:00:00",
            "2010-10-06 10:00:00"
        ],
        [
            "Roundtable Name",
            "2010 Playoffs Day One",
            "2010 Playoffs Day One"
        ],
        [
            "Comment",
            "It's only Game 1, it's only Game 1 - keep telling yourself that, Dusty. 4 H, 4 ER, and 2 BB for Edinson Volquez. He retired just 5 batters. Yikes. (Jesse Behr)",
            "This has baffled me for quite some time: Why isn't Edinson Volquez's first name pronounced ed-EEN-son instead of ED-in-son? (John Perrotto)"
        ]
    ],
    "pageTitle": "Edinson Volquez | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=45621",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 323147907,
    "recordOffset": 323108937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53208=Last Update: 12/31/2014 23:59 ET, 316483=Edinson Volquez has thrown 19,477 pitches that have been tracked by the PITCHf/x system between 2007 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason, The World Baseball Classic and Spring Training. In 2015, he has relied primarily on his Sinker (94mph), Change (86mph) and Curve (81mph), also mixing in a Fourseam Fastball (95mph).}",
    "lastModified": "Sat, 01 Aug 2015 03:37:12 GMT",
    "textBeforeTable": "BP Roundtables I guess you were one of the millions to go see see Horton hears a Who huh? Parra is making the Brewers make a tough decision but may not make the club at first. Volquez has a lot to prove. Cueto and Kennedy are arms that the Reds and yanks absolutely love and right now they are my top two of this list. I can't see Gio not being a member of the rotation this year at some point but when is up to a few factors and Sanchez like parra is nice sleeper with high upside. Solid list of names. (Mike Siano) Hey Mike, here's a question that appears to be growing more and more relevant: of the following up-and-coming SPs, can you rank them in terms of value they will provide to a fantasy team THIS YEAR assuming they all get spots in the rotation? The SPs are Manny Parra, Edinson Volquez, Johnny Cueto, Ian Kennedy, Gio Gonzalez and Jonathan Sanchez. This should be relevant to most fantasy players looking to make a great WW pickup early in the season. (The Grinch from Whoville) 2008-03-17 12:00:00 (link to chat) Normally I'd",
    "textAfterTable": "  PITCHf/x Pitcher Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC Edinson Volquez has thrown 19,477 pitches that have been tracked by the PITCHf/x system between 2007 and 2015, including pitches thrown in the MLB Regular Season, the MLB Postseason, The World Baseball Classic and Spring Training. In 2015, he has relied primarily on his Sinker (94mph), Change (86mph) and Curve (81mph), also mixing in a Fourseam Fastball (95mph).   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}