{
    "relation": [
        [
            "Attachment",
            "Current version (playable SWF) (working)",
            "AS3 Source code (ZIP) (updated)",
            "Screenshot"
        ],
        [
            "Size",
            "101.82 KB",
            "1.46 MB",
            "11.75 KB"
        ]
    ],
    "pageTitle": "The Swap-A-thon Challenge! | Glorious Trainwrecks",
    "title": "",
    "url": "http://www.glorioustrainwrecks.com/node/4346",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468761563,
    "recordOffset": 468731847,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6512=I may have to spend part of November making an unfinished game. I don't think I've got anything far enough along to be worth putting up for the event., 83=1000 B.C.: A Space Idiocity Plan on remaking this some day, 15948=1. the rules are optional. stick to them if you want but it doesnt matter. that said - 2. there is *one* rule i would like you guys to stick to. if two different people want to continue the same game, then that is fine. however, it can only be the two people. no more. oh, and to avoid it getting confusing, when you post it, add \"( edition)\". thanks. 3. you can post your unfinished games now, however, you may not start work on the game until it is december. 4. the reason why it's during december is because a) im busy for the entirety of november (nanowrimo) and b) well, it wouldnt be the apocalypse game-a-thon without some kind of stupid urban legend thing mixed into it so yeah, why not have the 2012 urban legend in there. 5. i love you all}",
    "TableContextTimeStampAfterTable": "{88917=From August 2012, made with AS3 and FlashPunk., 33840=I've been forestalled with a lot of schoolwork and another big project or two, but I'm now targeting the first week of February for this to be finished. I'm still trying to figure out some finer points of how exactly I want it to turn out, but it will happen!, 15352=Seemingly from 2008. Have almost no recollection of making. Very little work done, only movement system is in place and frankly I would recommend scrapping that. Also included are two images from 2005 that seem to be related., 61085=Here's a game I started on in 2009, when I played a lot of Sin & Punishment and wanted to make a top-down shooter but where you couldn't shoot bullets, you can only reflect them. I was going to have the player go room-to-room doing this (modeled after Legend of Zelda NES dungeons) and incorporate maybe some puzzles or something, but what I have here looks more like Space Invaders, which is also ok. In truth, I don't remember everything I wanted for this one., 31610=I am working on this and wanting to give it some more time. Probably finish it some time in the first week of January., 84827=From July 2010, made in AS3 with FlashPunk., 81310=From August 2009, written in AS3.}",
    "lastModified": "Sat, 01 Aug 2015 03:31:20 GMT",
    "textBeforeTable": "1000 B.C.: A Space Idiocity Plan on remaking this some day 1000 B.C.: A Space Sat, 11/03/2012 - 10:51 — Smedis2 Add new comment oh ok, hold on ill fix it for you. oh ok, hold on ill fix it Sat, 11/03/2012 - 01:06 — sewermist Add new comment And I take no pleasure in admitting this: this WILL bug me for the rest of the month. It should read Y2K12 Fri, 11/02/2012 - 21:17 — L Add new comment Interesting idea, I think I'll eventually submit Space Frankenstein vs. the Earthmen, since I don't think there's anything I can reasonably do with it that would satisfy me, since my initial game idea was way too complicated to implement in a reasonable amount of time.",
    "textAfterTable": "Sat, 11/03/2012 - 22:31 — nihilocrat KREUZZUG (Made with Unity 3.5) It was meant to be kind of like a shmup, but with space-sim-like controls (WASD and mouse) and a \"frontline\" which got pushed forward or backward depending on which \"side\" of the shmup corridor was winning. This and more info about how I was planning to do stuff is in \"design.rtf\". As per the rules, feel free to completely disregard it. Attachment Size kreuzzug_unity_src.zip 6.14 MB Add new comment Sun, 11/04/2012 - 03:27 — sewermist Gangster Quest (KNP/Any Clickteam product) Yep, it's the thing I used in the diagrams. This one was gonna be done during the 2SPOOKY kotm but that ended up not happening because YAY DISTRACTIONS. The basic premise is that you are the \"GOOD-GUY GANGSTER\" and you FIGHT CRIME INSTEAD OF CAUSE IT. One day, ELVIS (Impersonator) and GOOD-GUY GANGSTER were in a TENNIS COURT one day and ELVIS (Impersonator) suddenly took off in the middle of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}