{
    "relation": [
        [
            "l value",
            "0",
            "1",
            "2",
            "3",
            "4"
        ],
        [
            "symbol",
            "s",
            "p",
            "d",
            "f",
            "g..."
        ],
        [
            "obsolete term / \"mnemonic\"",
            "sharp / \"spherical\"",
            "principal / \"propeller\"",
            "diffuse / \"daisy\" (4 lobes) or \"donut\"(dz2)",
            "fundamental / \"flower\" (8 lobes)",
            "and so on alphabetically"
        ]
    ],
    "pageTitle": "Tones on a Drum and Orbital Wavefunctions - ChemPRIME",
    "title": "",
    "url": "http://wiki.chemprime.chemeddl.org/index.php/Tones_on_a_Drum_and_Orbital_Wavefunctions",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 261132635,
    "recordOffset": 261112152,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Now let's look at 3 dimensional wavefunctions that might be used to describe the electron, compared to the 3 D drum vibrations. In three dimensions, the circular nodes will become spherical nodes, and the linear nodes will become planar nodes. We also use a shorthand designation for the shapes of wavefunctions, in which letters which are used to designate the values of l: mode m5,2 mode m4,2 mode m3,2 Finally, the set of modes below has l = 2, so that there are two planar nodes, which are two diagonals, perpendicular to each other. Thus mode m3,2 divides the drum into four quadrants, with alternate quadrants vibrating up and down, respectively. The",
    "textAfterTable": "So if n = 1 and l = 0, it's a \"1s orbital\"; if n = 3 and l = 2, it's a \"3d orbital\", and if n = 4 and l = 3, it's a \"4f orbital\", etc. We'll start with the lowest energy wavefunction, the one with the fewest nodes. It has n = 1, l = 0, so it's designated \"1s\". We'll show the 2D drum vibration, the 3D orbital as a rotatable Jmol model, and a \"surface plot\" where the surface is drawn so that the electron would be within it (typically) 95% of the time. Orbital designation Drum Vibration Rotating Orbital Boundary Surface Diagram[1] 1s mode m1,0 We use the label \"1s\" to distinguish this pattern from other wave patterns the electron could possibly adopt if it moved about the nucleus with a higher energy. Each of these three-dimensional wave",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}