{
    "relation": [
        [
            "First Name",
            "Michael",
            "Jan",
            "Chandler"
        ],
        [
            "Last Name",
            "Stranz",
            "Ahlen",
            "Goule"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "staff:Rep.Price",
            "staff:H.Ag.Comte.,Reps.Peterson,Tanner,Stenholm"
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=57681FDE-3917-4864-AA09-468371388DE0&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 234237336,
    "recordOffset": 234227458,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21822=Agriculture/food-related provisions of: H.R.132, Disaster Relief Appropriations Act, 2013. H.R.933, Consolidated and Further Continuing Appropriations Act, 2013. Issues other than legislation: Emergency economic assistance for farmers and ranchers Funding for USDA programs Appropriations and budget requests for USDA/other agencies with an ag-related mission or responsibility., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 37604=Agriculture/food-related provisions of: S.458, Improve Nutrition Program Integrity and Deficit Reduction Act of 2013. Issues other than legislation: Implementation of country-of-origin labeling program. Establishment of national organic food and food production standards. Food Safety. Implementation of the Food Quality Protection Act. Domestic Food Assistance and hunger. Food stamps and domestic Nutrition Programs., 12285=Agriculture/food-related provisions of: H.R.1396, California Federal Milk Marketing Order Act. S.10, Agriculture Reform, Food and Jobs Act of 2013. S.141, to make supplemental agricultural disaster assistance for FY 2012 and 2013. S.281, Farm Program Integrity Act of 2013. S.345, Sugar Reform Act of 2013. S.605, Dairy Income Fairness Act of 2013. S.663, California Milk Marketing Order Act. Issues other than legislation: Farm Service Agency personnel levels. USDA agricultural credit availability. Reform of the Federal Milk Marketing Order. Establishment of a farmer-owned grain reserve. Distribution of farm program benefits. Expansion and improvement of Federal Crop Insurance programs. Review of Packers and Stockyards Act effectiveness in enhancing competitive practices in the livestock industry. Mandatory livestock price reporting. Contract production of agricultural commodities. Long-term domestic agricultural policy. Commodity loan rate adjustments. Facility loan programs for commodity storage. Natural disaster assistance for farmers and ranchers. Regulations of the agriculture futures industry. Farm bill implementation. Indemnity payments to dairy producers. Agricultural conservation programs. Funding and implementation of rural development programs. Funding for farmer-owned cooperatives. Balancing supply and demand. Natural resources. Real estate, land use, public lands, conservation. Small business. Agroterrorism. Grain standards, reauthorization. Veterinary sciences.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  LINDA D. KENDALL  2023143105  lkendall@nfudc.org 5. Senate ID#  14187-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}