{
    "relation": [
        [
            "No.",
            "1",
            "2",
            "3",
            "4"
        ],
        [
            "Item",
            "Silicon Tube * Size:φ5*1.5mm (thickness)",
            "Diffuser Stone",
            "Dryer Tube * Size: φ40*200mm",
            "Check Valve"
        ],
        [
            "Quantity",
            "1 piece (3m) * Can be cut into 2 or 3 pieces according to your own requirement",
            "2 pieces",
            "1 piece",
            "1 piece"
        ]
    ],
    "pageTitle": "无标题文档",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/1-5g-h-Ozone-Generator-Puifier-Sterilizer-Disinfector-/220805863465?pt=UK_Home_Garden_Hearing_Cooling_Air&hash=item33690e1829",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418096079,
    "recordOffset": 418059146,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{65054=1) Longer lifespan: key parts can last for over 10,000 hours while glass tube lasts for 5,000 hours and mica plate only 800-2000 hours 2) Easy to maintain: corona discharge area getting dusted will bring down the ozone output amount. Ozone generation unit (OGU) of our product can be cleaned; OGU of most other similar products is fixed and cannot be cleaned 3) Better cooling function brings more stable ozone generation 4) Higher concentration of ozone due to higher rate of conversion from room air to ozone 5) Better adaption to the environment}",
    "textBeforeTable": "Accessories 370*130*160 Dimension (mm) Aluminum Material 5-8L/min Air Flow 8-10KHz Work Frequency 3-5KV Work Voltage 30-80W Power Consumption AC220V / 50Hz or 110V/60Hz Power Source 1.5g/3g/5g per hour Ozone Output Technical Parameters Its application has been broadened to meet various environmental requirements. Yes No No Adjuster It is with intellectual working program, and you can have it performed either under ongoing setting or 0-60 minutes timing control Yes No Yes Timer You may offer after-sale service to your clients: they send back the machine, and you’ll return them a ‘brand new’ one after cleaning up the OGU unit Low * OGU of our product can be taken out and cleaned, and that will help resume ozone output level to a high standard Very High * The mica plates need replacement regularly, and each plate costs 99 USD",
    "textAfterTable": "Operation Instructions 1. The unit must be safely connected to the ground. Once power is connected, ‘Power indicator’ will light (red). 2. Press on ‘Power Switch’, and the ‘Work Indicator’ will light (green); the ozone generator is ready to work. 3. Turn the ‘Timer’ switch to the ongoing setting, and the machine will generate ozone continuously; you may also use an external timing control device to manage cycle programs under the ongoing setting. 4. Turn the ‘Timer’ switch to the other side with the time scales, and you can select length of session you wish the unit to run for. 5. Use the switch ‘Ozone output adjustment’ to adjust the ozone output amount. 6. The provided silicone tube is 3 metres long altogether, and you may cut it into 2 or 3 pieces according to your own requirement: A. The drying tube is connected to the ozone generator by silicone tube. Air passes the drying tube first before entering the unit and getting involved into the ozone generation process. B. For air purification, connect one end of the silicone tube to the ozone outlet of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}