{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "PS Docket Nos.",
            "WT Docket No.",
            "Report No."
        ],
        [
            "regulations.gov",
            "2015-01345",
            "",
            "13-87, 06-229",
            "96-86, RM-11433, RM-11577",
            "3013"
        ]
    ],
    "pageTitle": "47 CFR Part 2, Subpart E - Distress, Disaster, and Emergency Communications | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/part-2/subpart-E?quicktabs_7=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909074887,
    "recordOffset": 909054918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1027=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{50411=In this document, the Federal Communications Commission (Commission) proposes to authorize radar applications in the 76-81 GHz band. The Commission seeks to develop a flexible and streamlined regulatory framework that will encourage efficient, innovative uses of the spectrum and to allow various services to operate on an interference-protected basis. In doing so, it further seeks to adopt service rules that will allow for the deployment of the various radar applications in this band, both within and outside the U.S. The Commission takes this action in response to a petition for rulemaking filed by Robert Bosch, LLC (Bosch) and two petitions for reconsideration of the 2012 Vehicular Radar R&O., 3359=In this document, the Federal Communications Commission (Commission) announces the effective date to the amendment regarding Fixed and Mobile allocations for the 2025-2110 MHz band to the Federal Table of Frequency Allocations. This document is consistent with the Commission's Report and Order, Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands, stating that it would publish a document in the Federal Register announcing the effective date of this amendment., 22922=On August 15, 2014, the Commission released a Report and Order, “Expanding the Economic and Innovation Opportunities of Spectrum Through Incentive Auctions.” This document announces an effective date for several sections in the final regulations that appeared in the Federal Register on August 15, 2014 (79 FR 48442)., 36194=48 Stat. 1082, 27999=In this document the Commission implements certain changes to the rules governing the 700 MHz public safety narrowband spectrum (769-775/799-805 MHz). We eliminate the requirement for licensees to narrowband to 6.25 kHz technology by December 2016, thereby enabling licensees to extend the life of existing systems and providing public safety with greater flexibility in determining the optimal future use of the band. In addition, we revise and update the technical rules for the band to enhance interoperability and open up certain channels to new uses, and we release reserve spectrum to provide additional capacity, particularly for public safety licensees relocating to the 700 MHz band from the T-Band (470-512 MHz). These rule changes enhance the ability of public safety licensees to use this spectrum to protect the safety of life and property., 18004=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 13068=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection requirements associated with the Commission's Report and Order for Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands (Service Rules for Advance Wireless Service (AWS)), FCC 14-31. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new or modified information collection requirements., 8216=In this document, the Commission announces that the Office of Management and Budget (OMB) has approved, for a period of three years a non-substantive change to a currently approved information collection requirements contained in the regulations in the “Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz.” The information collection requirement was approved on December 23, 2014 by OMB., 35852=48 Stat. 1066, 90059=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 36023=48 Stat. 1068, 36596=Title 47 published on 2014-10-01}",
    "lastModified": "Tue, 02 Jun 2015 12:29:37 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 27107 - Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands 2015-05-12; vol. 80 # 91 - Tuesday, May 12, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. § 2.407 — National defense; emergency authorization. § 2.406 — National defense; free service. § 2.405 — Operation during emergency. § 2.404 — Resumption of operation after distress. § 2.403 — Retransmission of distress message. § 2.402 — Control of distress traffic. § 2.401 — Distress messages.",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rules; announcement of effective date. The amendment to 47 CFR 2.106 published at 79 FR 32366, 32407 (Jun. 4, 2014) is effective May 12, 2015. 47 CFR Part 2 Summary In this document, the Federal Communications Commission (Commission) announces the effective date to the amendment regarding Fixed and Mobile allocations for the 2025-2110 MHz band to the Federal Table of Frequency Allocations. This document is consistent with the Commission's Report and Order, Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands, stating that it would publish a document in the Federal Register announcing the effective date of this amendment. 2015-02-17; vol. 80 # 31 - Tuesday, February 17, 2015 80 FR 8248 - Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands GPO FDSys XML | Text Additional Documents type regulations.gov",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}