{
    "relation": [
        [
            "Drugs Set Your Timeline",
            "Ford Focus – DIY Zlaty rucicky",
            "R/GA The Social Interview",
            "WINNER : The Generous Store by Anthon Berg",
            "Ariel Fashion Shoot"
        ],
        [
            "Mccann Erickson, tel-aviv",
            "Mindshare",
            "R/GA",
            "Robert/Boisen & Like-minded",
            "Saatchi & Saatchi / MSL Nordic"
        ],
        [
            "Israel",
            "Czech Republic",
            "United States",
            "Denmark",
            "Sweden"
        ]
    ],
    "pageTitle": "72+ of the best social media campaigns worldwide - Memeburn",
    "title": "",
    "url": "http://memeburn.com/2012/05/72-of-the-best-social-media-campaigns-worldwide/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 157408235,
    "recordOffset": 157379183,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36283=The Bees Awards, a San Francisco-based award for the best use of social media, has revealed what it thinks are the best social media campaigns for 2012. Agencies and companies from 40 countries, ranging from Europe, China, Israel, the US and South Africa have scooped honours for innovative use of social media., 110757=Pingback: 12 of Memeburn’s most popular articles in 2012 | memeburn(), 32921=Social media campaigns are big business. In fact, social research company Hubspot estimates that some US$3.08-billion was spent just on advertising on social networking sites in 2011., 109957=Interesting winners here. The great thing about this, is that their campaigns technically should not cost “too” much. The distribution platform in terms of social media is easy. Even small businesses can have a nationwide reach. All one need really is to maximize their efforts in social media marketing, and that is the challenge. Here are some good tips: http://smallbusiness.printplace.com/2012/10/19/optimize-and-maximize-your-social-media-marketing-efforts/ , but it will really depend on how smart and creative you are with social marketing.}",
    "textBeforeTable": "Best Use of Micro-Blogging Platform   It is the third edition of the awards, the biggest ever. Below are the winners and runner-ups:      While massive multi-national agencies like Saatchi & Saatchi — which won Agency of the Year — and Ogilvy had strong showings, smaller agencies like South Africa’s Joe Public, which won for Best Use of a Microblogging Platform, and Spain’s Contrapunto also stood out. One of the best overall campaigns, however, had to be Canadian company Agence Tuxedo‘s “Go Beyond The Cover“, which used the tattoo-covered Rico Genest (a.k.a. Zombie Boy) to demonstrate how effective cosmetic company DermaBlend’s concealing products are. Among the more notable ones was an Israeli campaign by Mccann Erickson, Tel-Aviv that used Facebook Timeline to illustrate the effects of drug use. Ogilvy Cape Town’s mobile campaign for Black Label beer, which allowed soccer fans to “Be the Coach” and choose players for two of the country’s premier soccer sides, also stands out. Although US agencies feature heavily in the winners and nominees list, a number of campaigns from emerging markets drew the attention of the judges. The Bees Awards, a San Francisco-based award for the best use of social media, has revealed what it thinks are the best social media campaigns for 2012. Agencies and companies from 40 countries, ranging from Europe, China, Israel, the US and South Africa have scooped honours for innovative use of social media. They",
    "textAfterTable": "United States *** WINNER *** Twitter Army Joe Public South Africa   Best Use of Social Media Platform Drugs Set Your Timeline Mccann Erickson, tel-aviv Israel Ford Focus – DIY Zlaty rucicky Mindshare Czech Republic R/GA The Social Interview R/GA United States *** WINNER *** The Generous Store by Anthon Berg Robert/Boisen & Like-minded Denmark Ariel Fashion Shoot Saatchi & Saatchi / MSL Nordic Sweden   Best Use of Mobile Showtime’s The Franchise Fan Cave Catch",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}