{
    "relation": [
        [
            "Condition:",
            "Character Family:",
            "Year:",
            "Gender:"
        ],
        [
            "New: A brand-new, unused, unopened, undamaged item (including handmade items). See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Teenage Mutant Ninja Turtles TMNT",
            "1992 Vintage",
            "Boys"
        ],
        [
            "Type:",
            "Brand:",
            "Packaging:",
            ""
        ],
        [
            "Action Figure",
            "Playmates Toys",
            "Original (Unopened)",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Movie-Star-Foot-Soldier-AFA-Graded-85-TMNT-Teenage-Mutant-Ninja-Turtles-MIP-/121414352794?pt=US_Action_Figures&hash=item1c44dbff9a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 409500331,
    "recordOffset": 409456326,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics Seller assumes all responsibility for this listing. 121414352794 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab Guarantee:",
    "textAfterTable": "I am the original owner this sealed figure. AFA 85. Package is in like new condition.  I have taken pictures of every side to illustrate quality. I will ship carefully in order to preserve condition. Contact me with any questions. See my other listing for more Vintage TMNT items. Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing. Shipping and handling",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}