{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "This is one of the most safe campuses. Security is always roaming around checking everything out. Even if you leave campus you are safe. Security is available to escort you somewhere if you want.",
            "Since NCU is a Pentecostal school they do not have Greek life.",
            "There are a ton of different clubs and activities you can get involved in. You can even start your own club if they don't have what you are looking for.",
            "NCU is great for any type of student. This is not a one size fits all kind of school.",
            "North Central is located next to one of the most diverse neighborhood in Minneapolis.",
            "North Central is totally worth the money. Everything is amazing at this school. Your spiritual life is molded and you are stretched and grow closer to God every day. The teachers are great. There are tons of classes and majors. Every student here is wonderful. They care about getting to know you as a person and are always super friendly.",
            "We never run out of things to do. You can walk a short distance downtown, or take the light rail out to Mall of America. There are tons of coffee shops close by, or if you prefer to stay in, you can watch a movie. You could also hang out in the lounge areas or the library.",
            "The food is usually pretty good. We have a lot of different options for lunch. You can eat in the cafeteria or you can get deli if you are in a hurry.",
            "The dorms here are good. The community is what makes it great. You are right down the hall from your best friend.",
            "Academics here are amazing. The teachers are great about helping you and they spark your interest in the class. NCU offers a lot of different classes that you get to choose from.",
            "Look into the dorm you want to live in. Go visit it and make sure it is what you want. Make sure your major is available and meet with a financial counselor.",
            "North Central is the best college. The spiritual aspect is absolutely phenomenal. The teachers are amazing and NCU offers tons of majors."
        ]
    ],
    "pageTitle": "North Central University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Central-University/reviews?_escaped_fragment_=/show/45911",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899370091,
    "recordOffset": 899332694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96014=Last year (2012/2013) The cafeteria food was pretty good, but was so repetitive that one would get so sick of it, they went out to buy food. The college plans on changing this upcoming year., 128045=Each building is locked and can only be accessed by a student I.D. Underclassmen and students under the age of 21 have a 1:30 am curfew. We have security officers who do regular rounds around the campus, and an escort system that will drive students to places such as the light rail or anywhere within 2 blocks away from the school., 129394=There things to do for fun. North Central is located right next to a neighborhood park, there's a a skate park, a basket ball court, a small field and a playground. Therefore, one can go and hangout there on their leisure time in the Spring and early Fall. Also being right in downtown Minneapolis, we are also about two blocks away from the Metrodome stadium which now, in 2014, is being remodeled. When it is back up students can go catch a Vikings game. We are also about a mile away from Nicollet Mall, a bus ride away from Uptown, and lastly, the Mall of America is about a half and hour ride on the light rail (stop located right next to the Metrodome)., 149909=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 31 Maeve from Minneapolis, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Share any unusual traditions or locations on campus The whole campus is connected by skyways with the exception of two buildings. I had a semester where I never had a need to step outside, which was nice for the winter months. As far as traditions, there is The Week, which is basically one big carnival. There is also Battle of the Floors which is a competition where you put on one big drama skit with assigned themes. Be aware, however, that you are required to attend chapel everyday for an hour. Bang for the buck It is pricy, but as far a private schools go, it is actually cheap. A ton of scholarships are also up for grabs. What to do for fun On the bright side, you are living RIGHT in downtown Minneapolis (and it's completely safe, don't worry). You can walk to target, through the skyways, to the stonearch, and so much more. Restaurants are in abundance, and you have the whole cities at the disposal of your hand with the light rail half a mile away and the metro bus stops right outside the door. Food and Dining The cafeteria is a special place. I can bet that by your third year you will",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}