{
    "relation": [
        [
            "Symbol",
            "- / , . ; : \"text\"",
            "AD A.D.",
            "AM A.M.",
            "BC B.C.",
            "CC",
            "DAY",
            "D",
            "DD",
            "DDD",
            "DL",
            "DS",
            "DY",
            "E",
            "EE",
            "FF[1..9]",
            "HH",
            "HH12",
            "HH24",
            "MI",
            "MM",
            "MON",
            "MONTH",
            "PM P.M.",
            "RR",
            "RRRR",
            "SS",
            "TZD",
            "TZH",
            "TZM",
            "TZR",
            "WW",
            "W",
            "X",
            "YYYY",
            "YY Y"
        ],
        [
            "Meaning",
            "Punctuation and quoted text are reproduced in the result.",
            "AD indicator with or without periods.",
            "Meridian indicator with or without periods.",
            "BC indicator with or without periods.",
            "Century. For example, 2002 returns 21; 2000 returns 20.",
            "Name of day, padded with blanks to length of 9 characters.",
            "Day of week (1-7).",
            "Day of month (1-31).",
            "Day of year (1-366).",
            "Returns a value in the long date format.",
            "Returns a value in the short date format.",
            "Abbreviated name of day.",
            "Abbreviated era name.",
            "Full era name.",
            "Fractional seconds. Use the numbers 1 to 9 after FF to specify the number of digits in the fractional second portion of the datetime value returned. Example: 'HH:MI:SS.FF3'",
            "Hour of day (1-12).",
            "Hour of day (1-12).",
            "Hour of day (0-23).",
            "Minute (0-59).",
            "Month (01-12; JAN = 01).",
            "Abbreviated name of month.",
            "Name of month, padded with blanks to length of 9 characters.",
            "Meridian indicator with or without periods.",
            "Lets you store 20th century dates in the 21st century using only two digits.",
            "Round year. Accepts either 4-digit or 2-digit input. If 2-digit, provides the same return as RR. If you don't want this functionality, then simply enter the 4-digit year.",
            "Seconds (0-59).",
            "Daylight savings information. The TZD value is an abbreviated time zone string with daylight savings information. It must correspond to the region specified in TZR. Example: PST (for Pacific Standard Time) PDT (for Pacific Daylight Time)",
            "Time zone hour. (See TZM format element.)",
            "Time zone minute. (See TZH format element.) Example: 'HH:MI:SS.FFTZH:TZM'",
            "Time zone region information. The value must be one of the time zone regions supported in the database. Example: PST (Pacific Standard Time)",
            "Week of year (1-53) where week 1 starts on the first day of the year and continues to the seventh day of the year.",
            "Week of month (1-5) where week 1 starts on the first day of the month and ends on the seventh.",
            "Local radix character.",
            "4-digit year.",
            "Last 2, or 1 digit(s) of year."
        ]
    ],
    "pageTitle": "Oracle Business Intelligence Publisher Report Designer's Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E10415_01/doc/bi.1013/e12187/T421739T481157.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77216307,
    "recordOffset": 77156161,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{243527=Copyright © 2003, 2008, Oracle and/or its affiliates. All rights reserved., 2918=Using Microsoft Word's form field feature allows you to place the syntax in hidden form fields, rather than directly into the design of your template. BI Publisher supports Microsoft Word 2000 (or later) with Microsoft Windows version 2000 (or later)., 106191=For example, the following statement tests the AMOUNT element value. If the value is greater than 1000, show the word \"Higher\"; if it is less than 1000, show the word \"Lower\"; if it is equal to 1000, show \"Equal\":, 91665=http://myserver.domain:8888/CustomerReport/cstid=1234, 238163=For more information on XSL-FO see the W3C Website at http://www.w3.org/2002/08/XSLFOsummary.html, 66503=Microsoft Word 2000 Users: After you add the background map and overlay the shape group, use the Grouping dialog to make the entire composition one group., 66675=Microsoft Word 2002/3 Users: These versions of Word have an option under Tools > Options, General tab to \"Automatically generate drawing canvas when inserting autoshapes\". Using this option removes the need to do the final grouping of the map and shapes. We can now generate a visually appealing output for our report as seen in the following figure:, 223188=The pipe (|) is equal to the logical OR operator. In addition, XPath recognizes the logical OR and AND, as well as the equality operators: <=, <, >, >=, ==, and !=. For example, we can find all CDs released in 1985 or later using the following expression:, 196056=The data after the \"T\" is optional, therefore the following date: 2005-01-01 can be formatted using either date formatting option. Note that if you do not include the time zone offset, the time will be formatted to the UTC time., 224710=You could also access all the CD tittles released in 1988 using the following:, 185530=To use the Oracle format mask or the Microsoft format mask, the numbers in your data source must be in a raw format, with no formatting applied (for example: 1000.00). If the number has been formatted for European countries (for example: 1.000,00) the format will not work., 196021=2005-01-01T09:30:10-07:00, 64677=The shape-size command is used to stretch or shrink the cylinder based on the values of the elements SOFTWARE, HARDWARE, and SERVICES. The value is divided by 1000 to set the stretch or shrink factor. For example, if the value is 2000, divide that by 1000 to get a factor of 2. The shape will generate as twice its current height., 122005=The \"if\" statement is testing if the debit value is greater than 1000. If it is, then the next lines are invoked. Notice that the example embeds native XSL code inside the \"if\" statement., 119603=The template lists the accounts and their credit and debit values. In the final report we want to highlight in red any cell whose value is greater than 1000. The template for this is shown in the following figure:, 225804=<?namespace:fsg=http://www.oracle.com/fsg/2002-30-20/?>}",
    "lastModified": "Tue, 29 Jul 2008 18:57:18 GMT",
    "textBeforeTable": "The following table shows the entries made to complete the example. The Template Field Name is the display name from the template. The Default Text Entry is the value entered in the Default Text field of the Text Form Field Options dialog box (form field method only). The Placeholder Entry is the XML element tag name entered either in the Form Field Help Text field (form field method) or directly on the template. Complete the Example Select OK to apply. The Default text is displayed in the form field on your template. The figure below shows the Supplier field from the template with the added form field markup. In the help text entry field, enter the XML element's tag name using the syntax: <?XML element tag name?> You can enter multiple element tag names in the text entry field. In the example, the report field \"Supplier\" maps to the XML element VENDOR_NAME. In the Form Field Help Text field enter: <?VENDOR_NAME?> The following figure shows the Text Form Field Options dialog box and the Form Field Help Text dialog box with the appropriate entries for the Supplier field. Tip: For longer strings of BI Publisher syntax, use the Help Key (F1) tab instead of the Status Bar tab. The text entry field on the Help Key (F1) tab allows more characters.",
    "textAfterTable": "If your data source is a Data Template (for information, see Data Templates) and your results XML contains image data that had been stored as a BLOB in the database, use the following syntax in a form field inserted in your template where you want the image to render at runtime: <fo:instream-foreign-object content type=\"image/jpg\"> <xsl:value-of select=\"IMAGE_ELEMENT\"/> </fo:instream-foreign-object> where image/jpg is the MIME type of the image (other options might be: image/gif and image/png) and IMAGE_ELEMENT is the element name of the BLOB in your XML data. Note that you can specify height and width attributes for the image to set its size in the published report. BI Publisher will scale the image to fit the box size that you define. For example, to set the size of the example above to three inches by four inches, enter the following: <fo:instream-foreign-object content type=\"image/jpg\" height=\"3 in\" width=\"4 in\"> <xsl:value-of select=\"IMAGE_ELEMENT\"/> </fo:instream-foreign-object> Specify in pixels as follows: <fo:instream-foreign-object content type=\"image/jpg\" height=\"300 px\" width=\"4 px\"> ... or in centimeters: <fo:instream-foreign-object content type=\"image/jpg\" height=\"3 cm\" width=\"4 cm\"> ... or as a percentage of the original dimensions: <fo:instream-foreign-object content type=\"image/jpg\" height=\"300%\" width=\"300%\"> ... Chart Support BI Publisher leverages the graph capabilities of Oracle Business Intelligence Beans (BI Beans) to enable you to define charts and graphs in your RTF templates that will be populated with data at runtime. BI Publisher supports all the graph types and component attributes available from the BI Beans graph",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}