{
    "relation": [
        [
            "Patent application number",
            "20080291839",
            "20100299487",
            "20110099279"
        ],
        [
            "Description",
            "Method and system for maintaining high reliability logical connection - A method and system for maintaining a high reliability logical connection between hosts employs adaptive transparent pinging, clone blocking and bandwidth leveling to realize improvements in the areas of connection status verification, security and bandwidth management. In adaptive transparent pinging, a ping interval that defines a frequency at which ping messages are transmitted from an initiating host to a receiving host to check connection status is dynamically regulated based on data indicative of the reliability of a connection. In clone blocking, the receiving host verifies that a new connection that appears redundant is a re-established connection from the initiating host rather than a cloned connection. In bandwidth leveling, data bursts pending on initiating hosts that exceed a predetermined size are scheduled for transmission to receiving hosts.",
            "Methods and Systems for Partially-Transacted Data Concurrency - Aspects of the present invention comprise systems and methods for protecting multi-threaded access to shared memory. Some aspects provide higher data concurrency than other methods. Some aspects relate to methods and systems that provide access to data for all threads during the first phases of one thread's write operation. Some aspects provide all threads access to a particular data unit until one thread enters the commit phase of the write operation. Some aspects manage a computing data resource such that, when a thread enters the commit phase, all pending read requests are fulfilled, all pending write requests are allowed to proceed to commit phase at which point they are blocked, all new read and write requests are blocked and the commit phase is completed by updating the target data and releasing the blocked requests.",
            "Method and system for verifying logical connection - A method and system for maintaining a high reliability logical connection between hosts employs adaptive transparent pinging, clone blocking and bandwidth leveling to realize improvements in the areas of connection status verification, security and bandwidth management. In adaptive transparent pinging, a ping interval that defines a frequency at which ping messages are transmitted from an initiating host to a receiving host to check connection status is dynamically regulated based on data indicative of the reliability of a connection. In clone blocking, the receiving host verifies that a new connection that appears redundant is a re-established connection from the initiating host rather than a cloned connection. In bandwidth leveling, data bursts pending on initiating hosts that exceed a predetermined size are scheduled for transmission to receiving hosts."
        ],
        [
            "Published",
            "11-27-2008",
            "11-25-2010",
            "04-28-2011"
        ]
    ],
    "pageTitle": "Hooper, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hooper-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430316155,
    "recordOffset": 430289530,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Harold Scott Hooper, Vancouver, WA US 06-09-2011 Elevator Apparatus Yielding No Reverse Rope Bend - Provided is an elevator apparatus that may be mounted horizontally in an upper portion of an elevator hoistway. Such an elevator apparatus may comprise a drive machine, a deflector sheave, a support frame, and a roping system. The roping system may be configured to eliminate reverse rope bend to improve the rope life of the system. 20110132695 Published Description Patent application number Gary Hooper, Rathdrum, ID US 03-17-2011 Attenuated Live Triple G Protein Recombinant Rabies Virus Vaccine for Pre- and Post-Exposure Prophylaxis of Rabies - The invention provides a recombinant rabies viruses comprising three copies of a mutated G gene wherein each G gene encodes a rabies virus glycoprotein having the amino acid 194 mutated to a serine and the amino acid 333 is mutated to a glutamic acid. The recombinant rabies virus is nonpathogenic in immunodeficient mammals and can be used in a vaccine to induce an immune response protect mammals from infection by rabies virus as well as clear a pre-existing rabies virus infection from neural tissues. 20110064764 Published Description Patent application number Douglas Craig Hooper, Medford, NJ US 04-10-2014 Signal Activated Circuit Interrupter - The current invention is an automatic AC power interruption system built into a portable power strip or a portable casing or integrated",
    "textAfterTable": "Patent applications by Harold Scott Hooper, Vancouver, WA US James F. Hooper, Wenonah, NJ US Patent application number Description Published 20140093839 MEDICINAL IMPLANT DEVICE AND CARTRIDGE - The invention includes a device for inserting a medicament within a body cavity of a mammal, and a cartridge for containing the medicament within the device, where the cartridge includes a housing, a retractable chamber for containing medicament disposed within the housing, and a substantially stationary member disposed within the barrel of the retractable chamber, where upon activation of the device, the retractable chamber is retracted about the substantially stationary member, thereby depositing medicament within the body cavity. 04-03-2014 Jay Hooper, New Market, MD US Patent application number Description Published 20100323024 PUUMALA VIRUS FULL-LENGTH M SEGMENT-BASED DNA VACCINES - The invention contemplates a new synthetic, codon-optimized Puumala virus (PUUV) full-length M gene open reading frame (ORF) that encodes a unique consensus amino acid sequence. The PUUV ORF was cloned into a plasmid to form the first stable PUUV full-length M gene that elicits neutralizing antibodies. The gene can be engineered into a molecular vaccine system, and is useful to protect mammals",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}