{
    "relation": [
        [
            "Turning Point Evaluation",
            "Correct TP",
            "Missed TP",
            "False TP",
            "TP Error"
        ],
        [
            "Model 1 Level",
            "3",
            "3",
            "0",
            "3"
        ],
        [
            "Model 2 Curvature",
            "4",
            "2",
            "2",
            "4"
        ],
        [
            "Model 3 Slope",
            "5",
            "1",
            "2",
            "3"
        ],
        [
            "Model 4 Probit",
            "3",
            "3",
            "0",
            "3"
        ],
        [
            "Model 5 Yield-only",
            "6",
            "0",
            "2",
            "2"
        ],
        [
            "Model 6 Yield-Economy",
            "6",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - A Dynamic Factor Model of the Yield Curve as a Predictor of the Economy*",
    "title": "Table 6a: Turning Point Signal Errors of the Reference Cycle (IP and NBER) Peaks (4 in-Sample; 2 Out-of-Sample)",
    "url": "http://www.federalreserve.gov/pubs/feds/2012/201232/index.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439515771,
    "recordOffset": 439474553,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2096=The tests indicate strong evidence of several breaks in the components of the yield curve. First, all three series display a break in volatility between 1980:05 and 1981:08. In the case of the term spread, there is also strong evidence of a break in its mean in this period. Several papers have found instability in the predictive power of the yield curve, particularly with respect to the 1990-1991 recession.12 We find significant structural breaks in the mean of both the curvature and the level series around 1990:06 and 1990:12. In addition, the variance of the level also displays a break in 1990:11. On the other hand, the tests applied to the growth rate of industrial production find a break in its volatility in 1983:12. These results are summarized in Table 1., 23362=The models are first estimated using data from 1971:08 to 1999:12 and then recursively re-estimated for each month for the period starting in 2000:1 and ending in 2003:12. We use the in-sample estimates to generate h-step ahead forecasts in real time, using only collected real time realizations of industrial production as first released at each month for this analysis. We consider forecast horizons from 1 to 10 months, . The loss functions are evaluated using h-step ahead forecast errors obtained through a recursive forecasting scheme. We consider three loss functions: the root mean squared error (RMSE), Theil inequality coefficient (THEIL) and the LINLIN asymmetric loss function of Granger (1969):, 15175=Finally, the nonlinearities in the form of switching states can capture changes in the stochastic structure of the economy such as the possibility of recurrent breaks. Several recent papers have shown that the predictive content of the yield curve is not stable over time. In general, linear regression models that use output growth as the dependent variable indicate that the forecasting ability of the term spread has reduced since mid 1980s.6 Although the results from binary models of recession are less unambiguous, Chauvet and Potter (2002, 2005) find overwhelming evidence of breaks in the relationship between the yield curve and economic activity using Bayesian techniques to estimate probit models, and show that not taking them into account affect real time forecasts.7 Our models include the possibility of abrupt changes in the underlying series, based on the results of endogenous breakpoint tests., 19162=There is a large literature that investigates prediction of future economic activity using the term structure of interest rates. See, for example, Harvey (1988, 1989), Stock and Watson (1989), Estrella and Hardouvelis (1991), Estrella and Mishkin (1998), Chauvet and Potter (2002, 2005), Hamilton and Kim (2002), Wright (2006), and Ang, Piazzesi and Wei (2006), among many others, or Stock and Watson (2003) for an extensive survey of this literature. In general, linear regression models are used to forecast the growth rate of economic activity and discrete choice models such as probit or logit specifications to predict the probability of a recession. While the term structure is predominantly used in these models, recent work by Ang, Piazzesi, and Wei (2006) show that the information across the entire yield curve can result in more efficient and accurate forecasts of real economic growth., 7495=The slope of the curve is considered the best predictor of recessions among the yield curve components. As it can be observed, the yield curve has inverted before five out of six recessions in the sample as dated by the NBER. However, as found by several other authors, the slope did not turn negative before the 1990 recession. It is interesting to investigate the power of the slope in predicting previous recessions as well. Although data for the other series are not available before 1971, the slope series goes back to 1953:01 (Figure 2). During the period between 1953 and 1971 there were four recessions as dated by the NBER.10 The term spread had a much less clear-cut relationship with business cycles during this time. In particular, the slope only inverted before the 1969-1970 recession and did not become negative before the 1957-1958 and the 1960-1961 recessions. In addition, the slope inverted in 1966-1967 and no recession followed. It is important to keep this performance in mind, as it illustrates the instability of the term spread in predicting recessions over time. We further investigate this for our period in the next section., 9749=The series on U.S. Treasury yields with maturities of 3 months, 2 years, and 10 years are used to construct the three components of the yield curve. We use data compiled and made publicly accessible by Gurkaynak, Sack, and Wright (2007). Monthly yields are obtained by taking the average of daily yields. The data are available from 1971:08 to 2007:12. The empirical proxies used to represent the level, the slope, and the curvature of the yield curve are then constructed as follows: the level factor () is computed as the arithmetic average of the 3-month, 2-year, and 10-year bond yields; the curvature ()is measured as two times the 2-year bond yield minus the sum of the 3-month and 10-year bond yields; and the slope of the yield curve () corresponds to the difference between the 10-year bond rate and the 3-month T-bill rate. These empirical proxies are highly correlated with estimated latent factors from models of the entire yield curve as shown in Ang and Piazzesi (2003), Diebold and Li (2006), and Diebold, Rudebusch, and Aruoba (2006)., 13346=Our results point out to a strong correlation between the real economy and the bonds market. The yield factor extracted from the interrelationship between both sectors displays a better performance in anticipating economic recessions compared to alternative frameworks. In particular, the yield-economy factor predicts the beginning and end of all recessions (including the 2007-2009) in the sample studied with no false peaks or troughs and no missed turns - a perfect forecast score. An important feature of the model is its usefulness to predict not only the beginning but also the end of recessions. For example, the yield-economy factor model predicts in real time the end of the 2007-2009 recession as occurring in June 2009 with a lead of 18 months.8 We also evaluate the in-sample and out-of-sample forecasting performance of the proposed models and univariate alternatives in terms of calibration, resolution, and skill score. The yield-economy factor model is well calibrated and is the only one with positive skill score (i.e. it forecasts better than the benchmark constant forecast). In addition, the model displays the highest discrimination power, the lowest conditional and unconditional biases, and a better balance between accuracy and resolution, leading to a substantially smaller mean squared error compared to other models., 4367=Before October 1979, the Federal Reserve (Fed) used to target bank reserves in the financial system. A measure of the tightness of monetary policy was the changes in the federal funds rate. In October 1979, the Federal Reserve Bank adopted new operating procedures shifting their emphasis from targeting the federal funds rate to the quantity of non-borrowed bank reserves in order to achieve the desired rates of growth in the monetary aggregates. As a consequence, there was a widening of the range of the federal funds rate. The funds rate rose drastically from 11.4% in September to 13.8% by the end of 1979, and peaked at 19.1% in June 1982. By the end of 1982, the funds rate had then decreased to 8.9%. The wide fluctuations in the average federal funds rate between 1979 and 1982 were associated with a double dip recession and also a sharp fall in inflation. The policy actions by the FOMC not only corresponded to a change in the way monetary policy was conducted, but also engendered potential structural breaks in interest rate dynamics and in its relationship with the real economy.}",
    "TableContextTimeStampAfterTable": "{94131=Giacomini, R. and B. Rossi, 2006, \"How Stable is the Forecasting Performance of the Yield Curve for Output Growth?\" Oxford Bulletin of Economics and Statistics 68(s1), December, 783-795., 95413=Haubrich, J.G. and A.M. Dombrosky, 1996, \"Predicting Real Growth Using the Yield Curve,\" Federal Reserve Bank of Cleveland Economic Review, 32, 1, 26-34., 93196=Duffie, D., StateplaceKan, R., 1996, \"A Yield-Factor Model of Interest Rates, Mathematical Finance, 6, 379-406., 92499=Diebold, F.X. and G.D. Rudebusch, 1989, \"Scoring the Leading Indicators,\" Journal of Business, 62, 3, 369-91., 48183=There is a large body of literature documenting changes in the volatility of the placecountry-regionU.S. economy. In particular, McConnell and Perez-Quiros (2000) find evidence of a break towards more stability in the economy since 1984. We find that the level and slope of the yield curve also display an increased stability. The variance of the level fell to ¼ of its value after 1990, while the variance of the slope decreased to half its value after 1982. On the other hand, we do not find a significant change in the volatility of the curvature., 81547=Variables that exhibit high power in explaining the linear long-run variance of output may be less important in specific situations. In fact, the largest errors in predicting output occur around business cycle turning points. Thus, we choose to investigate the period before, during, and after the 2001 recession, which will allow analysis of the ability of the models in predicting in an out-of-sample real time exercise the substantial fall and recovery in the rate of growth of industrial production during this phase.20, 93732=Estrella, A., A.P. Rodrigues, and S. Schich, 2003, \"How Stable is the Predictive Power of the Yield Curve? Review of Economics and Statistics, 85, 3, 629-644., 61231=On the other hand, Model 6 has a striking performance, with a perfect forecast score (i.e, zero turning point errors, Table 6). It anticipates all peaks and troughs in-sample and out-of-sample. The average lead for detecting peaks is 18 months and for troughs is 16 months, respectively. In addition, it does not give any false signals, even when the yield curve turns flat and no recession follows as in the mid-1990s. Finally, Model 6 (and Model 5) not only signals the beginning of the 2007 recession out-of-sample, it has already identified its end (probabilities of recession fell below 50%), which none of the alternative models have.18, 51483=Table 4 shows the maximum likelihood estimates.17 The yield factor extracted from this framework shares some similarities with the single yield factor that uses information on the yield curve only. Most parameters are close in value. In particular, the factor loadings have the same signs - positive for the level and negative for the curvature and slope, implying that the high state of the yield-economy factor is associated with future economic recessions. Figure 8 plots the extracted yield-economy factor and its components along with the NBER-dated recessions. The yield-economy factor, which is a nonlinear combination of the yield components, is found to be stationary and with more pronounced cyclical fluctuations than its individual components. These features substantially increase the ability of the factor to signal future recessions, as will be discussed in more detail in the next section. Notice that the yield-economy factor rises substantially around two years before the beginning of recessions. This can also be observed in the dynamics of the smoothed probabilities of high value for the yield-economy factor, as shown in Figure 9. Each one of the six recessions in-sample and out-of-sample - including the most recent one that started in 2007:12 - is preceded by a rise in the probabilities of high yield factor above 50%. At around the onset of recessions the forward-looking probabilities - and the yield factor - fall indicating the future end of the recessions., 57034=In addition to in-sample turning point forecasts, we also test the ability of the models to forecast the last two recessions out-of-sample using unrevised real time data. In particular, we estimate the models up to 1999:01 and recursively re-estimate them out-of-sample until 2007:12. The results are shown in Tables 5, 6, 7, and 10., 60827=Model 5 correctly signals out-of-sample the 2001 recession with a lead of 15 months. However, the in-sample probabilities of recession increase above 50% in 1995-1996 and again in 1997-1998 (Figure 8). Thus, as Models 1 and 3, the single factor model that uses information from the three yield components still does not correctly filter the information from the flat yield curve from 1994 on., 93340=Estrella, A. and G. Hardouvelis, 1991, \"The Term Structure as a Predictor of Real Economic Activity,\" Journal of Finance, 46, 2, 555-576., 90184=Andrews, D.W.K. and W. Ploberger, 1994, \"Optimal Tests When a Nuisance Parameter is Present Only under the Alternative.\" Econometrica, 62:6, pp. 1383-414., 91958=Chauvet, M. and S. Potter, 2005, \"Forecasting Recessions Using the Yield Curve,\" Journal of Forecasting, 24, 2, 77-103., 58404=As it is found in the literature, the term spread does well in forecasting business cycle turning points (Model 3), signaling all troughs and peaks in-sample. However, its performance is not as good out-of-sample, missing 1 out of 2 peaks and 1 out of 1 trough. In addition, it falsely signals a peak and trough in-sample, in 1985-1986, and gives very mixed signals for the 2001 recession. As for the model for the level, the smoothed probabilities of recession from the term spread rose above 50% since 1995 and remained high until the beginning of the recession in 2001, six years later. The reason for this uncertainty can be visualized in Figure 6. The slope of the curve became flat from 1995 to 1999, but it only inverted in 2000. If this model were to be used to forecast recession at that time, there would certainly be large uncertainty on whether and when the economy would be heading to a recession during these six years, since prior to this period the spread identified recessions with an average lead of two years., 201238=Revised data on is used from 1971:8 to 2003:12. Recursive forecasting scheme is used. Estimation Period: 1971:08-1999:01. Forecast Period: 2000:01-2003:12. Numbers in bold indicate the smallest loss among all models for the particular forecast horizon., 96160=Nelson, C.R. and A.F. Siegel, 1987, \"Parsimonious Modeling of Yield Curves,\" Journal of Business, 60, 473-489., 95260=Harvey, C., 1989, \"Forecasting Economic Growth with the Bond and Stock Markets,\" Financial Analysts Journal, 38-45., 150744=(*) It does not include the trough for the current recession (2007-), which Models 5 and 6 have already signaled. Correct TP refers to prediction of a turning point when one does occur. Missed TP refers to prediction of no turning point when one does occur. False TP refers to prediction of a turning point when one does not occur. TP error refers to the total of Missed and False TP. A perfect forecast is when TP error is zero., 90593=Ang, A., Piazzesi, M., Wei, M., 2006, \"What Does the Yield Curve Tell us About GDP Growth?\" Journal of Econometrics, 127, 359-403., 46752=The dynamics of the slope of the yield curve - the term spread - has also changed significantly over time. The break date for this series is earlier than for the other two components, occurring in 1980-1981. We find that both the mean and variance of the slope display a break around this period. Prior to this date, the high mean state was around 2% and the low mean state was negative, at -1%. Differently from the other two components, both the high and low state mean values have increased after the break: the high mean to 3%, and the low mean became positive at 0.9% in the posterior period. That is, since 1980-1981 a flat curve -rather than an inversion of the curve - signals recession. This can be seen in Figure 6, which plots the smoothed probabilities of the low (flat or inverted) slope state with the extracted slope series. The term spread displays a distinct business cycle pattern - the probabilities of flat or inverted slope generally rise to around 100% towards the middle to the end of economic expansions and fall to values around 0% during recessions. The fact that the low mean state has turned positive since 1980-1981 illustrates the uncertainty on inferring subsequent recessions from changes in the term spread. For example, there were some instances - such as in 1995 or in 1998, in which the slope became flat but no recession followed. This will be discussed in more detail in section 6., 92277=Dickey, D.A. and W.A. Fuller, 1979, \"Distribution of the Estimators for Autoregressive Time Series with a Unit Root,\" Journal of the American Statistical Association, 74, 366, 427-431., 49694=Figure 7 plots the smoothed probabilities of high state for the yield factor. The probabilities consistently rise above 50% a couple of years before economic recessions - in the middle of expansions - and remain high until the beginning of recessions. Notice that the probabilities were noisy in the period between 1994 and 2001 as did the probabilities of the individual yield components described above. In fact, it would have been difficult to interpret movements of the yield curve factor at that time since it signaled the possibility of future recessions around 1995 and 1998 (probabilities increased above 80%) but no recession followed these high values of the yield curve factor. During this period, the level of the yield curve increased and the slope became flat.16 Thus, this model is still not able to extract unambiguous future recession signals when the movements in the components of the yield curve are subtle., 96585=Perron, P., 1989, \"The Great Crash, the Oil Shock and the Unit Root Hypothesis,\" Econometrica, 57, 1361-1401., 92646=Diebold, F.X. and C. Li, 2006, \"Forecasting the Term Structure of Government Bond Yields,\" Journal of Econometrics, 130, 337-364., 91048=Bernadell, C., J. Coche, and K. Nyholm, 2005, \"Yield Curve Prediction for the Strategic Investor,\" European Central Bank Working Paper 472., 90007=Andrews, D.W.K., 1993, \"Tests for Parameter Instability and Structural Change with Unknown Change Point,\" Econometrica, July, 61:4, 821-56., 91590=Chauvet, M., 1998/1999, \"Stock Market Fluctuations and the Business Cycle,\" Journal of Economic and Social Measurement, 25, 235-258., 93923=Friedman, B.M. and K.N. Kuttner, 1998, \"Indicator Properties of the Paper-Bill Spread: Lessons from Recent Experience,\" The Review of Economics and Statistics, 80, 34-44., 92981=Dotsey, M., 1998, \"The Predictive Content of the Interest Rate Term Spread for Future Economic Growth,\" Federal Reserve Bank of CityplaceRichmond, Economic Quarterly, 84, 31-51., 95964=Murphy, A. 1988, \"Skill Scores based on the Mean Square Error and their Relationships to the Correlation Coefficient,\" Monthly Weather Review, 116, 2417-2424., 91216=Brier, G.W. and R.A. Allen, 1951, \"Verification of Weather Forecasts;\" in: T.F. Malone (ed.) Compendium of Meteorology; American Meteorology. Soc. 841-848., 91760=Chauvet, M. and S. Potter, 2002, \"Predicting Recessions: Evidence from the Yield Curve in the Presence of Structural Breaks,\" Economics Letters, 77, 2, 245-253., 90376=Ang, A., Piazzesi, M., 2003, \"A No-Arbitrage Vector Autoregression of Term Structure Dynamics with Macroeconomic and Latent Variables,\" Journal of Monetary Economics, 50, 745-787., 95111=Harvey, C., 1988, \"The Real Term Structure and Consumption Growth,\" Journal of Financial Economics 22, 305-334., 96308=Nyholm, K., 2007, \"A New Approach to Predicting Recessions,\" Economic Notes, 36, 27-42., 93515=Estrella, A. and F.S. Mishkin, 1998, \"Predicting country-regionplaceU.S. recessions: Financial Variables as Leading Indicators,\" The Review of Economics and Statistics, 80, 45-61., 94516=Gurkaynak, R.S., B. Sack, and J.H. Wright, 2007, \"The country-regionplaceU.S. Treasury Yield Curve: 1961 to the Present.\" Journal of Monetary Economics, 24, 8, 2291-2304., 97404=Wright, J., 2006, \"The Yield Curve and Predicting Recessions,\" Federal Reserve Board, Washington, Working Paper no. 2006-7., 45835=The curvature of the yield curve also shows changes before and after 1990. Before 1990, the high and low values were around 1.3% and 0.2%, respectively. After this point, the high mean decreases to 0.3%, whereas the low mean of the curvature becomes negative, decreasing to -1.3%. Figure 5 shows the probabilities of low mean state and the curvature series. In contrast with the level, it is the low mean state of the curvature that is associated with economic recessions. In particular, the probabilities of low mean increase (as the curvature decreases or becomes negative) right before or during recessions. Notice that after 1990-1991 and the 2001 recessions, the probabilities remain high even after the recessions were over and until the middle of the subsequent expansions. This and other features of the curvature make it a less reliable leading indicator of recessions, as discussed in section 6., 94724=Hamilton, J.D., 1989, \"A New Approach to the Economic Analysis of Nonstationary Time Series and Business Cycles,\" Econometrica ,57, 357-384., 190980=The data on is released in the middle of the month with information for the previous month. We use real time data on starting with the vintage 1971:9, which includes the value for 1971:8 and ending with the vintage 2004:1, which includes the value for 2003:12. Estimation Period: 1971:M8-1999:12. Forecast Period: 2000:1-2003:12. Numbers in bold indicate the smallest loss among all models for the particular forecast horizon., 96433=Phillips, P. and P. Perron, 1988, \"Testing for a Unit Root in Time Series Regression,\" Biometrika, 75, 2, 335-346., 95741=McConnell, M. and G. Perez-Quiros, 2000, \"Output Fluctuations in the country-regionplaceUnited States: What Has Changed Since the Early 1980s?\", American Economic Review, 90, 1464-1476., 95604=Kim, C.-J., 1994, \"Dynamic Linear Models with Markov-Switching,\" Journal of Econometrics, 60, 1-22., 96941=Stock, J.H. and M.W. Watson, 2003, \"Forecasting Output and Inflation: The Role of Asset Prices,\" Journal of Economic Literature, 41, 3, 788-829.Journal of Monetary Economics 24(8), November 2007, 2291-230, 92813=Diebold, F.X., G.D. Rudebusch, and B. Aruoba, 2006, \"The Macroeconomy and the Yield Curve,\" Journal of Econometrics, 131, 309-338., 59444=The probit model of the yield slope is a popular framework to forecast recessions. Recent literature has shown, however, the predictive power of the yield curve has decreased over time. Chauvet and Potter (2002, 2005) relate this evidence to the presence of structural breaks in the relationship between the yield curve and the economy. Figure 10 plots the probabilities of recessions from the probit specification (Model 4). As it can be seen in Figure 10 and Tables 5 and 6, the probit specification signals all peaks and troughs before the 1990 recession, but misses all business cycle turning points afterwards, in-sample and out-of-sample. The probabilities of recession do not rise above the 50% threshold before or during the last three recessions., 97201=Stock, J. and M. Watson, 1989, \"New Indices of Coincident and Leading Indicators,\" In O. Blanchard and S. Fischer ed. NBER Macroeconomic Annual, CityplaceCambridge, MIT Press, 90890=Bai, J. and P. Perron, 1998, \"Estimating and Testing Linear Models with Multiple Structural Changes, Econometrica, 66, 47-78., 94355=Granger, C.W.J., 1969, \"Prediction with a Generalized Cost of Error Function,\" Operational Research Quarterly, 20, 199-207., 53126=The main difference between the yield-economy factor extracted from the joint model of the yield curve components and economic information and the factor extracted only from the yield components is that the smoothed probabilities of high state from the yield-only factor remain high and display two false signals during the mid-1990s, while the ones from the yield-economy factor do not give any false signals during this period and only increase before the 2001 recession. Thus, by including the relationship between the bonds market and the real economy, we obtain a factor that more accurately anticipates economic recessions., 94902=Hamilton, J.D. and D.H. Kim, 2002, \"A Re-Examination of the Predictability of Economic Activity Using the Yield Spread,\" Journal of Money, Credit and Banking, 34, 340-344., 57379=The level of the yield curve (Model 1) misses 3 out of 5 peaks and 3 out of 4 troughs in-sample, while the curvature of the yield curve (Model 2) misses 2 peaks and 3 troughs in-sample. Note that the probabilities of a recession from the level series remained above 50% from 1994 to 2001, giving very mixed signals of a recession since the early stages of the longest expansion in the country-regionplaceU.S. history. This is related to the fact that the level series decreased substantially in the last two decades, which contributes to confound the low and high state phases compared to previous decades. The worst performance is from model 2. In addition to missing many turning points, the curvature also signals 2 false peaks and 2 false troughs. As it can be seen in Figure 5, these false signals took place in 1976-1978 and in 1984-1989. The forecasting performance of Models 1 and 2 is also poor out-of-sample, with the level missing 1 out of 2 peaks and the curvature missing 1 out of 1 recession trough., 90761=Bai, J., 1997, \"Estimating Multiple Breaks One at a Time,\" Econometric Theory, 13, 315-352., 92115=Chib, S., 1998, \"Estimation and Comparison of Multiple Change-Point Models,\" Journal of Econometrics, 86, 22, 1998, 221-241., 44739=The level, curvature, and slope of the yield curve switch between low and high values but these values are not stable over time. In particular, the level of the yield curve shows striking changes pre and post 1990. The high mean value was 10.1% whereas the one for the low mean state was 5.5% before 1990. After 1990, the mean in both states decreases substantially, with the high mean equal to 5.4% and the low mean equal to 3%. This can be visualized in Figure 4, which plots the level of the yield curve and the smoothed probabilities of the high level state. Notice that the high level state is the one that predicts future recessions - the probabilities indicate that this state generally occurs from the middle of an expansion until a couple of months before the beginning of recessions. The exception is during the period of the Great Inflation between 1978 and 1985, in which the probabilities remain high even during recessions. The estimated probabilities of the Markov states for the level are consistent with the dynamics of inflation expectations over the business cycle.}",
    "lastModified": "Tue, 14 May 2013 18:19:41 GMT",
    "textBeforeTable": "Yates, J.F. (1982), \"External Correspondence: Decompositions of the Mean Probability Score,\" Organizational Behavior and Human Performance, 30,132-156. Wright, J., 2006, \"The Yield Curve and Predicting Recessions,\" Federal Reserve Board, Washington, Working Paper no. 2006-7. Stock, J. and M. Watson, 1989, \"New Indices of Coincident and Leading Indicators,\" In O. Blanchard and S. Fischer ed. NBER Macroeconomic Annual, CityplaceCambridge, MIT Press Stock, J.H. and M.W. Watson, 2003, \"Forecasting Output and Inflation: The Role of Asset Prices,\" Journal of Economic Literature, 41, 3, 788-829.Journal of Monetary Economics 24(8), November 2007, 2291-230 Senyuz, Z. (2008) \"Essays on Nonlinear Modeling of Real and Financial Markets with Applications to country-regionplaceU.S. and International Data\", UCR Ph.D. Dissertation. Perron, P., 1989, \"The Great Crash, the Oil Shock and the Unit Root Hypothesis,\" Econometrica, 57, 1361-1401. Phillips, P. and P. Perron, 1988, \"Testing for a Unit Root in Time Series Regression,\" Biometrika, 75, 2, 335-346. Nyholm, K., 2007, \"A New Approach to Predicting Recessions,\" Economic Notes, 36, 27-42. Nelson, C.R. and A.F. Siegel, 1987, \"Parsimonious Modeling of Yield Curves,\" Journal of Business, 60, 473-489. Murphy, A. 1988, \"Skill Scores based on the Mean Square Error and their Relationships to the Correlation Coefficient,\" Monthly Weather Review, 116, 2417-2424. McConnell, M. and G. Perez-Quiros, 2000, \"Output Fluctuations in the country-regionplaceUnited States: What Has Changed Since the Early 1980s?\", American Economic Review, 90, 1464-1476. Kim, C.-J., 1994, \"Dynamic Linear Models with Markov-Switching,\" Journal of Econometrics, 60, 1-22. Haubrich, J.G. and A.M. Dombrosky, 1996, \"Predicting Real Growth Using",
    "textAfterTable": "- - - significant at the 10% level, significant at the 5% level, significant at the 1% level. Table 2: Maximum Likelihood Estimates for the Univariate Markov Switching (MS) Model for DIP Parameter Estimates 4.13 (Standard Error) (0.16) -4.24 (Standard Error) (0.42)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}