{
    "relation": [
        [
            "Release",
            "Release 2.0",
            "Release 3.0",
            "Release 3.2",
            "Release 3.3.0",
            "Release 3.4.0",
            "Release 3.5.0",
            "Release 3.6.0",
            "Release 3.7.0",
            "Release 3.8.0",
            "Release 3.9.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "No modification.",
            "No modification.",
            "No modification.",
            "No modification.",
            "The area-sorted keyword was added.",
            "The all keyword was added.",
            "No modification.",
            "No modification.",
            "No modification."
        ]
    ],
    "pageTitle": "OSPF Commands on Cisco IOS XR Software - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r3-9/routing/command/reference/rr39crs1book_chapter4.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366452583,
    "recordOffset": 366346403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{470208=(Optional) Overrides the external-lsa metric with the max-metric value.The overriding metric argument specifies the number of in-summary-LSAs. The range is 1 to 16777215>. The default is 16711680., 1006518=172.16.1.53, 474491=(Optional) specifies the number of in summary-LSAs. The range is 1 to 16777215. The default is 16711680., 841529=Maximum number of events per queue. Events are dropped when the priority queue size exceeds this value. Range is 1000 to 30000., 1005887=172.31.97.53, 431179=The following example shows how the OSPF routing process 109 defines four OSPF areas (0, 2, 3, and 10.9.50.0), and associates an interface with each area:, 1034049=(Optional) Displays information about the opaque Type 10 LSAs. Type 10 denotes an area-local scope. Refer to RFC 2370 for more information on the opaque LSA options., 464066=The following example shows how to configure the OSPF instance to accept 12000 nonself-generated LSAs in the global routing table, and 1000 nonself-generated LSAs in VRF V1., 938249=The following example shows how to assign the IP address of 172.20.10.10 to the OSPF process 109:, 643411=(Optional) Specifies an unsigned integer value (in seconds) reflecting the poll interval. RFC 1247 recommends that this value be much larger than the hello interval. The poll-interval keyword does not apply to point-to-multipoint interfaces., 1006986=Packets destined for 172.16.1.53 are sent over GigabitEthernet interface 3/0/0/0., 77129=To modify or remove the area, the area-id argument format must be the same as the format used when creating the area. Otherwise, even if the actual 32-bit value matches, the area is not matched. For example, if you create an area with an area-id of 10 it would not match an area-id of 0.0.0.10., 124072=The following example shows how to set the reference value for the auto cost calculation to 1000 Mbps:, 492199=Number of interfaces. Range is 1 to 1024., 348440=The following example shows how to prevent OSPF routes from the 172.17.10.0 network from being installed if they are learned in area 0:, 475054=overriding-metric :16711680}",
    "textBeforeTable": "Command History EXEC Command Modes All neighbors Command Default (Optional) Specifies that all neighbors are grouped by area. area-sorted (Optional) Displays all neighbors given in detail (lists all neighbors). detail (Optional) Neighbor ID. neighbor-id For more information about the syntax for the router, use the question mark (?) online help function. Use the show interfaces command to see a list of all interfaces currently configured on the router. Note    Physical interface or virtual interface. interface-path-id Interface type. For more information, use the question mark (?) online help function. type (Optional) Area ID. If you do not specify an area, all areas are displayed. area-id",
    "textAfterTable": "Usage Guidelines To use this command, you must be in a user group associated with a task group that includes the proper task IDs. If you suspect user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Task ID Task ID Operations ospf read Examples The following is sample output from the show ospf neighbor command showing two lines of summary information for each neighbor:  RP/0/RP0/CPU0:router# show ospf neighbor Neighbors for OSPF Neighbor ID     Pri  State  Dead Time  Address   Interface 192.168.199.137 1 FULL/DR 0:00:31 172.31.80.37 GigabitEthernet 0/3/0/2     Neighbor is up for 18:45:22 192.168.48.1 1 FULL/DROTHER 0:00:33 192.168.48.1 GigabitEthernet 0/3/0/3     Neighbor is up for 18:45:30 192.168.48.200 1 FULL/DROTHER 0:00:33 192.168.48.200 GigabitEthernet 0/3/0/3     Neighbor is up for 18:45:25 192.168.199.137 5 FULL/DR 0:00:33 192.168.48.189 GigabitEthernet 0/3/0/3     Neighbor is up for 18:45:27 This table describes the significant fields shown in the display.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}