{
    "relation": [
        [
            "Patent application number",
            "20090073663",
            "20090197478"
        ],
        [
            "Description",
            "Wrap-around overmold for electronic assembly - An improved overmolded electronic assembly includes a backplate provided with a recessed edge, a circuit substrate on the backplate, at least one electronic component mounted on the circuit substrate, conductive traces on the circuit substrate which together with the electronic component(s) defines a circuit device, an electrical connector, and an overmold body that has peripheral edges that wrap around sides of the backplate and onto the edge recesses. The resulting over wrap feature eliminates delamination problems that would otherwise occur during thermal cycling of the electronic assembly, improves corrosion resistance at connector-to-backplate interfaces, and enhances securement of the printed circuit board assembly and electrical connector to the assembly.",
            "Interlocking overmold for electronic assembly - An improved overmolded electronic assembly includes a backplate, a circuit substrate on the backplate, at least one electronic component mounted on the circuit substrate, conductive traces on the circuit substrate which together with the electronic component(s) defines a circuit device, an electrical connector having a thermoplastic body and electrical conducting elements embedded in and extending through the thermoplastic body to define internal and external connectors, and an overmold body that is mechanically interlocked with protuberances integrally formed on the thermoplastic body of the electrical connector. The mechanical interlocking relationship between the overmold body and the thermoplastic body of the electrical connector eliminates or minimizes delamination problems that could otherwise occur during thermal cycling, reduces or eliminates stringent control on cleanliness and texture of surfaces of the thermoplastic body of the electrical connector that interface with the overmold body, and eliminate or reduce costs associated with overcoming problems associated with delamination during thermal cycling."
        ],
        [
            "Published",
            "03-19-2009",
            "08-06-2009"
        ]
    ],
    "pageTitle": "Mandel, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mandel-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440954559,
    "recordOffset": 440934509,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Larry M. Mandel, Noblesville, IN US 04-17-2014 EXERCISE BELT - An holistic exercise method for enhancing urine retention in a person having reduced urine retention and exercise belt therefore. The method includes: 20140106946 Published Description Patent application number Justin Barry Mandel, Clearwater, FL US 09-27-2012 Holistic repetitive exercise and exercise belt for overactive bladder urine normalization - An holistic exercise method for enhancing urine retention in a person having reduced urine retention and exercise belt therefore. The method includes: 20120245001 Published Description Patent application number Justin Barry Mandel, New York, NY US 09-29-2011 THERMAL SHIELD FOR SOLAR RECEIVER - A solar receiver system includes a panel mounted to a multiple of standoffs such that the panel is spaced away from the support structure to provide convective cooling. 20110232629 Published Description Patent application number Johnny Mandel, West Hills, CA US 08-25-2011 Offer Delivery System - An offer delivery system provides a mechanism for coordinating presentation of offers to customers that may originate from multiple different sources and that may be delivered to the customers over different channels. The systems makes use of rules to prioritize, select, and time the delivery of offers to any particular customer, allocate limited resources in the channels to deliver offers to a set of customers, and provide",
    "textAfterTable": "Patent applications by Larry M. Mandel, Noblesville, IN US Mark Mandel, Victoria, MN US Patent application number Description Published 20100006473 CONVERTIBLE CONTAINER FOR ELECTRONIC DEVICES - A container for an electronic device has pivotally coupled first and second portions. The first portion is configured to house the electronic device and has an opening for receiving the electronic device and for displaying the electronic device when the container is configured in a first configuration. The second portion is configured to act as a mount for mounting the container on a surface when the container is configured in the first configuration and the first portion is displaying the electronic device. The second portion is further configured to cover the opening in the first portion, and thus the electronic device, when the container is configured in a second configuration. 01-14-2010 Michael Mandel, Brookline, MA US Patent application number Description Published 20150142429 Recording and Entertainment System - A recording and entertainment system is provided. A mobile kiosk is capable or being outfitted with one or more cameras for capturing visual content, an audio recording system, a display device, a computer to control",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}