{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "I pay for my school tuition all on my own and I can personally say that it is worth every penny. I can see where my money is going and that it's put to good use.",
            "When it comes to fun the opportunities are endless. We have an awesome rec center that includes indoor basketball courts, soccer field, track, work out areas, classrooms for things such a Zumba, and our very own swimming pool and hot tubs. There are several groups on campus for any area of interest!",
            "From dinning halls to the commons there is tons of food options at Indiana State! Also since its in Terre Haute there are also many restaurants available near by.",
            "As a commuter I can't give you a personal response on this topic, however I have several friends who live in the dorms who love it!",
            "Depending on your major your classes and level of academic rigor will vary. Indiana State has a wide range of classes that you can take so that they can teach you at your level. Whether your a natural born genius, or someone with a good strong work ethic trying to get through school. Indiana State is there to challenge you and push you to be your very best!",
            "Indiana State University is an excellent choice for any student who is looking for that home away from home feel. Its small enough that you feel at home but big enough that you're always meeting new people. Indiana State's number one priority is its students, they do their best to prepare you for the upcoming challenges of adulthood."
        ]
    ],
    "pageTitle": "Indiana State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-State-University/reviews?_escaped_fragment_=/show/28167",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882497823,
    "recordOffset": 882398540,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{551623=I rate this so low because ISU is a very crowded place. Starting Spring 2014, they raffle off dorm rooms by lottery. Freshmen are guaranteed housing their first semester, but the rest of the student body may be left to find off campus housing., 253595=Terre Haute is a small close-knit community with plenty of activities. In town, there are sporting events, concerts, and festivals. Some events are free and are in walking distance from campus. Just a few miles north of Terre Haute is the home of the 4th largest festival in the United States -- the Parke County Covered Bridge Festival every October, although festival dates may be in conflict with Homecoming festivities., 172847=we march through the fountain., 244725=We currently do not have all black sororities on campus. But in the Fall of 2012 the AKA's and Delta's will be back on campus. I will plan on joining the a sorority in the FALL of 2012., 585779=© 2015, Cappex.com, LLC, 185618=depending on your major your tuition is pretty high. as of fall of 2012 the housing prices are increasing by 200 dollars. the financial aid office is almost always busy so if you want to talk to them you must take out a lot of time in your day., 130668=Apply in September it is free to apply then., 204048=If you are in the freshman dorms and its August plan for it be a hot semester. You cannot ask for a better location at the same time if you are in the towers., 122081=If you are considering coming to Indiana State, here's a few tips I think you may find very useful. During the process of choosing your meal plan, I would advise you choose the Blue Plan. It comes with over 1300 credits and almost $300 in Commons Cash. I highly recommend this plan because it provides you with this amount every semester and you have less of a chance of being broke when the end of the semester approaches. Also, try to avoid getting into fights. Although sometimes it hurts to walk away from a fight, you must realize that your future is at stake. Also, try attending some of the campus activities. If you attend them, there's a good chance you'll be coming out of it with a new shirt, a new water bottle, or some very unique gadget!, 245205=I am also in an organization call Sister's TOO, it is a nice organization for young female. Currently it is an all black organization, but we are trying to expand it for all female on ISU campus, for the FALL 2012. We do many different activities like community service, pool parties, STD's/Safe Sex meetings and etc., 495718=We have a beautiful fountain located in the center of campus. All freshmen also take part in the March Through the Arch during their first weekend on campus.}",
    "textBeforeTable": "08/09/2009 Reviewer is A current student here. 17 out of 20 people found this review useful. 1 of 138 Nursing Student Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "08/02/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 2 of 138 Categories Comments Great for these types of students This is a great school for people from small towns. The city is large enough to give you a lot of options for entertainment and small enough to make you feel comfortable. Tips for prospective students Meet your roommate before you move in. It is easier to change before you move in than after. Make sure of your career objective if your not sure take a general education and take 1 class a semester of something that you may want to study. You may discover something your naturally good at and a new career. Bang for the buck Since the fees are the same for 12credit hours up to 18 credit hours you can set your course load to your ability not to your pocket book. The room and board fees are comparable to any in the area and you can use the credits for your meals at the student union at places like Taco Bell when you miss",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}