{
    "relation": [
        [
            "Timestamp",
            "2014-12-20",
            "2014-12-20",
            "2012-03-04",
            "2012-03-04"
        ],
        [
            "Action",
            "Added",
            "Deleted",
            "Added",
            "Added"
        ],
        [
            "Category",
            "RELATION",
            "RELATION",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "part of GO:0070301 (cellular response to hydrogen peroxide)",
            "is a GO:0070301 (cellular response to hydrogen peroxide)",
            "is a GO:0070301 (cellular response to hydrogen peroxide)",
            "is a GO:0061417 (negative regulation of transcription from RNA polymerase II promoter in response to oxidative stress)"
        ]
    ],
    "pageTitle": "GO:0036129 negative regulation of transcription from RNA polymerase II promoter in response to hydrogen peroxide",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0036129",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418744451,
    "recordOffset": 418720232,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121238=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 121371=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "Usage of this term is subject to the following annotation guidelines: Annotation Guidance GO:0036129 Wiki Page GONUTS Any process that decreases the frequency, rate or extent of transcription from an RNA polymerase II promoter as a result of a hydrogen peroxide (H2O2) stimulus. Definition Biological Process Ontology negative regulation of transcription from RNA polymerase II promoter in response to hydrogen peroxide Name GO:0036129 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0036129: Term has no children Protein Annotation Display ID Mapping Filter",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}