{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Lightning-Rods-Kits-10kits-O-On3-On30-Sn3-Sn2-Doctor-Bens-SCALE-BRAND-NEW/231304601842?hash=item35dad420f2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 409600167,
    "recordOffset": 409550258,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80721=Using Industrial Weathering Pigments COPYRIGHT 2008 DEBEN LLC, 61255=It was in Boston, Massachusetts, in 1746 that Benjamin Franklin first stumbled upon other scientists' electrical experiments. He quickly turned his home into a little laboratory, using machines made out of items he found around the house. During one experiment, Ben accidentally shocked himself. By 1750, in addition to wanting to prove that lightning was electricity, Franklin began to think about protecting people, buildings, and other structures from lightning. This grew into his idea for the lightning rod., 59881=Some folks like to leave the shiny brass rod alone and that is okay. But realistically, farmers, factories and many others just used metal rods which many times were bare, common steel—that always rusts. I prefer this look because it gives me another reason to have rust running down the roof for additional detail. You can always us the Doctor Ben’s Industrial Pigment #1132 Dark Patina to create that green look from brass, bronze and copper that washes off over time., 61969=Lightning rod with glass balls have long been part of the American rural landscape. Some were made as early as 1840. They were originally sold as decorative ornaments for lightning rods and are found in a wide range of shapes and colors that also served to provide visual sign of a lightning strike (when the rod is struck the glass ball shatters and falls off, indicating to the owner which rod got struck and that they should check it and the grounding wire for damage)., 62642=The glass balls were usually about four and a half inches in diameter. There are some 34 shapes or styles of lightning rod balls. The balls were sold by salesmen going from farm to farm in horse drawn wagons from 1870 until the Great Depression closed businesses.}",
    "textBeforeTable": "Payment details 15% Restocking Fee-Return Product Authorization Number Required for Return-For a detailed Return Policy, Privacy Policy, Shipping Preference & Contact Information, please visit our \"About Us page. Thank you, DEBENLLC Publications & Products Return policy details The buyer is responsible for return shipping costs. Money Back 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy Seller charges sales tax for items shipped to: GA (6.0%). receiving cleared payment - opens in a new window or tab. Will usually ship within 1 business day of",
    "textAfterTable": "Seller's payment instructions WE COMBINE MULTIPLE PURCHASES! PADDED ENVELOPE-Please request a \"Combined Total\" for more than one purchase before you check out. THIS SAVES YOU MONEY & us time. We charge shipping by actual weight & this lets us know to give you the best shipping price possible! Thank you very much for your business & for choosing Us for your hobby product needs. Sincerely, Debbie & Richard Bendever, www.DEBENLLC.com time left Current bid amount + Shipping amount Bid Count time left",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}