{
    "relation": [
        [
            "Parameter",
            "Destination Destination/Mask",
            "Gateway",
            "Flags",
            "Use",
            "Interface"
        ],
        [
            "Description",
            "Specifies the host that is the destination endpoint of the route. Note that the IPv6 routing table shows the prefix for a 6to4 tunnel endpoint (2002:0a00:3010:2::/64) as the route destination endpoint.",
            "Specifies the gateway to use for forwarding packets.",
            "Indicates the current status of the route. The U flag indicates that the route is up. The G flag indicates that the route is to a gateway.",
            "Shows the number of packets sent.",
            "Indicates the particular interface on the local host that is the source endpoint of the transmission."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19253-01/816-4554/ipv6-admintasks-1/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76816503,
    "recordOffset": 76792760,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15526=mtu 1500, 76796=Refer to RFC 1761, Snoop Version 2 Packet Capture File Format for details of the snoop capture file., 15596=Shows that this interface has a maximum transfer size of 1500 octets. , 19572=This example shows entries for a host with solely a primary network interface, qfe0. Nevertheless, the ifconfig output shows that three forms of addresses are currently assigned to qfe0: loopback (lo0), IPv4 (inet), and IPv6 (inet6). In the IPv6 section of the output, note that the line for interface qfe0 displays the link-local IPv6 address. The second address for qfe0 is displayed on the qfe0:1 line.}",
    "lastModified": "Thu, 06 Jan 2011 08:53:06 GMT",
    "textBeforeTable": "The following table lists other miscellaneous tasks to administer the network after initial configuration, such as displaying network information. The table includes a description of what each task accomplishes and the section in the current documentation where the specific steps to perform the task are detailed. Major TCP/IP Administrative Tasks (Task Map) To configure IPv6 and create a dual-stack network environment, refer to Chapter 7, Configuring an IPv6 Network (Tasks). To plan an IPv6 implementation, refer to Chapter 4, Planning an IPv6 Network (Tasks). The tasks assume that you have an operational TCP/IP network at your site, either IPv4-only or dual-stack IPv4/IPv6. If you want to implement IPv6 at your site but have not done so, refer to following chapters for more information: Administering Default Address Selection Monitoring Packet Transfers With the snoop Command Displaying Routing Information With the traceroute Command Administering and Logging Network Status Displays Probing Remote Hosts With the ping Command Monitoring Network Status With the netstat Command Monitoring the Interface Configuration With the ifconfig Command Major TCP/IP Administrative Tasks (Task Map) This chapter contains tasks for administering a TCP/IP network. The following topics are covered:",
    "textAfterTable": "Display the status of network interfaces.  Monitor the performance of network interfaces, which is useful for troubleshooting transmission problems.  How to Display Network Interface Status Display packet transmission status.  Monitor the state of packets as they are sent over the wire.  How to Display the Status of Transmissions for Packets of a Specific Address Type Control the display output of IPv6-related commands.  Controls the output of the ping, netstat, ifconfig, and traceroute commands. Creates a file that is named inet_type. Sets the DEFAULT_IP variable in this file. How to Control the Display Output of IP-Related Commands Monitor network traffic.  Displays all IP packets by using the snoop command. How to Monitor IPv6 Network Traffic Trace all routes that are known to the network's routers.  Uses the traceroute command to show all routes. How to Trace All Routes Monitoring the Interface Configuration With the ifconfig Command You use the ifconfig command to manually assign IP addresses to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}