{
    "relation": [
        [
            "Field",
            "Package Name",
            "New Class Name"
        ],
        [
            "Description",
            "Choose an existing package or enter a new package name. If blank, Workbench uses the default package name.",
            "Enter a class name. The New Class Name must be unique within the package."
        ]
    ],
    "pageTitle": "Using Workbench (ELUG) - Eclipsepedia",
    "title": "",
    "url": "http://wiki.eclipse.org/index.php?title=Using_Workbench_(ELUG)&oldid=101715",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 258530423,
    "recordOffset": 258489189,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225402=Copyright © 2014 The Eclipse Foundation. All Rights Reserved.}",
    "textBeforeTable": "Use the following information to enter data in each field on the Add New Class dialog box: Enter data in each field on the Add New Class dialog box and click OK. Workbench will add the new class to the project in the Navigator. Select the project in the Navigator and click Create New Class . You can also right-click the project in the Navigator and choose Create New Class from the context menu or choose Selected > Create New Class from the menu. Add New Class Dialog Box To create new classes and packages from within Workbench, use this procedure: How to Create Classes Using Workbench For more information on using Workbench to edit classes, see How to Create Classes. This section includes information on using Workbench to create Java classes. However, it is sometimes convenient to create and configure classes in Workbench: for example, when generating an object model from a database schema. We recommend that you develop your Java classes using an IDE such as Eclipse and import these existing classes into Workbench (see How to Import and Update Classes) How to Create Classes How",
    "textAfterTable": "For more information on using Workbench to edit classes, see How to Configure Classes. How to Configure Classes We recommend that you develop your Java classes using an IDE such as Eclipse and import these existing classes into Workbench (see How to Import and Update Classes) However, it is sometimes convenient to create (see How to Create Classes) and configure classes in Workbench: for example, when generating an object model from a database schema. This section describes using Workbench to edit classes, including the following: Configuring Class Information Configuring Class Modifiers Configuring Class Interfaces Adding Attributes Configuring Attribute Modifiers Configuring Attribute Type Information Configuring Attribute Accessing Methods Adding Methods Configuring Method Modifiers Configuring Method Type Information Configuring Method Parameters Configuring Class Information This section includes information on using the workbench to configure class information. Using Workbench To configure class and superclass information, use this procedure: Select a class in the Navigator. Its properties appear in the Editor. Click the Class Info tab in the Editor. Click the Class tab. Class Tab, Class Information Fields",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}