{
    "relation": [
        [
            "Published Date",
            "Oct 18, 2013",
            "May 16, 2013",
            "Sep 26, 2012",
            "Jul 13, 2012",
            "Nov 5, 2010",
            "Oct 21, 2009",
            "May 22, 2008",
            "Oct 19, 2007",
            "Aug 29, 2006"
        ],
        [
            "Version",
            "18 (current)",
            "17",
            "16",
            "15",
            "14",
            "11",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - MYFORTIC- mycophenolate sodium tablet, delayed release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=eed26501-890d-4ff6-88e7-6dbea4726e53",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61440623,
    "recordOffset": 61393136,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{131409=Pediatric patients with a BSA of 1.19 to 1.58 m2 may be dosed either with three Myfortic 180 mg tablets, or one 180 mg tablet plus one 360 mg tablet twice daily (1080 mg daily dose). Patients with a BSA of >1.58 m2 may be dosed either with four Myfortic 180 mg tablets, or two Myfortic 360 mg tablets twice daily (1440 mg daily dose). Pediatric doses for patients with BSA <1.19 m2 cannot be accurately administered using currently available formulations of Myfortic tablets., 132749=The recommended dose of Myfortic is 720 mg administered twice daily (1440 mg total daily dose)., 63810=MPA is metabolized principally by glucuronyl transferase to glucuronidated metabolites. The phenolic glucuronide of MPA, mycophenolic acid glucuronide (MPAG), is the predominant metabolite of MPA and does not manifest pharmacological activity. The acyl glucuronide is a minor metabolite and has comparable pharmacological activity to MPA. In stable renal transplant patients on cyclosporine, USP MODIFIED based immunosuppression, approximately 28% of the oral Myfortic dose was converted to MPAG by presystemic metabolism. The AUC ratio of MPA:MPAG:acyl glucuronide is approximately 1:24:0.28 at steady state. The mean clearance of MPA was 140 (± 30) mL/min., 65506=In vitro studies demonstrated that the enteric-coated Myfortic tablet does not release MPA under acidic conditions (pH <5) as in the stomach but is highly soluble in neutral pH conditions as in the intestine. Following Myfortic oral administration without food in several pharmacokinetic studies conducted in renal transplant patients, consistent with its enteric-coated formulation, the median delay (Tlag) in the rise of MPA concentration ranged between 0.25 and 1.25 hours and the median time to maximum concentration (Tmax) of MPA ranged between 1.5 and 2.75 hours. In comparison, following the administration of MMF, the median Tmax ranged between 0.5 and 1.0 hours. In stable renal transplant patients on cyclosporine, USP MODIFIED based immunosuppression, gastrointestinal absorption and absolute bioavailability of MPA following the administration of Myfortic delayed-release tablet was 93% and 72%, respectively. Myfortic pharmacokinetics is dose proportional over the dose range of 360 to 2160 mg., 62365=Compared to the fasting state, administration of Myfortic 720 mg with a high-fat meal (55 g fat, 1000 calories) had no effect on the systemic exposure (AUC) of MPA. However, there was a 33% decrease in the maximal concentration (Cmax), a 3.5-hour delay in the Tlag (range, -6 to 18 hours), and 5.0-hour delay in the Tmax (range, -9 to 20 hours) of MPA. To avoid the variability in MPA absorption between doses, Myfortic should be taken on an empty stomach [see Dosage and Administration (2.3)]., 150615=Warnings and Precautions, New or Reactivated Viral Infections (5.6)     9/2013, 43571=In a 104-week oral carcinogenicity study in rats, mycophenolate sodium was not tumorigenic at daily doses up to 9 mg per kg, the highest dose tested. This dose resulted in approximately 0.6 to 1.2 times the systemic exposure (based on plasma AUC) observed in renal transplant patients at the recommended dose of 1440 mg per day. Similar results were observed in a parallel study in rats performed with MMF. In a 104-week oral carcinogenicity study in mice, MMF was not tumorigenic at a daily dose level as high as 180 mg per kg (which corresponds to 0.6 times the recommended mycophenolate sodium therapeutic dose, based on body surface area)., 61198=After near equimolar dosing of Myfortic 720 mg twice daily and MMF 1000 mg twice daily (739 mg as MPA) in both the single- and multiple-dose cross-over trials, mean systemic MPA exposure (AUC) was similar., 42893=The genotoxic potential of mycophenolate sodium was determined in five assays. Mycophenolate sodium was genotoxic in the mouse lymphoma/thymidine kinase assay, the micronucleus test in V79 Chinese hamster cells, and the in vivo mouse micronucleus assay. Mycophenolate sodium was not genotoxic in the bacterial mutation assay (Salmonella typhimurium TA 1535, 97a, 98, 100, and 102) or the chromosomal aberration assay in human lymphocytes., 142377=Revised: 9/2013, 2491=T2013-79 September 2013, 83469=In the National Transplantation Pregnancy Registry (NTPR), there were data on 33 MMF-exposed pregnancies in 24 transplant patients; there were 15 spontaneous abortions (45%) and 18 live-born infants. Four of these 18 infants had structural malformations (22%). In postmarketing data (collected from 1995 to 2007) on 77 women exposed to systemic MMF during pregnancy, 25 had spontaneous abortions and 14 had a malformed infant or fetus. Six of 14 malformed offspring had ear abnormalities. Because these postmarketing data are reported voluntarily, it is not always possible to reliably estimate the frequency of particular adverse outcomes. These malformations are similar to findings in animal reproductive toxicology studies. For comparison, the background rate for congenital anomalies in the United States is about 3%, and NTPR data show a rate of 4%–5% among babies born to organ transplant patients using other immunosuppressive drugs. There are no relevant qualitative or quantitative differences in the teratogenic potential of mycophenolate sodium and MMF., 146225=To report SUSPECTED ADVERSE REACTIONS, contact Novartis Pharmaceuticals Corporation at 1-888-669-6682 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 66389=Myfortic exhibits linear and dose-proportional pharmacokinetics over the dose-range (360 to 2160 mg) evaluated. The absolute bioavailability of Myfortic in stable renal transplant patients on cyclosporine was 72%. MPA is highly protein bound (>98% bound to albumin). The predominant metabolite of MPA is the phenolic glucuronide (MPAG) which is pharmacologically inactive. A minor metabolite AcMPAG which is an acyl glucuronide of MPAG is also formed and has pharmacological activity comparable to MPA. MPAG undergoes renal elimination. A fraction of MPAG also undergoes biliary excretion, followed by deconjugation by gut flora and subsequent reabsorption as MPA. The mean elimination half-lives of MPA and MPAG ranged between 8 and 16 hours, and 13 and 17 hours, respectively., 20901=T2013-78 September 2013, 82323=In a teratology study performed with mycophenolate sodium in rats, at a dose as low as 1 mg per kg, malformations in the offspring were observed, including anophthalmia, exencephaly, and umbilical hernia. The systemic exposure at this dose represents 0.05 times the clinical exposure at the dose of 1440 mg per day Myfortic. In teratology studies in rabbits, fetal resorptions and malformations occurred at doses equal to or greater than 80 mg per kg per day, in the absence of maternal toxicity (which corresponds to about 1.1 times the recommended clinical dose, based on body surface area).}",
    "textBeforeTable": "Number of versions: 9 MYFORTIC- mycophenolate sodium tablet, delayed release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Novartis Pharmaceuticals Corporation (002147023) 02/27/2004 NDA050791 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 120 in 1 BOTTLE NDC:0078-0385-66 1 Marketing End",
    "textAfterTable": "RxNorm MYFORTIC- mycophenolate sodium tablet, delayed release RxCUI RxNorm NAME RxTTY 1 485020 mycophenolic acid 180 MG Delayed Release Oral Tablet PSN 2 485020 Mycophenolic Acid 180 MG Delayed Release Oral Tablet SCD 3 485023 mycophenolic acid 360 MG Delayed Release Oral Tablet PSN 4 485023 Mycophenolic Acid 360 MG Delayed Release Oral Tablet SCD 5 616449 Myfortic 360 MG Delayed Release Oral Tablet PSN 6 616449 Mycophenolic Acid 360 MG Delayed Release Oral Tablet [Myfortic] SBD 7 616449 Myfortic 360 MG Delayed Release Oral Tablet SY 8 616450 Myfortic 180 MG Delayed Release Oral Tablet PSN 9 616450 Mycophenolic Acid 180 MG Delayed Release Oral Tablet [Myfortic] SBD 10 616450 Myfortic 180 MG Delayed Release Oral Tablet SY Get Label RSS Feed for this Drug MYFORTIC- mycophenolate sodium tablet, delayed release To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=eed26501-890d-4ff6-88e7-6dbea4726e53 To receive all DailyMed Updates for the last",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}