{
    "relation": [
        [
            "Category",
            "Packed grains",
            "Packed flour",
            "Grain gift boxes",
            "Vacuum-packed grains",
            "Large-pack beans",
            "Large-pack rice",
            "Large-pack flour",
            "Bean-based products",
            "Fruit vinegar and juices"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Product",
            "Millet, soy bean, mung bean, black rice and corn grits, etc.",
            "Mung bean flour, corn flour, buckwheat flour and sorghum flour, etc.",
            "Millet & grains mix",
            "Millet, sorghum, sticky rice, black rice, black bean, soy bean, mung bean, black rice, etc.",
            "Soy bean, mung bean, red bean, kidney bean, black bean, etc.",
            "Millet, sorghum, coix seed, black rice, sticky rice and buckwheat rice, etc.",
            "Sorghum flour, corn four, mung bean flour, bulkwheat flour, oat flour, etc.",
            "Vegetarian chicken wings, vegetarian prawns, vegetarian bean mushroom, thick-strip bean-based noodles, thin-strip bean-based noodles and various bean-based instant noodles.",
            "Apple vinegar, jujube vinegar, grape vinegar, golden pear juice, kiwi vinegar, strawberry juice, etc."
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Weight/Unit",
            "400 to 800g",
            "800 to 2,400g",
            "400 to 425g",
            "370 to 440g",
            "25kg",
            "25kg",
            "25kg",
            "60-500g",
            "250-400g"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Unit",
            "Bag",
            "Bag",
            "Bag",
            "Bag",
            "Bag",
            "Bag",
            "Bag",
            "Bag",
            "Bottle"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1467746/000114420412026219/v311739_s1.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 685327255,
    "recordOffset": 685187811,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{176206=The Regulations on the Administration of Construction Projects Environmental Protection, as adopted by the State Council on November 18, 1998 and effective on November 29, 1998, governs construction projects and the impact such projects will have on the environment. Pursuant to the Regulations on the Administration of Construction Projects Environmental Protection, the governing body is responsible for supervising the implementation of a three tiered system that includes (i) reviewing and approving a construction project, (ii) overseeing the construction project and (iii) to inspect the finished construction project and ensure that all harmful pollutants are disposed of correctly. Manufacturing companies are required to apply for inspection with environment protection authorities upon completion of a construction project., 515073=Effective January 10, 2011, the Company appointed Mr. Michael Han to serve as the Company’s Corporate Secretary. From April 2009 through January 2011, Mr. Han served as Vice President for Beijing Jinhuanya Management Consulting Co., Ltd., a PRC company. From April 2006 through March 2009, Mr. Han previously served as Vice President and Manager of the Administration Department of General Circuits (Beijing) Ltd., a PRC company, where he was in charge of Administration, Finance, Marketing and International Sales and Business Development. From April 2001 through March 2006, Mr. Han served as Senior Key Account Manager of Shougang NEC Electronics Co., Ltd., a PRC electronics company. Mr. Han earned his Bachelors of Science degree in Metal Forming & Metal Materials from the College of Beijing Iron & Steel Technology and his Master’s in Business Administration degree from Tsinghua University. There is no family relationship between Mr. Han and any of the other officers and directors of the Company., 150039=On July 21, 2005, the PRC government changed its decade old policy of pegging its currency to the U.S. currency. Under that policy, the Renminbi is permitted to fluctuate within a narrow and managed band against a basket of certain foreign currencies. This change in policy has resulted in an approximate 21% appreciation of the Renminbi against the U.S. dollar between 2005 and 2008. However, the PRC government decided to repeg the Renminbi to U.S. Dollars in response to the financial crisis in 2008.  On June 19, 2010, China ended the peg of Renminbi to the U.S. Dollar which allowed a greater flexibility of its exchange rate.  There remains significant international pressure on the appreciation of the Renminbi against the U.S. Dollar.  To the extent any of our future revenues are denominated in currencies other than the United States dollar, we would be subject to increased risks relating to foreign currency exchange rate fluctuations which could have a material adverse affect on our financial condition and operating results since operating results are reported in United States dollars and significant changes in the exchange rate could materially impact our reported earnings., 395518=2010 Share Exchange and Preferred Stock Financings, 476347=Research and development expenses were $98,393 and $73,860 for the years ended December 31, 2011 and 2010, respectively., 435582=We purchase raw material directly from farmers, farmer’s agents and other various suppliers. We did not have any suppliers who accounted for 10% or more of total purchases of raw materials or 10% or more of total trade payables during the fiscal years ended December 31, 2011 and 2010., 76947=We also entered into a Lock-Up Agreement with the Investors, pursuant to which the common stock owned by the management of City Zone was locked-up for the six (6) month period following the effectiveness of the Registration Statement is declared effective. The Lock-Up Agreement expired on April 21, 2011., 163101=On March 16, 2007, the National People’s Congress, approved and promulgated the PRC Enterprise Income Tax Law. The PRC Enterprise Income Tax Law took effect on January 1, 2008. Under the PRC Enterprise Income Tax Law, foreign investment entities and domestic companies are subject to a uniform tax rate of 25%. The PRC Enterprise Income Tax Law provides a five-year transition period starting from its effective date for those enterprises which were established before the promulgation date of the PRC Enterprise Income Tax Law and which were entitled to a preferential lower tax rate under the then-effective tax laws or regulations., 199926=The following table presents certain information with respect to our equity compensation plan as of December 31, 2011:, 380710=In May 2011, FASB issued an amendment (ASU No. 2011-05) to Comprehensive Income (ASC Topic 220). The amendment require that all nonowner changes in stockholders’ equity be presented either in a single continuous statement of comprehensive income or in two separate but consecutive statements. In the two-statement approach, the first statement should present total net income and its components followed consecutively by a second statement that should present total other comprehensive income, the components of other comprehensive income, and the total of comprehensive income. The Company had adopted this guidance to our consolidated financial statements as of and for the year ended December 31, 2011., 545545=On August 19, 2010, the Board of Directors of the Company approved the adoption of the procedures for the selection of director nominees.  Pursuant to NASDAQ Rule 5605(e)(1), a majority of the independent directors shall recommend and select the director nominees., 221896=On April 27, 2012, we had 10,566,766 shares of common stock issued and outstanding to 84 holders of record, and the closing price of our common stock as quoted on the OTC Markets-OTC Pink was $1.65 per share.  The number of record holders does not include beneficial owners of common stock whose shares are held in the names of banks, brokers, nominees or other fiduciaries., 80844=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Hong Wang, a Director of the Company, has the option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 120 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Wang will indirectly (through his ownership of Expert Venture Limited) own and control 664,142 shares, which equal 4.66% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Wang. As a result, the number of shares of beneficial ownership has included 664,142 shares of common stock that have become transferrable to Mr. Wang after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010., 285527=Cost of goods sold mainly consisted of cost of raw materials, labor, utilities, manufacturing costs, manufacturing related depreciation and packaging costs. Our cost of goods sold increased by 245.4% from $63.3 million in the year ended December 31, 2010 to $218.5 million for the year ended December 31, 2011, due to increases in sales volume and purchase prices. Our total sales volume for the year ended December 31, 2011 increased to 639, 168 tons, or 155.2%, from 250,410 tons for the year ended December 31, 2010., 1045026=On February 25, 2011, Deyufarm received an additional capital injection of $4,495 (RMB 28,782) from SBCVC for 0.02% of Deyufarm's equity interest., 747015=On April 27, 2010, we entered into a Share Exchange Agreement (“Exchange Agreement”) by and among (i) City Zone Holdings Limited, an emerging organic and non-organic agricultural products distributor in Shanxi Province, China, engaged in procuring, processing, marketing and distributing various grain and corn products (“City Zone”), (ii) City Zone’s shareholders, including, without limitation, Expert Venture Limited, a company organized under the laws of the British Virgin Islands and the selling stockholder hereunder and (iii) certain of our principal shareholders, whereby Expert Venture Limited and the other City Zone shareholders transferred to us all of the shares of City Zone in exchange for the issuance of an aggregate 8,736,932 shares of our common stock, of which 6,238,205 were issued to Expert Venture Limited. As a result of the Exchange Agreement, Expert Venture Limited and other minority shareholders of City Zone owned a majority of our outstanding shares, City Zone became our wholly-owned subsidiary and we acquired 100% of the processing and production operations of City Zone and its subsidiaries, the business and operations of which now constitutes the primary business and operations of the Company.   The 250,000 shares of our common stock being registered hereunder were part of the issuance by us to Expert Venture Limited pursuant to the Exchange Agreement., 71031=On April 27, 2010, we entered into a Share Exchange Agreement (“Exchange Agreement”) by and among (i) City Zone Holdings Limited, an emerging organic and non-organic agricultural products distributor in Shanxi Province, China, engaged in procuring, processing, marketing and distributing various grain and corn products (“City Zone”), (ii) City Zone’s shareholders, including, without limitation, Expert Venture Limited, a company organized under the laws of the British Virgin Islands and the selling stockholder hereunder and (iii) certain of our principal shareholders, whereby Expert Venture Limited and the other City Zone shareholders transferred to us all of the shares of City Zone in exchange for the issuance of an aggregate 8,736,932 shares of our common stock, of which 6,238,205 shares were issued to Expert Venture Limited. As a result of the Exchange Agreement, Expert Venture Limited and other minority shareholders of City Zone owned a majority of our outstanding shares, City Zone became our wholly-owned subsidiary and we acquired 100% of the processing and production operations of City Zone and its subsidiaries, the business and operations of which now constitutes the primary business and operations of the Company.   The 250,000 shares of our common stock being registered hereunder were part of the issuance by us to Expert Venture Limited pursuant to the Exchange Agreement., 365126=The Company’s revenue is recognized net of value-added tax (VAT), reductions to revenue for estimated product returns, and sales discounts based on volume achieved in the same period that the related revenue is recorded.  The estimates are based on historical sales returns, analysis of credit memo data, and other factors known at the time.  For the years ended December 31, 2011 and 2010, sales discounts from continuing operations were $70,987 and $0, respectively.  Commencing from year 2010, the Company had terminated the offering of sales discounts to customers., 379747=In May 2011, FASB issued an amendment (ASU No. 2011-04) to Fair Value Measurement (ASC Topic 820). In 2006, the FASB and the International Accounting Standards Board (IASB) published a Memorandum of Understanding, which has served as the foundation of the Board’s efforts to a common set of high quality global accounting standards. Consistent with the Memorandum of Understanding and the Board’s commitment to achieving the goal, the amendments in this Update are the result of the work by the FASB and the IASB to develop common requirements for measuring fair value and for disclosing information about fair value measurements in accordance with U.S. GAAP and IFRS. The adoption of this guidance had no impact on our consolidated financial position or results of operations., 316599=For the year ended December 31, 2011, net cash used in investing activities of continuing operations was approximately $4 million, a decrease of approximately $8.8 million, or 68.8%, from approximately $12.8 million for the year ended December 31, 2010.  The decrease was the result of the less payments made in 2011 as prepayments were made primarily in 2010 for acquisition of farmland use rights, for majority construction cost of the warehouses, office building and cylinder units in Shanxi Province which commenced in 2010 and was completed in 2011.  Cash used in investing activities of continuing operations in the year ended December 31, 2011 was primarily for purchasing machinery and equipment, while cash used in investing activities of continuing operations in year ended December 31, 2010 was primarily for paying for land use rights and construction of warehouses., 325668=The following table presents the Company’s material contractual obligations as of December 31, 2011:, 85582=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Yongqing Ren, Vice President of the Corn Division of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 200 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Ren will indirectly (through his ownership of Expert Venture Limited) own and control 1,106,903 shares, which equal 7.76% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Ren. As a result, the number of shares of beneficial ownership has included 1,106,903 shares of common stock that have become transferrable to Mr. Ren after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010., 432374=For our Corn Division, the portion of revenues derived from new or small customers has increased and the overall number of customers also increased. For our Grain Division, our customers are diversified among distributors and chain of supermarkets. For our Bulk Trading Division, a newly-added business in the fourth quarter of 2010, we have established stable relationships with Tianjin Yimingda Grain Division (a wholesaler), which is one of our largest customers and accounts for 28.3% of gross sales of Bulk Trading Division. We believe we can continue to keep stable relationships with existing customers and enlarge our customer base in the future., 400327=Lastly, pursuant to the Securities Escrow Agreement, our majority shareholder (which is also the selling stockholder in this prospectus, Expert Venture Limited) pledged 2,455,863 shares of common stock of the Company (the “Make Good Shares”) to secure the obligation that we reach certain earnings thresholds for the fiscal years ended 2010 and 2011.  Since the Make Good Shares have already been issued to Expert Venture Limited, any transfer of the shares pursuant to the terms of the Make Good Agreement will not cause any dilution to existing shareholders. One half (or 1,227,932 shares) of the Make Good Shares were allocated to the 2010 earnings requirement and the other half (1,227,931 shares) of the Make Good Shares were allocated to the 2011 earnings requirement. For the fiscal year 2010, we met our threshold requirement of reporting net income of at least 95% of $11,000,000. If we meet the threshold in 2011 of reporting net income of at least 95% of $15,000,000 (i.e., at least $14,250,000), the remainder of the Make Good Shares will be returned to Expert Venture Limited, however if we fail to meet our threshold, then the Make Good Shares will be released from escrow based on the following terms and conditions:, 686574=Dongsheng International Investment Co., Ltd., the President and Executive Director of which is Wenjun Tian, the Company's President and a Director, loaned the Company in the aggregate amount of $2.9 million in the year ended December 31, 2011.  Such loan is unsecured, bears no interest and no due date is specified.  As of December 31, 2011 and March 28, 2012, $2.9 million and $2.5 million were due under this loan, respectively., 1607=REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933, 21956=This prospectus relates to the sale of up to 250,000 shares of our common stock, par value $0.001 per share, which may be offered by the selling stockholder from time to time. All of the shares of common stock offered by this prospectus are being sold by the selling stockholder, and such shares consist of shares which had been previously issued by us to the selling stockholder on April 27, 2010 pursuant to a share exchange transaction. Such registration does not mean that the selling stockholder will actually offer or sell any of these shares. We will not receive any proceeds from the sales of shares of our common stock by the selling stockholder., 299640=Gross profit in Corn Division was $29.4 million, contributing to 68.2% of total gross profit for the year ended December 31, 2011.  Gross margin for our Corn Division was 16.5% for the year ended December 31, 2011, down by 560 basis points from 22.1% for the year ended December 31, 2010. The decrease of gross margin was mainly due to the continuous increase in the purchase price of raw corn and supplemental procurement from suppliers. The purchase price of raw corn increased by about 12% during the year ended December 31, 2011, but the selling price did not increase consistently. Due to our rapid growth in corn sales, we supplemented the supply of raw materials from farmers by purchasing from other corn traders, of which the purchasing price was usually higher and it negatively affected the gross margin of the Corn Division., 229651=In the fourth quarter of 2011, we adjusted the structure of our business divisions in order to better allocate resources and to assess the performance of the group according to our growth strategy. Our Deep Processed Division was dissolved because of the termination of our control agreements with the VIE Group on December 20, 2011, which conducted most of the business of our Deep Processed Division. We changed the name of our Simple Processed Grain Division to the Grain Division, which conducts processed grain products being sold through our retail sales network. With the rapid growth of our bulk trading business, we set up a new division called the Bulk Trading Division, the activities of which were previously conducted in the Grain Division. We now have three business divisions: the Corn Division, the Grain Division and the Bulk Trading Division. According to FASB Accounting Standard Codification Topic 280, we prepared the financial information for these segments for the year ended December 31, 2011 and restated the comparable information for the year ended December 31, 2010., 692405=On January 13, 2010, Jinzhong Deyu provided a two year guarantee on a $1.3 million short-term bank loan payable to Jinzhong Economic Development District Rural Credit Union by Jingzhong Yuliang, bearing interest at a floating rate of prime rate plus 129.83% of prime rate, of which prime rate was based on the six-month to one-year loan interest rate released by The People's Bank of China.  The loan was originally due March 8, 2011.  In January 2011, the Company entered into an agreement with the bank for an extension and the new term was from February 1, 2011 to October 1, 2011.  The adjustable interest rate was a rate per annum equal to the prime rate plus 117.23% of prime rate.  The prime rate was based on the one to three year loan interest rate released by The People's Bank of China.  The loan was fully paid off on May 11, 2011, with Jingzhong Yuliang paying the principal amount of $1.3 million plus $8,865 in accrued interest., 782294=West Coast Stock Transfer is currently the transfer agent and registrar for our common stock. Its address is 2010 Hancock Street, Suite A, San Diego, CA 92110. Its phone number is (619) 664-4780., 318578=Net cash used by discontinued operations for the year ended December 31, 2011 was $416,000 and net cash provided by discontinued operations for the year ended December 31, 2010 was $433,000., 799223=The selling stockholder and any other person participating in such distribution will be subject to applicable provisions of the Securities Exchange Act of 1934, as amended, and the rules and regulations thereunder, including, without limitation, to the extent applicable, Regulation M of the Exchange Act, which may limit the timing of purchases and sales of any of the shares of common stock by the selling stockholder and any other participating person. To the extent applicable, Regulation M may also restrict the ability of any person engaged in the distribution of the shares of common stock to engage in market-making activities with respect to the shares of common stock. All of the foregoing may affect the marketability of the shares of common stock and the ability of any person or entity to engage in market-making activities with respect to the shares of common stock., 121888=The PRC legal system is a civil law system. Unlike the common law system, the civil law system is based on written statutes in which decided legal cases have little value. In 1979, the PRC began to promulgate a comprehensive system of laws and has since introduced many laws and regulations to provide general guidance on economic and business practices in the PRC and to regulate foreign investment. Progress has been made in the promulgation of laws and regulations dealing with economic matters such as corporate organization and governance, foreign investment, commerce, taxation and trade. The promulgation of new laws, changes of existing laws and the abrogation of local regulations by national laws could have a negative impact on our business and business prospects., 146894=The Foreign Investment Industrial Catalogue jointly issued by the Ministry of Commerce for the People’s Republic of China and the National Development and Reform Commission in 2011 classified various industries/business into three different categories: (i) encouraged for foreign investment; (ii) restricted to foreign investment; and (iii) prohibited from foreign investment. For any industry/business not covered by any of these three categories, they will be deemed industries/business permitted to have foreign investment. Except for those expressly provided restrictions, encouraged and permitted industries/business are usually 100% open to foreign investment and ownership. With regard to those industries/business restricted to or prohibited from foreign investment, there is always a limitation on foreign investment and ownership. The PRC Subsidiary’s business does not fall under the industry categories that are restricted to, or prohibited from foreign investment and is not subject to limitation on foreign investment and ownership., 1077108=The Company's inventories are stated at lower of cost or market.  Cost is determined on moving-average basis.  Costs of inventories include purchase and related costs incurred in delivering the products to their present location and condition.  Market value is determined by reference to selling prices after the balance sheet date or to management’s estimates based on prevailing market conditions.  Management periodically evaluates the composition of its inventories at least quarterly to identify slow-moving and obsolete inventories to determine if valuation allowance is required.  As of December 31, 2011 and 2010, management had identified no slow moving or obsolete inventory. For the years ended December 31, 2011 and 2010, loss on reduction of inventory to the lower of cost or market was $56,140 and $0, respectively., 366766=The Company expenses the cost of advertising as incurred or, as appropriate, the first time the advertising takes place.  Advertising costs from continuing operations for the year ended December 31, 2011 and 2010 were $952,472 and $83,576 respectively. , 590046=(2) Effective February 3, 2012, Ms. Amy He was promoted to Acting Chief Financial Officer of the Company. Ms. He replaced Mr. Charlie Lin, whose employment and employment agreement with the Company officially terminated on March 5, 2012 in accordance with the notification procedures set forth in his employment agreement., 72657=2010 Private Placement, 216097=In connection with the Share Exchange, on April 27, 2010, we issued an aggregate of 8,736,932 shares of our common stock to the shareholders of City Zone.  We received in exchange from the City Zone shareholders 100% of the shares of City Zone, which exchange resulted in City Zone becoming our wholly owned subsidiary. The issuance of such securities was exempt from registration pursuant to Section 4(2) of, and Regulation D and/or Regulation S promulgated under the Securities Act of 1933, as amended., 393742=Our principal office is located at 8th Floor, Block 5, Aolinjiatai Building, 1 Kehuiqian Street, Chaoyang District, Beijing, China 100192. Our telephone number in China is +(8610)-5224 1802 and our fax number is +(8610)-5224 1822. Our telephone number in the United States is (646) 820-8060. Our corporate website is www.deyuagri.com (information on our website is not made a part of prospectus)., 26347=The date of this prospectus is ________ ___, 2012., 307321=Loss from discontinued operations, net of income taxes was incurred from the VIE Group, which we terminated our control over on December 20, 2011., 763382=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Junde Zhang, Vice President of the Grain Division of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 200 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Zhang will indirectly (through his ownership of Expert Venture Limited) own and control 1,106,903 shares, which equal 7.76% of the fully-diluted percentage of outstanding shares of common stock. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Zhang. As a result, the number of shares of beneficial ownership has included 1,106,903 shares of common stock that have become transferrable to Mr. Zhang after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010. In addition, the Company has granted to Mr. Zhang options to purchase 40,000 shares of our common stock under the Plan, 26,667 of which have vested., 222912=In connection with our private placement in May 2010, we issued an aggregate 2,455,863 shares of our Series A convertible preferred shares and warrants exercisable into 982,362 shares of common stock to Investors.  Pursuant to the terms of our Series A convertible preferred share designations, the holders of our Series A convertible preferred shares are entitled to receive cumulative dividends at a rate of 5% per annum, and such shares of Series A convertible preferred stock are convertible into shares of our common stock on a 1:1 basis, subject to applicable adjustments. , 355359=The goodwill in the balance sheet as of December 31, 2010 was generated from the acquisition of Haoliangxin by Deyufarm on July 24, 2010. In 2010, goodwill was tested for impairment and it was determined that goodwill was not impaired as of December 31, 2010. Pursuant to the Termination Agreements for the VIE Group, the Company deconsolidated the VIE Group and no goodwill was presented on the balance sheet as of December 31, 2011, and either as of December 31, 2010 after reclassification of the assets and liabilities of discontinued operations., 1068290=(3) Taizihu and Huichun became the wholly-owned subsidiaries of the Company on February 2, 2012 through a business acquisition (see Note 20), but they are not within the consolidation scope as of December 31, 2011, 498307=According to government regulations of the PRC, the PRC Government owns all land.  We own the following land use rights for farmland and/or industrial lands: (1) land use rights of farmland in Jinzhong Shanxi consisting of 17,000 acres (approximately 70,000,000 square meters) for the remaining average of 38 years; (2) land use right of the industrial land in Quwo, Shanxi consisting of 1,076,000 square feet (approximately 100,000 square meters) for the remaining 45 years, which belongs to the Taizihu Group acquired by the Company on February 2, 2012; (3) land use right of the industrial land in Yuci District of Jinzhong, Shanxi consisting of 504,000 square feet (approximately 47,000 square meters) for the remaining 49 years; (4) land use right of the industrial land in Shanzhuangtou, Jinzhong Deyu of 125,000 square feet (approximately 12,000 square meters), for which the term was terminated on March 14, 2011; however according to the Certification issued by the Jinzhong Municipal Bureau of Land and Resources on March 30, 2011, the Company holds the legal title of the land use rights during the period of the renewal process; (5) land use right of the industrial land in Shanzhuangtou, Jinzhong Deyu of 73,000 square feet (approximately 6,800 square meters) for estimated 50 years, which we obtained on March 19, 2012., 1073583=As a result of the financings associated with the reverse merger, we had, as of December 31, 2010, $125,560 in a trust account. The use of these funds requires the written approval of our placement agent and us. The funds in the escrow account were designated for certain expenses, such as investor relations, accounting/consulting fees, SEC fees, and stock transfer agent fees. This amount was classified as restricted cash under current assets on our balance sheet as of December 31, 2010, while the restriction has been released in 2011., 385518=In December 2011, FASB issued an Update (ASU No. 2011-11) to Balance Sheet (ASC Topic 210) regarding disclosures about offsetting assets and liabilities. Pursuant to this Update, entities are required to disclose both gross information and net information about both instruments and transactions eligible for offset in the statement of financial position and instruments and transactions subject to an agreement similar to a master netting arrangement. This scope would include derivatives, sale and repurchase agreements and reverse sale and repurchase agreements, and securities borrowing and securities lending arrangements. The adoption of this guidance had no impact on our consolidated financial position or results of operations., 657495=(2) As a result of the termination of employment (the \"Termination\") of Mr. Li Ren as the Vice President effective February, 3, 2012, and pursuant to the terms of the Plan, the unexercised options will expire and be forfeited three months after the Termination., 170234=On September 21, 2006, the China Securities Regulatory Commission published on its official website procedures regarding its approval of overseas listings by special purpose vehicles. The China Securities Regulatory Commission approval procedures require the filing of a number of documents with China Securities Regulatory Commission and it would take several months to complete the approval process. The application of the Merger & Acquisition Rules with respect to overseas listings of special purpose vehicles remains unclear with no consensus currently existing among the leading PRC law firms regarding the scope of the applicability of the China Securities Regulatory Commission approval requirement., 514087=Mr. Zhou is our Chief Operating Officer. Between January 2005 and December 2006, Mr. Zhou served as the General Manager of Beijing Kangqiaoshidai Education Development Co., Ltd. Between January 2007 and October 2008, he was the General Manager of Antai Global (Beijing) Risk Management Co., Ltd. Mr. Zhou also served as the Vice President of Dongsheng International (Beijing) Investment Co., Ltd. between October 2008 and August 2009. Mr. Zhou has been a director of Detian Yu since August 2009.  Mr. Zhou is the holder of an undergraduate degree., 118976=The PRC is transitioning from a planned economy to a market economy. While the PRC government has pursued economic reforms since its adoption of the open-door policy in 1978, a large portion of the PRC economy is still operating under five-year plans and annual state plans. Through these plans and other economic measures, such as control on foreign exchange, taxation and restrictions on foreign participation in the domestic market of various industries, the PRC government exerts considerable direct and indirect influence on the economy. Many of the economic reforms carried out by the PRC government are unprecedented or experimental, and are expected to be refined and improved. Other political, economic and social factors can also lead to further readjustment of such reforms. This refining and readjustment process may not necessarily have a positive effect on our operations or future business development. Our operating results may be adversely affected by changes in the PRC's economic and social conditions as well as by changes in the policies of the PRC government, such as changes in laws and regulations (or the official interpretation thereof), measures which may be introduced to control inflation, changes in the interest rate or method of taxation, and the imposition of restrictions on currency conversion in addition to those described below., 302285=Selling expenses increased by $6.9 million, or 109.5%, for the year ended December 31, 2011 as compared to $6.3 million for the year ended December 31, 2010.  Such increase was mainly attributable to the increase of freight charges, slotting fees for entering more stores and marketing personnel expenses due to increased sales volume., 1067840=(2) Detian Yu terminated its control over the Junda, Longyue, Deyufarm, Haoliangxin, Xinggu Deyufarm, (collectively, the “VIE Group”) on December 20, 2011. The operation results of the VIE Group are included in the consolidated financial statements from January 1 to December 20, 2011, 759424=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Wenjun Tian, a former Director and former President of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 300 shares of Expert Venture Limited, which constitutes 30% of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Tian will indirectly (through his ownership of Expert Venture Limited) own and control 1,660,354 shares, which equal 11.64% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Tian. As a result, the number of shares of beneficial ownership has included 1,660,354 shares of common stock that have become transferrable to Mr. Tian after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010. In addition, the Company has granted to Mr. Tian options to purchase 150,000 shares of our common stock under the Plan, 100,000 of which have vested. Effective April 30, 2012, Mr. Tian resigned as the Company’s President and as a member of the Board of Directors., 381601=In September 2011, FASB issued an amendment (ASU No. 2011-08) to Intangibles–Goodwill and Other (ASC Topic 350). The amendments in the Update permit an entity to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount as a basis for determining whether it is necessary to perform the two-step goodwill impairment test described in Topic 350. If, after assessing the totality of events or circumstances, an entity determines it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, then performing the two-step impairment test is unnecessary. However, if an entity concludes otherwise, then it is required to perform the first step of the two-step impairment test by calculating the fair value of the reporting unit and comparing the fair value with the carrying amount of the reporting unit, as described in paragraph 350-20-35-4. If the carrying amount of a reporting unit exceeds its fair value, then the entity is required to perform the second step of the goodwill impairment test to measure the amount of the impairment loss, if any, as described in paragraph 350-20-35-9. The Company had adopted this guidance to our consolidated financial statements as of and for the year ended December 31, 2011., 590534=(3) Effective February 3, 2012, Mr. Li Ren resigned as the Company’s Vice President - Brand and Marketing and Mr. Weizhong Cai resigned as the Company’s Chief Scientist, and Mr. Yunlin Ding was appointed the Vice President of Company., 320454=In connection with an exchange agreement, on April 27, 2010, we issued an aggregate of 8,736,932 shares of our common stock to the shareholders of City Zone.  We received in exchange from the City Zone shareholders 100% of the shares of City Zone, which exchange resulted in City Zone becoming our wholly owned subsidiary.  Immediately after the Exchange, we entered into a Purchase Agreement with certain accredited Investors for the issuance and sale in a private placement of units, consisting of, 2,455,863 shares of our Series A convertible preferred stock and Series A warrants to purchase up to 982,362 shares of our common stock, for aggregate gross proceeds of approximately $10,805,750., 369021=In December 2004, the Financial Accounting Standard Board, or the FASB, issued the Statement of Financial Accounting Standards, or SFAS, No. 123(R), “Share-Based Payment”, which replaces SFAS No. 123 and supersedes APB Opinion No. 25.  SFAS No. 123(R) is now included in the FASB’s ASC Topic 718, “Compensation – Stock Compensation.”  Under SFAS No. 123(R), companies are required to measure the compensation costs of share-based compensation arrangements based on the grant-date fair value and recognize the costs in the financial statements over the period during which employees or independent contractors are required to provide services.  Share-based compensation arrangements include stock options and warrants, restricted share plans, performance-based awards, share appreciation rights and employee share purchase plans.  In March 2005, the SEC issued Staff Accounting Bulletin No. 107, or SAB 107, which expresses views of the staff regarding the interaction between SFAS No. 123(R) and certain SEC rules and regulations and provides the staff’s views regarding the valuation of share-based payment arrangements for public companies.  SFAS No. 123(R) permits public companies to adopt its requirements using one of two methods.  On April 14, 2005, the SEC adopted a new rule amending the compliance dates for SFAS No. 123(R).  Companies may elect to apply this statement either prospectively, or on a modified version of retrospective application under which financial statements for prior periods are adjusted on a basis consistent with the pro forma disclosures required for those periods under SFAS No. 123., 451561=Grain products contain high levels of vitamin B1, dietary fiber and trace elements. Coarse grains are believed to be beneficial to people with diabetes or high blood pressure. The Chinese Nutrition Society, commissioned by the Ministry of Health in 2011 to formulate dietary guidelines, recommends consumption of 250-400 grams per day of processed grain foods for adults. They also recommended that adults consume 50-100 grams per day of coarse grains and whole grain foods and consume 30-50 grams per day of bean or bean-based products. Over 70% of adults in China, amounting to approximately 665 million people, are urban residents. Based on these guidelines, the demand for coarse grain products and bean-based products by people in urban cities could reach 18.2 million tons and 9.7 million tons per year, respectively., 281700=Net revenue from our Corn Division for the year ended December 31, 2011 was approximately $177.7 million, an increase of $108.2 million, or approximately 155.7%, as compared the year ended December 31, 2010. This growth was attributable to the expansion of our sales network, the increase in our storage capacity and turnover and the obtainment of sufficient working capital. Further, our corn sales network has been extended to approximately 15 provinces in 2011 from 7 provinces in 2010, which now include sales to more livestock feed companies, corn oil/corn starch manufacturing companies and governmental procurement agencies. Our capacity of storage and turnover increased from 50,000 tons and 250,000 tons to over 100,000 tons and 700,000 tons, respectively, when the new processing center with five drying cylinders and six warehouses went into operation in June 2011. We obtained sufficient working capital from bank loans and bank notes to support corn purchases from farmers and suppliers. The average balance of our bank loans and bank notes increased to $9.3 million for the year ended December 31, 2011 from $2.2 million for the year ended December 31, 2010. Our sales volume and revenue from the Corn Division for the year ended December 31, 2011 reached 531,165 tons and $177.7 million, respectively., 341808=The Company's inventories are stated at lower of cost or market.  Cost is determined on moving-average basis.  Costs of inventories include purchase and related costs incurred in delivering the products to their present location and condition.  Market value is determined by reference to selling prices after the balance sheet date or to management’s estimates based on prevailing market conditions.  Management periodically evaluates the composition of its inventories at least quarterly to identify slow-moving and obsolete inventories to determine if valuation allowance is required.  As of December 31, 2011 and 2010, management did not identify any slow moving or obsolete inventory. For the years ended December 31, 2011 and 2010, loss on reduction of inventory to the lower of cost or market was $56,140 and $0, respectively., 63490=On June 16, 2011, Tianjin Guandu (previously named Tianjin Detianyu Food Co., Ltd. before October 24, 2011), a newly formed wholly-owned subsidiary of Detian Yu with RMB10,000,000 ($1,544,497) registered capital entered into a Cooperation Agreement with the Administrative Committee of Sino-Singapore Tianjin Eco-city (the “Agency”), the representative organization of the Tianjin Municipal Government. The agreement provides for a cooperative relationship between Tianjin Guandu and the Agency regarding Tianjin Guandu’s establishment of its operations in Tianing’s Eco-city, particularly with respect to certain tax arrangements. Tianjin Guandu is in the business of wholesale distribution of simple-processed and deep-processed packaged food products and staple foods., 307843=As a result of the above, we had net income available to common stockholders of $17.3 million for the year ended December 31, 2011 compared to a net income of $11.5 million for the year ended December 31, 2010, an increase of $5.8 million, or 50.7%., 590934=(4) Effective April 30, 2012, Mr. Tian resigned as the Company’s President and as a member of the Board of Directors., 317683=Net cash provided by financing activities of continuing operations for the year ended December 31, 2011 was approximately $14.5 million, an increase of approximately $2.6 million, or 21.8%, from approximately $11.9 million for the year ended December 31, 2010.  This net cash provided by financing activities of continuing operations for the year ended December 31, 2011 mainly consisted of net proceeds from short term loans from banks, related parties and bank acceptance notes, while the net cash provided by financing activities of continuing operations for the year ended December 31, 2010 was mainly consisted of net proceeds from private placement, short term loans from banks and related parties., 540803=On August 19, 2010, we established our Audit Committee. The Audit Committee consists of Timothy Stevens, Al Carmona and Longjiang Yuan, each of whom is an independent director. Timothy Stevens, Chairman of the Audit Committee, is an “audit committee financial expert” as defined under Item 407(d) of Regulation S-K. The purpose of the Audit Committee is to represent and assist our board of directors in its general oversight of our accounting and financial reporting processes, audits of the financial statements and internal control and audit functions. The Audit Committee’s responsibilities include:, 233309=Results of Operations for the Year Ended December 31, 2011 as Compared to the Year Ended December 31, 2010, 300677=Gross profit in the Grain Division was $10.1 million, contributing to 23.4% of total gross profit for the year ended December 31, 2011.  Gross margin for the Grain Division was 24.9% for the year ended December 31, 2011, compared with 56.5% for the year ended December 31, 2010. The decrease was mainly attributable to our sales expansion strategies that we implemented by lowering the average selling price compared with the market price in 2011 and increasing sales percentages of certain types of grains with lower margins such as millet and flour., 700307=The following table sets forth certain information regarding beneficial ownership of our common stock as of, April 27, 2012: (i) by each of our directors, (ii) by each of the named executive officers, (iii) by all of our executive officers and directors as a group, and (iv) by each person or entity known by us to beneficially own more than 5% of any class of our outstanding shares. As of April 27, 2012, there were 10,566,766 shares of our common stock outstanding:, 76405=Pursuant to the Registration Rights Agreement, we agreed to file a registration statement on Form S-1 (or other applicable Form) within 60 days of the close of such financing.  We filed a Registration Statement on Form S-1 with the SEC on June 15, 2010 (, and on October 21, 2010, the SEC declared the Form S-1 effective., 510919=Mr. Hao is our CEO and Chairman. Between December 2001 and May 2004, Mr. Hao served as the Finance Manager of China Merchants Dichain (Asia) Ltd., a Hong Kong listed company. Between May 2004 and November 2007, Mr. Hao served as a director and Vice President of Shenzhen Litong Investments Ltd.  Since November 2007, he has been a director of Jinzhong Deyu Agriculture Trading Co. Limited, which is now a subsidiary of Deyu Agriculture Corp.  Mr. Hao received a Master’s degree in Finance from Nankai University. He is also a certified public accountant in China., 547612=On August 19, 2010, our Board of Directors adopted a Code of Conduct applicable to all directors, officers and employees. Pursuant to NASDAQ Rule 5610, the Code of Conduct complies with the definition of a “code of ethics” set out in Section 406(c) of the Sarbanes-Oxley Act of 2002. , 216797=Simultaneous with the closing the Share Exchange, we entered into the Purchase Agreement with certain accredited Investors for the issuance and sale in a private placement of Units, consisting of 2,455,863 shares of our Series A convertible preferred stock, par value $0.001 per share and Series A warrants to purchase up to 982,362 shares of our common stock, for aggregate gross proceeds of approximately $10,805,750. The issuances of the aforementioned securities were exempt from registration pursuant to Section 4(2) of, and Regulation D and/or Regulation S promulgated under the Securities Act of 1933, as amended., 174451=According to the Prevention and Control of Water Pollution Law, as adopted by the Standing Committee of the 10th National People’s Congress on February 28, 2008 and effective on June 1, 2008, China adopted a licensing system for pollutant discharge. Companies directly or indirectly responsible for discharge of industrial waste water or medical sewage to waters shall be required to obtain a pollutant discharge license. All companies are prohibited from discharging wastewater and sewage to waters without or in violation of the terms of the pollutant discharge license., 1096517=This guidance applies to other accounting pronouncements that require or permit fair value measurements.  On February 12, 2008, the FASB finalized FASB Staff Position (FSP) No. 157-2, Effective Date of FASB Statement No. 157 (ASC 820).  This Staff Position delays the effective date of SFAS No. 157 (ASC 820) for nonfinancial assets and liabilities to fiscal years beginning after November 15, 2008 and interim periods within those fiscal years, except for those items that are recognized or disclosed at fair value in the financial statements on a recurring basis (at least annually).  The adoption of SFAS No. 157 (ASC 820) had no effect on the Company's financial position or results of operations., 819568=22632 Golden Springs Dr. #230, Diamond Bar, CA 91765, USA, 546814=To the Company’s knowledge, based solely on a review of the copies of such reports furnished to the Company, all reports under Section 16(a) required to be filed by its officers and directors and greater than 10% beneficial owners were filed as of the date of this filing, except that Charlie Lin failed to file a Form 3 in connection with his appointment as Chief Financial Officer of the Company on January 10, 2011., 1028087=Deyu Agriculture Corp. (the “Company”), formerly known as Eco Building International, Inc., was incorporated under the laws of the State of Nevada on December 23, 2008.  We completed the acquisition of City Zone Holdings Limited (“City Zone”), an agricultural products distributor in the Shanxi Province of the People’s Republic of China (the “PRC”) engaged in procuring, processing, marketing, and distributing various grain and corn products, by means of a share exchange, effective April 27, 2010.  As a result of the share exchange, City Zone became our wholly-owned subsidiary.  We currently conduct our business primarily through the operating PRC subsidiaries, including Jinzhong Deyu Agriculture Trading Co., Ltd. (“Jinzhong Deyu”), Jinzhong Yuliang Agriculture Trading Co., Ltd. (“Jinzhong Yuliang”), Jinzhong Yongcheng Agriculture Trading Co., Ltd. (“Jinzhong Yongcheng”), Shanxi Taizihu Food Co., Ltd. (“Taizihu”) and Shanxi HuiChun Bean Products Co., Ltd. (“Huichun” and together with Taizihu, the “Taizihu Group”, see Note 20) and Betian Yu Biotechnology (Beijing) Co., Ltd. (“Detian Yu”) and its subsidiaries., 511932=Effective February 3, 2012, the Company appointed Ms. Amy He to serve as the Company’s Acting Chief Financial Officer.  Ms. He, who is resident in the Company’s headquarters in Beijing, has served as the Company’s Financial Controller since October 2011. Prior to that, Ms. He served as an audit manager for Deloitte Touche Tohmatsu CPA Ltd. in China from July 2005 through September, 2011, where she served multinational corporations and Chinese corporate clients, including private companies and public listed companies in the United States. Ms. He earned a Master’s Degree in Management from the Chinese Academy of Sciences and a Bachelor’s Degree in Accounting from Tsinghua University in China., 86823=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Junde Zhang, Vice President of the Grain Division of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 200 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Zhang will indirectly (through his ownership of Expert Venture Limited) own and control 1,106,903 shares, which equal 7.76% of the fully-diluted percentage of outstanding shares of common stock. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Zhang. As a result, the number of shares of beneficial ownership has included 1,106,903 shares of common stock that have become transferrable to Mr. Zhang after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010., 221274=On November 5, 2010, we filed a Registration Statement with the SEC on Form S-8 covering up to 1,000,000 shares underlying options which may be granted under the Plan. As of March 28, 2012, none of the options granted pursuant to the Plan have been exercised., 231398=On February 2, 2012, we acquired the Taizihu Group, which is in business of producing and selling bean-based products, fruit vinegars and juices and other grain products. The business of Taizihu Group is conducted as part of the business of the Grain Division. However, management’s discussion and analysis of results of operations for the years ended December 31, 2011 and 2010 set forth herein below do not include the operations results of Taizihu Group, for the Taizihu Group’s financial statements are not required to be consolidated prior to February 2, 2012, the acquisition date according to US GAAP., 212754=(1) On November 4, 2010, the Company’s Board of Directors approved the Company’s 2010 Share Incentive Plan.  Under the Plan, 1,000,000 shares of the Company’s common stock were originally allocated to and authorized for use pursuant to the terms of the Plan.  On November 8, 2010, a total of 931,000 non-qualified incentive stock options were approved by our Board of Directors and granted under the Plan to executives, key employees, independent directors, and consultants at an exercise price of $4.40 per share and on December 15, 2010, 40,000 non-qualified incentive stock shares were approved by our Board of Directors and granted under the Plan to a consultant at an exercise price of $4.40 per share, of which shall vest as follows:, 384134=In December 2011, FASB issued an Update (ASU No. 2011-10) to Property, Plant, and Equipment (ASC Topic 360). Under the amendments in this Update, when a parent (reporting entity) ceases to have a controlling financial interest (as described in Subtopic 810-10) in a subsidiary that is in substance real estate as a result of default on the subsidiary’s nonrecourse debt, the reporting entity should apply the guidance in Subtopic 360-20 to determine whether it should derecognize the in substance real estate. Generally, a reporting entity would not satisfy the requirements to derecognize the in substance real estate before the legal transfer of the real estate to the lender and the extinguishment of the related nonrecourse indebtedness. That is, even if the reporting entity ceases to have a controlling financial interest under Subtopic 810-10, the reporting entity would continue to include the real estate, debt, and the results of the subsidiary’s operations in its consolidated financial statements until legal title to the real estate is transferred to legally satisfy the debt. The adoption of this guidance had no impact on our consolidated financial position or results of operations., 83048=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Jianming Hao, the Chairman of the Board and the President and Chief Executive Officer of the Company, has the option, subject to certain performance targets, to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 101 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Hao will indirectly (through his ownership of Expert Venture Limited) own and control 558,986 shares, which equal 3.92% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Hao. As a result, the number of shares of beneficial ownership has included 558,986 shares of common stock that have become transferrable to Mr. Hao after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010., 804031=   We filed with the Securities and Exchange Commission a registration statement under the Securities Act of 1933 for the shares of common stock in this offering. This prospectus does not contain all of the information in the registration statement and the exhibits and schedule that were filed with the registration statement. For further information with respect to us and our common stock, we refer you to the registration statement and the exhibits and schedule that were filed with the registration statement. Statements contained in this prospectus about the contents of any contract or any other document that is filed as an exhibit to the registration statement are not necessarily complete, and we refer you to the full text of the contract or other document filed as an exhibit to the registration statement. A copy of the registration statement and the exhibits and schedules that were filed with the registration statement may be inspected without charge at the Public Reference Room maintained by the Securities and Exchange Commission at 100 F Street, N.E. Washington, DC 20549, and copies of all or any part of the registration statement may be obtained from the Securities and Exchange Commission upon payment of the prescribed fee. Information regarding the operation of the Public Reference Room may be obtained by calling the Securities and Exchange Commission at 1-800-SEC-0330. The Securities and Exchange Commission maintains a website that contains reports, proxy and information statements, and other information regarding registrants that file electronically with the SEC. The address of the website is www.sec.gov., 525436=Effective February, 3, 2012, the Company appointed Mr. Yunlin Ding to serve as Vice President of Company. Immediately prior to Mr. Ding’s appointment as the Company’s Vice President, he served as Vice President of Detian Yu since July 2009. Mr. Ding also served as vice general manager of the investment department of Beida Qingniao Group, a company organized under the laws of China and the holding company for three companies listed in China and two companies listed in Hong Kong, from February 2002 to July 2009. Mr. Ding earned a Bachelor’s Degree and a Master’s Degree in Economics from Nankai University in 1996 and 1999, respectively., 16925=(2) Estimated solely for purposes of calculating the registration fee in accordance with Rule 457(c) and Rule 457(g) under the Securities Act of 1933, using the average of the high and low price as reported on the OTC Markets-OTC Pink on April 27, 2012, which was $1.65 per share., 377684=In January 2010, FASB issued an amendment regarding improving disclosures about fair value measurements. This new guidance requires some new disclosures and clarifies some existing disclosure requirements about fair value measurement. The new disclosures and clarifications of existing disclosures are effective for interim and annual reporting periods beginning after December 15, 2009, except for the disclosures about purchases, sales, issuances and settlements in the roll forward of activity in Level 3 fair value measurements. Those disclosures are effective for fiscal years beginning after December 15, 2010 and for interim periods within those fiscal years. There was no impact from the adoption of this guidance to our consolidated financial position or results of operations as the amendment only addresses disclosures., 520706=Mr. Stevens is an independent director of the Company. Mr. Stevens has over 30 years of executive leadership, management, and client service experience with the world’s leading law, public accounting, and management consulting firms. Since January 2011, Mr. Stevens has served as Chief Operating Officer of an international law firm in Hong Kong. Prior to that since 2004, Mr. Stevens served as the Executive Director of Saul Ewing LLP, a Philadelphia law firm where he oversaw all aspects of its day to day business operations with a focus on improving the bottom line and supporting the Firm’s growth strategy and other key objectives. From 1999 to 2003, he served as the Chief Operating Officer and a member of the Management Committee in the Hong Kong and China offices of the international law firm Baker & McKenzie where he was responsible for all operations (other than client service) for Baker & McKenzie’s large Hong Kong and China practice. From 1995 to 1998, Mr. Stevens served in the Chairman’s office as the Finance and Administrative Partner of PricewaterhouseCoopers China, the world’s largest auditing firm, where he supervised the business plans, office openings and expansions as well as the financial management of the firm.  Mr. Stevens graduated from Clifton College and Bristol University in the United Kingdom. He received the ACA qualification from the UK Chartered Accountants’ Qualification Program in 1974. Mr. Stevens is a licensed CPA in Massachusetts as well as being a Hong Kong FCPA., 768686=In connection with our private placement in May 2010, we executed a Securities Purchase Agreement whereby we issued shares of Series A convertible preferred stock to investors.  The holders of Series A Preferred are entitled to receive cumulative dividends in preference to the holders of common stock at an annual rate of 5% of the applicable per Series A Preferred original purchase price (the “Dividend Preference” and the “Dividends”).  If, after the Dividend Preference has been fully paid or declared and set apart, the Company shall make any additional distributions, then the holders of Series A Preferred shall participate with the holders of common stock on an as-converted basis with respect to such distributions.  Dividends shall be payable in cash or stock, at the Company’s option., 517894=Mr. Yuan is an independent director of the Company. He is an acknowledged expert in agricultural technology and has been serving as the vice director of the Science and Technology Bureau of the Chinese Academy of Agricultural Sciences, the largest and highest agriculture institute in China (“CAAS”). Prior to joining the Company, Mr. Yuan spent 17 years in the Institute of Crop Science of the CAAS, where he was also the senior director of the R&D team for paddy rice genetic breeding technologies as well as a scientist in the science commission. He is the director of the Crop Science Society of China and an expert for the National Crop Variety Approval Committee. From 2002 to 2004, Mr. Yuan was an independent director of the board of Shanxi Tunyu Seed Industry Co., Ltd.  Over the years, Mr. Yuan has participated in and led 13 national R&D programs and has developed 17 new crop breeds. He has published more than 20 academic thesis and 5 books on agricultural sciences. Mr. Yuan was also granted 2 scientific and technological progress awards by the Ministry of Agriculture of China.  Mr. Longjiangg Yuan holds a master’s degree in Plant Genetic Breeding from the Graduate School of the Chinese Academy of Agricultural Sciences and a bachelor’s degree in Agriculture from Wan Nan Agriculture University., 56022=Operating revenue from continuing operations for the year ended December 31, 2011 was $261,576,666, representing a 207% increase from $85,174,884 for the year ended December 31, 2010. Our net income available to common stockholders for the year ended December 31, 2011 was $17,335,442, representing a 50.7% increase from $11,502,253 for the year ended December 31, 2010., 181081=The Administrative Provisions on the Filing of Export Food Manufacturers, promulgated by the General Administration of Quality Supervision, Inspection and Quarantine of the People’s Republic of China and effective as of October 1, 2011, implements a filing system on enterprises producing, processing or storing food for export. For those export food covered by the List of Products for Carrying out Filing of Export Food Manufacturers, enterprises can be allowed to produce, process or store the food for export only after obtaining the filing certificates., 5085=1790 Broadway, 8th Floor, 4602=Telephone: 86-10-5224 1802, 1067472=(1) Tianjing Guandu Food Co., Ltd, (\"Tianjing Guandu\"), previously was Tianjing Detianyu Food Co., Ltd. changed its company name and completed the name change registration on October 24, 2011., 284496=Revenue from our Bulk Trading Division for the year ended December 31, 2011 was $43 million, an increase of $39 million, or 936.2%, as compared to the year ended December 31, 2010. Our bulk trading of grain was a newly-added business commencing from the fourth quarter of 2010, which we found can fully utilize our existing resources including our supply and sales networks, warehousing and logistics. Based on our extensive wholesale network in 15 provinces and sufficient working capital from bank loans and bank notes, the sales volume and revenue from our Bulk Trading Division grew rapidly, reaching 76,124 tons and $43 million, respectively., 463776=Our Corn Division’s warehousing, processing and logistics center is located in Jinzhong with site coverage of 504,000 square feet (approximately 46,000 square meters) and constructed area of 129,000 square feet (approximately 12,000 square meters). The construction of this processing center was completed in June 2011 with five drying cylinders and six warehouses for the storage of 70,000 tons. We have a large rental cave-type warehouse named Shanxi 661 Warehouse with storage capacity of 30,000 tons. We also have contracts for temporary warehouses near railway stations which supplement our storage capacity. Our total capacity of storage and annual turnover reach over 100,000 tons and 700,000 tons, respectively., 543769=On August 19, 2010, our Board of Directors approved the adoption of the independent director oversight of executive officer compensation.  Pursuant to NASDAQ Rule 5605(d), all matters regarding executive officer compensation shall be submitted for approval or recommendation by a majority of the independent directors., 406918=On December 20, 2011, Detian Yu executed a series of termination agreements whereby Detian Yu terminated its control over the VIE Group (collectively, the “Termination Agreements”), effective immediately. The Company’s Board of Directors and a majority of the preferred shareholders of the Company approved the disposition of the VIE Group., 760977=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Yongqing Ren, Vice President of the Corn Division of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 200 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Ren will indirectly (through his ownership of Expert Venture Limited) own and control 1,106,903 shares, which equal 7.76% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Ren. As a result, the number of shares of beneficial ownership has included 1,106,903 shares of common stock that have become transferrable to Mr. Ren after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010. In addition, the Company has granted to Mr. Ren options to purchase 40,000 shares of our common stock under the Plan, 26,667 of which have vested., 77438=Lastly, pursuant to the Securities Escrow Agreement, Expert Venture Limited pledged 2,455,863 shares of common stock of the Company (the “Make Good Shares”) to secure the obligation that we reach certain earnings thresholds for the fiscal years ended 2010 and 2011. One half (or 1,227,932 shares) of the Make Good Shares were allocated to the 2010 earnings requirement and the other half (1,227,931 shares) of the Make Good Shares were allocated to the 2011 earnings requirement. For the fiscal year 2010, we met our threshold requirement of reporting net income of at least 95% of $11,000,000. If we meet the threshold in 2011 of reporting net income of at least 95% of $15,000,000 (i.e., at least $14,250,000), the remainder of the Make Good Shares will be returned to Expert Venture Limited, however if we fail to meet our threshold, then the Make Good Shares will be released from escrow based on the following terms and conditions:, 228804=We have experienced high growth in both revenue and net income.  Operating revenue from continuing operations for the year ended December 31, 2011 was $261,576,666, representing a 207% increase from $85,174,884 for the year ended December 31, 2010. Our net income attributable to common stockholders for the year ended December 31, 2011 was $17,335,442, representing a 50.7% increase from $11,502,253 for the year ended December 31, 2010., 169107=On August 8, 2006, six PRC regulatory agencies, including the Ministry of Commerce of the People’s Republic of China, the China Securities Regulatory Commission, the State-owned Assets Supervision and Administration Commission of the State Council, the State Administration of Taxation, the State Administration for Industry and Commerce, and the State Administration of Foreign Exchange, jointly amended and released the Merger & Acquisition Rules, which became effective on September 8, 2006. This regulation, among other things, includes provisions that purport to require that an offshore special purpose vehicle formed for purposes of overseas listing of equity interest in PRC companies and controlled directly or indirectly by PRC companies or individuals obtain the approval of the China Securities Regulatory Commission prior to the listing and trading of such special purpose vehicle’s securities on an overseas stock exchange., 156186=On August 29, 2008, the State Administration of Foreign Exchange issued a Notice of the General Affairs Department of the State Administration of Foreign Exchange on the Relevant Operating Issues concerning the Improvement of the Administration of Payment and Settlement of Foreign Currency Capital of Foreign-Invested Enterprises or Notice 142, to further regulate the foreign exchange of foreign investment entities. According to the Notice 142, foreign investment entities shall obtain verification report from a local accounting firm before converting its registered capital of foreign currency into Renminbi, and the converted Renminbi shall be used for the business within its permitted business scope. The Notice 142 explicitly prohibits foreign investment entities from using Renminbi converted from foreign capital to make equity investments in the PRC, unless the domestic equity investment is within the approved business scope of the foreign investment entity and has been approved by the State Administration of Foreign Exchange in advance., 375407=Certain prior period amounts have been reclassified in these consolidated financial statements to conform to the 2011 presentation of discontinued operations of the VIE Group for the deep processed grain business., 1075020=Accounts receivable are recorded at net realizable value consisting of the carrying amount less allowance for doubtful accounts, as needed.  We assess the collectability of accounts receivable based primarily upon the creditworthiness of the customer as determined by credit checks and analysis, as well as the customer’s payment history.  Management reviews the composition of accounts receivable and analyzes historical bad debts, customer concentrations, customer credit worthiness, current economic trends, and changes in customer payment patterns to evaluate the adequacy of these reserves.  As of December 31, 2011 and 2010, there were no customers with accounts receivable greater than six months past due., 75478=The private placement closed simultaneously with the signing of the Financing Documents and our issuing of 2,455,863 shares of Series A convertible preferred stock and warrants exercisable into 982,362 shares of common stock to certain investors (collectively, the “Investors”).  Pursuant to its terms, the Series A convertible preferred stock receive cumulative dividends at a rate of 5% per annum and can be converted into common stock on a 1:1 basis, subject to applicable adjustments.  Pursuant to its terms, the warrants can be converted into 982,362 shares of common stock at an exercise price of $5.06 per share (the \"Warrants\").  The Warrants will expire on April 27, 2015., 305510=Under the Enterprise Income Tax (“EIT”) Law of the PRC, the standard EIT rate is 25%.  Our PRC subsidiaries are subject to PRC income taxes on an entity basis on income arising in or derived from the tax jurisdiction in which they operate.  According to the Tax Pronouncement [2008] No. 149 issued by the State Administration of Tax of the PRC, the preliminary processing industry of agricultural products is entitled to EIT exemption starting January 1, 2008.  Three of the Company’s wholly-owned subsidiaries located in Shanxi Province, namely Jinzhong Deyu, Jinzhong Yongcheng and Jinzhong Yuliang, are subject to the EIT exemption.  All of our other subsidiaries are subject to the 25% EIT rate., 378700=In April 2010, FASB issued an amendment to Stock Compensation. The amendment clarifies that an employee stock-based payment award with an exercise price denominated in the currency of a market in which a substantial portion of the entity’s equity shares trades should not be considered to contain a condition that is not a market, performance, or service condition. Therefore, an entity would not classify such an award as a liability if it otherwise qualifies as equity. The amendments are effective for fiscal years, and interim periods within those fiscal years, beginning on or after December 15, 2010. The adoption of this guidance had no impact on our consolidated financial position or results of operations since our stock-based payment awards have an exercise price denominated in the same currency of the market in which our Company shares are traded., 399296=Pursuant to the Registration Rights Agreement, we agreed to file a registration statement on Form S-1 (or other applicable Form) within 60 days of the close of such financing.  We filed a Registration Statement on Form S-1 with the SEC on June 15, 2010, and on October 21, 2010, the SEC declared the Form S-1 effective., 404481=Additionally, as a result of the Exchange, we changed our fiscal year end to December 31., 1089708=The goodwill in the amount of $1,103,309 recorded in the consolidated balance sheet of the VIE Group as of December 31, 2010 (see Note 3) was generated from the acquisition of Haoliangxin by Deyufarm on July 24, 2010. In 2010, goodwill was tested for impairment and it was determined that goodwill was not impaired as of December 31, 2010. Pursuant to the Termination Agreements for the VIE Group, the Company deconsolidated the VIE Group and no goodwill was presented on the consolidated balance sheets as of December 31, 2011 and 2010 of the Company after reclassification of the assets and liabilities of discontinued operations., 286237=As a percentage of net revenue, cost of goods sold increased by 920 basis points from 74.3% for the year ended December 31, 2010 to 83.5% for the year ended December 31, 2011. We experienced a purchase cost increase on both corn and grains caused by the inflation in prices of raw materials in China. Our sales expansion strategies that we implemented by lowering the average selling price compared with the market price reduced our profit margin. The increasing percentage by 1170 basis points of bulk trading of total sales with a margin of 8.3% for the year ended December 31, 2011 also negatively affected our overall profit margin., 1102006=The Company expenses the cost of advertising as incurred or, as appropriate, the first time the advertising takes place.  Advertising costs from continuing operations for the year ended December 31, 2011 and 2010 were $952,472 and $83,576 respectively. , 125954=We conduct our business in Renminbi, thus our functional currency is the Renminbi, while our reporting currency is the U.S. dollar.  The value of the Renminbi against the U.S. dollar and other currencies may fluctuate and is affected by, among other things, the political situation as well as economic policies and conditions. On July 21, 2005, the PRC government changed its decade old policy of pegging its currency to the U.S. currency. Under that policy, the Renminbi is permitted to fluctuate within a narrow and managed band against a basket of certain foreign currencies. This change in policy has resulted in an approximate 21% appreciation of the Renminbi against the U.S. dollar between 2005 and 2008. However, the PRC government decided to repeg the Renminbi to U.S. Dollars in response to the financial crisis in 2008.  On June 19, 2010, China ended the peg of Renminbi to the U.S. Dollar which allowed a greater flexibility of its exchange rate.  There remains significant international pressure on the appreciation of the Renminbi against the U.S. Dollar.  To the extent any of our future revenues are denominated in currencies other than the United States dollar, we would be subject to increased risks relating to foreign currency exchange rate fluctuations which could have a material adverse affect on our financial condition and operating results since operating results are reported in United States dollars and significant changes in the exchange rate could materially impact our reported earnings., 523601=Mr. Zhang is our Vice President responsible for the operation of the Grain Division. Since April 2004, he has been the Production Director and the General Manager of our Cereal Crops Division. Mr. Zhang is a successful entrepreneur and was appointed as a member of the Yuci People’s Congress. He was awarded the honorable title of Industrial Restructuring Leader by the Yuci Municipal Government. Mr. Zhang is the holder of an undergraduate degree and has over 10 years of experience in grain breeding, cultivation, processing, marketing and management., 59040=We have a modern processing center for corn with five drying cylinders and six warehouses, the construction of which was completed in 2011. Our total capacity of storage and annual turnover of corn has exceeded 100,000 tons and 700,000 tons, respectively. We are also equipped with fully automatic and advanced production lines for grain processing with a total production capacity of over 105,000 tons. The advanced production lines and production technologies help produce grain products with high quality by maintaining the nutritional components of the products., 395748=On April 27, 2010, Deyu (then known as Eco Building International, Inc.) completed the acquisition of City Zone Holdings Limited, an emerging organic and non-organic agricultural products distributor in Shanxi Province, China, engaged in procuring, processing, marketing and distributing various grain and corn products (“City Zone”), by means of a share exchange (the “Exchange”).  As a result of the Exchange, City Zone became a wholly-owned subsidiary of Deyu., 805879=We file periodic reports under the Securities Exchange Act of 1934, including annual, quarterly and special reports, and other information with the Securities and Exchange Commission. These periodic reports and other information are available for inspection and copying at the regional offices, public reference facilities and website of the Securities and Exchange Commission referred to above., 437485=Corn is used extensively in feeds, food for human consumption and highly processed products. According to the United States Department of Agriculture (“USDA”), the demand for corn in the global and Chinese markets has continued to increase with annual growth for 2009 through 2012 of 3% and 7%, respectively, and the growth is expected to continue in the next five years. Further, the global demand for corn has substantially exceeded supply from 2009 through 2012. China is the world’s second-leading consumer and producer of corn, second only to the United States, accounting for over 20% of the world’s consumption. The following table shows the statistics of supply and demand for the global and Chinese markets from 2009 to 2012 (including estimated and forecasted):, 430952=No single customer accounted for greater than 10% of the Company’s consolidated gross revenue or consolidated accounts receivable as of December 31, 2011. For the year ended December 31, 2010, one customer accounted for 18% of the Company’s consolidated gross revenue while no other single customer accounted for greater than 10%. The same customer accounted for 3% of the Company’s consolidated accounts receivable as of December 31, 2010 while no single customer accounted for greater than 10%., 687788=Deyufarm paid the miscellaneous expenses for the Company for $3,338 in the year of 2011.  As of December 31, 2011 and March 28, 2012, $3,338 and $0 was due under this transaction, respectively., 178651=The Regulations on the Implementation of the Food Safety Law of the People’s Republic of China as adopted at the 73rd Standing Committee Meeting of the State Council on July 8, 2009 and effective on July 20, 2009, are promulgated in accordance with the Food Safety Law of the People’s Republic of China. The Regulations require that the local People’s Government at or above the country level shall perform the responsibility specified in the Food Safety Law of the People’s Republic of China, improve the ability for supervision and administration of food safety, ensure supervision and administration of food safety; establish and improve the coordination mechanism between food safety regulatory authorities, integrate and improve the food safety information network, and realize the sharing of food safety and food inspection information and other technical resources., 809677=December 31, 2011, 745203=(2) Applicable percentage of ownership is based on 10,566,766 shares of common stock outstanding as of April 27, 2012, together with 1,995,475 shares of common stock issuable upon the conversion of convertible preferred stock, 1,154,272 shares of common stock issuance upon the exercise of warrants, and 543,333 shares of common stock issuance upon the exercise of exercisable stock options within sixty (60) days as of the date hereof for beneficial owner., 818403=In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the consolidated financial position of Deyu Agriculture Corp. as of December 31, 2011 and 2010 and the consolidated results of their operations and their cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America., 339944=As of December 31, 2011, $1,588,840 of cash was restricted as a pledge for $1,588,840 (RMB 10,000,000) of notes payable obtained from Jinzhong City Yuci District Rural Credit Union Co., Ltd. in August 2011 and $262,159 of cash was restricted as a pledge for $2,121,101 (RMB13,350,000) for a bank loan obtained from China Merchants Bank (Dongzhimen branch) in November 2011., 682969=The Company (a) sold grain products in the aggregate amount of $3.3 million to Beijing Yilian Gifts Tech Development Co., Ltd. (\"BYGT\"), the Executive Director of which is Jianming Hao, the Company's Chief Executive Officer and (b) sold corn in the aggregate amount of $1.1 million to Tieling Zhongnong Agriculture Technology Development Co., Ltd. (\"TZAT\"), the legal representative of which is Yongqin Ren, the Company's Vice President of the Corn Division, during the fiscal year ended December 31, 2011.  The Company also purchased a batch of sunflower seed for $2.6 million from TZAT in June 2011 and returned the goods at original cost for quality rejection. The prices in the transactions with such related parties were determined according to market price at the time of purchase and sale., 405472=On November 16, 2010, Detian Yu entered into a series of control agreements (collectively, the “Control Agreements”) with each of (a) Beijing Jundaqianyuan Investment Management Co., Ltd. (“Junda”), a PRC company and equity interest holder in Deyufarm Innovation Food (Beijing) Co., Ltd., a PRC company (“Deyufarm”) and (b) Jinzhong Longyue Investment Consultancy Services Co., Ltd. (“Longyue”), a PRC company and equity interest holder in Deyufarm whereby Detian Yu provided management and consulting services and business cooperation opportunities services to each of Junda and Longyue in exchange for service fees from each of Junda and Longyue equal to 100% (in the aggregate) of the net income after tax of each of Junda and Longyue.  Together, Junda and Longyue own 64.2857% of Deyufarm, and each derive 100% of their income from the profits generated by Deyufarm through its wholly-owned subsidiary, Sichuan Haoliangxin Instant Food Co., Ltd., a PRC company, and Beijing Xinggu Deyufarm Food Co. Ltd., a PRC company (together with Deyufarm, Junda and Longyue, the “VIE Group”). A complete description of the transaction is set forth in the Registrant’s Current Report on Form 8-K as filed with the SEC on November 17, 2010., 480920=Continue to develop bulk trading business based on our existing resources. We have accumulated ample resources and advantages such as extensive network of supply and sales, strong warehousing capacity and exclusive logistics. In 2011, our newly-added bulk trading business grew rapidly. We plan to continue to develop our bulk trading business by fully utilizing and diversifying our grain varieties, especially certain rare grain varieties in China such as kidney beans, green beans and sunflower seeds by anticipating the demand trend in the market., 689364=On May 10, 2011, Wenjun Tian, Jianming Hao and an unrelated third party provided a one year guarantee on a $7.9 million short-term bank loan payable to Bank of Communications by Detian Yu, bearing interest at a floating rate of prime rate plus 30% of prime rate, of which prime rate was based on the one-year loan interest rate released by The People's Bank of China.  The actual interest rate as of December 31, 2011 was 8.5280%.  The maturity date is May 9, 2012. Detian Yu paid $0 towards principal and $408,296 towards interest on the loan during the fiscal year ended December 31, 2011. $7.9 million was outstanding under the loan as of December 31, 2011 and March 28, 2012., 306415=Despite the fact that we earned net income from continuing operations before income tax of $20.7 million, income tax expenses were $184,000 for the year ended December 31, 2011, because most of the net income before income tax was from Jinzhong Deyu and Jinzhong Yuliang, which are subject to the EIT exemption. We recorded income tax benefit of $914,000 for the year ended December 31, 2010 mainly derived from net operating losses carry-forwards for the next five years., 123111=The PRC Labor Contract Law was adopted by the Standing Committee of the National People’s Congress of PRC on June 29, 2007 and became effective on January 1, 2008. The implementation of the new law, especially the following provisions, may increase our labor costs: (a) an employer shall make monetary compensation, which shall be based on the number of an employee’s working years with the employer at the rate of one month’s wage for each year, to the employee upon termination of the employment contract with certain exceptions (for example, in the circumstances where the term of a fixed-term employment contract expires and the employee does not agree to renew the contract even though the conditions offered by the employer are the same as or better than those stipulated in the current contract); (b) the wages of an employee on probation may not be less than the lowest wage level for the same job with the employer or less than 80% of the wage agreed upon in the employment contract, and may not be less than the local minimum wage rate; (c) if an employee has been working for the employer for a consecutive period of not less than 10 years, or if a fixed-term employment contract with an employee was entered into on two consecutive occasions, generally the employer should enter into an open-ended employment with such employee, unless the employee requests for a fixed-term employment contract; (d) if an employer fails, in violation of the related provisions, to enter into an open-ended contract with an employee, it shall each month pay to the employee twice his wage, starting from the date on which an open-ended employment contract should have been entered into; (e) if an employer fails to enter into a written employment contract with an employee more than one month but less than one year after the date on which the employer started using him, the employer shall each month pay to the employee twice his wage; and (f) if an employer hires an employee whose employment contract with another employer has not yet been terminated or ended, causing the other employer to suffer a loss, it shall be jointly and severally liable with the employee for the compensation of such loss. Our labor costs may increase due to the implementation of the new PRC Labor Contract Law and our business and results of operations may be materially and adversely affected., 684631=The Company paid social insurance and office rental for Deyufarm Innovation Food (Beijing) Co., Ltd. (\"Deyufarm\"), a former variable interest entity of the Company, for $89,929 in December 2011. The amounts due from Deyufarm as of December 31, 2011 and March 28, 2012 under this transaction were $89,929 and $0, respectively., 313926=For the year ended December 31, 2011, net cash used in operating activities of continuing operations totaled approximately $7.7 million, while net cash provided by operating activities of continuing operations was $3.9 million for the year ended December 31, 2010. This increase of net cash used in operating activities was primarily attributable to an increase of cash used in expanding sales by granting credit to customers and purchasing inventory as a result of the key driver of continuous sales growth of our corn and grain businesses. Our corn and grain business requires immediate cash payments to farmers and their agents before our accounts receivable can be collected from customers. As our business continued to grow, our supply of raw material was supplemented by grain traders or wholesalers, some of which require advanced payments for purchasing, and more cash was used in inventory purchases accordingly. The increase in accounts receivable was $23.8 million for the year ended December 31, 2011 as compared to $6.6 million in the year ended December 31, 2010 as a result of growth of our net revenue and credit offered to new retailers and wholesalers. The continuous increase in inventories and advance to suppliers also contributed to the increase in net cash used in our operating activities of continuing operations, which was $8.7 million and $8.8 million for the years ended December 31, 2011 and 2010 respectively. , 303031=General and administrative expenses increased by $4.6 million to $8.2 million in the year ended December 31, 2011, or 127.8%, compared to $3.6 million for the year ended December 31, 2010. This increase was attributable to increased employee bonuses for good business performance, increased expenses spent on professional services for us as a U.S. public company and other increased expenses due to our business expansion., 177454=The Food Safety Law of the People’s Republic of China as adopted at the 7th Session of the Standing Committee of the 11th National People’s Congress of the People’s Republic of China and effective on June 1, 2009, governs the food safety in food production and business operation activities. Pursuant to the Food Safety Law of the People’s Republic of China, food producers must establish an internal inspection and record system for raw materials and predelivery products, and food distributors must also establish internal systems to record and inspect food products procured from suppliers. In addition, any food addictives that are not in the approved government catalog must not be used and no food products can be sold inspection-free., 17404=The Registrant amends this registration statement on such date or dates as may be necessary to delay its effective date until the Registrant shall file a further amendment which specifically states that this registration statement shall hereafter become effective in accordance with Section 8(a) of the Securities Act of 1933, or until the registration statement shall become effective on such date as the Commission, acting pursuant to Section 8(a), may determine., 230931=Because our control over the VIE Group terminated on December 20, 2011, the operations results of the VIE Group have been presented as discontinued operations. Therefore, management’s discussion and analysis set forth herein below are based on the results of continuing operations., 1035491=Junda is a limited liability company incorporated in the PRC on June 13, 2010 with registered capital of $14,637 (or RMB 100,000) by Jianming Hao, Chairman and Chief Executive Officer of the Company, and Wenjun Tian, President and Executive Director of the Company.  As of December 31, 2010, Junda’s equity interest was 100% held by several executives and managers of the Company, including (a) Jianming Hao, owning 33% of Junda, (b) Wenjun Tian, owning 34% of Junda, (c) Jianbin Zhou, the Chief Operating Officer of the Company, owning 10% of Junda, (d) Li Ren, Vice President of Branding and Marketing of the Company, owning 5% of Junda, (e) Yongqing Ren, Vice President of the Corn Division of the Company, owning 3% of Junda and (f) Junde Zhang, Vice President of the Grain Division of the Company, owning 3% of Junda.  As a result, the execution of the Contractual Arrangements with Junda is considered a related party transaction., 72872=Simultaneously with the acquisition of City Zone, we completed a private placement offering in the gross amount of $8,211,166 of the sale of securities to accredited investors at $4.40 per unit, with each “Unit” consisting of one share of our Series A convertible preferred stock and one warrant to purchase 0.4 shares of our common stock with an exercise price of $5.06 per share. On May 10, 2010, we closed on the second and final round of the private placement offering as disclosed in our Current Report on Form 8-K filed with the SEC on May 3, 2010 through the sale of 589,689 Units comprised of 589,689 shares of our Series A convertible preferred stock and 235,882 five-year warrants with an exercise price of $5.06 per share, to certain accredited investors for total gross proceeds of $2,594,607. We raised an aggregate amount of $10,805,750 in the two rounds of offerings., 543183=The board of directors has adopted a written charter for the Audit Committee.  During the fiscal year ended December 31, 2011, the Audit Committee met six times., 803082=KCCW Accountancy Corp., Certified Public Accountants, an independent registered public accounting firm, has audited, as set forth in its report thereon appearing elsewhere herein, our financial statements at December 31, 2011 and 2010 and for the years then ended that appear in the prospectus. The financial statements referred to above are included in this prospectus in reliance upon the independent registered public accounting firm’s report on their given authority as experts in accounting and auditing., 163963=On December 26, 2007, the State Council issued a Notice on Implementing Transitional Measures for Enterprise Income Tax, providing that the enterprises that have been approved to enjoy a low tax rate prior to the promulgation of the PRC Enterprise Income Tax Law will be eligible for a five-year transition period since 1 January, 2008, during which time the tax rate will be increased step by step to the 25% unified tax rate set out in the PRC Enterprise Income Tax Law. From 1 January, 2008, for the enterprises whose applicable tax rate was 15% before the promulgation of the PRC Enterprise Income Tax Law , the tax rate will be increased to 18% for year 2008, 20% for year 2009, 22% for year 2010, 24% for year 2011, 25% for year 2012. For the enterprises whose applicable tax rate was 24%, the tax rate will be changed to 25% from January 1, 2008., 84293=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Wenjun Tian, a former Director and former President of the Company, will have an option, subject to certain performance targets (discussed in more detail below), to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 300 shares of Expert Venture Limited, which constitutes 30% of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Tian will indirectly (through his ownership of Expert Venture Limited) own and control 1,660,354 shares, which equal 11.64% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Tian. As a result, the number of shares of beneficial ownership has included 1,660,354 shares of common stock that have become transferrable to Mr. Tian after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010., 325027=On November 5, 2010, we filed a Registration Statement with the SEC on Form S-8 covering up to 1,000,000 shares underlying options which may be granted under the Plan. As of March 19, 2012, none of the options granted pursuant to the Plan have been exercised., 1034927=On November 16, 2010, Detian Yu entered into a series of contractual arrangements (the “Contractual Arrangements”) with each of Beijing Jundaqianyuan Investment Management Co., Ltd. (“Junda”), Jinzhong Longyue Investment Consultancy Services Co., Ltd. (“Longyue”), and their shareholders, pursuant to which Detian Yu effectively took over management of the business activities of Junda and Longyue., 157687=In October 2005, the State Administration of Foreign Exchange issued the Notice on Issues Relating to the Administration of Foreign Exchange in Fund-raising and Return Investment Activities of Domestic Residents Conducted via Offshore Special Purpose Companies, or the State Administration of Foreign Exchange Notice 75, which became effective as of November 1, 2005, and was further supplemented by three implementation notices issued by the State Administration of Foreign Exchange on November 24, 2005 May 29, 2007 and May 20, 2011, respectively. The State Administration of Foreign Exchange Notice 75 states that PRC residents, whether natural or legal persons, must register with the relevant local State Administration of Foreign Exchange branch prior to establishing or taking control of an offshore entity established for the purpose of overseas equity financing involving onshore assets or equity interests held by them. The term “PRC legal person residents” as used in the State Administration of Foreign Exchange Notice 75 refers to those entities with legal person status or other economic organizations established within the territory of the PRC. The term “PRC natural person residents” as used in the State Administration of Foreign Exchange Notice 75 includes all PRC citizens and all other natural persons, including foreigners, who habitually reside in the PRC for economic benefit. The State Administration of Foreign Exchange implementation notice of November 24, 2005 further clarifies that the term “PRC natural person residents” as used under the State Administration of Foreign Exchange Notice 75 refers to those “PRC natural person residents” defined under the relevant PRC tax laws and those natural persons who hold any interests in domestic entities that are classified as “domestic-funding” interests., 298719=Our gross profit increased by $21.2 million, or 96.8%, from $21.9 million for the year ended December 31, 2010 to $43.1 million for the year ended December 31, 2011. The increase was attributable to an increase in sales volume, including an increase of $14 million in the Corn Division, $3.6 million in the Grain Division and $3.6 million in the Bulk Trading Division.  Our gross margin decreased from 25.7% in the year ended December 31, 2010 to 16.5% in the year ended December 31, 2011. The decrease in gross margin was the combined result of a drop in gross margin in our Corn Division, a drop in grain sales and a low margin contributed by our bulk trading business, a newly-added business in the fourth quarter of 2010., 8976=If any of the securities being registered on this form are to be offered on a delayed or continuous basis pursuant to Rule 415 under the Securities Act of 1933, check the following box. x, 690269=On August 9, 2011, Yuci Jinmao Food Processing Factory, the legal representative of which is Junlian Zheng, the wife of Junde Zhang, the Vice President of the Company, provided a two-year guarantee on a $1.4 million short-term bank loan payable to Jinzhong City Yuci District Rural Credit Union Co., Ltd. by Jinzhong Yongcheng, bearing interest at a floating rate of prime rate plus 130% of prime rate, of which prime rate was based on the six-month to one-year loan interest rate released by The People's Bank of China.  The actual interest rate as of December 31, 2011 was 15.084%.  The maturity date is August 7, 2012.  Jinzhong Yongcheng paid $0 towards principal and $73,291 towards interest on the loan during the fiscal year ended December 31, 2011. $1.4 million was outstanding under the loan as of December 31, 2011 and March 28, 2012,, 215389=On November 5, 2010, we filed a Registration Statement with the SEC on Form S-8 covering up to 1,000,000 shares underlying options which may be granted under the Plan. As of March 28, 2012, none of the options granted pursuant to the Plan have been exercised., 1045816=On December 20, 2011, Detian Yu entered into a series of termination agreements (collectively, the “Termination Agreements”) with each of Junda, Longyue and their shareholders, pursuant to which Detian Yu gave up the control management of the business activities of Junda and Longyue. According to the Termination Agreements, each side agreed to terminate the Contractual Arrangements entered into on November 16, 2010., 376993=Except for the classification for discontinued operations, certain classifications have been made to the prior year financial statements to conform to the current year presentation.  The reclassifications have no impact on the Company’s 2010 consolidated statement of operations and retained earnings., 365911=We offer a right of exchange on our grain products sold through our relationship with grocery store networks.  The consumer who purchases the product may exchange it for the same kind and quantity of product originally purchased.  In accordance with FASB ASC 605-15-25-1 and 605-15-15-2, these are not considered returns for revenue recognition purposes.  For the years ended December 31, 2011 and 2010, the returns of our product were not material., 493152=We are also engaged in the production and sale of grain foods. The supervising authority for such production is the Technology Quality Supervision Bureau of Shanxi Province. Pursuant to Food Safety Laws and ancillary regulations, China’s Head Office of the Technology Quality Supervision Bureau supervises technology quality of enterprises which are engaged in food production. The Bureau issues Food Production Permits, undertakes mandatory examinations of technology quality for entry into the industry and is responsible for investigation of incidents regarding food safety. Pursuant to Regulation 29 of the Food Safety Laws, entities engaging in food production, food distribution and food service, must obtain the Food Production Permit, Food Distribution Permit and Food Service Permit. Those who have obtained the Food Production Permit are authorized to operate food production businesses and are not required to apply for a Food Distribution Permit. Deyu has also obtained the nation’s Industrial Production Permit from the Technology Quality Supervision Bureau (Cereals: QS140701040051 and Flour: QS140701016210). Our food labeling complies with the Interim Measures for Labeling of Food Products of Enterprises in Shanxi Province and GB7718-1994 Standards for Food Products Labeling and has obtained the relevant registration certificate (Record number SB/1407000-009-01)., 308482=The following summarizes the key components of our cash flows for the year ended December 31, 2011 and 2010:, 362062=This guidance applies to other accounting pronouncements that require or permit fair value measurements.  On February 12, 2008, the FASB finalized FASB Staff Position (FSP) No. 157-2, Effective Date of FASB Statement No. 157 (ASC 820).  This Staff Position delays the effective date of SFAS No. 157 (ASC 820) for nonfinancial assets and liabilities to fiscal years beginning after November 15, 2008 and interim periods within those fiscal years, except for those items that are recognized or disclosed at fair value in the financial statements on a recurring basis (at least annually).  The adoption of SFAS No. 157 (ASC 820) had no effect on the Company's financial position or results of operations., 685182=The Company sold grain products to Beijing Doukounianhua Biotechnology Co., Ltd., the legal representative of which is Jianbin Zhou, the Company's Chief Operating Officer, for total $24,666 in December 2011.  As of December 31, 2011 $24,666 was due under this transaction and remained outstanding as of March 28, 2012., 6339=1802 North Carson Street. Suite 108, 172740=The Regulations on the Safety Administration of Dangerous Chemicals was promulgated by the State Council on January 26, 2002, effective as of March 15, 2002. It sets forth general requirements for manufacturing and the storage of dangerous chemicals in China. The Regulations on the Safety Administration of Dangerous Chemicals requires that companies manufacturing dangerous chemicals establish and strengthen their internal regulations and rules on safety control and fulfill the national standards and other relevant provisions of the State. In addition, according to the Regulations on the Safety Administration of Dangerous Chemicals, companies that manufacture, store, transport or use dangerous chemicals shall be required to obtain corresponding approvals or licenses with the State Administration of Work Safety and its local branches and other proper authorities. Companies that manufacture or store dangerous chemicals without approval or registration with the proper authorities can be shut down, ordered to stop manufacturing or ordered to destroy the dangerous chemicals. Such companies can also be subject to fines. If criminal law is violated, the persons chiefly liable, along with other personnel directly responsible for such impropriety, shall be subject to relevant criminal liability., 283207=Net revenue from our Grain Division for the year ended December 31, 2011 was $40.5 million, an increase of $29 million, or 253%, as compared to the year ended December 31, 2010. The increase was primarily due to growth of our market share through the expansion of our sales network and promotional activities. Our retail distribution network covered approximately 20,000 supermarkets and convenience stores as of December 31, 2011, as compared to approximately 10,000 stores as of December 31, 2010. We developed special counters in over 200 supermarkets with open and loose grains in baskets where customers can scoop the grains into plastic bags to determine the volume they want. This sales strategy targets a large number of consumers and significantly contributes to our net revenue increase. Our marketing initiatives such as promotion and hosting new product press conferences also increased our brand awareness among customers as well as sales revenue. The sales volume and revenue from our Grain Division for the year ended December 31, 2011 reached 31,878 tons and $40.5 million, respectively., 449512=Corn is primarily used as raw feed material for pigs, cattle, chicken and other livestock. Corn byproducts, including corn stalks, are also used as an important source of feed. Since 1997, feed production has maintained steady growth. China is now the world’s second largest feed producer according to USDA., 171336=On June 29, 2002, the Work Safety Law of the PRC was adopted by the Standing Committee of the 9th National People’s Congress and came into effect on November 1, 2002, as amended on August 27, 2009. The Work Safety Law provides general work safety requirements for entities engaging in manufacturing and business activities within the PRC. Additionally, Regulation on Work Safety Licenses, as adopted by the State Council on January 7, 2004 effective on January 13, 2004, requires enterprises engaging in the manufacture of dangerous chemicals to obtain a work safety license with a term of three years. If a work safety license needs to be extended, the enterprise must go through extension procedures with authorities three months prior to its expiration. In addition, on May 17, 2004, the Measures for Implementation of Work Safety Licenses of Dangerous Chemicals Production was promulgated as implementing measures to the Regulation on Work Safety Licenses which provides that entities producing dangerous chemicals are required to obtain work safety licenses pursuant to specific requirements. Without work safety licenses, no entity may engage in the formal manufacture of dangerous chemicals., 693584=On January 13, 2010, Jinzhong Deyu and Jinzhuong Yuliang provided a two-year guarantee on a $1.3 million short-term bank loan payable to Shanxi Province Rural Credit Union by Jingzhong Yongcheng, bearing interest at a floating rate of prime rate plus 107% of prime rate, of which prime rate was based on the six-month to one-year loan interest rate released by The People's Bank of China.  The loan was originally due January 13, 2011.  In January 2011, the Company entered into an agreement with the bank for an extension and the new term was from January 14, 2011 to June 11, 2011.  The adjustable interest rate was a rate per annum equal to the prime rate plus 107% of prime rate.  The prime rate was based on the one to three year loan interest rate released by The People's Bank of China.  The loan was fully paid off on May 11, 2011, with Jingzhong Yongcheng paying the principal amount of $1.3 million plus $6,750 in accrued interest., 758030=Pursuant to a share transfer agreement dated April 26, 2010, Mr. Jianming Hao, the Chairman of the Board and the President and Chief Executive Officer of the Company, has the option, subject to certain performance targets, to purchase from Mr. Yam Sheung Kwok, the current sole shareholder of Expert Venture Limited, up to 101 shares of Expert Venture Limited. Accordingly, upon exercise of such option, Mr. Hao will indirectly (through his ownership of Expert Venture Limited) own and control 558,986 shares, which equal 3.92% of the fully-diluted percentage of outstanding shares as of the date of this prospectus. Since the performance targets set forth in the share transfer agreement have been met, the option has vested and become exercisable to Mr. Hao. As a result, the number of shares of beneficial ownership has included 558,986 shares of common stock that have become transferrable to Mr. Hao after adjusting proportionally to the reduction of total number of shares held by Expert Venture Limited since April 2010. In addition, the Company has granted to Mr. Hao options to purchase 250,000 shares of our common stock under the Plan, 100,000 of which have vested., 1071532=On April 27, 2010, as a result of the consummation of the Share Exchange, we changed our fiscal year end from May 31 to December 31 to conform to the fiscal year end of City Zone., 64467=On July 25, 2011, we incorporated and registered Hebei Yugu, a 70%-owned subsidiary of Detian Yu with RMB10,000,000 ($1,563,824) in registered capital, in Gaocheng City of Shijiazhuang, Hebei Province, China. Hebei Yugu is primarily engaged in wholesale distribution of grains, beans and potatoes., 64950=On February 2, 2012, RedSun Technology (Shenzhen) Co. Limited ( “Redsun”), a wholly-owned subsidiary of the Company, acquired 100% of the issued and outstanding registered share capital of Taizihu and its subsidiary, Huichun (together with Taizihu, the “Taizihu Group”) in consideration of RMB34,705,000 ($5,502,181). The Taizihu Group is in the business of producing and selling bean based products, fruit vinegars and juices and other grain products. The Company will file the audited financial statements of the Taizihu Group and pro forma financial information required to be filed with the SEC not later than April 19, 2012 in accordance with the rules of the SEC., 1100175=We offer a right of exchange on our grain products sold through our relationship with grocery store networks.  The consumer who purchases the product may exchange it for the same kind and quantity of product originally purchased.  In accordance with FASB ASC 605-15-25-1 and 605-15-15-2, these are not considered returns for revenue recognition purposes.  For the years ended December 31, 2011 and 2010, the returns of our product were not material., 301429=Gross profit in the Bulk Trading Division was $3.6 million, contributing to 8.4% of total gross profit for the year ended December 31, 2011. We began to conduct bulk trading business in the fourth quarter of 2010 and its gross profit for the year ended December 31, 2010 was immaterial. The gross margin for the year ended December 31, 2011 was 8.3%, which was relatively lower compared with grain retail business due to its nature of high turnover rate., 1043532=On February 21, 2011, Deyufarm received capital injection of $3,800,505 (RMB 24,971,218) from SBCVC Fund III Company Limited (\"SBCVC\"), a company organized under the laws of Hong Kong, in exchange for 35.69% of Deyufarm's equity interest pursuant to the two Investment and Relevant Issues Agreements entered into by each of Junda and Longyue with Deyufarm and SBCVC on September 15, 2010. According to the Investment and Relevant Issues Agreements, SBCVC shall invest an equivalent of RMB 25,000,000 of US dollars to Deyufarm. Before or in the meantime that SBCVC completes such investment to Deyufarm, Longyue shall have invested RMB 35,000,000 to Deyufarm through a capital increase and obtained the relevant capital verification report. Any time within 2 years after completing an investment to Deyufarm, SBCVC has the right to require Deyufarm to repurchase in advance, or Junda or Longyue to purchase part of or all the equity interests of Deyufarm owned by SBCVC. The board of directors of Deyufarm shall be comprised of 3 directors, and Junda, Longyue and SBCVC shall each nominate one director. The board of directors shall nominate a financial administrator agreed to by SBCVC. Forty-eight (48) months after SBCVC completes its investment in Deyufarm, the parties shall consummate a qualified IPO of Deyufarm., 179973=The Law of the People’s Republic of China on Quality and Safety of Agricultural Products was adopted at the 21st Meeting of the Standing Committee of the Tenth National People’s Congress on April 29, 2006. This Law was enacted in order to ensure the quality and safety of agricultural products, maintain the health of the general public, and promote the development agriculture and rural economy. Pursuant to this Law, agricultural products distribution enterprises shall establish a sound system of inspection and acceptance for their purchases. In addition, agricultural products that fail to pass the inspection based on the quality and safety standards of agricultural products cannot be marketed., 522676=Mr. Wang was appointed to serve as a director of the Company effective April 30, 2012. Mr. Wang has served as Vice President of Detian Yu since October 2009. Prior to that, Mr. Wang served as General Manager of Shanxi Dongsheng Guarantee Company Limited from February 2009 through October 2009. Prior to that, Mr. Wang worked for the Labaor Bureau of Jinzhong in Shanxi Province from July 1996 through January 2009. Mr. Wang received his bachelor's degree from the Chinese Agriculture University in 1996., 304842=Interest expense for the year ended December 31, 2011 was $806,000 compared to interest expense of $341,000 for the year ended December 31, 2010, an increase of $464,000, or 136%.  This increase was mainly due to the increase in short-term loans for working capital., 674594=(1) The numbers for 2010 represents the aggregated fair value to option awards granted to the directors as at the grant date of the options granted in November 18, 2010, which is determined in accordance with ASC Topic 718.  For information regarding the fair value of option awards as at the grant date of the options, please refer to Note 15 of the Consolidated Financial Statements – Share-Based Compensation., 549372=The following table sets forth all cash compensation paid by us, as well as certain other compensation paid or accrued, in 2010 and 2011, to each of the following named executive officers:, 217603=On November 4, 2010, the Company’s Board of Directors approved the Company’s 2010 Share Incentive Plan.  Under the Plan, 1,000,000 shares of the Company’s common stock shall be allocated to and authorized for use pursuant to the terms of the Plan.  On November 8, 2010, a total of 931,000 non-qualified incentive stock options were approved by our Board of Directors and granted under the Plan to executives, key employees, independent directors, and consultants at an exercise price of $4.40 per share and on December 15, 2010, 40,000 non-qualified incentive stock shares were approved by our Board of Directors and granted under the Plan to a consultant at an exercise price of $4.40 per share, of which shall vest as follows:, 591217=(5) Effective April 30, 2012, Mr. Hao was appointed to serve as President of the Company., 223692=On July 29, 2011, we distributed 66,379 shares of Series A convertible preferred shares as a cumulative Series A convertible preferred share dividend of $212,420 in aggregate, to such holders of Series A convertible preferred stock on a pro rata basis and on January 27, 2012, we issued a Series A convertible preferred share dividend equal to $219,721, in the aggregate, to such holders of Series A convertible preferred stock on a pro rata basis., 524590=Mr. Ren has been the Vice President and General Manager of our Corn Division since April 2004. He was conferred the honorable title of Industrial Restructuring Leader for two consecutive years and the prize of Top Ten Youth Career Development Contributor by the Yuci Municipal Government. Mr. Ren is the holder of an undergraduate degree. He is well experienced in corn breeding, cultivation, processing, marketing and management., 816341=We have audited the accompanying consolidated balance sheets of Deyu Agriculture Corp. (the “Company”) as of December 31, 2011 and 2010, and the related consolidated statements of income and comprehensive income, stockholders’ equity, and cash flows for the years then ended.  These consolidated financial statements are the responsibility of the Company's management.  Our responsibility is to express an opinion on these consolidated financial statements based on our audits., 24937=We are a reporting company pursuant to Section 12(g) of the Securities Exchange Act of 1934, or the Exchange Act, and our common stock is currently quoted on the OTC Markets-OTC Pink under the symbol “DEYU.PK”.  On April 27, 2012, the last reported sale price of our common stock was $1.65 per share., 685716=The Company sold grain products to Jinshang International Finance Leasing Co., Ltd., a shareholder and the Executive Director of which is Wenjun Tian, the Company’s former President and a Director, for $3,537 in September 2011.  As of December 31, 2011, $3,537 was due under this transaction and remained outstanding as of March 28, 2012. Effective April 30, 2012, Mr. Tian resigned as the Company’s President and as a member of the Board of Directors., 339229=As a result of the financings associated with the Exchange, we had, as of December 31, 2010, $125,560 in a trust account. The use of these funds requires the written approval of our placement agent and us. The funds in the escrow account were designated for certain expenses, such as investor relations, accounting/consulting fees, SEC fees, and stock transfer agent fees. This amount was classified as restricted cash under current assets on our balance sheet as of December 31, 2010, while the restriction was released in 2011., 792759=The selling stockholder may also sell shares under Rule 144 under the Securities Act of 1933, as amended (the “Securities Act”), if available, rather than under this prospectus., 404781=On May 19, 2010, we filed with the Secretary of State for the State of Nevada a Certificate of Amendment to our Articles of Incorporation changing our name from “Eco Building International, Inc.” to “Deyu Agriculture Corp.” FINRA declared the name change effective on June 2, 2010., 266095=Our net revenue for the year ended December 31, 2011 was $261.6 million compared with $85.2 million for the year ended December 31, 2010, an increase of $176.4 million, or 207%, of which $108.2 million was attributable to corn sales, $29 million to grain sales and the remaining $39.2 million to bulk trading sales. Sales derived from our Corn Division, Grain Division and Bulk Trading Division for the year ended December 31, 2011 were $177.7 million, $40.5 million and $43.3 million respectively, accounting for 67.9%, 15.5% and 16.6% of total net revenue, respectively., 70839=2010 Share Exchange, 1031583=City Zone was incorporated in the British Virgin Islands on July 27, 2009 under the BVI Business Companies Act, 2004.  In November 2009, pursuant to a restructuring plan set out below, City Zone has become the holding company of a group of companies comprising Most Smart, Shenzhen Redsun, Shenzhen JiRuHai, Beijing Detian Yu, Jinzhong Deyu, Jinzhong Yongcheng, and Jinzhong Yuliang., 340695=Accounts receivable are recorded at net realizable value consisting of the carrying amount less allowance for doubtful accounts, as needed.  We assess the collectability of accounts receivable based primarily upon the creditworthiness of the customer as determined by credit checks and analysis, as well as the customer’s payment history.  Management reviews the composition of accounts receivable and analyzes historical bad debts, customer concentrations, customer credit worthiness, current economic trends, and changes in customer payment patterns to evaluate the adequacy of these reserves.  As of December 31, 2011 and 2010, there were no customers with accounts receivable greater than six months past due., 397122=On May 10, 2010, we closed on the second and final round of the private placement offering as disclosed in our Current Report on Form 8-K filed with the SEC on May 3, 2010 through the sale of 589,689 Units comprised of 589,689 shares of our Series A convertible preferred stock and 235,882 five-year warrants with an exercise price of $5.06 per share, to certain accredited investors for total gross proceeds of $2,594,607. We raised an aggregate amount of $10,805,750 in the two rounds of offerings., 659520=Our directors are reimbursed for expenses incurred by them in connection with attending Board of Directors’ meetings.  The following table presents compensation distributed to our independent directors during the years ended December 31, 2011 and December 31, 2010 for serving on the Board of Directors:, 1029406=On May 11, 2010, our Board of Directors adopted a resolution to change our name to \"Deyu Agriculture Corp.\"  FINRA declared the name change effective on June 2, 2010., 1029945=On April 27, 2010, we entered into a Share Exchange Agreement (“Share Exchange”) under which we issued 8,736,932 shares of common stock, par value $0.001 per share, to Expert Venture Limited (“Expert Venture”), a company organized under the laws of the British Virgin Islands, and the other shareholders of City Zone (“the “City Zone Shareholders”).  As a result of the Share Exchange, City Zone became our wholly-owned subsidiary and City Zone Shareholders acquired a majority of our issued and outstanding common stocks.  Concurrent with the Share Exchange, Mr. Jianming Hao (“Mr. Hao”), the managing director of City Zone and all of its operating subsidiaries, was appointed our Chief Executive Officer., 680353=On January 10, 2011, we entered into an employment agreement with Charlie Lin pursuant to which Mr. Lin was hired as our Chief Financial Officer. Effective March 5, 2012, Mr. Lin’s employment and his employment agreement were terminated., 159710=PRC residents are required to complete amended registrations with the local State Administration of Foreign Exchange branch upon: (i) injection of equity interests or assets of an onshore enterprise to the offshore entity, or (ii) subsequent overseas equity financing by such offshore entity. PRC residents are also required to complete amended registrations or filing with the local State Administration of Foreign Exchange branch within 30 days of any material change in the shareholding or capital of the offshore entity, such as changes in share capital, share transfers and long-term equity or debt investments and these changes do not relate to return investment activities. PRC residents who have already organized or gained control of offshore entities that have made onshore investments in the PRC before the State Administration of Foreign Exchange Notice 75 was promulgated must register their shareholdings in the offshore entities with the local State Administration of Foreign Exchange branch on or before March 31, 2006., 739683=The following table presents information regarding Expert Venture Limited. The information concerning beneficial ownership has been taken from our stock transfer records and information provided by Expert Venture Limited and is dated as of April 27, 2012. Beneficial ownership has been calculated in accordance with the rules of the SEC, which generally attribute beneficial ownership of securities to persons who possess sole or shared voting power or investment power with respect to those securities and include shares of common stock issuable pursuant to the exercise of stock options or warrants that are either immediately exercisable or exercisable within 60 days of April 27, 2012., 367417=The Company expenses its research and development costs as incurred.  Research and development costs from continuing operations for the years ended December 31, 2011 and 2010 were $98,393 and $73,860, respectively., 1099521=The Company’s revenue is recognized net of value-added tax (VAT), reductions to revenue for estimated product returns, and sales discounts based on volume achieved in the same period that the related revenue is recorded.  The estimates are based on historical sales returns, analysis of credit memo data, and other factors known at the time.  For the years ended December 31, 2011 and 2010, sales discounts from continuing operations were $70,987 and $0, respectively., 687226=Wenjun Tian, the Company's former President and a Director, loaned the Company in the aggregate amount of $2.5 million in the year ended December 31, 2011.  Such loan is unsecured, bears no interest and no due date is specified.  As of December 31, 2011, $2.5 million was due under this advance and remained outstanding as of March 28, 2012., 657212=(1) Effective April 30, 2012, Mr. Tian resigned as the Company’s President and as a member of the Board of Directors., 214279=On March 8, 2012, the Company’s Board of Directors allocated to and authorized for use the maximum number of shares allowable pursuant to the terms of the Plan and granted 420,000 options under the Plan, of which 264,000 were new options and 156,000 were re-granted after such options were forfeited by employees as a result of their resignations from the Company in accordance with the terms of their option agreements. All of the newly granted options vest as follows:, 684205=The Company sold grain products to BYGT for $3.3 million in the year 2011 and the amounts due from/ to BYGT as of December 31, 2011 and March 28, 2012 were $468,976 and $285,210 under this transaction, respectively., 1074289=As of December 31, 2011, $1,588,840 of cash was restricted as a pledge for $1,588,840 (RMB 10,000,000) of notes payable obtained from Jinzhong City Yuci District Rural Credit Union Co., Ltd. in August 2011 and $262,159 of cash was restricted as a pledge for $ 2,121,101 (RMB 13,350,000) of bank loan obtained from China Merchants Bank at Dongzhimen branch in November 2011., 129432=Pursuant to the Foreign Exchange Control Regulations of the PRC issued by the State Council which came into effect on April 1, 1996, and the Regulations on the Administration of Foreign Exchange Settlement, Sale and Payment of the PRC which came into effect on July 1, 1996, regarding foreign exchange control, conversion of Renminbi into foreign exchange by Foreign Investment Enterprises, or FIEs, for use on current account items, including the distribution of dividends and profits to foreign investors, is permissible. FIEs are permitted to convert their after-tax dividends and profits to foreign exchange and remit such foreign exchange to their foreign exchange bank accounts in the PRC. Conversion of Renminbi into foreign currencies for capital account items, including direct investment, loans, and security investment, is still under certain restrictions. On January 14, 1997, the State Council amended the Foreign Exchange Control Regulations and added, among other things, an important provision, which provides that the PRC government shall not impose restrictions on recurring international payments and transfers under current account items., 819724=Tel: +1 909 348 7228 • Fax: +1 626 529 1580 • info@kccwcpa.com, 1032328=In November 2009, pursuant to a restructuring plan (“Restructuring”) intended to ensure compliance with the PRC rules and regulations, City Zone, through a series of acquisitions and wholly-owned subsidiaries, acquired 100% equity interests in Jinzhong Deyu, Jinzheng Yuliang, and Jinzhong Yongcheng.  The former shareholders and key management of Jinzhong Deyu, Jinzhong Yongcheng, and Jinzhong Yuliang became the ultimate controlling parties and key management of City Zone.  This restructuring exercise has been accounted for as a recapitalization of Jinzhong Deyu, Jinzhong Yongcheng, and Jinzhong Yuliang with no adjustment to the historical basis of the assets and liabilities of these companies, while the historical financial positions and results of operations are consolidated as if the restructuring occurred as of the beginning of the earliest period presented in the accompanying consolidated financial statements.  For the purpose of consistent and comparable presentation, the consolidated financial statements have been prepared as if City Zone had been in existence since the beginning of the earliest and throughout the whole periods covered by these consolidated financial statements., 771750=In connection with our private placement in May 2010, we also issued Series A Warrants to investors and the placement agent which are exercisable into shares of common stock. Each Series A Warrant:, 691339=On August 9, 2011, Yuci Jinmao Food Processing Factory, the legal representative of which is Junlian Zheng, the wife of Junde Zhang, the Vice President of the Company, provided a two-year guarantee on a $1.4 million short-term bank loan payable to Jinzhong City Yuci District Rural Credit Union Co., Ltd. by Jinzhong Yuliang, bearing interest at a floating rate of prime rate plus 130% of prime rate, of which prime rate was based on the six-month to one-year loan interest rate released by The People's Bank of China.  The actual interest rate as of December 31, 2011 was 15.084%.  The maturity date is August 7, 2012.  Jinzhong Yuliang paid $0 towards principal and $73,291 towards interest on the loan during the fiscal year ended December 31, 2011. $1.4 million was outstanding under the loan as of December 31, 2011 and March 28, 2012., 819260=March 27, 2012, 66039=Our principal office is located at 8th Floor, Block 5, Aolinjiatai Building, 1 Kehuiqian Street, Chaoyang District, Beijing, China 100192. Our telephone number in China is +(8610)-5224 1802 and our fax number is +(8610)-5224 1822. Our telephone number in the United States is (646) 820-8060. Our corporate website is www.deyuagri.com (information on our website is not made a part of this prospectus).}",
    "lastModified": "Fri, 04 May 2012 18:37:39 GMT",
    "textBeforeTable": "  TABLE OF CONTENTS     - 2 -    The date of this prospectus is ________ ___, 2012.   Neither the Securities and Exchange Commission nor any state securities regulators have approved or disapproved of these securities or determined if this prospectus is truthful or complete. Any representation to the contrary is a criminal offense.  ",
    "textAfterTable": "    CERTAIN RELATIONSHIPS AND RELATED PARTY TRANSACTIONS 70     PRINCIPAL SHAREHOLDERS 73     SELLING STOCKHOLDER 76     DESCRIPTION OF SECURITIES 80     PLAN OF DISTRIBUTION 83     LEGAL MATTERS 85     EXPERTS 85     WHERE YOU CAN FIND ADDITIONAL INFORMATION 85     DISCLOSURE OF COMMISSION POSITION ON INDEMNIFICATION FOR SECURITIES ACT LIABILITY 86     FINANCIAL STATEMENTS 87    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}