{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard",
            "Cash on pickup",
            "Other - See seller's payment instructions",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Shure IN EAR Sound Isolating PRO EAR Phones SE425 CL Clear | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Shure-In-Ear-Sound-Isolating-Pro-Ear-Phones-SE425-CL-clear-/261211007141",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414074491,
    "recordOffset": 414026799,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at All brand new items are covered by 12 months warranty or more - See listing. If you are unsure on the warranty conditions or warranty period please give us a call. If you do experience a fault with your product please give us a call. Return policy details The buyer is responsible for return postage costs. Money Back 60 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions BEFORE MAKING PAYMENT PLEASE NOTE: - By paying with PAYPAL your sending money overseas. Help us keep the money in Australia & support Australian businesses. We accept bank deposit & credit/debit card. Alternatively we can process your payment over the phone. Give us a call (03) 5229 2269 Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}