{
    "relation": [
        [
            "Version",
            "7.x-1.1",
            "6.x-1.3"
        ],
        [
            "Download",
            "tar.gz (7.41 MB) | zip (8.61 MB)",
            "tar.gz (4.9 MB) | zip (5.65 MB)"
        ],
        [
            "Date",
            "2013-Jul-19",
            "2013-Feb-15"
        ],
        [
            "Links",
            "Notes",
            "Notes"
        ]
    ],
    "pageTitle": "Distribution project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_distribution?page=5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899896835,
    "recordOffset": 899871515,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121877=This project is still in development, there will not be a stable version for some time. Read the Road map here: http://drupal.org/node/1591448, 71751=Screencast stepping through functionality as of March 21st, 108170=New in 1.0: Support for the new .TXT format raw logs. In January, Apple discontinued the XLS-format reports sent by email. Now you can load any XLS files you already have PLUS the new TXT format logs, and get a single full report spanning all dates regardless of the report file format you import., 38919=Note: 10 July 2014 - this starterkit is nearing a 1.0 release. Please help test., 77654=Proximity Search Kickstart is a quick way to evaluate proximity based search using a Search API and Leaflet based modules stacks. Please see the slides from Drupal Camp Moscow 2014 to get more details about how it look and works.}",
    "lastModified": "Sat, 01 Aug 2015 03:56:16 GMT",
    "textBeforeTable": "Recommended releases Downloads So to improve this process, we have packaged Project Kickstart distribution with latest Drupal core and commonly used modules. All of the contributed modules, have been picked carefully and used by us in many projects. Generally we start the Drupal project development with downloading latest Drupal core and many contributed modules. For example, we need to go through various modules to find out the best suited modules for different purposes like Content, Mail, Search, Performance, User Management, Developer Tools etc. Then we need to enable those modules and need to look for dependencies, if any. The main purpose of Project Kickstart distribution is to start the Drupal project development quickly with the best recommended libraries / modules / themes. Site builders can also use this distribution as it has features like responsive design for mobile devices, in-place content editing, pre-configured CKEditor WYSIWYG tool! April 8, 2013 at 9:57am amitgoyal on Posted by Project Kickstart Categories: Actively maintained, Under active development ⋅ Read more about Converge View all releases",
    "textAfterTable": "Development releases Version Download Date Links 8.x-1.x-dev tar.gz (85.5 MB) | zip (91.46 MB) 2013-Dec-24 Notes View all releases Read more about Project Kickstart ⋅ Categories: Actively maintained, Under active development Panopoly Base Distribution Starter Kit Posted by caschbre on December 10, 2013 at 10:07pm Announcements Note: 10 July 2014 - this starterkit is nearing a 1.0 release. Please help test. Introduction The Panopoly Distribution can serve as a base distribution for other distributions similar to how a base theme operates. The latest version of Open Atrium serves as an excellent example of this. Downloads",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}