{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7",
            "Step 8"
        ],
        [
            "Command or Action",
            "enable Example: Router> enable",
            "configure terminal Example: Router# configure terminal",
            "ethernet cfm domain domain-name level level-id Example: Router(config)# ethernet cfm domain ServiceProvider level 4",
            "mep crosscheck mpid id vlan vlan-id [mac mac-address] Example: Router(config-ecfm)# mep crosscheck mpid 402 vlan 100",
            "exit Example: Router(config-ecfm)# exit Example: Router(config)#",
            "ethernet cfm mep crosscheck start-delay delay Example: Router(config)# ethernet cfm mep crosscheck start-delay 60",
            "exit Example: Router(config)# exit Example: Router#",
            "ethernet cfm mep crosscheck {enable | disable} domain domain-name {port | vlan{vlan-id | vlan-id - vlan-id | , vlan-id - vlan-id}} Example: Router# ethernet cfm mep crosscheck enable domain cust4 vlan 100"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Enters global configuration mode.",
            "Defines a CFM domain at a specified level and places the CLI in Ethernet CFM configuration mode.",
            "Statically defines a remote MEP on a specified VLAN within the domain.",
            "Returns the CLI to global configuration mode.",
            "Configures the maximum amount of time that the device waits for remote MEPs to come up before the cross-check operation is started",
            "Returns the CLI to privileged EXEC mode.",
            "Enables cross-checking between the list of configured remote MEPs of a domain and MEPs learned through CCMs."
        ]
    ],
    "pageTitle": "Carrier Ethernet Configuration Guide, Cisco IOS Release 15S - Configuring IEEE Standard-Compliant Ethernet CFM in a Service Provider Network [Cisco IOS 15.5S] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/cether/configuration/15-s/ce-15-s-book/ce-cfm-ieee.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374077083,
    "recordOffset": 374012581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{592017=IEEE 802.1ag-2007 Compliant CFM - Bridge Domain Support, 577109=ITU-T Y.1731 OAM Mechanisms for Ethernet-Based Networks, 584112=802.1ag - IEEE D8.1 Standard-Compliant CFM, Y.1731 multicast LBM / AIS / RDI / LCK, IP SLA for Ethernet}",
    "textBeforeTable": "DETAILED STEPS 6.    Determine customer MEPs. 5.    Determine customer MIPs. 4.    Determine service provider MEPs. 3.    Determine service provider MIPs. 2.    Determine operator level MEPs. 1.    Determine operator level MIPs. SUMMARY STEPS Determination of whether the domain should be inward or outward. Assignment of maintenance levels and names to domains based on agreement between the service provider and operator or operators. Determination of the nesting and disjoint maintenance domains. Determination of the number of maintenance domains in the network. Agreement by all organizational entities on the responsibilities, roles, and restrictions for each organizational entity. Understanding of the type and scale of services to be offered. Understanding of organizational entities involved in managing the network; for example, operators, service providers, network operations centers (NOCs), and customer service centers. Knowledge and understanding of the network topology. Before You Begin",
    "textAfterTable": "Examples The figure below shows an example of a network with a service provider and two operators, A and B. Three domains are to be established to map to each operator and the service provider. In this example, for simplicity we assume that the network uses Ethernet transport end to end. CFM, however, can be used with other transports. Configuring IEEE Ethernet CFM Provisioning the Network Provisioning Service Configuring and Enabling the Cross-Check Function Provisioning the Network Provisioning the Network for CE-A Provisioning the Network for U-PE A Provisioning the Network for PE-AGG A Provisioning the Network for N-PE A Provisioning the Network for U-PE B Provisioning the Network for PE-AGG B Provisioning the Network for U-PE B Provisioning the Network for CE-B Provisioning the Network for CE-A Perform this task to prepare the network for Ethernet CFM. Before You Begin To",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}