{
    "relation": [
        [
            "If you file Form. . .",
            "1040",
            "1040NR",
            "1040-SS",
            "1041"
        ],
        [
            "Then enter the amount from Schedule H, line 8, on. . .",
            "line 59 and check box b",
            "line 56",
            "Part I, line 4",
            "Schedule G, line 6"
        ]
    ],
    "pageTitle": "Instructions for Schedule H (Form 1040), Household Employment Taxes - How To Fill In Schedule H, Form W-2, and Form W-3",
    "title": "",
    "url": "http://taxmap.ntis.gov/taxmap/archive2009/taxmap/instr/i1040sh-002.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 242125146,
    "recordOffset": 242109194,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{360=Comments About Tax Map IRS Tax Map 2008 Current IRS Tax Map}",
    "lastModified": "Mon, 20 Dec 2010 15:42:54 GMT",
    "textBeforeTable": "No. Follow the instructions in the chart below. Yes. Complete Part II of Schedule H. Review the cash wages you paid to all your household employees for each calendar quarter of 2008 and 2009. Is the total for any quarter in 2008 or 2009 $1,000 or more? Line 9.(p4) taxmap/instr/i1040sh-002.htm#TXMP35f7bd52 Subtract the amount on line 7 from the amount on line 6 and enter the result on line 8. Line 8.(p4) taxmap/instr/i1040sh-002.htm#TXMP0233e683 Enter on line 7, any advance EIC payments you made to your household employees in 2009. Line 7.(p4)",
    "textAfterTable": "If you do not file any of the above forms, complete Part IV of Schedule H and follow the instructions under When and Where To File on page H-3. taxmap/instr/i1040sh-002.htm#TXMP4b0f544c Part II. Federal Unemployment (FUTA) Tax(p4) FUTA tax, with state unemployment systems, provides for payments of unemployment compensation to workers who have lost their jobs. Most employers pay both a federal and state unemployment tax. The FUTA tax rate is 6.2%. But see Credit for contributions paid to state below. Do not deduct the FUTA tax from your employee's wages. You must pay it from your own funds. See page H-11 for a listing of some helpful contact information for each state. taxmap/instr/i1040sh-002.htm#TXMP48371d87 Credit for contributions paid to state.(p4) You may be able to take a credit of up to 5.4% against the FUTA",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}