{
    "relation": [
        [
            "Company (Canadian ticker, US Ticker)",
            "Algonquin Power and Utilities (AQN.TO, AQUNF.PK)",
            "Brookfield Renewable Power Fund (BRPFF.PK,BRC-UN.TO)",
            "Innergex Renewable Energy Inc. (INGXF.PK,INE.TO)",
            "Macquarie Power & Infrastructure Corp. (MCQPF.PK,MPT.TO)",
            "Northland Power Inc. (NPIFF.PK,NPI.TO)"
        ],
        [
            "Price",
            "C$4.95",
            "C$21.41",
            "C$9.74",
            "C$8.43",
            "C$15.81"
        ],
        [
            "Yield",
            "4.8%",
            "6.2%",
            "6.0%",
            "7.8%",
            "6.8%"
        ],
        [
            "Mkt Cap",
            "C$471M",
            "C$2.2B",
            "C$580M",
            "C$480M",
            "C$1.2B"
        ],
        [
            "Sectors",
            "Elec, Nat Gas,&Water distrib, cogen, biomass, hydro",
            "Conventional and run-of-river hydropower",
            "Run-of-river hydro and wind",
            "Cogen, Wind, Hydro, Biomass, Solar, District heating",
            "Nat Gas, Wind, Biomass"
        ]
    ],
    "pageTitle": "Alternative Energy Stocks: Industry General Archives",
    "title": "",
    "url": "http://www.altenergystocks.com/archives/industry_general/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 286330203,
    "recordOffset": 285999087,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{109707=By 2030, we'll be moving people and freight at speeds in excess of 500 miles per hour using hyperloop technology. Centuries-old rail systems will find new homes in museums, and short-range air travel will become almost non-existent., 56433=Image: Lazard, Levelized Cost of Energy Analysis -- Version 8.0, 2014, 33998=In the long, slow recovery from the 2008 financial collapse, the banking industry has increasingly been regarded as a buglight for the untrustworthy., 30836=Portland, Oregon's Capital Pacific Bank (OTCBB:CPBO) was founded in 2003 as a local bank to serve the needs of local businesses. In the intervening decade, it has grown into a full-scale financial institution that also has a mission of sustainability and community involvement., 101453=A further reason for the 2002-2009 correlation is that the economy was humming along very well at that time. This helped fuel investor optimism that the market would continue to grow for solar, wind, and the like. Similarly, oil became a strong proxy for the stock market at that time, as speculators started investing heavily in oil. They believed that as the global economy expanded, there would be more demand for oil, thus raising the prospects for oil prices. In essence, oil became a proxy for the stock market., 3395=This article was first published on the author's Forbes.com blog, Green Stocks on March 5th., 88728=Exhibit 1: Costs of Computer Processing Power, Electricity from Solar PV, and Oil Price per Barrel, 1976-2014[i], 104003=After this crash, no clear trend emerged until the end of 2012, when the next up-channel started. At that time, investors felt that alternative energy stock prices better reflected the economic realities of the underlying business, and started buying again. There is likely another reason, though, that it took five years for alternative energy markets to recover. Psychologically, after getting severely burned in the crash of 2008, it took a long time for investors to feel comfortable dipping their toes back in the water., 79491=[ii] IEA, \"Energy Technology Perspectives 2014 Harnessing Electricity's Potential,\" Global Outlook, 2014. https://www.iea.org/media/ETP14_factsheets.pdf, 102141=The chart at right shows crude oil (Cushing OK spot) as compared to the NEX over two time periods. From 2001 to 2009, oil and alternative energy prices were very strongly linked. For you math wonks, the two had a correlation coefficient of 0.87, which is extremely significant. This makes sense, since a rise in oil prices would mean that other energy alternatives become more attractive. From 2010 to the present, the NEX had a slight negative correlation to oil prices. The two markets did not exactly go in opposite directions, but they had virtually no corresponding movement., 108766=As far as transportation is concerned, I suspect that by 2050, they won't even be building internal combustion passenger vehicles anymore. Economically, environmentally, and socially, they just won't make sense., 44708=Posted by Guest Contributor at 09:18 AM | Permalink | Comments (0), 76768=[ix] Jabusch, Garvin, \"Cheap Oil and the Next Economy,\" Green Alpha's Next Economy, December 24 2014. http://blogs.sierraclub.org/gaa/2014/12/cheap-oil-and-the-next-economy.html, 24270=One way to account for all this is to look at annual energy production in GWh per year.  The data from the following chart is taken from each company’s 2013 annual report.  I had to drop SolarCity (NASD:SCTY) from the list because I could not find energy production data., 87410=Imagine what that means for world economies. When we grow and use more fossil-commodity–based energy, that energy becomes more expensive -- and economic growth is thwarted. But as we grow with technology-based energies, the increasing power demand decreases the cost of that energy and further stimulates economies! Put another way, consider the simulative effects as we realize the IEA's estimate of \"over USD 115 trillion in fuel savings\"[ii] by 2050 as the transition to tech-based renewables, chiefly solar, advances. Solar, although already grid-competitive in many areas, is just getting started. The blue line in the exhibit suggests what may yet be possible as solar technology evolves to enjoy the same level of scale and investment as semiconductors. Even with using current solar technology, though, $115 trillion is a heck of a liquidity injection., 30122=At the end of 2013, CPB had $239 million in total assets, and net income of $1.8 million, or $0.69 per share, the highest annual earnings in the company's history. It had double digit growth in both deposits and loans, and an 8.8% return on equity for the year. It closed out the year with a book value per common share of $8.36., 109414=Even with all of these wonderful and exciting innovations that will move us forward as a global society, it's highly unlikely that all of the world's energy needs in 2050 will be met without the inclusion of fossil fuels., 18835=Posted by Tom Konrad at 03:56 PM | Permalink | Comments (0), 84541=No one has written more clearly on this than investor Jeremy Grantham: \"As a sign of the immediacy of this problem, we have never spent more money developing new oil supplies than we did last year (nearly $700 billion) nor, despite U.S. fracking, found less -- replacing in the last 12 months only 4 1/2 months' worth of current production! Clearly, the writing is on the wall. It is now up to our leadership and to us as individuals to read it and act accordingly.\" In a sidebar, Grantham goes on: \"The only longer-term price relief and net benefit to the economy will come when either we reverse recent history and start to find more oil more cheaply, which will be like waiting for pigs to fly, or when cheaper sources of energy displace oil.\"[vi] As economist Gregor MacDonald recently tweeted: \"Sorry, did everyone forget Majors started cutting capex in Q1 of 2014, because $100 not enough to outrun declining ROI on runaway costs?\"[vii], 32015=“[It's] the unique structure - not-for-profit, member-owned cooperative - of credit unions that gives them the ability to offer better rates and member-focused service,” CUNA said in a statement in August., 83550=In the end, no producer can sell oil for less than it costs to recover it. And those costs are high -- too high to compete in the long run. As Stanford lecturer Tony Seba recently said, \"Put these numbers together and you find that solar has improved its cost basis by 5,355 times relative to oil since 1970...traditional sources of energy can't compete with this\"[viii] [italics added]. A nexus of effects is arising from the interplay of tech and commodity energy dynamics, and few if any of them are favorable to fossil fuels., 32814=A portmanteau of “bankers” and “gangsters,” the term was first used in 1933, but embraced anew when people saw what had become of their assets. Trust in banks sank., 112707=In Saudi Arabia, we recognize that eventually, one of these days, we’re not going to need fossil fuels. I don’t know when - 2040, 2050 or thereafter. So we have embarked on a program to develop solar energy. Hopefully, one of these days, instead of exporting fossil fuels, we will be exporting gigawatts of electric power., 63161=Posted by Jeff Siegel at 09:55 PM | Permalink | Comments (0), 134614=Posted by Debra Fiakas at 09:00 AM | Permalink | Comments (0), 34857=Posted by Tom Konrad at 11:27 PM | Permalink | Comments (0), 63956=Because 2015 is going to be busy, loud, and very, very profitable., 98946=The charts at right show natural gas (Henry Hub LA spot) compared to the NEX. There is a clearly a correlation between the two, though it is somewhat weak. It is also interesting to note that at starting around 2015, there was a divergence between natural gas prices and the NEX., 72915=Abengoa Yield took a bit of a tumble last September, falling from around $40 a share to about $25 a share (although it should be noted that the company's only been public since last June)., 6688=This article was first published on the author's Forbes.com blog, Green Stocks on March 16th., 104843=The first down channel on the chart coincides with a general stock market slump. This drop started during the eight month recession which began in March 2001., 67068=This is a shame, since we really don't know how 2015 will unfold. And until something horrible actually happens, it's really nothing more than an illusion., 39596=The divestment movement was only in its infancy when coal stocks peaked in 2011, so divestment has been only a minor contributor to their decline. Bullard attributes most of the decline to fundamental factors, such as low gas prices and (to a limited extent) wind power in the US, and concerns about air pollution in China., 94944=The first important domestic incentive is the Business Energy Investment Tax Credit (ITC). The ITC rebates up to 30% for solar, fuel cells, wind, combined heat and power (CHP) and geothermal. This incentive is scheduled to sunset at the end of 2016. Whether it gets renewed or not will affect the rate at which renewable projects go forward. This will cause concern for investors., 78447=[v] Parkinson, Giles, \"Solar Costs Will Fall Another 40% In 2 Years. Here's Why.\", CleanTechnica, January 29, 2015. http://cleantechnica.com/2015/01/29/solar-costs-will-fall-40-next-2-years-heres/?utm_source=dlvr.it&utm_medium=twitter, 79215=[iii] Richard, Michael Graham, \"In 42 of the 50 biggest U.S. cities, rooftop solar is now cheaper than the grid!\" TreeHugger, January 27, 2015.  http://www.treehugger.com/renewable-energy/42-of-50-biggest-us-cities-rooftop-solar-now-cheaper-grid.html, 50720=Posted by Garvin at 10:22 AM | Permalink | Comments (0), 27323=Posted by Jeff Siegel at 09:33 AM | Permalink | Comments (0), 46312=Then they went further and announced then would multiply current investment in climate investments by 10 times by 2020 = $420 billion. A that point I was in love - that's a big kicker for climate change related investments. Of course the majority of their investments are in the form of bonds - which will mean increased demand for climate bonds and green bonds. Yes, that's increased demand in the already hot market., 28705=Since the crisis of 2008, banks have increased their efforts in mobile and online banking services to cut any overlap in service. If a customer can deposit his checks and manage his finances online, he would have no reason to go to his local branch and waste several hours of his precious time., 119504=Posted by Debra Fiakas at 04:12 PM | Permalink | Comments (0), 6394=Posted by Tom Konrad at 08:58 AM | Permalink | Comments (0), 91592=Posted by Harris Roen at 09:47 AM | Permalink | Comments (0), 77141=[viii] Ahmed, Nafeez, \"How Solar Power Could Slay the Fossil Fuel Empire by 2030\", Motherboard, December 10, 2014. http://motherboard.vice.com/read/how-solar-power-could-slay-the-fossil-fuel-empire-by-2030, 11350=Posted by Tom Konrad at 08:43 AM | Permalink | Comments (0), 124663=Posted by Garvin at 09:04 AM | Permalink | Comments (0), 76455=Posted by Garvin at 09:29 AM | Permalink | Comments (0), 108958=By 2030, 30% of the U.S. will be powered by renewables. And that's a conservative estimate., 104320=The Great Recession then hit in December 2007, just as alternative energy stocks appeared to be ascending into nosebleed territory. As a result, prices came crashing down a painful 71% in about a year. This outstripped the distressing declines the stock market in general had at that time., 103459=Following the uptrend that went from 2012 to the beginning of 2014, there was a noteworthy giveback. The NEX fell 21% in about nine and a half months. Much of that giveback has been regained. It remains to be seen if the current trend will continue to be positive, or if we have entered into a sideways market., 4454=In truth, that scenario is not at all improbable. It happens all the time. Most investors own slices of most large, publicly traded companies. 44% of US households owned mutual funds in 2012. Whenever a large public company harms more than one household through its actions, it’s probably harming a shareholder. Only our hands-off approach to our investments, often through multiple intermediaries like advisers and mutual funds, keeps us from thinking about the harm we’re doing to ourselves., 100684=The correlation between oil and the stock market remained strong for a decade, but finally started to diverge at the end of 2013. Since then there has been a strong negative correlation., 77994=[vi] Grantham, Jeremy, \"The Beginning of the End of the Fossil Fuel Revolution (From Golden Goose to Cooked Goose)\" GMO Quarterly Letter Third Quarter 2014. https://www.gmo.com/America/CMSAttachmentDownload?target=JUBRxi51IICva8EQo4wdFQADWV9wEmzLzeD%2fGf9Lvs9eioH3K0LxNpPNgOFRVI8cwSP%2bAMJGLMAyxMzMVtpN8J49yf%2f%2bWX0Iv0NKRoYDe6hfhF3WeEjFuA%3d%3d, 3067=Posted by Tom Konrad at 09:22 AM | Permalink | Comments (3), 64135=So enjoy your last remaining hours of 2014. Drink some champagne, eat good food, and spend time with your family and friends. But most importantly, get ready..., 58588=The first reason we believe this is that solar provides a competitive, economic advantage over diesel, coal or natural gas, because fossil-fuel prices, even if low at this moment, have proven to be quite volatile over time.  A recent New Yorker piece on oil prices points out that \"…oil has historically been more volatile than most other commodities; a 2007 study found that in the U.S. it was more volatile than ninety-five per cent of other products.\" The same can't be said of wind or sunlight -- once the capital expenditure for the systems to capture them and convert them to usable energy has been made, the price for fuel is zero. Indefinitely. , 85018=Meanwhile, back in fossil fuel land, costs of production aren't getting any cheaper, even if barrel and pump prices (temporarily) have. Oil is expensive to find and to extract. That's why oil companies were cutting their exploration budgets long before the current oil price decline began in mid-2014. Unfortunately, a decline in oil prices does nothing to lower the costs of exploration and production --  meaning that  oil's margins get squeezed., 152550=Essentially the question becomes: how much of the energy we pour into the economy is productive and how much is wasted? According to economists, notably John A. “Skip” Laitner, about 15% of it becomes economically useful while the remaining 85% dissipates unrequited (here is Laitner’s 2013 paper; free registration required)., 86512=Solar will become so inexpensive that it will inevitably continue to gain market share from fossil fuels, starting with those used to generate electricity (coal, then natural gas), and then, as the global economy adapts to make better use of renewable electricity in more sectors (think electric cars), it will displace oil. The popular current question \"when will renewables reach grid parity?\" will seem quaint and even funny in less than a decade. As one report has revealed, \"a recent sign of the progress that solar is making in taking over the world: In 42 of the 50 biggest U.S. cities, home to about 21 million single-family homeowners, solar power is now cheaper than electricity from the power grid.\"[iii] This is happening because, again, as demand increases, so does scale, investment, R&D advances, and declines in installation expense, all of which lead to fast-falling overall costs. Solar PV module costs have declined \"75 per cent since the end of 2009 and the cost of electricity from utility-scale solar PV falling 50 per cent since 2010.\"[iv] Now, reasonable estimates predict that \"Solar Costs Will Fall Another 40% in 2 Years.\"[v], 54450=The International Energy Agency (IEA) has recently written that \"The sun could be the world's largest source of electricity by 2050.\" Mostly, it says, because of declining costs, and not so much because it can help battle climate change, although that could be a growth factor as well., 67792=When the ball drops, we'll hug, kiss, and cheer on all that waits to be discovered in 2015., 46962=​Then the two insurance industry associations, ICMIF and the IIS, representing the majority of insurance companies globally, put out a humdinger. This is an industry that manages a third of the world’s investment capital - approximately $30 trillion. That gets attention. But only $42 billion can be called climate related investment (what have they been doing!). So they announced they would double the industry investment in climate investments to $84 billion by end of 2015. That's good., 41607=The report's author Nathaniel Bullard, told me in an interview that divesting from coal would have been more difficult just three years ago. He says, “US coal has had clear indicators of future change in place for a while. … Some coal equities have lost 90% of their value since 2011... This much diminished size means that... the same number of shares will represent a much smaller portion of an investor's overall portfolio relative to 2011.”, 159783=“The share of biofuels in total use of coarse grains is projected to increase until 2015, reaching 13%”, 67954=We'll sip an old fashioned or two with apple and sage, share some laughs, and maybe even shed a few tears as we remember those we lost in 2014., 68912=Posted by Jeff Siegel at 09:07 AM | Permalink | Comments (0), 108848=By 2040, we'll be at 45%, and by 2050, we'll be well above 70%., 90042=Recently, though, the two types of energy -- oil and solar -- have been trading in tandem, both falling significantly since mid-2014. Traders by and large seem to be thinking \"energy is energy.\" But this \"energy-as-monolith\" view is not appropriate to the reality of the economics, nor is it supported by the fundamentals., 33617=In a 2012 essay entitled “Is Banking Unusually Corrupt, and If So, Why?” Financial analyst, Circuit Court judge and University of Chicago Law School Lecturer Richard A. Posner laid out the reasons why the system might foster unethical behavior., 73663=Seage is enthusiastic about adding water delivery and treatment projects, such as desalination plants, given the growing public worries about drought and depleting groundwater resources in the U.S. He pointed to a 30-year contract totaling $3.4 billion that an Abengoa-led consortium won last year to build and operate wells, collection stations, and pipelines to deliver water from two aquifers to San Antonio. Abengoa expects the project to come online by 2020., 66260=In 2015, bad things will happen., 67330=Whenever I need a little push before venturing off on a new path, I remind myself of that quote. And I wanted to share it with you today because as we head in to 2015, it seems as if fear is weighing on our collective shoulders more than ever., 85297=Like a pundit in the 1960s or 70s predicting that the computers of 2015 would fill entire rooms and be capable of hundreds of calculations per minute, today's observers who believe solar is still an expensive, niche energy source will be proven badly mistaken., 77381=[vii] MacDonald, Gregor, Twitter, December 22, 2014. https://twitter.com/GregorMacdonald/status/547171901227798528 , 28955=Branch closures in the U.S. hit its all-time highest level in 2013, with 1,487 branch locations closing over the course of 2013. This is the most significant decline ever recorded by SNL Financial, a financial market analysis firm., 23561=Ormat (NYSE:ORA) and NRG Yield (NASD:NYLD) only reported aggregate energy production for 2013, so I made some assumptions based typical capacity factors to allocate production between Ormat’s geothermal and waste heat operations, and between NRG Yield’s wind and solar farms.  Ormat’s products business which sells equipment to other geothermal and waste heat recovery operations is scaled based on the relative revenue earned by each segment, while NRG Yield’s thermal businesses provide heat or cooling, and are shown in thermal kWh, which typically have lower value than electrical kWh., 114535=Posted by Debra Fiakas at 12:45 PM | Permalink | Comments (0), 78777=[iv] Parkinson, Giles, \"Graph of the Day: The plunging cost of renewables,\" RenewEconomy, January 19, 2015. http://reneweconomy.com.au/2015/graph-day-plunging-cost-renewables-49704, 141321=Posted by Garvin at 09:47 AM | Permalink | Comments (2), 32631=Seventy-eight percent (78%) of people surveyed in the Consumer Banking Insights Study believed big banks were fully to blame for the financial crisis of 2008 and the subsequent recession. Thirty one percent (31%) of those people said they didn't trust big banks with their money even though they were already customers of one., 107012=Posted by Jeff Siegel at 09:01 AM | Permalink | Comments (0), 104666=By 2003, alternative energy stocks started to turn around. This marked the beginning of a fantastic five year run, as investors started noticing wind power and photovoltaics were becoming economically viable alternatives to traditional electric generation. Annualized returns in this five year period averaged a remarkable 38%!}",
    "TableContextTimeStampAfterTable": "{626552=UN FAO Agricultural Outlook 2010-2019, 138157=This article was first published on the author's Green Stocks blog on Forbes.com on September 24th., 484594=Posted by cleanenergyintel at 10:26 AM | Permalink | Comments (0), 452911=2012 will bring us:, 599735=Posted by Garvin at 08:40 PM | Permalink | Comments (1), 264404=There is a saying on Wall Street “as goes January, so goes the rest of the year.”  Indeed, since 1950, the direction of the stock market in the month of January foretold the movement of the market for the rest of the year 70% of the time. Additionally, almost all Januarys that had over a 5% gain (11 out of 12) predicted a gain for the rest of the year. In fact, the average gain in those years was 17%, far exceeding historical averages., 228216=Posted by Doug Young at 09:42 AM | Permalink | Comments (0), 275831=2012 saw a return to positive performance for the next economy and for markets overall. Generally, global economic conditions, as indicated by some jobs growth, slowly improving industrial output and a housing rebound, improved marginally, but debt crises in Europe and America, exacerbated by eternal dithering, gamesmanship and posturing by politicians and other policy makers on both continents, kept optimism in check and moderated expectations for growth. With respect to the next economy, though, growth and expectations for growth began showing real signs of building momentum as mainstream awareness of the need ensure the longevity of the world economy by changing some of its foundations continued to advance. Thus our ‘next economy’ macroeconomic thesis became still more relevant and closer to fruition., 89463=Posted by Debra Fiakas at 09:22 AM | Permalink | Comments (0), 639793=Posted by Eamon Keane at 05:50 PM | Permalink | Comments (2), 270227=2013 has already revealed key moves forward from institutions not traditionally aligned with post fossil fuels economy thinking., 56419=Since 2014 should be a year of steady growth, larger cap stocks that are lower on the speculative level will likely be the best performers. It is often the case that in the maturing stages of a bull market, large cap stocks do better. If the stock market falls dramatically, I would expect the more volatile stocks to experience accelerated losses, but I do not believe this will be the case in 2014., 419537=Our next sage, America's 42nd president Bill Clinton, gave a keynote address to the 2012 ARPA-E Energy Innovation Summit, March 1st, 2012, which was exclusively about how we may benefit from actualizing the next economy:, 415655=Posted by David Gold at 10:59 AM | Permalink | Comments (2), 427778=President Barack Obama delivers the 2012 State of the Union Address (Image source: whitehouse.gov), 220490=Posted by Guest Contributor at 08:56 AM | Permalink | Comments (0), 43479=Google certainly has displayed a healthy appetite for Texas Panhandle wind energy. Last fall it committed to purchase all the output from EDF Renewable Energy's 240-MW Happy Hereford wind farm southwest of Amarillo. A year ago it plunked down $200 million in EDF's 161-MW Spinning Spur Wind Project in Oldham County, Texas, also west of Amarillo, which went operational in late 2012. (Note that EDF is taking over Spinning Spur III from Cielo Wind Power, in case Google is eyeing more investments for power circa 2015.), 701589=The deposits at Mountain Pass were discovered in 1950 by two prospectors who found a radioactive outcrop and assumed they had located a source of uranium. The prospectors were disappointed to learn that their claim did not contain uranium but rather flouro-carbonate bastnaesite. This mineral was completely worthless to them but was very interesting to the US Geological Survey. The Geological Survey undertook further surveys and discovered non-radioactive deposit of bastnaesite. One of the two original prospectors who found the deposit worked for MolyCorp (MCP) and he persuaded the company to claim the land although it didn’t exactly know what to do with its rare earth ore. MolyCorp spent the next two decades developing a market for the rare earth elements found in its mine: Cerium, lanthanum, samarium, gadolinium, neodymium, praseodymium and europium., 450980=A recent Pike Research study showed there will be more than one million plug-in electric cars on the roads in just three years. And by 2017, just about five years from now, that number will grow to 5.2 million., 60281=On Sunday, January 5, 60 Minutes aired a piece on the cleantech space. In the days that followed, I have had interesting conversations with clients about what was broadcast to 7.4 million viewers.[1] Those discussions reinforced my belief that 60 minutes missed the mark and inspired me to write this blog on why cleantech is essential, massive, vibrant, and desired., 863859=Posted by David Gold at 07:41 PM | Permalink | Comments (0), 167964=By contrast, Gap has been more willing than most companies to air its dirty linen (pun intended). The company has been forthcoming about what it calls “the severity of worker safety issues in Bangladesh” since 2010. When it comes to the environment, the company is clear about where it will exert its influence — over its supply chain and its own operations — and where it will leave the problems for others to solve., 854111=Posted by Guest Contributor at 07:39 PM | Permalink | Comments (4) | TrackBacks (0), 850569=The second disadvantage is more serious from a broader system perspective. PV makes electricity instantaneously as sunlight hits it. If the system doesn’t need the energy at that time, more cost-effective systems must be turned down or the PV energy must be sloughed off. On the other hand, although the peak in PV output correlates fairly well with the beginning of the peak demand periods (usually mid-afternoon on hot summer days in this part of the world), the output from the PV system falls off too early to meet the tail of the peak load that extends into the evening (end of peak on the APS system is now 8:00 PM). , 798317=Posted by John Petersen at 03:15 AM | Permalink | Comments (2), 280654=On the securities level, we saw once again in 2012 the importance of diversification across all sectors of the next economy. We find it hard to overemphasize this point: the post fossil fuels economy is emerging in all sectors, so to invest as though renewable energy (as critical as it is) is the only aspect of a green economy is shortsighted and results in high volatility. Attempting to represent the entirety of the next economy, our Green Alpha Next Economy Index (GANEX) is invested in 27 sectors and 52 sub-sectors, spanning, we believe, nearly everything required for a broad-based economic system to function. Reviewing GANEX’s top five 2012 total return performers gives some indication of its diversification:, 71511=While I find most attempts to count jobs created from specific government programs confusing, readers might be surprised to learn that the solar industry currently employs more workers than the coal industry. In 2012, the solar industry employed 119,000, and the industry is growing rapidly. In 2012, the coal industry employed 89,800, and the industry is contracting.[26] [27], 270375=First is the U.S. Government, which released its somewhat regular (approximately every four years), multi-agency National Climate Assessment (caution: link is to the full report PDF of 147MB) on January 11th. Its message is unequivocal, “…observed climatic changes are having wide-ranging impacts in every region of our country and most sectors of our economy. Some of these changes can be beneficial, such as longer growing seasons in many regions and a longer shipping season on the Great Lakes. But many more have already proven to be detrimental, largely because society and its infrastructure were designed for the climate of the past, not for the rapidly changing climate of the present or the future.” (Italics mine.) Federal scientists and career professionals clearly get the need for transition, as does at least one governor., 259739=One of the most promising investment areas for 2013 may come from the area of energy efficiency. From an economic standpoint alone, smart efficiency measures that businesses and individuals can deploy have a short payback period, and many can bank immediate cost savings., 450067=In addition to the Chevy Volt and Nissan LEAF, we'll start to see Mitsubishi's electric car — the “i” — hit the highways in 2012. Ford's all-electric Focus is also expected to make its debut. That particular vehicle looks like it could be a real crowd-pleaser., 470766=  In 2003, Alan Greenspan sounded the alarm to Congress about the potential impact on natural gas prices (which were already on the rise) if significant action to increase imports wasn’t taken.  The problem, though, was that natural gas can only be transported by pipeline or by container and only in a liquid form, but  the reserves were mostly overseas.  So, in 2005 there were plans for as many as 55 Liquefied Natural Gas (LNG)-importing facilities.  Only six were built, and most sit idle today.  Disruptive horizontal drilling and fracking technology opened up enormous reserves of previously unreachable natural gas in shale. Production skyrocketed and prices dropped by over 60%.  Current estimates place U.S. reserves at 100 years or more…without additional technology., 55012=Stocks that were the most volatile had the best returns in 2013. This is not surprising, since in a robustly up market year, volatile stocks will swing way above the averages. Conversely, stocks with the lowest volatility had lower average returns., 830823=The company is not reliant on any one customer, as it distributes its products to over 1700 customers in various industries (hotel/motel, dry cleaners, hospitals etc). A diversified customer base reduces a company's risk, as its revenues/earnings are not reliant on a potential single point of failure., 198789=This article was first published on the author's Forbes blog on June 25th., 318069=Figure 3 shows the same information in a different format. Each fuel type is shown as a percent of the total fuels consumed. A sharp eye can see a decrease in the amount of liquid fuels used, and an increase in renewables. Still, those renewables will comprise less than 10% of the overall energy picture, even projected 30 years out! Put another way, fossil fuels are expected to account for 80% of the energy consumed in 2040, which is only 5% less than they do now. The days of drilling and coal mining are not coming to an end any time soon., 828296=Posted by David Gold at 12:10 AM | Permalink | Comments (3), 317115=Over the longer term, however, total U.S. energy consumption in 2040 is projected to continue to grow by an average of 0.3% annually, to between 9-10% above current levels. Consumption of liquid fuels (oil, gas, etc) is actually projected to drop by about 4.5%, while use of natural gas is expected to increase by almost a quarter above current levels., 322328=An additional installation company that the Roen Financial Report tracks is Ameresco Inc (AMRC). Its stock price was beaten down in November on an earnings release. The company showed decent growth in profits and earnings per share since March, but still showed a 25% drop in revenues compared to the same quarter last year. In addition, the company dropped its revenue guidance to between 7-10% lower than analyst expectations. Still, I think the company is fairly valued in the $10/share range., 83172=[28] http://www.dblinvestors.com/2013/08/report-nuclear-received-4-times-more-subsidies-than-solar-in-ca/, 316154=The U.S. Energy Information Agency (EIA) made public an early release of its in-depth Annual Energy Outlook. This comprehensive report details likely trends in production, consumption, prices, and sources of energy out to 2040., 906785=Posted by Charles Morand at 09:46 PM | Permalink | Comments (0), 575290=Total Clean Energy investment in 2010 was $243 billion., 191240=Investors should be vigilant and monitor to see if the two moving averages cross again. This can indicate a false bull, as happened with the run between May 2009 and February 2010. Alternatively, it can signify the start of decline. This was foretold by the two moving averages crossing in February 2008, which preceded the precipitous drop later that year., 38400=Kachan expects to see more innovative funding opportunities like Mosaic in 2014. “You will also see new systems, new initiatives targeted at the space, many of which, for the first time offer investors the chance to make money at making small investments in projects or innovation,” he said.  Kachan cautions that he has some reservations about the long-term viability of equity-based crowdfunding – he worries what will happen when investors lose money, which undoubtedly will occur at some point. “I think it’s not going to take too many of those squeezes, those so-called down-rounds, and the requirements for pro rata investment.  These things are going to potentially bite investors and it might turn off people from equity-based crowdfunding,” he explained.  But nonetheless, he’s certain that we will see lots more in the financial innovation space in 2014.  “That said, some people will make some money in doing this [equity-based crowdfunding]  and that will encourage others to start doing this.”, 263787=Since I believe increased consumption will continue to more than offset increased production, I envisage that oil prices will continue to be pegged to the stock market. Because of this, domestic crude oil prices should rise slightly to the $100/barrel range by year’s end, but may peak out at $115/barrel at some point in 2013., 468496=Pessimists will point to forecasts such as those from the Energy Information Administration that project significantly slower growth.  The most recent of those very projections just three short years ago forecast consumption for 2010 that now, by EIA’s own numbers, are known to be about 17% low!  The problem with forecasts of these types is that they systematically fail to account for future disruptive technologies or significant changes to market conditions. In 2001 it seemed like the days of the dot com were gone as the markets crashed and company after company went out of business.  Yet, the greatest value creation on the Web occurred after the dot bomb.  I don't believe we are doomed; I believe that technology innovation will enable disruptive changes in our energy production and consumption and I believe the greatest value creation for cleantech companies lies ahead. So, to cheer you up, here are just a handful of examples in which past forecasts of doom were way off and whose combined legacy says, \" Don't underestimate the power of human innovation and spirit!\"..., 60746=We recently took fifteen clients to China on our annual tour, and the Beijing Air Quality index (AQI) of PM2.5 read above 200 on multiple days. The average AQI in Los Angeles, California, through 2009 was 19[2]. As CBS News has reported, the health and economic implications of severe pollution are significant. Kids with asthma flood hospitals. Flights are canceled. Schools are closed. Concerts are postponed. People wear masks and stay indoors., 854023=John Can be reached at jva1000 [at] gmail,com or 303 885 9264, 186454=Alternative energy stocks are up over 30% on average for the year, reflecting impressive gains off of widely oversold lows in 2012. Almost three-quarters of stocks have been gainers, and two-thirds have seen double-digit price growth in the past 12 months. Solar and energy efficiency stocks in particular have done extremely well, both up over 50% annually., 254863=The chart below shows the change in net profit margin from 2011 to 2012 for the largest solar companies. Performances were not stellar in 2011, only 12 out of the 13 companies turned a profit and the average net profit margin was just over $5 million. In 2012, however, only one of the companies posted a tiny profit, and companies averaged over $28 million in losses. I could throw up similarly downbeat charts for other measures of financial health, including earnings per share (EPS), price to book ratios, and sales growth., 750374=Posted by Eamon Keane at 09:16 AM | Permalink | Comments (0), 691512=Posted by Guest Contributor at 04:10 PM | Permalink | Comments (0), 704864=Restarting a mine is no easy task. Environmental regulations in 2010 are considerably more stringent than they were back in the 1970s, costs are multiples of what they were and there is also the challenge to find the expertise needed to mine and process these elements., 175605=Who’s Buying: Director of both firms Uwe Roper bought 39,000 shares of RDZ at C$0.99 on July 31st, and 25,000 shares of Capstone at C$3.85 on July 13th., 314718=Posted by Garvin at 09:51 AM | Permalink | Comments (0), 34607=Overall consumer sentiment toward solar and wind energy was up significantly in 2013 over 2012, indicating that in general, U.S. residents feel positive about clean energy.  And when investors are looking for investment opportunities, it follows that they put their money into technologies, products, services and companies that they feel good about., 868357=Posted by David Gold at 05:37 AM | Permalink | Comments (0), 70492=Did the government lose some money in cleantech? Yes, it did. However, from a portfolio perspective, the losses (less than 3%[23] of the aggregate) are far smaller than they were portrayed on 60 Minutes. The DOE has also done many positive things. The ATVM Government loan guarantee program (derided in 60 Minutes) provided $5.9 billion to Ford Motor Company in 2009, $465 million to Tesla (which repaid 9 years early), and $1.5 billion to Nissan NA. [24] Via ARPA-E, the DOE has stimulated innovation in important ways with relatively modest amounts of money.[25] Governments are investing in cleantech in a number of other constructive ways not mentioned on the program. For example, the US Military is deploying cleantech to achieve greater energy security and flexibility. Cities all over the world are racing each other to use cleantech solutions to address traffic, pollution, and resource challenges., 811595=Colorado's recently released Renewable Energy Development Infrastructure (REDI) report looks at what the resource-rich state needs to do to accomplish the state goal of reducing CO2 emissions 20% from 2005 levels by 2020.  Investors who expect the developed world to attempt similar cuts in emissions should take note of the report's conclusions, and invest accordingly., 586825=Posted by Tom Konrad at 08:04 PM | Permalink | Comments (0), 83605=[31] http://www.forbes.com/sites/heatherclancy/2013/10/02/new-ebay-data-center-runs-almost-entirely-on-bloom-fuel-cells/, 581302=Japan has ambitious targets to source 28 GW of solar and 5 GW from wind by 2020. I expect them to adopt even more ambitious targets as a result of the nuclear crisis., 52043=Half of bottom ten returns are in different business segments of the fuel alternatives industry. One is a biofuel company, BioFuel Energy Corp (BIOF), a former ethanol producer that has been selling plants and reducing its workforce. Chilean-based Sociedad Quimica y Minera (ADR) (SQM), the world’s largest producer of lithium for batteries, suffered from massive insider selling back in August. Cereplast Inc (CERP) is a very volatile startup with flagging sales. CERP develops bio-based resins as a renewable substitute for petroleum-based plastics., 417129=In his most recent annual shareholder letter, release February 25th, 2012, Warren Buffett touted Berkshire Hathaway's significant, recent investments in renewable energies:, 554327=Posted by David Gold at 07:34 PM | Permalink | Comments (1), 272624=Next, in the realm of leading think tanks, the World Economic Forum (WEF), leading up to its annual meeting at Davos, Switzerland, issued its “Global Risks Report 2013,” citing climate change, water scarcity and greenhouse gas emissions among society’s chief risk factors. There’s a slightly longer discussion of WEF’s important acknowledgements towards the end of our 2012 annual shareholder letter., 543453=Posted by Guest Contributor at 11:40 AM | Permalink | Comments (0), 267065=The bottom line is that low interest rates and plenty of corporate cash will be a strong driver of stocks in 2013, including the growth industries within alternative energy., 355367=Next week I'll be at a private meeting in New York where I'll be discussing some of my predictions for 2013. Here's a preview..., 456345=After all, if you're thankful for something, why do you have to wait until November 24th to talk about it?, 66605=In addition to the highly publicized failures, we (via our i3 data platform) have also tracked many successes. Tesla is perhaps the best example of a company that has achieved great commercial success and is being rewarded for this in the financial markets. The company was founded in 2003, went public in 2010 and today trades with an $18 billion market capitalization. Let’s compare this with the value of an established car company: Peugeot was founded in 1810 and produced its first automobile in 1889. The company currently trades at a market capitalization of $3 billion, one-sixth of Tesla’s value. The Model S was named the Motor Trend Car of the Year, and Elon Musk was recently named Fortune’s Business Person of the Year., 838079=Stay tuned for a short series on Green Energy Investing for Experts to be published in December.  (The link is to a search, articles will show up as they are published.), 50597=This report drills down into the data to better understand what happened to alternative energy stocks in 2013, and considers where cleantech investments may go in 2014., 397036=China's pause in Clean Energy investment growth was a re-consolidation, not a sign of a peak.  While the US was cutting incentives in 2011, China was adopting new ones.  Not only did China increase a national target for solar deployment to 50 GW in 2010, but they adopted their first national feed-in tariff., 699199=In the USA, this realization comes at a time when the Obama administration has committed the United States to replacing more than a million gasoline powered cars with hybrid and electric cars by 2015. These cars – referred to as “green” vehicles – use A LOT of rare earth elements in their power trains. Reducing the US’s reliance on foreign oil is one motivation for moving to green cars. However, given the current situation, and unless alternative supply sources are found – soon – it appears that the US might be replacing a dependence on one commodity (oil) for reliance on a much more difficult to find and more expensive one (Rare Earth Elements – REEs). And these REEs are almost exclusively available from its main trade rival. Somewhat belatedly the USA has discovered the looming crisis in rare earth availability and has only recently begun to look at securing domestic supplies and rebuilding its supply chain., 347731=So where are alternative energy stocks likely to go from here? I remain cautious in the short term, concerned that the broader economic picture will overshadow any sector plays. Between the threat of massive tax hikes and spending cuts in the U.S., and the re-fanning of the dangerous debt embers that are smoldering in Europe, I would not be surprised at all by a market correction in the 15% range or worse. This type of correction would not be surprising, though, considering the S&P 500 reached a high in September that was 33% above its lows at the end of 2011., 378114=Goldman’s investments since 2005 have been successful, or the bank would be unlikely to be coming back for more.  Yet the leading clean energy ETF, the Powershares Wilderhill Clean Energy ETF (NYSE:PBW),  has fallen 70% over the same period.  Clearly, Goldman was not just passively investing in a basket of green stocks, as PBW does., 448726=Just to put this in perspective, consider this: When Toyota first launched the Prius Hybrid in 1997, the Japanese automaker sold 3,000 units., 139112=Posted by Tom Konrad at 08:37 AM | Permalink | Comments (0), 156714=Here, then, are five tips to help you make sense of the next report that lands on your desk or arrives via email. They were developed with help from Steve Lydenberg of Domini Social Investments — the principal author of How to Read a Corporate Social Responsibility Report, an excellent 2010 study from the Boston College Center for Corporate Citizenship — and Bill Baue, a consultant and leader of the Sustainability Context Group, an organization working to improve corporate reporting., 39450=Konrad agrees that financial innovation in renewable energy is probably going to be THE story of 2014. Ever the mathematician, Konrad guesses that about 60-75 percent of renewable energy investment will be driven by financial innovation, with the remainder being driven by policy, which he also feels will be favorable, at least on the state level, in 2014., 170548=Posted by Guest Contributor at 01:57 PM | Permalink | Comments (0), 193551=Posted by Harris Roen at 11:01 AM | Permalink | Comments (0), 454598=Either way, don't let it weigh on you. Because regardless of how things turn out in 2012 — there's always a bull market somewhere!, 375301=More than any other investment bank, Goldman Sachs (NYSE:GS) is famed for its skill at picking good investments.  Last week, the bank  announced it would invest another $40 billion in green technologies over the next 10 years (or an average of $4 billion a year.)   While this is a drop from the $4.8 billion invested in 2011, the last time Goldman Sachs made a commitment to green tech was 2005.  The $1 billion pledged then ended up as $4 billion in direct investments of Goldman’s own money, and another $24 billion of financing arranged by the bank., 173969=Who’s Buying: Director Alistair Sinclair bought 1,100,000 shares at C$0.15 on June 18th., 266742=I believe inflation will remain tame, despite unprecedented amounts of government spending. The “Velocity of Money’ (the rate at which money flows through the economy) is still very low, and actually dropped in 2012. Unless this indicator picks up, we do not see excessive inflation coming any time soon., 451344=Considering the overall vehicle market is expected to grow 3.7 percent between 2011 and 2017, this is a massive growth story., 264256=Alternative energy stocks do not exist in a vacuum, so it is important to look at the prevailing stock market trajectory in 2013., 706500=According to the U.S. Geological Survey, there are 13 million tons of extractable rare earths in the United States, 5.4 million in Australia, and 19 million in Russia and neighboring countries. In 2009, China had 36 million tons., 312578=Public opinion has already begun to change. According to Yale University’s Public Support for Climate and Energy Policies (Nov 13, 2012) report, “A large majority of Americans (77%) say global warming should be a “very high” (18%), “high” (25%), or “medium” priority (34%) for the president and Congress. One in four (23%) say it should be a low priority.”, 495363=Posted by David Gold at 07:25 PM | Permalink | Comments (2), 268660=Posted by Harris Roen at 04:03 PM | Permalink | Comments (0), 201119=In 2007, when practically any stock which could be labeled green was going stratospheric, my phone was ringing off the hook.  Then came the crash in 2008, with green stocks falling more than the market as a whole.  Worse, they failed to participate in the market recovery since then.  Green investors are a dedicated lot.  Many of my clients worried that the slump might never end, but none left.  But the calls from new clients became very few and far between., 575469=Solar Photovoltaic (PV) installations grew 53% over 2009, 705409=Until that time, relying solely on Chinese exports does not seem to be an option for the US any longer. The supply chain for a number of commercial and defense related industries has already begun to break down. A Government Accountability Office (GAO) report from April 2010 identified four rare earth element shortages that have already caused some kind of weapon system production delay., 203019=Investment advisor Jan Schalkwijk, CFA at JPS Global Investments:, 274853=Posted by Garvin at 11:30 AM | Permalink | Comments (0), 72458=Big corporates are actively investing in cleantech to drive growth and competitive advantage, differentiation and to further their sustainability goals. As noted in our recent report, “Partnering with Corporates,” energy companies have been among the leading investors. The chart below shows the most active corporate investors between the third quarter of 2011 and the second quarter of 2013. Over that period, GE, ConocoPhillips, Total, and BP all ranked highly with more than 10 deals. Shell recently launched a new venture fund, Shell Technology Ventures. And it’s good that the oil and gas majors are innovating., 302121=Posted by Harris Roen at 09:33 PM | Permalink | Comments (0), 627809=Given the above quotes, it is a wonder that most energy outlooks pay only cursory attention to the interrelationship between water, food, energy and climate.  Signs of stress in the water-food-energy complex are visible in the record high food prices, dropping water tables and the need for cooling in power plants is on vivid display in northern Japan. Do you know how/if it will affect your investments? Maplecroft's water security index shows nearly the entire Middle East and North Africa, the origin of much of the world's oil, as under extreme risk of water scarcity. There’s a nice graphic in the World Economic Forum’s Global Risks 2011 which highlights some of the water-food-energy interactions in Figure 1.  I’ll try to concisely address them in this series., 286616=While we are generally growth oriented managers, we also in 2012 had good reason to believe that many of our holdings represent excellent values. As of December 31st 2012, 66 of our 80 holdings were trading below the average (1979 to present) price to book ratio of the S&P 500 index.  Our average price to book was 1.45, compared to 2.27 for the S&P 500., 190914=In addition, the 200-day moving average crossed the 50-day moving average in December 2012, and the NEX has been trading above the 200-day moving average since that time. This can be an early sign of a prolonged upswing, as occurred in September 2006. The crossing marked the start of a 15 month, 83% surge., 713727=Posted by Guest Contributor at 02:38 PM | Permalink | Comments (0), 352182=Posted by Harris Roen at 01:48 PM | Permalink | Comments (0), 141941=While roll-to-roll production processes have yet to move out of the lab, researchers continue to improve the quality and size of graphene sheets produced in this way.  The most advanced version of the technology seems to be vapor deposition of carbon on copper sheets.  Other substrates have been used, but copper’s flexibility makes it uniquely suitable for roll-to-roll production.  Lockheed Martin announced that it has obtained a patent for perforated graphene nanopore-based water filters in March, and also produces its graphene on copper sheets.  The company has not yet commercialized the technology, however, saying that it is still figuring out how to scale up production.  Lockheed aims to have a prototype for testing in a desalination plant by 2014 or 2015., 190265=On a technical basis, alternative energy stock prices look like they have formed a bottom. The chart below shows the WilderHill New Energy Global Index (NEX), which after flying high for a couple of years dropped 66% off its peaks in 2007. The downward pattern, however, shows a clear triple bottom. Three times, a new low occurred below the previous downward trough creating a wave-like pattern. This typically happens in three or four waves before a significant upturn begins., 707909=MolyCorp’s rare-earth separation plant at Mountain Pass, resumed operations in 2007. This year, MolyCorp began using stockpiled rock that was mined under a previous permit and employed new separation technologies. The company expects to sell 3,000 tons of rare earths in 2011 and by 2012. MolyCorp expects to eventually produce 20,000 tons a year, and produce rare-earth products at half the cost of the Chinese. However, the company cannot use the processes used in the mine’s heyday: processes that are both economically and environmentally unsustainable. According to the company, their new techniques are both more environmentally sound and save money, techniques such as eliminating the production of waste saltwater. MolyCorp will use a closed-loop system, converting the waste back into the acids and bases required for separation and eliminating the need to buy and transport dangerous chemicals. The company will also install a natural-gas power co-generation facility on site to cut energy costs., 329836=This SEC move to file criminal charges will add to the pressure on the auditors, and I suspect that we're likely to see some cooperation between the 2 sides before the end of 2013. As this inevitable outcome approaches, the auditors are likely to quickly determine which of their clients might become the biggest liabilities and sever their relationships with those companies sooner rather than later., 737414=Posted by David Gold at 11:41 PM | Permalink | Comments (0), 201624=Finally, in late 2012, green stocks began to rally.  The leading clean energy ETF, PBW, is up 40% from its November low.  The leading solar ETF, TAN, is up 65% from its low., 445853=Which is why we'll continue to play this angle in 2012., 509745=Posted by Tom Konrad at 11:22 AM | Permalink | Comments (0), 28299=With five solid years of installed capacity growth coupled with steady cost reductions, it’s no surprise that renewable energy finance experts agree that large-scale wind and solar projects will receive the biggest portion of renewable energy dollars in 2014., 355576=Electric cars will remain the target of naysayers and partisan slaves in 2013., 407866=Posted by Tom Konrad at 05:42 PM | Permalink | Comments (2), 335704=However one good area of investing in the Indian renewable energy story is through green focused utilities like Greenko, Orient Green Power etc. Most Investment banks and big Private Equity firms have already committed hundreds of millions of dollars investing in renewable energy focused power generation firms. Larger privately owned electricity utilities in India are also investing heavily into green power generation to meet the Renewable Purchase Obligations (RPO) which mandates that 15% of the electricity generation by 2020 should come from clean energy sources. In Summary while the past few years have not been the best for the green sector in India, the future looks very promising indeed. Read why Private Equity firms are investing millions in India's wind energy industry, 35681=Konrad believes that 2014 will be a great year for renewable energy finance, he said.  He said that we saw the beginning of it in 2013 with the securitization of a bond by Solar City and pointed to Hannon Armstrong’s securitization of an energy efficiency bond in late December 2013 as another indicator that renewable energy financing is on track to take off in 2014. , 396404=Ironically, fading support for Clean Energy is also what allowed the US to re-take the lead in 2011.  Many developers rushed to get projects started before the end of 2011, when a number of Clean Energy incentives expired (see sidebar.) , 110782=Posted by Guest Contributor at 09:17 AM | Permalink | Comments (2), 80640=[11] http://cleantechnica.com/2013/05/24/solar-powers-massive-price-drop-graph/, 160002=2. Follow the (big) money. A good sustainability report should focus on those company activities that have the greatest impact. So, for example, what matters most in the financial services industry is not paper consumption, LEED-certified work spaces or direct greenhouse gas emissions, but lending and investment practices. Citi’s most recent report says it opened 23 LEED-certified branches in 2012 — a data point that is hard to put into context (since the report doesn’t say how many branches the company operates) and not very meaningful, in any event. What we want to know about Wall Street is how the big banks are taking environmental issues into account in their lending and investments. “No other industry has as much ability to affect the environmental and social practices of other industries as financial services does,” says Lydenberg., 575397=Up 30% over 2009, 35160=“I remain optimistic that renewable energy investments will continue to gain ground in 2014,” said OPIC’s Tabernacki.  “I think, without question, more money will be invested into renewable energy in 2014 than was in 2013,” said Akin Gump’s Umanoff.  “I’m more optimistic than ever about the health of the clean-tech space,” stated Dallas Kachan. “I think that overall, we’re going to have a really good year,” said Tom Konrad, a private money manager who writes about clean energy investing., 432677=Posted by Garvin at 08:42 AM | Permalink | Comments (0), 259149=Since there are very few publically traded pure-play wind companies in the U.S., a good way to add wind to a portfolio is by investing in ETFs. Two good examples are First Trust ISE Global Wind Energy Index Fund (FAN), and PowerShares Global Wind Energy Portfolio ETF (PWND). Though these funds were down between 15% and 20% for 2012, they have bounced back nicely since their July lows. In fact, both funds are up in the 33% range since that time., 359367=In the absence of the wind energy production tax credit, the U.S. wind industry will absolutely stall in 2013., 460807=The cost: about 0.06 cents per kilowatt-hour of total generation by 2030, or roughly $0.50 per month, per household., 539009=Hitachi is recycling RE magnets from hard disk drive motors, air conditioners and compressors. Typically, recycling REEs was performed manually using acids and other chemicals, which created its own set of environmental issues. But Hitachi has recently announced a new “dry” process, which relies on a new extraction material with a high affinity for Rare Earths.  Hitachi hopes to commence full recycling operations by 2013.4, 121027=Posted by Debra Fiakas at 11:17 AM | Permalink | Comments (0), 158387=That’s nice, but environmentalists will want to understand what the giant oil company (2012 revenues: $234 billion) is doing about climate change, if anything. Figuring that out from the report is hard, if not impossible. Chevron reports that its 2012 emissions from operations were 56.3 million metric tons of CO2 equivalent, down by about 3.5 million metric tons from 2011, and below its goal of 60.5 million metric tons. That sounds like progress. But you have to read the footnotes to learn that the decline was largely caused by the sale of one refinery in Alaska and “decreased production” from a second refinery in Richmond, Calif., where an August 2012 fire sent thousands of people to hospitals and later led Chevron to pay $2 million in fines and restitution., 533615=Posted by Guest Contributor at 09:38 AM | Permalink | Comments (1), 100727=Posted by Guest Contributor at 08:16 AM | Permalink | Comments (0), 125372=I was contacted by the Corporate Communications officer of Grafoid, Inc in response to my poll and upcoming articles, and later did a short interview with its CEO, Gary Economo.  Grafoid describes itself as “a privately held Canadian graphene development and investment company,” 21% owned by Focus Graphite, Inc. (TSX-V:FMS, OTC:FCSMF,) a junior mining firm which owns the high grade Lac Knife graphite property  in Quebec, Canada.  It was previously known as Focus Metals, but changed its name to Focus Graphite in 2012., 57650=Picking the right stocks will remain important in 2014, so investors are urged research alternative energy stocks carefully to ensure the best returns., 358866=China solar companies will continue to pump out cheap solar in 2013, but they'll be among the first casualties when the house of cards comes crashing down., 809763=Posted by Bill Paul at 04:18 AM | Permalink | Comments (0), 330256=We already saw solar panel maker Trina (NYSE: TSL) cut its ties with Deloitte back in June, though it's unclear who initiated the split. (previous post) We should expect to see more similar divorces in the months ahead, with the rate accelerating as the SEC and auditors move closer to their final cooperation. As that happens, look for lots of volatility in the share prices of companies that get dumped by their auditors, as investors fret that such companies could eventually become the targets of SEC investigations and eventual de-listings., 455256=Posted by Jeff Siegel at 11:52 PM | Permalink | Comments (0), 449773=In fact, the company announced a couple of months ago it has set a goal of selling 1.5 million electric vehicles by 2016. That's only four years away., 574412=The Pew Charitable Trusts just released their report on Clean Energy, finance, and investment in the Group of Twenty (G20) economies in 2010 [pdf]., 32214=The U.S. wind market will flourish in 2014 as companies work steadily to complete construction on projects they began in late 2013 (wind project developers had to start construction by the end of 2013 in order to take advantage of the Production Tax Credit (PTC)).  But since the PTC officially expired in 2013, don’t expect to hear about too many new wind power projects being commissioned in 2014 and beyond. Umanoff predicted that the U.S. will install upwards of 9 GW of wind power in 2014 and even more in 2015 as companies build out their planned projects., 53330=Comparing returns of the various alternative energy industries confirms that solar was the best performer in 2013. The average return for the 67 solar stocks that the Roen Financial Report tracks was an impressive 81%. Solar investing has taken off for several reasons, rising impressively from its oversold lows in August 2012., 398830=The Pew Charitable Trusts just released the 2011 edition of their report, \"Who's Winning the Clean Energy Race?\", 215254=Posted by Tom Konrad at 07:43 AM | Permalink | Comments (0), 165793=4. Read more than one report at a time.  How many glasses of water does it take to brew a gallon of beer? I have no idea either, so reading that New Belgium, a Colorado brewing company, wants to reduce its water use per barrel to 3.5 to 1 by 2015 doesn’t tell me much. In 2011, the ratio was 4.22 to 1., 839349=Posted by Tom Konrad at 11:03 PM | Permalink | Comments (0) | TrackBacks (0), 25592=Kachan said that in 2014 VCs will be funding what he called “capital efficient plays,” for example, “energy efficiency or efficiency in general…so-called cleanweb investments,” he said.  Cleanweb refers to the intersection of IT and sensors and big data, i.e. products and services that drive efficiency in homes by using the cloud (think nest thermostats) or drive efficiency in workflow or access to capital such as crowdfunding.  “There has been an emphasis on capital efficient initiatives as opposed to 2007 and 2008 and the massive billions of dollars that we saw go into biofuels, for instance,” he explained., 26951=Kachan, a seasoned cleantech investment advisor, believes that 2014 may actually be the year that renewable energy expectations and deliveries begin to match.  In other words, the technology is mature enough that investors understand what it is capable of providing and invest accordingly.  In addition, major corporations are getting into renewable energy. “The largest companies in the world are taking a more active, aggressive role than ever in wanting to profit from clean energy,” said Kachan who explained that renewable energy and clean tech are still following the same trajectories of those technologies that came before them. “This is representative of the overall lifecycle of the maturation of the clean tech space,” he said.  “If you look at other technology revolutions in the past where venture capital played a dominant role in the early days, sources of capital diversify over time,” he explained. , 290123=There have been six earnings reports released so far in 2013 for alternative energy stocks, all small or microcap companies. There were no blowouts, but also no superstars – most were within analyst expectation or somewhat below. , 397380=It looks like America is winning the Clean Energy race, but 2011 was just our year to be the Hare to China's Tortoise.  Next year, look for the US to take a nap along the side of the Clean Energy racecourse, while China resumes its purposeful ramp-up of Clean Energy investment., 670747=Posted by Tom Konrad at 10:19 PM | Permalink | Comments (6), 460546=The 20 percent by 2030 has actually been an industry goal since former president George Bush signed off on a DOE report detailing how the U.S. could achieve that kind of wind penetration, and do so without any major technology breakthroughs., 404972=The most notable change in Clean Energy during 2011 were the rapid price drops.  With Wind and especially Solar power cheaper, the big winners are Clean Energy consumers.  As discussed above, Italians are already saving money by investing in solar to displace electricity from the grid. , 148373=[W]idespread commercial viability of [graphene's] properties may still be further off than many  investors seem to be hoping. This is mainly because a lot of its benefits are paired with limitations that to greater or lesser degrees, still need to be overcome. For example, even though it has 100% energy conversion rate for absorbed photons, it only absorbs ~3% of photons striking it. There is a lot of research going on addressing this such as with dye-sensitized cells and other ideas, but all of this is primarily still in the lab and not ready for widespread use. Keep in mind, graphene was only discovered in 2004. Something we’ve been aware of for less than a decade will necessarily have a long way to go in terms of our understanding how to best unlock its potential., 677483=Posted by Tom Konrad at 12:42 PM | Permalink | Comments (0), 573460=Posted by Tom Konrad at 10:25 AM | Permalink | Comments (0), 397940=Posted by Tom Konrad at 03:29 PM | Permalink | Comments (0), 577824=China took the lead in clean energy investment in 2010, displacing Germany., 39826=“I see 2014 as the year that renewable energy finance comes of age,” said Konrad. , 260029=In 2012, Fidelity Investments featured energy efficiency as a “compelling investment opportunity.” According to Fidelity, global power needs are expected to rise 50% in the next 25 years, creating an increasing market for more efficiency lighting, engines and buildings., 700870=And yet, it didn’t have to be this way. Given China’s near monopoly in rare earths production it might come as a surprise to learn that the United States was the world’s leading producer of rare earths as recently as 1995., 576166=Lowest investment since 2005, 84233=Posted by Guest Contributor at 02:08 PM | Permalink | Comments (0), 49043=Posted by Guest Contributor at 09:36 AM | Permalink | Comments (0), 127975=A similar company to Focus Graphite, Lomiko Metals Inc.  (TSX-V:FMS, OTC:FCSMF) was recently in the news for having turned graphite into “graphene oxide.”  (Grafoid also says it can also easily oxidize MesoGraf.) The graphene supercapacitors which made headlines last March were made from graphene oxide using the laser from a DVD burner., 396678=Because so many initiatives expired and may not be renewed, 2011 seems likely to be America's last hurrah in the the Clean Energy race.  Unless we re-initiate significant support for clean energy soon, Clean Energy investment and the industries and jobs it creates are likely to head for more hospitable political environments., 820389=Posted by Tom Konrad at 09:28 AM | Permalink | Comments (0) | TrackBacks (0), 33891=Navigant consulting has been examining consumer attitudes towards clean energy since 2009 and published its latest report “Energy and Environment Consumer Survey” in December 2013.  The report is a summary of a survey conducted among 1,084 U.S. adults based on a “nationally representative and demographically balanced sample.”  The survey asked for consumer attitudes towards 10 clean energy topics and the results are shown in the chart below., 32800=Most experts agree that other renewable energy technologies will hold steady in 2014.  Geothermal will continue to make progress in areas with good resourced such as the Philippines.  “Large hydro continues to be very attractive but mainly in developing economies and new markets,” said Umanoff.  “It’s very, very hard to permit a large hydropower facility in a mature, industrial democracy,” he said.  Biofuels and biomass projects will make headway as well but in terms of gaining marketshare, the winners will be wind and solar. , 36079=“I think that we will see a few publicly traded ‘yield cos’ (yield companies) in solar listed in 2014,” he said.  A yield co is a publicly traded company that is oriented towards income as opposed to growth.  This type of investment opportunity is a major switch, said Konrad.  “Any stock you have ever written about pretty much has been a growth stock,” he explained.  “Tesla (TSLA) is a growth stock.  People buy Tesla because they think the company is going to keep on gaining market share,” he clarified., 895028=Posted by Charles Morand at 10:23 AM | Permalink | Comments (3), 321578=I have written before that I like installation companies as a group within the solar sector. Investors that scooped up shares of the newly issued solar installer SolarCity (SCTY) have done extremely well, up over 20% from its opening on December 13. While SolarCity may be a good long-term play as part of a speculative portfolio, it is not for the faint of heart considering that it has nowhere near positive earnings yet., 253287=Posted by Harris Roen at 12:05 PM | Permalink | Comments (0), 782007=Posted by Tom Konrad at 10:09 AM | Permalink | Comments (1), 34981=Perhaps that’s why all of the finance experts that we spoke to for this article said they were “optimistic” about the 2014 outlook for renewable energy finance., 448886=In 2011, the first year Nissan starting selling the all-electric LEAF, more than 20,000 will have been sold. Not too shabby — especially considering the LEAF carries with it the burden of range anxiety, something Prius owners have never had to deal with., 591350=These are important because the way GICS forces us to classify our holdings is pure 19th century. Notice there's nothing in our energy sector. Our published top 25 holdings as of 12/31/2010 included such names as First Solar, Inc. (FSLR), and Vestas Wind Systems (VWDRY.PK). And the unpublished part of the portfolio contains many more companies in solar, wind, wave, turbine, and geothermal power. Yet, according to GICS, we have no exposure to the energy sector at all. None. All our power-related holdings fall under either \"industrials\" or \"information technology.\" Really? I get how some of these could be manufacturing but, come on, these days there's so much more to power than burning fossilized hydrocarbons. (In addition, this skewing of reality means the \"industrials\" and \"information technology\" sectors in our index now appear more weighted than they really are.), 842738=Now, gas turbines (or combustion turbines) appear to violate this rule since they don’t need water cooling. However, this is deceptive. In fact, they are simply using the atmosphere as their cool reservoir. They pull cool ambient temperature air from the atmosphere and then return it to the atmosphere at a very high temperature (typically 1000 F or more). The maximum temperature inside a gas turbine is limited by materials issues, and is pretty well fixed for the purposes of our discussion. Since the hot temperature is essentially fixed, the temperature difference is driven by the temperature of the inlet air: the cooler the inlet air the higher the efficiency. (You might note that gas turbines are actually running at their poorest efficiency during the very hottest summer days when they are most commonly used for peak generation.) , 152829=This article was first published on the author's Forbes.com blog, Green Stocks on September 18th., 441247=Posted by Eamon Keane at 08:52 AM | Permalink | Comments (0), 525195=While public policy and the media tend to focus on technological innovation as the key to addressing climate change and boosting clean energy, business model innovation (BMI) offers a path to rapid deployment of existing technologies. The concept was popularized and given its current acronym by Mark Johnson, Clayton Christensen, and Henning Kagermann in their Dec. 2008 Harvard Business Review article “Reinventing Your Business Model.” They point out that “Low-cost U.S. airlines grew from a blip on the radar screen to 55% of the market value of all carriers. Fully 11 of the 27 companies born in the last quarter century that grew their way into the Fortune 500 in the past 10 years did so through business model innovation.”, 524108=Boston-based Zipcar (ZIP) raised $174 million from its Initial Public Offering in April 2011. It already has operates in 14 big cities and 230 college campuses around the United States, Canada and the UK, and is planning to use the new capital for market expansion. Zipcar is not a high tech business, and its success is not due to sophisticated technological innovation; rather, it’s an example of business model innovation. Zipcar reinvented the traditional car rental business by simplifying and reducing the costs for short-term rentals, and rebranding the service as green car sharing. They developed a distributed model of rental locations, an annual membership system, an all inclusive by-the-hour pricing structure, and online booking. Together these greatly reduce the cost and time needed to rent a car, while maximizing convenience. Indeed, most of the people I know who use Zipcar’s service are not ardent environmentalists, but enjoy the hassle-free approach and the easy parking., 303636=For over a decade now, Green Alpha cofounders Jeremy Deems and I have been wondering when popular awareness of these truths would emerge. And while I can't represent that we're there yet, I can say that we definitely are noticing a major shift in both frequency and tone of recent journalism and punditry on the subject of sustainability economics. Fellow green economist Tom Konrad got me thinking about all this when he asked me and a few other money managers for thoughts about 2013 for his Forbes piece on the subject. The more I thought about framing an answer, the more I realized how much momentum I’ve been noticing just over the last quarter or so. To give an idea of what I mean, here's a representative but far from complete list of some smart people and organizations articulating a vision of and working towards a next economy wherein society can thrive without exceeding earth's tolerances or threatening the underpinnings of the global economy. Each of these is worth delving into in its own right., 713221=Will Rare Earths Cripple the Green Economy? Part 1 and Part 2 (Eamon Keane, September 2010) Rarer Rare Earths Are Not Going To Sink The Wind Power Sector (Charles Morand, Aug 2009), 355190=This is why a lot of the same guys who trivialized my analyses back in 2004-2005 now regularly read these pages and invite me to speak at their conferences..., 394004=According to the just-released report \"Who's Winning the Clean Energy Race?\" from the Pew Charitable Trusts, the United States invested the most in Clean Energy of any country in 2011, retaking the lead from China, which had held the top sport for the last two years.  But the US's resurgence is more likely to be a blip than a trend., 254143=2013 is poised to be an exciting year for alternative energy investors. Despite the conflagration solar had in 2012 we see opportunities there, as well as in wind and energy efficiency. This article also reveals why 2013 is shaping up to be a good year for the stock market in general, and alternative energy in particular., 81135=[14] https://www.llnl.gov/news/newsreleases/2013/Jul/images/28228_flowcharthighres.png, 280028=All Green Alpha portfolios are based on our universe of next economy companies, with individual securities and weights selected to best fit the mandate of each portfolio. We’re especially pleased that December 30th 2012 saw the fourth anniversary of the inception of the GANEX, reflecting a four year track record milestone measuring the growth and progress of the overall next economy. (On the topic of portfolios, look for an exciting announcement from us later in Q1 regarding our fourth and newest portfolio offering that will greatly enhance our ability to serve current and future clients.), 728617=Posted by Tom Konrad at 01:40 AM | Permalink | Comments (13), 258442=Bloomberg reports that at the beginning of January, the Bureau of Ocean Energy Management started to gage interest in offshore wind leases for 127 square miles off the coast of New York. Also, in 2013 the administration plans to conduct competitive lease auctions off the Massachusetts coast., 278935=Each of the three Green Alpha portfolios saw a positive return for 2012. Our flagship green economy benchmark, the Green Alpha Next Economy Index (or GANEX) returned 4.21%; our Sierra Club Green Alpha portfolio (SCGA), actively managed and more concentrated than the GANEX, returned 6.79%; and our newest portfolio, the Green Alpha Growth and Income Portfolio (GAGIP), was up 6.96% for the partial year from its inception on October 8th, 2012.  While we are happy to return to positive performance after a tough year for next economy stocks in 2011, we did nevertheless underperform the legacy fossil-fuels based indices; the S&P 500 was up 16% and the Dow Jones Industrial Average returned 7.26% in 2012. All three of our portfolios did however outperform prominent green economy ETF portfolios (see discussion below)., 46456=Google has had an investment say in Nest since 2011, and the firm \"has the business resources, global scale and platform reach to accelerate Nest growth across hardware, software and services,\" writes Fadell in a blog post. \"Google will help us fully realize our vision of the conscious home and allow us to change the world faster than we ever could if we continued to go it alone. We've had great momentum, but this is a rocket ship.\" An Apple-watching news site explores why Google, not Apple, is buying Nest: ultimately managing data about home usage is more in line with Google's business, while smaller hardware plays like chips has become Apple's pursuit. And Google's cash warchest gives it the freedom and wherewithal to take big shots like this., 344452=First, let us look in detail at what happened in the last week of trading. Of the approximately 250 alternative energy companies that the Roen Financial Report tracks, only 21 companies, or less than 9%, were gainers. In other words, losers beat gainers by a 10:1 ratio! On average, alternative energy companies were down 5.8%, with 35 companies showing double-digit losses for the week. Of the 21 gainers, fully half were volatile penny stocks with market caps less than $100 million, so those gains may change very quickly., 697591=Posted by Eamon Keane at 08:52 PM | Permalink | Comments (0), 216841=The 2012 report cites Apple’s planned expansion into “iDataCenters” to support its booming iCloud services, which at the time were thought to be powered mostly by fossil fuels. Apple was given poor rankings due to its apparent lack of initiative in clean energy and efficiency. Due to this lack of commitment,  “Apple [was] finding itself behind other companies such as Facebook (FB) and Google (GOOG) who are angling to control a bigger piece of the cloud. Instead of playing catch up, Apple has the ingenuity, on-hand cash and innovative spirit to Think Different and make substantial improvements in the type of energy that powers its cloud,” according to Greenpeace., 645610=Posted by Dana Blankenhorn at 08:39 PM | Permalink | Comments (0), 254596=If 2011 was a bad year for solar, with the bankruptcy of Solyndra, tariff wars with China, and other damaging events, then 2012 was a disaster. The Ardour Solar Energy Index (SOLRX) lost 35% in 2012. This is on top of a blistering 66% loss in 2011!, 83345=[29] http://www.wired.com/wiredenterprise/2013/11/facebook-iowa-wind/, 24970=Renewable energy finance experts describe the early days of clean tech venture capital (VC) investment as being one fraught with “exuberance” and “frothiness.”  Investors were eager to fund what they believed would be the next big thing and clean tech aka green energy aka renewable energy was where the action was.  Dallas Kachan of boutique cleantech research and advisory firm Kachan and Company points to biofuels as a technology that received billions of dollars of investment capital in 2007 and 2008 and now has very little to show for it. Not a good result for an early-stage investor., 49905=Alternative energy stocks had an epic year in 2013. The widely watched Ardour Global Alternative Energy Index Composite (AGIGL) was up 53% in 2013. That’s double the 26% return for the S&P 500. In fact, 2013 marked the largest annual return for the AGIGL since 2007. In January 2013, I predicted that “…low interest rates and plenty of corporate cash will be a strong driver of stocks in 2013, including the growth industries within alternative energy.” That forecast turned out to be true and then some., 26607=VC investment in renewable energy has been trending down for the past two years in fact and it will continue to do so in 2014 and beyond, said Kachan. “We predict that in 2014, we will continue to see companies having a harder and harder time raising venture capital,” he said, “but that’s not necessarily a bad thing.” , 394593=The United States' investments in Clean Energy were up 42% in 2011 over 2010, reaching $48.1 Billion.  Meanwhile, Chinese investments were basically flat at $45.5 Billion., 349902=Harris Roen is Editor of the “ROEN FINANCIAL REPORT” by Swiftwood Press LLC, 82 Church Street, Suite 303, Burlington, VT 05401. © Copyright 2010 Swiftwood Press LLC. All rights reserved; reprinting by permission only. For reprints please contact us at cservice@swiftwood.com. POSTMASTER: Send address changes to Roen Financial Report, 82 Church Street, Suite 303, Burlington, VT 05401. Application to Mail at Periodicals Postage Prices is Pending at Burlington VT and additional Mailing offices., 325567=Posted by Harris Roen at 09:20 AM | Permalink | Comments (1), 199678=Posted by Tom Konrad at 09:57 AM | Permalink | Comments (0), 342211=Posted by Guest Contributor at 10:14 AM | Permalink | Comments (3), 578429=Investment in wind power dropped 50% from 2009 levels, 63751=Cleantech products and services are disrupting massive global industries. In 2014 alone, the US is projected to spend about $1.3 trillion on energy.[9] As costs of clean technology have declined, adoption is increasing rapidly. Let’s look at solar photovoltaic (PV) as an example: Since the beginning of 2011, the average price of a solar panel has declined by 60%[10]. As we look further back in time, the declines are more impressive. The price of PV cells has dropped from $76.67 per watt in 1977 to $0.74 per watt in 2013.[11] This has led to a significant increase in PV deployments. PV installations in the US have grown approximately 50% per year from 2011 to 2013.[12] In 2012, renewable energy sources (biomass, geothermal, solar, water, wind) represented half of all new capacity in the US.[13] Towards the end of 2013, BrightSource Energy’s Ivanpah Unit 1 connected to the grid., 217807=Shortly after the report was released — and Greenpeace hosted several colorful protests — Apple announced it would power its three new data centers in North Carolina, Oregon and California would be fully powered by renewable energy. Its Maiden, NC facility includes two 20-MW solar PV installations, with its remaining power to derived from a 10-MW biogas plant, fuel cells and renewable power purchased from local and regional sources — which are all set to be up and running by the end of 2013. It is locally sourcing wind power for its Newark, Calif. center and will do the same with a mix of renewable sources at its Prineville, Ore. center. Its next data center in Reno, Nevada will be powered by onsite geothermal and solar sources., 829074=Saj Karsan EnviroStar (EVI) is a distributor of laundry equipment that has developed a proprietary dry-wet-cleaning machine that avoids the use of perchloroethylene (Perc), a harmful chemical that the International Agency for Research on Cancer has deemed a carcinogen. Perc is also classified as a hazardous air contaminant by the US Environment Protection Agency, and its use will become illegal in the state of California in the year 2023. EnviroStar's patented Green-Jet process uses an environmentally-friendly, water-based solution that is both non-toxic and requires less energy consumption than traditional dry-cleaning methods., 442266=Last December, I made three predictions for 2011:, 115399=Posted by Debra Fiakas at 11:38 AM | Permalink | Comments (0), 75130=More importantly, when companies (or people) develop awesome products, people want to buy them. For example, Nest Labs has built a learning thermostat that people all over the world want to install in their homes. Their thermostat consistently results in 20% energy savings, but I suspect it’s their phenomenal design and ease-of-use that’s really driving adoption. Nest is a young company – launched in 2011 – yet has grown tremendously and is now selling ~50,000 thermostats per month. Impressively, there is evidence that people have been “smuggling” Nest thermostats outside of the US before the company was officially shipping to those countries.[33], 262444=Until recently, oil was a commodity that traded principally on supply and demand, or on the perception of how supplies may be squeezed due to regional conflicts. In the past several years, however, oil prices have turned into a proxy for how traders believe the economy, and thus the stock market, will fare. The logic goes that the more economic activity occurs, the greater oil consumption will be. Since 2009, the price of a barrel of crude oil has been almost exactly correlated to the S&P 500 index., 256021=Despite the gloomy statistics, financial and energy analyst may look back at 2012 as the turnaround year for solar. Many individual companies (particularly the upstream photovoltaic (PV) manufacturers) are facing economic realities of oversupply and falling PV prices, which will ultimately lead to bankruptcies or mergers. According to IHS iSuppli Market Intelligence, the number of PV suppliers is expected to plunge by 70% in 2013. Those left standing, however, will profit immensely, since solar is a white-hat energy source that is likely only at the beginning of its long-term growth story., 759225=Posted by Eamon Keane at 04:47 PM | Permalink | Comments (0), 39932=This article is part of th Renewable Energy World January/February Annual Outlook Issue for 2014, which will be published on February 10, 2014. The issue includes our Global Directory of Suppliers.  If you are not already a subscriber, why not subscribe now?, 129009=[W]orking closely with Glabs [Graphene Laboratories of Calverton, NY] to develop supercapacitors and other devices and ideas using graphene converted from natural flake graphite we find in Quebec.  The connection between graphite and graphene on a scientific level is large.  However the some of the amazing properties of graphene can be found in graphene nanoplatelets.  Imagine graphene to be a pristine, smooth plywood sheet and nanoplatelets a particle board or cork board formation.  This structure may increase conductivity but reduce strength and make the substance useful in battery and supercapacitor applications (which we are working on).  As you know, there are more than 9000 patents for graphene.  There is enough flake graphite resources to supply the creation of an industry based on graphene.  But few are working on the pinch point of the hourglass – the conversion technology.  That is what Lomiko and Glabs would like to create graphite and graphene substances that focus on one or two of the qualities of graphene – strength, conductivity, or elasticity and produce it for pennies per gram.  Current costs of $ 100 – $1000 per gram are prohibitive for production purposes., 28577=“Utility scale solar, mainly photovoltaic solar, and utility-scale wind will continue to be active in their growth in particular outside of the U.S.,” said Adam Umanoff, partner with Akin Gump law firm. Lynn Tabernacki, managing director of renewable and clean energy at Overseas Private Investment Corp. (OPIC) agreed.  “In 2014, solar and wind will remain the mainstay of renewable energy investments because of sustained cost reductions for plant construction using these technologies,” she said., 855030=Sectors like solar, biofuels and smart grid have received a significant overweighting of venture capital investment compared to other sectors. Is this because they are better investment opportunities or because venture capitalists (VCs), being human, invest in what they know and who they know? While many entrepreneurs may not believe it, VCs are human, too. In my last post, “Human Capital, Not Venture Capital, the Biggest Cleantech Need,” I discussed how the greatest challenge today to growing a successful early-stage cleantech business is the shortage of successful, experienced cleantech entrepreneurs. But finding the right human capital to build great cleantech businesses isn’t the only stumbling block: Human capitalists (VCs) have been limited by their own experiences and networks. At the end of the day, venture capitalists almost always invest first in people. A great, experienced management team can make a business out of an average technology. A bad management team can destroy the most amazing of technologies. Over the past decade, as cleantech VC investment started to expand to more than a handful of specialized funds, VCs naturally turned to their business networks to learn about the sectors, identify opportunities and build management teams. Given that the largest categories of VC investments in the preceding few decades have been in software/web, semiconductors, information technology and pharmaceuticals, these are also the areas where the VCs’ largest network of experienced successful entrepreneurs resided. As crossover entrepreneurs and crossover VCs started to explore or create opportunities, they naturally looked where their knowledge could be most applied. It should not be surprising that the lion’s share of VC investment dollars have been going into areas that have closely related technology foundations to the traditional areas of VC investment. Sectors like solar, smart grid, biofuels and LEDs have received most of the VC dollars and, as a result, increased press hype. The table below highlights the approximate portion of cleantech VC investments in some of these key areas over the past three years. No doubt there are exciting investments to be made in these sectors. Our fund, Access Venture Partners, has invested in both an LED lighting company (TerraLUX) and a smartgrid company (Tendril Networks). But what about sectors like green building materials, industrial energy efficiency, geothermal and nuclear? They serve equally enormous markets (if not larger) and at least in some areas (if not most) have equal or greater potential impact on the economy and the environment. Solar is a particular anomaly, receiving the single largest share of all cleantech venture capital. While sexy because of its elegance, solar is a challenged technology. The economics of solar must struggle against the triple confluence of very low efficiencies, very high costs and the fact the sun simply doesn’t shine much of the time (think night and clouds). No doubt that solar venture investments are targeted at changing those factors – except for the sun, of course. There are limits to what even VCs can accomplish. But even if the cost of solar cells dropped to zero, solar still would find itself challenged to compete with other renewables, let alone traditional energy, because at least half the system cost is outside of the cells. Geothermal, which unlike solar can be used as “base load” (meaning that it is always on), is at the other end of the spectrum. There have been few geothermal venture capital investments, yet it has some of the most compelling economics at both the utility and home scale. I would highlight both MIT’s 2006 report on the huge potential of geothermal energy and, of more contemporary interest, the October 2009 issue of Consumer Reports, which showed how a geothermal heat pump’s potential economic return usually outperforms that of a home-based solar thermal system. So why the VC investment preference for solar over geothermal? I’m betting that much of the bias has to do with the fact that not many VCs have strong networks of geologists, drilling technologists, heat pump engineers and steam turbine power generation experts to build great geothermal companies (myself included). While it is certainly important to be knowledgeable and comfortable with the people and technology of a company, VCs must challenge themselves to think outside their own box. If the cleantech market is going to fulfill its full business potential, VCs must push themselves beyond the normal human inclination to stick with what’s familiar. A comfortable investment may not be a great investment. Cleantech VCs need to take a peek over the side of our box. What we see and what we can learn may surprise us. , 79980=[6] http://www.huffingtonpost.com/2013/02/12/hurricane-sandy-second-costliest_n_2669686.html, 334412=India is set to become the 3rd largest market for wind energy after USA and China and is set to enter the top 10 club of countries in installing solar energy capacity in 2012. Massive power deficits, millions of people without power, billions of dollars in oil, gas and coal imports imply that India offers massive opportunities for renewable energy generation. In fact Indian solar energy represents one of the biggest energy opportunities in the 21st century. The Indian government target of 20 GW by 2022 will be beaten by a huge margin in our view., 833360=Posted by Guest Contributor at 10:32 PM | Permalink | Comments (0), 265066=So far the stock market, as measured by the S&P 500, is up 4.8% since the beginning of the year, and is on track to have continued gains for the month. Even more impressive, alternative energy stocks are up 9.2% so far for the year on average. Even if you take out volatile penny stocks, gains averaged 8.1%. Considering this I feel all stocks, including the alternative energy sector, will have a very positive 2013., 359040=For investors, solar will remain tricky. The most lucrative opportunities in 2013 will continue to be in those small niche tech sectors and in installation. The latter could prove to really launch the SolarCity IPO, so definitely watch that one carefully., 331023=Bottom line: Big US auditors are likely to sever their relations with a growing number of mid-sized and smaller US-listed Chinese firms in 2013 as they face growing pressure to comply with SEC investigations., 361612=Posted by Jeff Siegel at 09:06 AM | Permalink | Comments (0), 831782=The biggest risk to this company may be the way its controlling (and managing) shareholders appear to view public stockholders: as opponents rather than partners. Last December, the controlling shareholders tried to take advantage of a misbehaving market by making a bid for the remainder of the company. The bid, which valued the entire company at $6 million, likely so undervalued the company's assets that it was withdrawn just six days later. Consummation of the deal required a fairness opinion that the price offered was fair for the public stockholders, an opinion no financial advisor could likely offer with a straight face., 426224=Posted by Garvin at 06:11 PM | Permalink | Comments (0), 461159=Even Bloomberg's New Energy Finance recently released a report indicating the best wind farms in the world already produce power as economically as coal, gas and nuclear generation, and the average wind farm will be fully competitive by 2016., 357967=First, solar prices will continue to fall, albeit probably not as fast as we saw in 2012. This will benefit solar installers that are making a killing right now in the United States. Installation growth will remain strong, particularly with all these new solar leasing companies that are breaking records on both commercial and residential installations., 449526=Predictions for 2012, 45536=That's a neat segue to our next Google news item. While the company continues to lunch on renewable energy deals, this week it swallowed its biggest meal yet: $3.2 billion for Nest Labs, maker of the Nest smart thermostat and a newer line of smoke/CO2 alarms. (Sorry, anyone who predicted Nest as one of the most anticipated 2014 IPO offerings.) Here's a bit of sunshine for other cleantech investors: the deal means Nest's early VC investors are exiting with 15-20× multiples, including a $400 million payday for Kleiner Perkins Caufield & Byers., 263142=Of course, other factors will contribute to the price of oil in 2013. New drilling technologies are on the rise, giving life to what were thought to be unproductive wells, which will increase supplies. This increased production efficiency, though, has associated environmental issues. Also, the increased production will be more than offset by increased consumption, particularly by developing countries. For example, according to the International Energy Agency, energy consumption in China is likely to double in 10 years from 2008 levels, and triple by 2025!, 447754=I'm not going to sit here today and defend the electric car from all the bogus arguments we hear time and time again from the media whores and partisan slaves. (Feel free to check out this article I wrote back in 2010, where I responded to some of the more common criticisms.), 81426=[16] http://www.mckinsey.com/~/media/mckinsey/dotcom/client_service/automotive%20and%20assembly/lighting_the_way_perspectives_on_global_lighting_market_2012.ashx, 574687=I had the opportunity to review a pre-release version of the report. Some 2010 trends they discovered were encouraging or exciting, some were disappointing. I also had the chance to speak to the director of Pew's Clean energy Program, Phyllis Cuttino, about the report. Here are the highlights from the report and our discussion., 77062=This consumer pull reminds me of the role consumer choice has had in disrupting other industries. For example, the cell phone industry was not particularly exciting back in 1983, despite the launch of the DynaTAC. As cell phones penetrated the work place, they were very much part of a company’s IT system. Companies selected which employees would be eligible for a cell phone and which devices it would support. Then an interesting thing happened: employees started to care about their phones. They started lobbying their IT departments for iPhones. The top-down decision making process was no longer tenable. Employees insisted on choice. Why couldn’t their IT departments just figure out how to support whatever smart phone they wanted to own? As you probably know, this led to the decline of Blackberry (current market cap of $4.5 billion) and the rise of Apple (current market cap of $480 billion[34])., 31893=In addition, in 2014, expect to see more solar installation companies tap into the burgeoning innovations in how to offer their customers low-cost financing options or attractive leasing models to help offset the cost of going solar.  (More on financial innovations in the section below.), 580389=Solar PV dominated Japanese clean energy investment in 2010., 766790=Posted by Eamon Keane at 08:38 PM | Permalink | Comments (0), 453850=The move to pony up more nuclear power in the U.S. will continue, although I'm not convinced it'll get very far in 2012. Regardless of your take on nuclear, it is prohibitively expensive without massive government support. And there ain't much of that right now. That being said, I remain bullish on new nuclear fuel technologies that enable lower cost production and safer power generation., 576023=40 GW added in 2010, 51390=Canadian Solar Inc. (CSIQ) was by far the largest gainer, up almost 800% in 2013. This solar cell and module company has been rebuilding its capacity over the past year, with choppy but growing sales. It also posted its first profitable quarter since 2010. Though Canadian Solar is technically based in Ontario, all of its manufacturing facilities are in China., 442978=Toward the end of 2010, we saw the writing on the wall..., 214340=This article was first published on the author's Forbes.com blog, Green Stocks on May 8th., 477644=Posted by David Gold at 05:51 PM | Permalink | Comments (1), 645108=Dana Blankenhorn first covered the energy industries in 1978 with the Houston Business Journal. He returned after a short 29 year hiatus because it's the best business story of our time. In between he covered PCs, the Internet, e-commerce, open source, the Internet of Things and Moore's Law. It's the application of the last to harvesting the energy all around us he's most excited about. He lives in Atlanta., 98467=These proposed rules now move into a 90-day comment period, which will almost certainly be voluminous, and likely will be extended by the SEC, with final rules coming after that -- likely late 2014 or even 2015, points Adam Wade, associate at Foley Hoag. With that much time, there could be significant difference between these preliminary rules and what gets finalized., 417412=MidAmerican will have 3,316 megawatts of wind generation in operation by the end of 2012, far more than any other regulated electric utility in the country. The total amount that we have invested or committed to wind is a staggering $6 billion. We can make this sort of investment because MidAmerican retains all of its earnings, unlike other utilities that generally pay out most of what they earn. In addition, late last year we took on two solar projects – one 100%-owned in California and the other 49%-owned in Arizona – that will cost about $3 billion to construct. Many more wind and solar projects will almost certainly follow., 178548=Posted by Tom Konrad at 09:04 AM | Permalink | Comments (0), 805237=Posted by David Gold at 10:35 PM | Permalink, 51851=Of the bottom ten stocks, the worst performer was Ecotality (ECTYQ), which went bankrupt in September. Three other of the lowest performers were delisted to the pink sheets., 123951=In my research, I found many companies which are developing graphene applications, and rushing to patent the results.  Most of these applications are still years from producing measurable revenue.  One example from my previous article was Lockheed Martin‘s (NYSE:LMT) patent on graphene water filters in March.  Lockheed clearly has the financing and brand name needed to commercialize this application quickly, but only says that it aims to have a prototype ready for testing by 2014 or 2015.  That puts the launch of a commercial product at least another three years beyond that, to give time for adequate testing an manufacturing scale-up at least five years out., 37257=Further, Konrad expects to see at least one renewable energy income mutual fund unveiled in 2014 “because there are lots of things to put into it,” he said., 80918=[13] http://www.renewableenergyworld.com/rea/news/article/2013/01/renewable-energy-provides-half-of-all-new-us-electrical-generating-capacity-in-2012, 83793=[32] http://www.seia.org/research-resources/america-votes-solar-national-solar-survey-2012, 153819=Posted by Tom Konrad at 09:14 PM | Permalink | Comments (0), 23263=Posted by Debra Fiakas at 11:50 AM | Permalink | Comments (0), 174618=Who’s Buying: Executive Chairman and founder Ross Beaty bought 37.6 million shares at prices between C$0.29 and C$0.32 in April and June.  He has hinted that he might buy the entire company if the stock price does not recover., 575577=17 GW of solar was installed in 2010, 702850=However, during the mid-90’s commodity prices bottomed out and the mine found it increasingly difficult to compete with cheaper Chinese imported rare earths. In 1998, after hundreds of thousands of gallons of water carrying radioactive waste spilled into and around Ivanpah Dry Lake, the chemical processing at the mine was stopped and the mine shut its doors. After the California mined closed, China assumed the mantle of world leader in rare earth extraction., 68880=What about cleantech venture capital (VC)? While some VCs have indeed lost money in cleantech, other VCs are getting good returns. DBL Investors invested in both Tesla and SolarCity. Generation Investment Management invested in Nest and SolarCity. I don’t have insight into their specific returns but believe their funds will perform very well. EnerTech, Westly Group, Braemar, and BDC all recently raised new funds. In 2013, our i3 market intelligence platform tracked $6.8 billion dollars of investment across 18 sectors of resource innovation. We tracked a 38% quarterly increase in funds invested from Q3 2013 ($1.5 billion) to Q4 2013 ($2.1 billion).[20], 37849=Other newer financial innovations will expand in 2014, said Dallas Kachan, pointing specifically to crowdfunding.  “When the equity-based crowdfunding systems start taking hold, that really stands a chance of unlocking large sums of hitherto unavailable capital for the whole cleantech space,” he said.  Solar Mosaic, for example, which launched in officially in August of 2011 gained a lot of visibility in 2013.  The company allows individuals to invest in solar projects and offers attractive returns to investors., 271348=In his 2013 State of the State Address, New York Governor Andrew M. Cuomo went far beyond recognition of these facts and expressed his desire to make his state an economic leader in and therefore a beneficiary of the next economy transition: “The economy of tomorrow is the clean tech economy.  We all know it, it’s a foot race – whatever state, whatever region gets there first wins the prize, and we want it to be New York.” On the topic of government inflection, I suppose it’s obligatory to mention that during his second inaugural address, President Obama did appear to be talking the talk on climate. But we’ve heard encouraging words from him before, most notably during his 2011 State of the Union Address, which I discussed at the time as being generally positive. Time will tell. As many have pointed out, the watershed decision for Obama will be final approval or disapproval of the Keystone XL pipeline. Approval would demonstrate beyond any doubt that he prioritizes short term political/monetary benefits over the long term health of the American economy or environment., 879900=Posted by Charles Morand at 09:18 PM | Permalink | Comments (6), 360600=Natural gas will remain king in 2013. And while it will continue to be dirt cheap, prices will start inching back up next year., 393106=Posted by David Gold at 12:00 PM | Permalink | Comments (0), 373717=Posted by Garvin at 02:45 PM | Permalink | Comments (1), 523235=Posted by Tom Konrad at 07:34 PM | Permalink | Comments (2), 347054=Why was the energy sector hit in particular? Simply because short term oil price movementa have little to do with supply and demand, but have instead turned into a proxy for the outlook on the economy, and thus the stock market. Since 2009, the correlation between the S&P 500 and oil prices has been ridiculously tight, 1.00 being a perfect correlation. So when people started gazing over the ever-nearing fiscal cliff, the odds of a recession increased, oil futures dropped and energy stocks tanked., 304827=- PricewaterhouseCoopers’ November 2012 report titled “Too late for two degrees?” (N.B., 3.6 degrees Fahrenheit) states flatly that “[i]t’s time to plan for a warmer world.” Since, as they conclude, to limit warming to two degrees Celsius, the world needs to begin slowing its carbon dioxide emissions “by 5.1 percent every year from now to 2050, essentially slamming the breaks on [CO2 emissions] growth starting right now,\" is not going to happen, we need to take all realistic mitigation steps we can and also plan for adaptation. Coming as it does from a mainstream accounting and auditing firm with no tree hugger ax to grind, this serves as a particularly stark warning, but also signals the truly massive scale of the investment opportunity. - The National Research Council’s report (via the National Academy) on climate change and national security, “Climate and Social Stress: Implications for Security Analysis,” released in November 2012, was “prepared at the request of the U.S. intelligence community.” It provides a clear-eyed look at economic and politico-social consequences of climate change.  It states, in part, “[a]s a practical matter, [climate change] means that significant burdens of adaptation will be imposed on all societies and that unusually severe climate perturbations will [be] encountered in some parts of the world over the next decade with an increasing frequency and severity thereafter. There is compelling reason to presume that specific failures of adaptation will occur with consequences more severe than any yet experienced, severe enough to compel more extensive international engagement than has yet been anticipated or organized.” When realized, this “more extensive international engagement” means more opportunities for companies providing solutions, and crucially, in this case, the momentum for economic transition is coming from the security and intelligence community. The more disparate the voices urging transition, the closer to popular inflection we become. - Not to be outdone by the National Academy, the World Bank (also in November 2012) warned that in its opinion, the globe is on track for warming of four degrees Celsius (7.2 degrees Fahrenheit) if mitigation does not commence immediately. The Bank, in asserting that that kind of warming could devastate the global economy, cited in particular “Ocean Acidification,” “Heat Extremes,” “Lower agricultural yields,” and “Risks to Human Support Systems.” The Bank concludes by indicating a pressing need for “increased support for adaptation, mitigation, inclusive green growth and climate-smart development.” - Warren Buffett’s MidAmerican Renewables has been pouring money into renewable energy projects. In addition to US$11 billion invested in renewable energies over the last year or so, MidAmerican just announced that it’s investing $2.5 billion more for a 579 Megawatt plant in Los Angeles County. As MidAmerican’s Chief Financial Officer Patrick Goodman recently said, “we believe renewables is the better investment right now.” Buffett, certainly not one to invest this kind of money for the sake of being “green,” sums up the opportunity this way: “[m]any more wind and solar projects will almost certainly follow.” - The U.S. Department of Defense, which cares first about national security, second about costs and traditionally not much about ecology, has nevertheless put together America’s single most impressive list of renewable energy and low and zero emissions transportation initiatives. Why? As then Joint Chiefs Chairman Admiral Dennis McGinn said, “Ultimately, as we gain proficiency in generating sustainable, renewable energy sources as a nation we build national strengths and stability.” How far is the military going with these projects? “The DOD is positioned to become the single most important driver of the cleantech revolution in the United States,” according to Clint Wheelock, president of Pike Research, one of America’s leading pure research firms on the subject of renewable energy. - The insurance industry, which ultimately has to pay every time there’s a new climate disaster, has had enough. Munich RE, a leading global reinsurer whose climate practice releases key reports on the economic risks of climate change, in October wrote (registration required), \"[i]n the long term, anthropogenic climate change is believed to be a signiﬁcant loss driver…It particularly affects formation of heatwaves, droughts, thunderstorms and -- in the long run -- tropical cyclone intensity.\" - Reuters recently published a piece explaining “Why you need a climate change portfolio,” using the cogent argument “[w]hether you believe in man-made global warming or not, it's undeniable that trillions of dollars will be spent on technologies to address the collateral damage of climate change.” We do believe in climate change, so we think there may be reason for all those dollars to flow to the appropriate mitigation and adaptation technologies with even more velocity than Reuters may be assuming. - 350.org’s “Fossil Free” institutional divestment campaign is, amazingly, already starting to see some traction. Really. From 350’s website: “Seattle Mayor Mike McGinn sent a letter to the city’s two chief pension funds on friday [sic], formally requesting that they ‘refrain from future investments in fossil fuel companies and begin the process of divesting our pension portfolio from those companies.’” - Even the slow-to-change traditional investment banking industry is showing signs of tuning into reality. In a blog post on its website, the New York Times cites evidence for “A Change in the Weather on Wall Street,” largely as a result of superstorm Sandy, which impacted Wall Street directly. But in addition, “[t]he other new argument is economic. Until this year, the political calculus about climate change had only one side. The oil and coal companies made sure everyone knew about the costs of action. But few people mentioned the costs of inaction. Now they cannot be ignored.”, 177610=This article was first published on the author's Forbes.com blog, Green Stocks on August 23rd., 55796=The economy is setting up 2014 to be another good year for the stock market. Profits remain adequate, interest rates are low, and most importantly, the U.S. housing market continues to improve. Additionally, price momentum in the stock market is very good, so I expect additional money that retail investors have been keeping on the sidelines to flow in. I doubt growth will match that of 2013, however, since prices and valuations are not as depressed as they were a year ago. This means that even if a company continues to have a good year, comparisons to previous years data will look less impressive., 812007=Since Colorado Governor Bill Ritter recruited my friend Morey Wolfson for the Colorado Governor's Energy Office (GEO) he's had a lot less time to socialize with the rest of us in the clean energy community, but we caught up over lunch during the International Peak Oil Conference in October where I was speaking on investing for a peak oil world, and he is on the advisory board of the sponsoring organization, ASPO-USA., 67507=Is Tesla the only cleantech public market success story? No, not at all. In 2013, we tracked 14 cleantech IPOs including Marrone Bio Innovations (MBII), Silver Spring (SSNI), Control4 (CTRL), BioAmber (BIOA), and Evogene (EVGN). These IPOs and other cleantech public companies have performed exceedingly well. We recently analyzed the 2013 performance of stocks within the Russell 3,000 diversified index and were pleased to discover that Revolution Lighting Technologies (RVLT), SunEdison (SUNE), Solar City (SCTY), and Tesla (TSLA) were among the very top performing stocks in the index:, 454283=Overall, I'm cautiously bullish on 2012., 26473=(Image, right: Global Total Investments in Clean Energy (2004-2012). Credit: Bloomberg New Energy Finance), 703953=Fast forward to 2010, and we find that the demand for rare earths has risen considerably given all of the recent discoveries of additional technological uses for the minerals. Just as REE demand has started to ramp up, China began to restrict exports. The US, like other nations, is scrambling to react and get back in the game. However, ramping up a dormant industry is costly and requires a great deal of time. Obtaining a mining license and the associated environmental permits can be described as a regulatory equivalent of a very long cross country steeple chase., 59520=Posted by Harris Roen at 10:35 AM | Permalink | Comments (0), 284845=The chart below shows the performance of the GANEX, from its inception on December 30, 2008 to the end of 2012, versus two prominent green exchange traded funds, the Guggenheim Solar portfolio (TAN, in gold here), and the PowerShares WilderHill Clean Energy ETF (PBW, the black line). Over this period, the GANEX returned 28.15%, while the TAN was -79.22% and PBW performance was -46.68%. To be clear, GANEX differs significantly from these other two. TAN is a basket of exclusively solar and solar-related stocks, and PBW, though not as sector focused as TAN, is limited primarily (but not exclusively) to renewable energy. GANEX by contrast attempts to capture the entirety of the next economy, including renewable energy and solar, but also everything else we’ll need to have a thriving economic system, including, again, transportation, communications, commerce, infrastructure, materials, energy, agriculture, water and more. So while the comparison with these two may not be exact, we believe it does show the importance of careful diversification into all areas of the emerging green economy.  , 41114=Posted by Guest Contributor at 09:04 AM | Permalink | Comments (0), 332418=Posted by Doug Young at 09:10 AM | Permalink | Comments (0), 354098=I never forgot that guy. In fact, over the years I had hoped to run into him again, just so I could remind him that not only was I 100% right about and made a fortune as a result of the solar bull market from 2005 to 2008, but that he was also kind of an asshole., 79601=[4] http://world.time.com/2013/09/25/the-cost-of-cleaning-chinas-filthy-air-about-817-billion-one-official-says/, 261625=I have no doubt that energy efficiency companies with good management and strong balance sheets will do well in 2013 and beyond., 255604=Even analysts’ projections for solar earnings have come way down. In 2011, the average EPS estimate for these large solar companies was a meager 0.57 one year out. In 2012, analyst EPS estimates dropped to a very negative average assessment of -1.72. Though depressing, this reality jived with my forecast at the beginning of 2012, where I predicted another year of rough sledding for solar stocks., 382275=Posted by Tom Konrad at 08:41 AM | Permalink | Comments (0), 581802=If all clean energy continues to grow at the current 45% compound rate, Japan will add 11.7 GW of capacity in 2011. Much of this will likely be biomass and wind, so the average capacity factor will be considerably higher than for clean energy just from solar, meaning that this new clean energy generation should be enough to replace the electricity from damaged reactors more than twice over in just one year. Those who think clean energy cannot replace nuclear power should reconsider., 466016=Posted by Jeff Siegel at 07:37 AM | Permalink | Comments (0), 369372=And one assumes big oil will have seen the writing on the wall of the future by now, and be plotting ways to become the masters of the next great sources of energy. I hope that's the case, but other than Total buying a big piece of Sun Power, I've seen no major moves in that direction. In fact, as recently as October 2011, I heard an oil executive at a conference say something very like \"yeah, we tried experimenting with solar in the '70s, but it was just way too expensive to make a decent value proposition,\" as though he thought the audience was credulous and uninformed enough not to know PV efficiency has improved more than 100 times per dollar's worth since then., 24226=The world of renewable energy finance is vast: encompassing everything from venture capital funding for innovative start-ups, to research and development (R&D) and manufacturing expansion spending, to project finance and all the way through to investing in clean energy companies on the stock market. Because of that, for the general public, predicting where money will flow over the course of the next year is a shot in the dark at best. But there are finance experts who spend their lives tracking where the money is and where it isn’t and here we offer you their expert opinions on renewable energy cash flow in 2014., 159186=What’s more, emissions from operations account for only part of Chevron’s impact. The company’s report says, “combustion of our products resulted in emissions of approximately 364 million metric tons of CO2 in 2012, approximately 8 percent less than the 396 million metric tons emitted in 2011.” Why the decline? Is the fact that people are burning less gas and oil good for the planet but bad for Chevron? The report doesn’t explain., 701188=Until 1948, most of the world’s rare earths were mined in India and Brazil. In the 1950s, South Africa assumed the status of world’s leading rare earth source, but a single mine in the United States eventually overtook South Africa’s production output. From the late 1950s, into the mid-1980s the Mountain Pass rare earth mine in California was the world’s leading producer of REEs., 157551=1. Pay attention to what’s in the report — and what’s left out. Lots of companies fill their sustainability reports with anecdotes, but these are often off point. Chevron’s 2012 corporate responsibility report says a Chevron executive in Angola is part of “a team that protects endangered turtles that come ashore to breed, dig sandy nests and lay their eggs on the beaches at Chevron’s Malongo oil production facilities.” And we learn that the company has partnered with the Wildlife Conservation Society to “introduce passive acoustic monitoring in the south Atlantic Ocean to assess humpback whale breeding activity” as it explores for oil., 343068=If you follow the energy sector closely, then you know that many questions regarding the direction of alternative energy companies were looming during the 2012 campaign season. Was the country going to continue with the Obama Administration’s “all-of-the-above” strategy with its strong emphasis on renewables, or would there be an accelerated domestic drilling and pipeline bonanza under Republican leadership. When the election finally ended last week, many pundits expected investors to pour money into the beleaguered alternative energy sector resulting in a surge of stock prices. So why, instead, did alternative energy stocks head down?, 566392=Posted by Guest Contributor at 07:55 PM | Permalink | Comments (0), 265596=Another reason I believe stocks will do well in 2013 is that the economy is improving. Unlike the gloomy years of 2009-2011, where a continuum of bad economic news was the rule of the day, 2012 revealed some financial bright spots. These include improved business sentiment, a turnaround in housing, and healthy stock market returns., 458647=Hell, back in 1903, the president of the Michigan Savings Bank told Henry Ford's lawyer, Horace Rackham, that the horse was “here to stay” and the automobile was only a novelty, a fad., 289270=Posted by Garvin at 11:13 AM | Permalink | Comments (0), 229085=Some 44 companies active in alternative energy have reported earnings in January 2013. Results have been all over the map, so it is important for alternative energy investors to know where to be cautious, and where the best potential profits are to be found. Below is a summary of selected earnings results from alternative energy companies that the Roen Financial Report tracks., 405301=World Clean Power capacity additions in 2011 were 83.5 GW, 59% more than in 2010, at a cost of $141 billion, up only 12% from 2010 levels.  In other words, we're getting a lot more energy by only spending a little more.  The $59 billion dollars extra that the same amount of capacity would have cost at 2010 prices is pure gain for consumers., 79050=[1] http://tvbythenumbers.zap2it.com/2014/01/07/sunday-final-ratings-family-guy-60-minutes-the-simpsons-bobs-burgers-the-best-of-jimmy-fallon-betrayal-adjusted-down/227214/, 448335=Not including December sales (which we won't see until January), 8,738 LEAFs and 6,142 Volts have been sold in the United States.}",
    "textBeforeTable": "I've listed the funds I know of in the table below, along with their current dividends and the sectors they invest in. Those that converted to corporations are still out there, and still paying good dividends.  And while a few are gone because of mergers, there are also a few new ones that I did not mention in my 2007 article.  They are a great place to start for investors who want a green portfolio, but need income or can't handle the stomach-turning gyrations of the solar or wind stocks. AQN.TO, AQUNF.PK]. convert to corporations like Algonquin Power and Utilities [ Boralex [BLX.TO, BRLXF.PK]) or bought out like the Boralex Power Income Fund (bought by manager renewable energy income trusts I introduced investors to in March 2007 to either be Over the past four years, changes in Canadian tax law have led the Income investors can also invest in clean energy. Tom Konrad CFA Still Renewable, Still Paying Good Dividends February 20, 2011 ts\">Comments (6) Posted by Tom Konrad at 10:19 PM | Permalink | DISCLAIMER: The information and trades provided here are for informational purposes only and are not a",
    "textAfterTable": "As you can see, although these companies have become corporations, the yields will appeal to income investors.  DISCLOSURE:  Long AQUNF, NPIFF. DISCLAIMER: The information and trades provided here and in the comments are for informational purposes only and are not a solicitation to buy or sell any of these securities. Investing involves substantial risk and you should evaluate your own risk levels before you make any investment. Past results are not an indication of future performance. Please take the time to read the full disclaimer here. Posted by Tom Konrad at 12:42 PM | Permalink | Comments (0) February 14, 2011 The Renewable IPO By Greg Pfahl Renewable IPOs in 2010 2010 proved to be a much better year for the initial public offering and renewable energy companies, perhaps surprisingly, saw their share of activity. In 2010 there were more than double the number of initial public offerings than in 2009, and we also saw a significant increase in secondary offerings as well. Worldwide public investment in renewable energy increased 21 percent last year, with China representing 20 percent of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}