{
    "relation": [
        [
            "Impairment",
            "Neck weakness",
            "Difficulty swallowing",
            "Airway restriction",
            "Hand weakness/atrophy",
            "Arm, chest and shoulder weakness/atrophy",
            "Hip weakness",
            "Gluteal and hamstring weakness",
            "Quadriceps weakness/atrophy",
            "Spasticity of legs",
            "Hyperactive reflexes/clonus",
            "Balance",
            "Speech",
            "Decreased vital capacity",
            ""
        ],
        [
            "Description",
            "As my upper body position moves away from vertical, I have increasing difficulty holding my head up.",
            "To avoid aspiration or coughing episodes, I must chew slowly and swallow multiple times.",
            "At higher levels of effort, my throat seems to collapse when inhaling.",
            "For example, I cannot fully extend or flex my fingers or thumbs, and my grip strength and dexterity are greatly reduced. I cannot hold a pen or type on a keyboard, and I cannot feed myself or get dressed without assistance.",
            "For example, I cannot lift my hands over my head, brush my teeth or hair or lift anything over 1 pound with my biceps. I cannot perform a push-up.",
            "For example, I cannot lift my leg over my trike top tube or saddle.",
            "For example, I have difficulty getting into or out of a chair.",
            "My left quad has observable and measurable atrophy and approximately 30% less strength has compared to my right.",
            "For example, my gait is clumsy/ataxic and slow. I have fallen three times in the past 10 days (unrelated to cycling). I have begun using a walker.",
            "My legs shake/vibrate/bounce uncontrollably from the ankles when my calves are lightly engaged.",
            "For example, difficulty walking, standing or transferring from a seated, standing or prone position.",
            "Intelligible with repetition. Because I cannot type, I control my computer with a voice-recognition program. With my deteriorating voice quality, the program has become less accurate and I have begun training on a piece of equipment that controls the computer by tracking the movement of my eyes.",
            "A number of different devices have been used at the hospital to measure my vital capacity. The most recent ratings have been 80 % to 85%. I do not, however, experience shortness of breath outside of exercise.",
            ""
        ],
        [
            "Effect on cycling and adaptations",
            "Cannot maintain an aggressive forward position for time trial or road racing. Adaptations. (1 ) I have added an adjustable stem to raise the bars, (2) I use a flat mountain bike bar in lieu of traditional road bars, and I do not use time trial bars, (3) I use a bungee cord support device as pictured below.",
            "For rides over 90 min., I stop to eat or drink; for rides under 90 min., I eat and drink before I ride.",
            "This is a relatively new development that does not affect me when riding a recumbent, which leads me to believe the solution lies in upper body positioning. I am hoping to control this problem with modifications to some of the adaptations described in \"neck weakness\" above.",
            "Shifting, braking, and maintaining an adequate grip on the bars. Adaptations. (1) I use electronic shifters mounted horizontally to enable me to shift with knuckles rather than fingertips, (2) the pulling force required to fully engage the two rear disc brakes was too much for me, so I have repositioned the rear brake lever to allow me to push on the lever rather than having to pull on the lever, (3) \"winged\" grips.",
            "Balance, steering and acceleration. Adaptations. (1) I use a wider, flat mountain bike bar in lieu of traditional road bars, and I do not use time trial bars, (2) I do not/cannot stand out of the saddle to accelerate, climb or sprint.",
            "I cannot mount or dismount my trike without assistance, and my climbing power is reduced.",
            "Reduced power.",
            "Uneven pedal stroke and reduced power.",
            "Uneven pedal stroke and reduced power.",
            "Cadence is disrupted and jerky. Vibration can affect control of the machine. Reduced power. Adaptations. (1) reduce cadence to approximately 60 RPM, (2) when pedaling, change from flat foot position to pointed toe (fully engages calf muscles to control reflexes), (3) when coasting, slide aft on saddle and fully flex ankles (fully extends calf muscles to control reflexes).",
            "All aspects of cycling. Adaptations. (1) tricycle instead of bicycle, (2) I use a wider, flat mountain bike bar in lieu of traditional road bars, and I do not use time trial bars, (3) I use mountain bike pedals and shoes because I cannot reliably walk on elevated cleats.",
            "No effect on cycling .",
            "Reduced power.",
            ""
        ]
    ],
    "pageTitle": "Oso High Endurance Sports and Oso High Mountain Bike Race Biting Back at ALS",
    "title": "",
    "url": "http://www.osohigh.com/107_Days_to_Oso_High.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 636992123,
    "recordOffset": 636852840,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{142757=April 5, 2012, 326769=Days 28-25, May 21-24, 2012 Roma : Italian is a a one country language, which might provide its inhabitants an incentive to pick up a language or two in case they ever venture beyond their borders or encounter someone from a far away land. If Americans are notoriously ethnocentric, we are at least # 2 on the world list.  After four days in Roma, we are convinced there are more bilingual  people in Montpelier VT than in all of Roma. However, the number of people of people we have encountered who have advised us that they\" don't speak English\" (in perfect English) raises some suspicion that \"don't\" is a word purposefully selected in lieu of \"can't\", meaning that not speaking English is a choice, not a linguistic deficiency. If this is so, you have to respect them for standing on principle at the expense of financial gain or customer service.  After a couple of days, the inconvenience of the language barrier began to fade as we discovered that every word in Italian in English, Spanish or French, except that the Italian version has a couple of extra vowels.  This discovery has been the source of much merriment, as we have cavorted through the city securing food, shelter, gifts, parking spaces and roadside mechanical assistance by resorting to speaking English with a Sopranos-like accent. Thus, when Jean asked for an \"esspoona\", one was immediately delivered by a restaurant employee who, only 24 hours earlier, had been unable to respond  to Jean's pleas for a coffee mug even after an impressive sign  language and charades performance.  The Trucko we rented at the aeropuerti: Oh, how I could go on. However, it's getting late and tomorrow is a race day so I have selected a few quotes:( 1) \" [in the rental car parking lot] We have a big bike. Will the rear seat come out?\" (2) [same place] \"Why  won't this thing start?\" (3) [same place] \"IT HAS A CLUTCH?!!!!!\" (4) \"Ignore the Garmin, she doesn't know what she's  talking about\" (5) [15 times in the five miles from our hotel to the Vatican]So what? I'm bigger than he is!\" (6) [with reference to the number of alleged traffic violations in the preceding 30 seconds] \"Ya think?! Well I'm about to break another one.\" [sound of engine revving in front of a hot clutch, followed by sheet metal and under carriage steel connecting with marble carved and placed by Julia's Caesar's army] (7) \"Is leaving the dome light on overnight really enough to kill the battery?\" (8) \"Cables for to a jumpa?\" (9)  \"Do you think this is a legal parking space?\"(10) \"Fukudome!\"  (11) [a few more times] \"So what? We're bigger than him!\"  The World Cup: Our hotel looks like the United Nations on \"Wear your national flag day\". Time trial racing  starts tomorrow on a straight and flat circuit that could produce very fast times if the wind coming from the Mediterranean  is calm.  Sunday's road race winds  through a 3rd century brothel and bath houses where the Emperor Caligula had his way with juvenile male goats.  The course was not designed by anyone who has ever ridden a killer trike (up, crappy pavement, down, many turns including 2 hairpins, up, down, and one more hairpin). Good, now do that 4 more times.   Team Schneebs is ready to roll. Jean and my current favorite sister-in-law, Maureen, have built the bike, swapped wheels , fixed things, and done an amazing amount of stuff-hauling. They have also performed other typical mechanic-type duties, such as spoon feeding me, and shaving my legs. Classification: classification went as expected, which is to say I am still a T1 (the name for the group of guys who are the best dancers in the race). While I am a member of the US National Team, the group of team members competing here was selected months ago, so I will have to wear a neutral uniform. To ensure people know I am an American, I have selected my race gear: blue jean cut-offs, a wife beater, and if I can find them, hair extensions so I can rock a mullet. Git 'er done. , 111914=Day 94, March 16, 2012. \"Your axle went to the painters today.\" Geoff Booker is building my trike conversion axle in his workshop at his home in England. Geoff is the only source in the world for a UCI-compliant trike conversion kit. The primary engineering challenges Geoff solved is the requirement for the two rear wheels to be able to travel at different speeds (for cornering) coasting or under power. This component is called a \"differential\", as it is in your car (it is the big, round chunk of steel staring back at you when you peak under your rear bumper, looking toward the front). Geoff's design, however, weighs about 100 pounds less than the one under your Hummer., 118382=1975. Note the Run-DMC shoes.                        1979. Hint: I am not alone because I am winning., 107544=10:07, 274748=Note: we have added pictures from Oso High to the June 28 entry, below., 265613=June 25-28, 2012. Back home (temporarily). We leave today for Angel Fire to lay down final preparations for this weekend's Oso High Mountain Bike Race. Short track on Saturday, and cross-country on Sunday. Back home Monday, then off to Canada for the last leg of the 2012 UCI Para Cycling World Cup., 263038=Day 0, June 17-24, 2012. It should be apparent by now that I have a tendency to go on and on. Anticipating that this could be one of those entries, I attempted to present the North Georgia/Dueling Banjos/Condensed version. I was unsuccessful., 310156=Everything went right. John lined up across the road to tail me in case I had a mechanical requiring thumbs (i.E. A mechanical ). Because of the various equipment issues I have encountered this year, my effort has frequently been limited by the distractions provided by the trike. Not today. The only problem I ran into was a turnaround at the halfway point caused by my grip assist device working a little too well. 31:20, the fastest pace of any of my paracycling races. While John wiped the snot off my face, clothing and trike, I mulled over the possibility of a second run. Hearing no objections from John or the officials, we rolled to the line eight minutes after we finished the first run., 151363=Day 68, April 11 , 2012. We went to the ALS clinic at the University of New Mexico Hospital for my quarterly checkup today. My lungs and diaphragm are holding steady. My balance is not. This is a picture of me after the appointment., 215570=Day 24, May 25, 2012, 14842=January 5: me to ALSA:, 244471=Today we worked on the courses for the Oso High Mountain Bike Race, which is coming up on June 30 and July 1. They will be the best ever. There is only one mile of retread from last year's cross - country route. Well, except for the main descent, but that's so much fun you will forgive the puffery. The new \"Enlightenment \" is what will give Oso High its reputation. It scales 1400 feet per lap through a delicious pine and aspen forest. And you know what that means... Yep, rich black dirt, great traction, some soft places to crash and a romantic venue for a post- race hike with your favorite girl or guy, where he or she will repeatedly exclaim with admiration \"you rode up this?!,” and you will lie and say \"yeah, now come on over here and give me some sugar” and he or she will fall helplessly into your arms. You do not want to miss this race., 308816=August 2-3, 2012. The logistics of getting me on the bike are significant. It takes about an hour to get out the door, and most of what has to be done needs to be done by someone other than me. About all I can do on my own is get my shorts on far enough that, if I were to walk out the door without some help, I would get laughed at but not arrested., 106444=39:39, 12222=January 18: me to ALSA:, 208058=Day 31, May 18, 2012. I love to wrap up training for a big event on a high note. See yesterday's discussion of the percentage scores that will determine who goes to London. Yesterday afternoon, Johnny and I rode a 20 km course (same distance as I will ride in Augusta) in 42: 20, which is a 93.5% score. However, this was a totally flat course and I will have to climb 400 feet in Augusta. And… Augusta is a month from now. It's a race against time, which brings me to the concept of ability buffers., 289048=For now, here's where we are: this weekend is the Sandia Peak Epic Omnium, a three event mountain bike fiesta being put on by our team, Sport Systems Mountaintop Cycling as a benefit for the ALS Association. I have raced in the event's predecessors dating back to 1994. That can't happen this time, but I'm going to get there, and I'm going to get there on a bike. Or a trike. Whatever. I'm going to get out of the truck at the bottom of the mountain and ride to the race up at the ski area. So, “3 Days to Sandia”. Honk and toss me a doughnut if you pass me on your way up!, 26696=At My Fastest, probably in 2009, I could never do more than ride \"near\" him. So, when you picture what I mean by saying I went \"with\" him, the picture in your mind should be more like a bicycle pulling a trailer than like Lance Armstrong and Alberto Contador buzzing into Paris shoulder-to-shoulder. Damian offered the Vortex and I his rear wheel. We accepted and rolled along happily in his draft, enjoying the extra 3 mi./h we seemed to be gathering without putting in any additional effort., 29397=Days 48-46, January 29-31, 2012. My dad and stepmom are collectors of timeshares. When you travel within the Schneebeck Timeshare Zone, running from the salty tip of the Baja Peninsula to the lofty peaks of British Columbia, you are never more than a gas tank away from one of their properties. Yesterday, we walked past three of them in less than 5 min. There will never be a timeshare version of Monopoly because Dad and Charlotte have already won. If they had spentevery night to which they are entitled in every one of their condos, they would be over 135 years old. In addition to being world dominant in this field, they are also impossibly generous with their stash. This is how we find ourselves overlooking the Pacific outside Cabo San Lucas this week., 156613=Days 65 and 64, April 14-15, 2012. Abby was confirmed in the Catholic Church this weekend., 23654=Day 50, January 27, 2012. Live. Love. Give. The following two pieces remind us how lucky we are to have what we have at this moment., 93990=Days 108-105, March 2-5, 2012. \"Dude, should we call ski patrol?\", 122223=Days 90-86, March 20 -24, 2012. Track. It was the first thing I was any good at in high school other than class work. I wanted desperately to be good at football (for long discussion, click here), but my only marketable football skill was kicking. By the time I entered high school in 1974, the large men in the NFL with names like \"Groza\" who kicked footballs the way God intended – straight on, the way you kick a copier or printer – had become dinosaurs. They were being replaced by a little swarthy European men with names like \"Stenerude\" who sneaked up on the ball from the side, in fear, apparently, that the ball might kick them back. As this was not cool, I told no one at Chantilly High School I could kick., 175807=Days 53 and 52, April 26-27, 2012. This will be primarily informational. We will have more detail and funny moments (including that time when our friend Andy Kain, a one-time Bermuda National road race champion, gave me his strategic recommendation for handling a particular competitor in tomorrow’s road race… “Cut him off”.), 280694=The win in the road race gave me 112 points for the World Cup Series, which was enough for 2nd place in the 2012 UCI Paracycling World Cup overall, and the #2 world ranking for my class.  If I had gone to the World Cup event in Spain and finished either the time trial or road race those #2s would both be #1s.  But, if I had gone to Spain, I would have been fatigued going into Augusta, where I would have crashed and broken me or the bike and not been able to go to Canada, so I would have been 2nd anyway.  And I wouldn’t have seen the beluga whale we saw north of Quebec.  And Jean would have slit my throat while I slept before Spain, in which case I wouldn’t have raced in Spain or Canada, and I would have been 6th.  So this probably worked out about right., 12167=Thank you for your response. I am confused; however, because my understanding of the study protocol is that data will not be unblinded until the completion of phase 3. That would mean \"compassionate use\" would occurred no earlier than 2013. … To accept that notion with grace, we need to understand the compelling reason behind [the company's ] position. To date, I have not seen that. Your offer to \"forward[my] concerns to the Company\" is appreciated; however, the Company knows my concerns. I am only one voice. What I am asking is whether the ALS Association will advocate for immediate access to [the drug] through any of the compassionate use avenues., 107338=45:12, 15342=Call your friends at the ALS Association or at the ALS Division of MDA. Surely they will light up the company like the fourth of July. Right?, 106858=19:58, 245387=Day 11, June 10, 2012. It's summer in Angel Fire. We haven't been up since ski season. Everything is green, but very dry and the mountain range looks like it might spontaneously combust. This is the longest period of time we have had between visits and some things have changed. I need help going up the stairs but going down is no more difficult than it was three months ago. Go figure., 16302=i)        Call your friends at the ALS Association or at the ALS Division of MDA. Surely they will light up the company like the fourth of July. Right?, 39852=Day 40, February 6, 2012. Groundhog Day was last week… Or was it? \"Dude, are you okay?\" Occasionally, I record data reflecting objective information about my physical abilities. Tonight, I was doing full squats on my toes without resistance to test my quad strength and balance. Each repetition brought me down into a position very much like a baseball catcher., 47565=Once you have a classification you may compete in national and some international competitions. The key to becoming a player on the international stage is being selected to be part of a national Paralympic team. UCI sponsors an annual series of high-profile events that, together with smaller competitions, are scored over the course of the year, with the high point athlete earning the title of \"World Cup Champion\". Most years UCI also hosts a single-event world championship. 2012 being an Olympic year brings the international focus to the Paralympic Games, which follow the Olympic Games in London this summer. Each National Federation is given a set number of participants per sport for the Paralympic Games., 79415=Day 115, February 24, 2012. A star-crossed ride. We first \"met\" John St. Michel during the race in Acoma last September. Since then, we have exchanged e-mail and waves on the bike path. A couple of weeks ago, John stopped to help me when I was struggling to lift my very heavy iPhone out of my side pack. We agreed to meet for a ride soon. \"Soon\" was today., 180638=Days 51-49, April 28-30, 2012. Montréal was nothing if not intense. It was cold, wet, windy, chaotic, emotionally shocking and soothing, exciting, funny, sad, confusing, and – overall – a great time. We learned I have become an essentially useless travel companion. Jean had to do everything – herd the luggage, handle airport check-in, security and customs, drive the car, build, tune and fret over the trike, and – this was the real slap in the face – get her own coffee. We had a great visit with our dear friend Andy Kain, who drove half way across Canada to spend the weekend with us and give Jean a bit of a break from her coaching and wrenching duties. We made some new friends and thoroughly enjoyed the vibe of para cycling, which is very much like mountain biking, except all the legs are shaved and the UCI-approved bikes included a stew of amateur welding and fiberglass, duct tape, gorilla glue and – I swear I'm not making this up – a broom stick., 171970=Days 61 and 60, April 18 and 19, 2012. Here's a depressing exercise. Make a list of all the physical \"impairments\" you might have 40 years from now as compared with your current condition. Then imagine a neurologist, younger than some of your shoes telling you everything on the list would happen in about two years.  In preparation for my first para cycling competition, I had to put together a list for UCI of my impairments, how they affect me on the bike, and what adaptations I have made to work around the problems. The list looks like so:, 123850=When I am focused and thinking clearly, my brain can deliver effective instructions to proceed forward that overcome Satan whispering \"retreat\" to my hamstrings. At 1:49 AM last night, I was neither focused nor thinking clearly when I got out of bed to dispose of some diet Coke. I stepped forward, Satan countered, my hamstrings rebelled and I fell backward as if I had been punched in the face. As far as falls go, this one wasn't bad. My back hit the (rounded) corner of an old-fashioned school desk, and I bounced off that and onto a pile of pillows on the floor. The impact with the desk knocked the wind out of me, but that always makes me feel more alive., 95935=Days 104-103, March 6-7, 2012. Christmas in March. The first gift was a bike ride. If you don't ride, it may not sound like much, but dropping 5 mi./h from your usual cruising speed completely transforms the nature of a ride. Think of driving your car on a flat road at 60 mi./h, then slowing to 45. The wind-generated noise quiets; the whine of the tires drops two octaves; the fuel economy gauge shoots to the top; the steering wheel relaxes in your hands; and the engine props its feet up on the dash board and sparks up a cigarette. Analogous things happen when you drop 20 to 25% of your speed on a bike. The forces working against you when you ride a bike increase exponentially with increasing speed, so a reduction in speed of 25% can easily translate to a reduction in power of over 50%., 183363=Days 46-45, May 3-4, 2012. Jean hasn't been reading the blog this week, so we can keep this one between us chickens, okay? I take an anti-anxiety medication called lorazepam before I ride to help control the tremors in my legs. I'm not going to say how this happened (in part because I don't know), but last Saturday before the road race in Montréal I wound up receiving a double dose of lorazepam. This is probably why I was sound asleep in the truck 15 min. before the start., 173072=Tomorrow morning at 9:20 AM, I will spend 20 min. With three people who will assign me to a classification for competition. In essence, they decide whether I will be \"fast\" or \"slow\". Either will be fine with me., 117039=Day 91, March 19, 2012. I retired from skiing yesterday. I think. There was quite an emotional scene in our mud room as Jean, Jimmy and Abby were helping me get my stuff off., 21420=Days 52 and 51, January 25 and 26, 2012. Skiing with Frankenstein., 150877=Day 69, April 10, 2012. Albuquerque High School sports update. Jimmy pitched his first complete game in a 7-3 win over West Mesa High School!, 239408=Day 16, June 4, 2012. And there's the opening bell. Schneebeck dances, circling backwards while the champ advances. There's a quick jab from the champ. Schneebeck retreats again, but the champ isn't giving him any space and – he lands a massive right hook to Schneebeck's jaw… or is it his chin? He stumbles – first left and now right. He backs hard into the turnbuckle and flops to the canvas like a dead fish. Folks, this fight is over…, 98621=Day 100, March 10, 2012. I guess I am becoming more difficult to understand. I have had two clues. First, when I speak, people are more frequently responding with a question: \"Huh?\", 307466=Today, Part Deux. I met Roger this afternoon at 3:00. He's small, but at the same time huge under the circumstances. Sort of the color of a bowl of red and green chile all stirred up with a bit of cheese mixed in., 147085=Day 71, April 8 , 2012. After a delicious Easter brunch on our back porch, I went out for my second ride on the trike. I'm still quite anxious about control of the machine, so there was \"a whole lotta shakin’ goin’ on.\" I also discovered a new problem – my throat closes up when I inhale at a fairly high level of effort. Read that one I again. Very handy as I prepare for a time trial – the \"race of truth\"… I'm hoping the issue is a neck thing that will be helped by wearing my head holder-upper thing. Stay tuned., 45035=So, London is a massive longshot. As best I can determine…   Hey, there's never been a cyclist with ALS in the Paralympic Games. There's never been a cyclist with ALS on the podium at the US National Championships or at a World Cup event. There's never been a cyclist with ALS on the US national team. All that has a [tap tap tap] 0% chance of changing in 2012 if I don't take a whack at it. Game on! … Wait – I don't have a trike!, 112801=It was like that scene in \"Caddyshack\", where the priest was shooting the round of his life, and refused to stop after a violent thunderstorm moved in and lightning bolts were crashing all around him. I couldn't have cared less about getting back to the car. We ripped down the front side, where we found the summit lift was not moving. We had surpassed our previous one-day best, but we were still 300 feet short of 40,000. While everyone else worked on a plan for how we would get home, I was focused on where I could find another 300 feet. At 3:55 PM I noticed the old lift that services a mostly beginner area was still turning…., 287874=The next day, I celebrated by taking a three hour nap. Then Maureen came over and we sat down to watch Breaking Bad at 3:30 PM. Like the subject matter of the show, the first one is free . In my case, Jimmy coaxed me into the power recliner. Then he leaned me way back and threw the chair remote across the room, trapping me until I had seen the pilot and episode one. Nothing has been the same since. So, when Maureen and I hit \"play\", I knew we would probably want to watch more than one episode. Jean joined us at some point, then Jessa . We were interrupted by a few phone calls, the arrival of the pizza dude, and a test of the emergency broadcast system. Seven hours later – 10:30 PM – we stumbled forth , looking as strung out as Jesse’s girlfriend. And we wanted more. Rehab tomorrow., 238350=Days 19 and 18, June 2-3 , 2012. Crunch time. Two weeks from today, we will be in Georgia for nationals. It is time for some high quality intervals. We took a shot at that yesterday, but ran into some problems. My shifter is definitely shot. I figured I could work around that, but then I discovered my left handlebar grip has retired. That did not help at all with my security on the bike. Paul Mohr was with me for the ride. When we finished, I was about to suggest a recovery cheeseburger when I heard Paul's breakfast reappear. Every ride is a good ride, but this one was not perfect. I also wound up with a blister on each thumb because I forgot my gloves. All-in-all, this was a day to be thankful I wasn't racing., 129071=Day 80, March 30, 2012. Good news from England. My conversion axle has been shipped and should arrive Monday or Tuesday!, 72870=Days 119-118, February 20-21, 2012. Skiing really isn't this complicated. Over the weekend, I took a couple of headers, including one full-on face plant where I smashed my goggles into my glasses and my glasses into my face and broke the glasses. At least there I had a partial excuse in somewhat difficult snow conditions and a binding set too loose. A couple of hours later I turned the most mundane activity in skiing into a multiple car pile-up. Jean and I were getting on the chairlift. Jean was carrying my poles, and I wasn't moving very fast. The chair caught me on my left knee, shoved me into Jean and knocked both of us to the deck. Jean cracked her tailbone; I bashed my ribs on all four poles; and the lift operators wanted ski patrol to come evaluate me for a head injury because of my voice. Livin’ the dream, baby… Livin’ the dream., 260926=From wikipedia : The Haunted Pillar is all that remains of a farmer's market that once stood at Fifth and Broad Streets in downtown Augusta, Georgia. The market stood from 1830 until February 7, 1878, when it was destroyed in a tornado., 106755=19:41, 23372=… This is one hell of a way to leave my family, my friends and my life, being totally dependent on my wife for everything. [She] is an angel, one of a kind. I'm truly blessed but I hate her last memories of me will be of a man who could do nothing except think and ALS is now f****ng with my thoughts,… I keep loosing my train of thought and typing with my toe takes longer but I'm glad I had that option. Brother, I stopped living after being diagnosed, my arms & hands were stolen completely 3 months later. I mean I quit doing everything even going outside as I look back that was when I should have been living it up,but no I was on my computer each moment of every day. February will be 3 years since being diagnosed, I couldn't believe it so I went to another specialist in that field again being diagnosed ALS. I waisted all my time inside except for Dr. visits every 4 months. I Pray that no one else spends their last few years of life the way I did, what a waste. I quit living life over 3 years before my death…, please, if you know or suspect anyone doing as I did intervene!, tell them about me and all the regrets I carry because now I have know choice. I hope you understand what I'm saying. God Bless you my friend, and again Thank you, Thanks for everything.\", 40356= This is a man who does not need more work. He has his hands completely a full; he has no employees; and, when you see his work you will understand it is an engineering work of art created one at a time. Mine should be ready by April., 46459=I am not a member of the US Paralympic Team. In fact, I have only met one person who is a member of the team. And only one person who works at the USOC even knows who I am. I have never competed at an international, national or local Paralympic event. Based on my physical abilities, I probably first became eligible for Paralympic competition during the month of December 2011. So how do I fit in to this, if at all?, 150345=Day 70, April 9, 2012. He's up. He's down. He's up. He's down. He's up. He's down. He's up. One of those days. I rode a short sprint workout on my way to track practice. The good news was my head holder-upper device definitely helped with the breathing issue. The bad news – I can't stop the trike. As I descended from the bridge down to Albuquerque High School, I realized I did not have the grip strength to bring my speed under control before the stop light. Fortunately, I a green arrow just before I blew through the intersection. But I was too hot in the corner, and I hit the curb on the far side and went down on the sidewalk., 274540=July 5.  After breakfast Paul installed our high-tech inner-tube/steering damper and we were ready to pre-ride the course. Jean and Paul took turns hanging out the window of our van to shoot “how-not-to-do-this” videos, or to document the manner of my death for insurance purposes. We rode the whole course once, then used the van to shuttle me to the top of the course to try to improve my technique (or deaden my senses). After several laps, I was comfortable letting the suicycle fly, unbridled, down the only steep descent on the course without curves. The rest of the descents, my terror had been reduced to manageable fear. I decided that meant I was ready to race., 107851=11:00, 273803=July 4. We woke up this morning in Mont Ste.-Anne, Quebec, Canada. After Jean finished videotaping  the activity of 300 year old statues at the Basilica, we were off like a herd of turtles for Baie-Comeau. East of Montreal, the Province of Quebec is not really all that bi-lingual. The road signs are all-French, and even the menu at McDonalds insists that chicken McNuggets are “croquettes.”, 243567=Days 15-12, June 6-9, 2012. The last hard week of training before Augusta. Monday through Friday, every day, on the trike. Equipment issues are almost resolved. The new shifter is installed and working perfectly. My left handlebar grip keeps popping loose – this is a problem I don't need. We went faster every time out until the last one, which I will come back to momentarily. Thursday and Friday we did 20 kilometers at 94% and 93% (click here for explanation), but the course was an entirely flat out-and-back., 297366=July 27-28, 2012. Just like a tree being released to gravity by a chainsaw. Slowly at first, then faster. Would my head hit the wall or the floor? Answer: both. I will wake up tomorrow with a massive pain in the neck. Tonight, however, there is a Mountain Top team party at the Calverts to celebrate the first day of the Sandia Peak race and my 52nd birthday. I will probably remain seated. Safety first., 119492=Throughout my years in track, Edwin Moses has always been my favorite hurdler. From 1976 to 1988 he was undefeated in national and international-level competition. Over 120 consecutive wins against the best in the world. He set and re-set the world record several times and won Olympic gold twice (would have been three if Jimmy Carter hadn't gotten confused about the relationship between the Olympics and politics in 1980). In the midst of the streak, Moses was asked whether, after years of domination, he even got nervous before his races. Moses responded \"every summer I feel like I am being led to the executioner 13 times.\", 172808=Friday evening, if the track has been plowed, I will race a 13.2 kilometer time trial. Regardless of my result within my competition, this can determine whether I qualify for the US National Team. There is a qualification standard expressed as a time per kilometer. If I go faster, I'm on the team; if I goes slower, I'm not on the team, but I can try again. This does not determine whether I will go to London for the 2012 Paralympic Games. The London team will be a subset of the members of the US National Team as it stands after the US National Championships in Augusta at the end of June., 252538=What's next? When we started down the road to Augusta, I wrote: \"Hey, there's never been a cyclist with ALS in the Paralympic Games. There's never been a cyclist with ALS on the podium at the US National Championships or at a World Cup event. There's never been a cyclist with ALS on the US national team. All that has a [tap tap tap] 0% chance of changing in 2012 if I don't take a whack at it.\" So, it's fair to say we had four goals going into this, and we have checked off three of them. Going to the last World Cup event in the Great White North next week is extremely unlikely to change any of that. The event was poorly conceived by being planned for a venue that can only be reached by dog sled and a ferry; consequently, the competition will be very thin. Indeed, spread across the 24 categories in para cycling, there are only 56 athletes scheduled to compete. So, why bother? Well… (a) Jean is an impossibly good sport; (b) it will almost certainly be my last chance to compete in para cycling; (c) the National Team coach is putting me in stars and stripes for this one; and (d) there are still those two spots on the team for London..., 89382=Days 111- 110, February 28-29, 2012. I retired again today, and this time I mean it. When I retired in September, I was put on a \"leave of absence\", which is something we do for people who may return to work. While no one, including me, really expected that, I drew some comfort from being \"on leave\", as if I were spending six months in Uganda researching for a novel about life in the Hamptons. One primary purpose for my leave had been to sort out some fairly complicated issues relating to structuring our family health care plan. Over the last 48 hours, several pieces fell into place, and the cord was cut at about 4:30 PM today. Beginning tomorrow, my health care will be provided by a plan called \"Medicare\", which, if I understand correctly, means I have to become a Democrat because Democrats like taxes and Medicare is funded by taxes (including the ones I have been paying monthly since the 1970s, and the monthly $550 \"Medicare premium\" I will pay going forward). But it may mean I have to become a Republican because a mob of old people threatens to bulldoze the US Capitol building every year if Congress reduces the benefits of Medicare. This angry mob calls itself \"AARP\" and they all vote Republican for reasons I do not understand. I have much to learn, and I don't even own a pair of coveralls., 117365= 2003. New Mexico's hurdlers.                                         2005. My last race., 11186=January 19: ALSA to me:, 246945=Day 10, June 11, 2012. The Vortex on the dirt. Because the rear wheel is so far back, it sits fairly light on the ground and tends to lose its grip on the earth. This is not an ideal characteristic for a mountain bike, but again we countered with an aggressive tread and low pressure, and that's enough to get it up grades well over 10%. Unless the surface is sand or loose gravel. And I found some of that. Until we reduced the tire pressure, the ride quality was comparable to shoving a jackhammer up your butt and turning it on (or so it would seem). Once we reduced the psi, however, it delivered a ride I initially found playful, but which degenerated to \"brutal\" after a few hours., 128765=Congratulations! On behalf of the U.S. Association of Blind Athletes, Disabled Sports USA, U.S. Handcycling  and U.S. Paralympics, I would like to invite you to the May 7-14, 2012 Cycling Development Camp [at the US Olympic Training Center in Colorado Springs]., 58606=Days 130-127, February 10-13, 2012. Baseball analogy day. Another Error in Medication; Another Homer in Innovation., 107646=9:21, 201067=Day 37, May 12, 2012. In only 30 seconds of The You Tube (click here) you can see (a) my badass aerodynamic/baguette delivery position, and (b) the wind that greeted us for our chilly time trial. The course was a basically flat rectangle that, on the right day, would have been very fast. This, however, was not the right day. On the downwind leg, my speed held fairly steady between 25 and 28 mi./h. On the up wind segment, however, I rarely got over 12 mi./h., 18557=Days 58-53, January 19-24, 2012. Back to compassionate use.  \"I'm sorry this [blog entry] is so long, I didn't have time to make it shorter\" (George Bernard Shaw). If you are hoping for compassionate use, the Holy Grail is the submission of an IND application to the FDA (an \"IND\" is an investigational new drug). An IND can be submitted to FDA by a physician on the behalf of one patient to many. As I said in the January 16 blog, FDA generally approves them when the manufacturer has agreed to provide the drug. So what do you do if the manufacturer of a clearly promising experimental drug says \"no\"?, 62396=Can all three of those premises be true? If you believe God is good and all-powerful, then how can you believe anything that happens is genuinely bad? Similarly, if you believe God is good and bad stuff happens, then how can you believe God is all-powerful? In philosophy, this is known as the \"Logical Problem of Evil\", which is often attributed to a Greek dude, Epicurus, who lived about 2000 years ago. On the day he died from a fatal bout with kidney stones, Epicurus wrote to a friend as follows:, 77852=Days 117-116, February 22-23, 2012. Oso High’s 2012 Adaptive Equipment Innovation of the Year. , 135274=Day 76, April 3, 2012. Metric conversion. After this weekend's racing, our team leader, Damian Calvert, sent out a communiqué to our team sponsors reporting on a truly dominant team performance by Sport Systems Mountaintop Cycling. Unfortunately, he included the following description of my time trial:, 199658=Day 38, May 11, 2012. \"Racing is 20% physical and 80% mental.\" These words came from the same coach who inspired the rhetorical question: \"is he an asshole or is he just acting like an asshole?\" I am very sure it is the latter. On Monday, Coach Torres warned us he would treat us \"like athletes\". What that meant was he would take on the drill Sargeant persona on the road. And only on the road. Off the road, he was as kind as anyone you have ever met., 53702=News flash Part Deux! Game on! We are going to USA Cycling's Para Cycling National Championships. June 20-24, 2012, in Augusta, Georgia., 209408=Days 30 and 29, May 19 and 20, 2012., 236002=Day 17, May 31, 2012. I learned three things about my recumbent trike today: (1) notwithstanding its low center of mass and apparent stability, it can be flipped; (2) once it reaches the tipping point, it completes the maneuver with the spunk of a rat trap; ergo (3) a helmet is a good idea., 67353=Day 123, February 17, 2012. We are making progress toward having a plan for this para cycling adventure. We will probably attend a World Cup race about three weeks prior to US Nationals. It would be nice if my very first race wasn't the one and only qualifying race for the Paralympic Games., 301737=July 29-30, 2012. The Sandia Peak Epic Omnium. We left home at 8 AM Bannon time (8:35 AM) for the mountain. Jean, Jimmy, Mom, Paul Mohr and John Blueher. Paul and John unloaded our road bikes at the bottom of climb from Cedar Crest to the ski area. A little bit over 7 miles and 1600 feet of climbing in just under an hour. The blood thirsty trike is my friend., 105861=38:40, 156340=As part of the celebration of the Easter season, this might be an appropriate time for a couple of additional reflections on suffering to supplement the April 4 entry., 190706=Long and short term residents at the OTC all have access to top shelf food served from a dining hall located in the resident athletes’ building. If college freshman are vulnerable to padding their bodies with a \"freshman 15\", there is probably a similar phenomenon here – the \"OTC 20\"). Everyone at the OTC is lucky to be there, and resident and visiting athletes alike behave accordingly. No rowdiness, no litter, and no alcohol. Aside from the presence of coffee, tea and Coca-Cola, the environment is a lot like in the athletes’ dormitories at BYU. In 1992, I competed at the Masters National Track and Field Championships at BYU. When we returned to our rooms from dinner one evening, a 50-something sprinter found all of his belongings in the hallway, including his cooler. The BYU secret police had removed a six pack of Coke from the cooler and placed it ominously on top to explain his eviction. I digress…, 142877=April 23, 2011, 134511=Oh dear. There has been a misunderstanding. As I prepare for my first para cycling competition, I have gone completely euro-metric. All data in para cycling is expressed in metrics. Most importantly, the qualifying standards for the US team are minutes per kilometer in a time trial. Consequently, I am no longer six-foot one, 165. Instead, I am 207.3, 72. In my dreams, I speak only French (with a heavy drunken slur). I am preparing our 2011 taxes in British pounds sterling. Before we leave for The Continent, I must have a pair of man-pris and silky-smooth legs. I consider the greatest debate in philosophy whether the glass is 0.5 full or 0.5 empty. Of particular moment for this e-mail, my Garmin now displays data in metric units., 310385=Race day. 14. 4 km. The US National Team qualifying standard for that distance is 32:50. I measure my hard rides against the standard because it is the paracycling definition of \"fast \"., 257677=I was the first trike off the line, and I went as fast as I could go.  Ryan Boyle started 30 seconds behind me and made up that gap in the first 1000 meters.  Then came Steve Peace, who tore by at 1500 meters, having already erased my one minute head start.  I knew then that Steve was riding his way to London.  Alex Mask was the final trike off the start, and I saw his tail lights about nine minutes later.  After that, I was just a man alone with my thoughts, some poetry and my smart phone.  So, with the course playing to all of my weaknesses except my voice,  I won the national championship for my class by default, but my time was not what we had hoped. The party after, however, exceeded expectations.  Ryan danced., 97924=Days 102-101, March 8-9, 2012. If I can lift it, it's light. The wheels on my trike will be light. They are also engineered to create negative drag – that means the wheels will give my trike less overall wind resistance than if it had no wheels at all. Think about that for a minute.… Good. Now do that again. And, if you are a bike nerd like me, do that one more time., 12790=January 12: ALSA to me:, 311907=The truth is I'd like to think I could still be able to do this next season. But that would be something like \"265 Days to Montreal\". If there is one thing I learned (and didn't forget) from \"166 Days to Leadville\" it is that 166 days is a long time with ALS. 265 is a number larger than 166;ergo, an even longer time. I enjoy having something specific to look forward to because my \"to do\" list is quite short. But it's more philosophically consistent with the theme of this blog and how we are living our lives to do like so: from tomorrow forward, the title of this blog will be \"1 Day to Tomorrow\", a reminder that time shouldn't be wished away. The day numbering will ascend rather than descend, because none of us know how much time we have left, and the growing number will remind us to be grateful for the delicious living we've been given because of the fact that what I got on July 28, 2010 was an ALS diagnosis and not the front bumper of a city garbage truck. Our plans for the future will come in bite-sized pieces in this manner: \"1 Day to Tomorrow (up next: The Volcano Time Trial, August 11, 2012)\"., 192147=Day 40, May 9, 2012. The Olympic Training Center in a nutshell (based only upon personal observation – no research was performed… I didn't even read the placemats)., 82489=Day 114, February 25, 2012. The World Cup Catch-22. I must be missing something., 63983=Patrick expects to have his bearing by early March and promised to give me a call so I can get to work on my trike handling while my axle is being built. Oh yeah…, 107235=37:24, 159830=Days 63 and 62, April 16-17, 2012. This is the part of \"Rocky\" where Balboa mixes breakfast drinks with raw eggs and runs through the foggy morning on the railroad tracks while punching furiously at mosquitoes. We have not yet gotten to the part where he sprints triumphantly up the steps of the Philadelphia Art Museum. What I mean by that is the trike is beginning to feel more like a bike and less like a rodeo bull. I have made a handful of turns with my speed in double-digits. When the trike leans with the camber of the road, I don't always suck every molecule of oxygen from the surrounding air and go into a head-to-toe fit of shaking. I am a long way from comfortable, but making progress every day., 116053=Days 93-92, March 17-18, 2012. The most objective measure of skiing volume or endurance is the vertical foot. Obviously, the volume/endurance equation has an important subjective component as well (for example, as the slope’s degree of pitch increases, a vertical foot is initially very easy to ski, then progressively more difficult until it reaches 90°, at which point skiing becomes very easy again…), but we work with what we have. And what we have is the watch that measures vertical feet and counts the number of lift rides., 71976=Days 122 and 121, February 18-19, 2012. For the caregivers., 102844=Over the last 10 days I have done several workouts intended to assess my 20 min. fitness. The news is all good. I repeated a power workout I had done in May 2011, 10 months ago and nearly one year after I was diagnosed. With  two 20 minute efforts, I recorded power output at 94.1% of what I did in May 2011. On the road, I have done a number of 10 km and 5 km repeats. If the times translate favorably from the recumbent Vortex to the upright trike, I should be very competitive. If, that is, I can learn to competently handle the trike., 285434=July 6-12, 2012.  , 256470=The Presentation of the London Team. During a break in competition Friday evening, the USOC announced the London Paralympic Cycling Team. Or did it? The International Paralympic Committee allocated 15 spots to the United States – seven women and eight men. On Friday night, two men who were widely expected to make the team were not called, and an announcement was made that the final two spots would be filled not later than July 15. This left the 13 athletes on stage looking around like someone had dropped a contact lens. On the plus side, everyone whose name was called absolutely earned the opportunity to represent the United States, and they will probably bring home in excess of 20 medals. Medals, we were reminded at the meeting the night before the time trial, are the central mission of the US Olympic Committee and the US Paralympic Team. Several athletes have good arguments that they have gotten a raw deal. I am not among them. Although I am the national champion, currently ranked number two in the world, and I even shaved my legs and face for that clean Olympic look (well, as Olympic as someone who moves like C3PO can look), fair is fair in my case – I simply didn't ride fast enough in the Olympic trials to make it interesting., 223020=Days 23- 21       May 27-28, 2012. So, you fly half way across the world to race your bike, and the day before your race, your fancy/expensive electronic shifters are on the fritz (making you need to say °Sh%”mano”) and your brakes  are sneaking around trying to figure out when to unexpectedly bite with their full power so as to launch you over the bars and into Romas  ancient wastewater system.  If you werent an experienced international tricycle racer, you might lost some sleep over this. However, I only stared at the ceiling from 2 am until 7 am.  You know,  because Im so experienced.  As an example only, one of the strokes of nocturnal engineering genius that survived the night involved increasing the efficiency of my rear brakes by way of a spoon and some duct tape . When push came to shove in the daylight, however, I couldn’t bring myself to have to answer an official asking °vut is zis?” so I dumped that idea. Another problem  I solved during the night was how to  make my lame­-ass T1 fingers get a decent grip on my  back up shift levers. The solution, of course, was and is honey. Smeared conservatively on the shifters. Aw yeah., 276194=Monday morning, our hotel’s chef, Guy, led us back to Montreal by way of a ferry across the St. Lawrence to his hometown, a brief visit to Guy’s house and another 6 hours back to Montreal.  Paul’s job description had been sherpa and mechanic, but he also was our chauffeur, driving every mile of the 1400 kilometers from Montreal to Baie-Comeau and back.  Every time Paul yawned, Jean would quickly close her eyes and drool a bit before Paul had a chance to look hopefully into the rear view mirror for help., 182129=\"Royal Marine sadly lost his battle against bone cancer on 4th April.\", 310601=August 4, 2012. Did I mention that the trike is dialed in? Well, it is. And, yes, I realize those sentences both ended with prepositions. I'm going to stop doing that..., 7255=On January 23, I spoke at length with ALSA’s director of communications. After about 15 min., Shakespeare I again came to mind: \"[You] speak an infinite deal of nothing\" (The Merchant of Venice). Bordering on frustration, but laboring against it becoming obvious, I asked \"does ALSA believe the manufacturer should make [the drug] available now?\" The response: \"we support compassionate use\"., 51036=Jean and I flew to San Diego on Tuesday, had dinner with Steve and his girlfriend Sara that night, and tried out the bike on Wednesday. Steve's number two bike is on a long-term loan to Don Peters, an ultra cycling legend who completed his most recent Race Across America in 2008. When he was 71. Don met us at a parking lot near Sea World. The morning got off to a rough start that I hope is explained by a change we made in my medications on Monday night. My legs shook uncontrollably. On the bike, the vibration was so great I could barely control the steering. The bike, meanwhile, has dramatically different handling characteristics than a two-wheeler. This made me nervous. Anxiety increases tremors/shaking… The result was not pretty., 86584=Days 113-112, February 26-27, 2012. \"He skis better than he walks.\", 113949=At 3:22 PM, we were on the lift on the back side of the mountain. We needed one more run on the back side, which shuts down at 3:30 PM, and then we would need one more on the front, catching the last chair before 4 PM so we could get back up the mountain to our truck. We reached the summit on the back at 3:29 PM and slipped the gate to the back side as ski patrol was pulling an orange rope across the opening to close it down. We scorched the run, then hopped back on the chair to the top so we could slide down the front side., 153776=Day 66 April 13 , 2012. Albuquerque High School sports update. Our girls’ shuttle hurdle relay took third place at the Albuquerque Relays. Not bragging, but Abby ran the fastest leg for AHS. See the race – click here (the Bulldogs are in white and green; Katie Jackson leads off, followed by Lizzie, Abby and Angelique)., 288347=July 19-20, 2012. Back home after a wild world tour. Slapped back into reality by a wheelchair fitting appointment. As you might expect, it's great and it sucks. It has lots of bells and whistles (literally… A bell, a whistle, turn signals, hazard lights, power windows and a plow attachment), and I could access the entire house without moving any furniture. On the other hand, it's a wheelchair and I'm going to need it soon., 26138=After that experience, I was glad to have our team’s weekly group ride fit into my Saturday schedule. It's been a while since I did the team ride. I was late, and/or in the wrong place, and/or targeting the wrong time for the roll-out, because, when I arrived at the usual coffee place, there was no one there wearing stretchy pants (except the guy styling hair next door). I waited a few minutes in case I was, by chance, early (no dice). I met a very nice Dr. Hal, who was about to call the police until I explained why I sounded so thoroughly wasted at 9:45 AM., 249902=Days 9-6, June 12-15, 2012. Game almost on! We leave for Georgia tomorrow morning. My training plan was designed to put me at a performance peak next week. I think it worked. I took off Monday to allow my body to stop vibrating after bashing around Angel Fire on the Vortex on Sunday. Tuesday, Wednesday and Thursday I rode with John Blueher, Capt. Brent and Paul Mohr. On two different courses, we put down our best times with scores of 93%-98%. We erased some equipment issues, improved my position on the bike, tuned up the head holder-upper, twisted my knob (the one that tightens my helmet – you should be ashamed of yourself) that, and trimmed my toenails. Time to get serious. Click here., 240658=Day 16, June 5, 2012. This is the first blog entry I have written entirely with my eyes. My new dynavox computer types by following the movement of my eyes across a wide variety of keyboards. After I complete the typing , I can push a button and a silky smooth voice of my choice will speak out loud what I have written. Although it can be as slow as one character at a time, it has automatic completion capability and it can actually predict the next word based upon the context., 38648=Days 43-41 February 3-5, 2012. \"Dude, are you okay?\" Another head injury, complete with blood, EMTs, a doctor with a pink sweater, and a US customs officer. I will have to come back to this because things must stay in the correct order., 309257=I wasn't exactly finished recovering, so I worked on that in the first five kilometers. By then we were within striking distance of the first run and I felt strong. My new cassette has a bigger big gear than the old one, and I used it more than half the return. 30:56,which is an average speed of 28. 0 km per hour - the fastest time trial pace for anyone in my class anywhere in the world this year. Oh yeah., 100413=Days 99-98, March 11-12, 2012. Boys (+1) ski weekend. We had Paul Mohr, Brian Nichols, Mike Hart, Michael Hart, Gus Pedrotti, Jimmy and Julie Koob (a.k.a. Gorgeous Pie, a.k.a. Sweet Pretty Baby, a.k.a. Cupcake, etc.)., 129478= Day 79, March 31, 2012. Another new event for Abby – the 100 m hurdles. Four -stepping all the way. Very smooth., 44072=Why did I pick this 2011 Jamis Xenith Team bike? It has electronic/very light touch shifters. Fully-equipped, it will weigh a respectable 15 pounds. It has no wheels. The likelihood of finding a used bike with wheels that would be ideal for Paralympic competition is very low. There was nothing to gain by purchasing a bike with wheels I wouldn't use, so finding one being offered without wheels was my preference. This bike has a long steer tube which will allow me to mount the bars higher to take some of the load off my fettuccine-like arms. The price was insane unless the original owner was a bike shop employee who paid a deeply-discounted price for the bike last year. This also makes it highly likely the bike received very good maintenance., 183760= Day 44, May 5, 2012. Albuquerque High School Sports Update. Abby took third in both the 100 hurdles and the 300 hurdles at the District 5-5A meet today. One personal best and one almost. In the two events, the Bulldog hurdlers went 3-4 and 2-3-4. AHS won the meet by 3 million points. What a fabulous freshman season for Abby!, 312617=August 5,2012. Augusta is, obviously enough, well into the rearview mirror. Traditionally, I should long ago have decided what's next. I've been stalling, in part because there remains the tiniest sliver of possibility that I might wind up in London. If that were to happen, my \"Road to London\"would be more of a \"Dark Alley to London\". While I wouldn't turn it down, for present purposes, I'm just going to go ahead and ignore that for now., 114239=Early Sunday, we woke up, Jean cooked for us, helped me get ready and dumped us at the end of the road at 7:40 AM. We skied nonstop almost all day. Jean and Abby joined us now and then, but separated from us when they stopped to do silly things such as rest., 206232=On February 7, I wrote: \" So, London is a massive longshot as best I can determine… Hey, there's never been a cyclist with ALS in the Paralympic Games. There's never been a cyclist with ALS on the podium at the US National Championships or at a World Cup event. There's never been a cyclist with ALS on the US national team. All that has a [tap tap tap] 0% chance of changing in 2012 if I don't take a whack at it. Game on! \", 152089=Day 67, April 12, 2012. No more asterisks. John Blueher and I went to the bike path on the Rio Grande today. The few turns and short climbs were slow, my legs shook a lot, and hanging on to the bike is a challenge, but my overall time for a 20 km time trial was fast enough to meet the qualification standard for some level of the US Paralympic team regardless of whether I am classified as a T-1 or a T-2. I am only going to say this once because it sounds kind of whiny, but I am going to say it – safety was not the primary consideration when UCI decided to put the most disabled people in para cycling on the most dangerous bicycle-like machine ever invented. I'm just sayin’…, 128010=Day 81, March 29, 2012. Down again. This time I was at Abby’s track meet. I knew it was a bad idea to write, as I did two days ago, that all my falls had been backward. This time I was standing on an asphalt apron beside the track, leaning against a cinderblock wall talking with Jean, who was on the other side of the wall. One foot slipped on some gravel, and down I went., 294911=July 21-25, 2012. Race day. No, I haven't given up on trying to make this thing go fast. Today's festivities: a 14.4 km time trial. Today's result: a mechanical breakdown. As my upper body strength continues to decline, I have found it helpful to have the assistance of a device to help keep my trike going in a straight line. Such a device is known as a steering damper. Most roads are not flat. They are designed and built to facilitate drainage. Typically, there is a high point, or \"crown\" right down the middle of the pavement, which causes water to drain to each side of the road. The slant of the pavement is called \"camber\"., 224409=Days 20-19, May 29-30, 2012. The  day after our visit to the Vatican, I slept all day (really) while Jean and Maureen went shopping. That is, if they brought a present home for you. If not, then they were far too busy packing the bike to have time to get any shopping done. Either way, I slept all day., 131460=Day 78, April 1, 2012. The Adoption Exchange Classic. A 15 km time trial. In my most optimistic moments, I had imagined doing this on the new UCI-compliant trike. Realistically, however, I knew that was unlikely. So it was me and the Vortex. For the visual effect, I decided to wear the sperm hat., 140685=Day 75, April 4, 2012. On the topic of suffering. I have written previously of the Buddhist teaching that suffering comes from resisting what is. I heard that originally from our friend Anne Thomas . It's not that I don't trust her, but it's Holy Week, so I thought I should do some more reading on the topic., 234723=Day 18, May 31, 2012. Rome in pictures., 302911=July 31, 2012. It would be ideal if this had happened before Augusta, but the trike is dialed in. The Abby grip devices are properly set for both hands; the Paul Mohr steering damper is balanced and optimally tight; and the Chris Dineen head holder-upper is keeping air moving through my windpipe and keeping me from chewing on my handlebars. Finally, we swapped the cassette for a different one with a better range of gears. All of this is making me more comfortable and faster on the trike. Today, Michael Donovan and Damian Calvert rode behind me telling jokes while I hammered out a 20 km effort 15% faster than I rode in Augusta at the Olympic trials.… Oh, the tea and crumpets., 131786=Day 77, April 2, 2012. Trykit Conversions delivers! Maureen Bannon, Paul Mohr and Jimmy Schneebeck assemble! Now we only need the wheels built!, 51957=I sat down with Jean and the kids to run it by them. The ultimate goal, I explained, would be to make it to the 2012 Paralympic Games in London in September. Everyone gave me at the \"go\" sign. Step one – find a bike to test ride., 73224=Before I had ALS, I was a life time 30% free-throw shooter. That sucked. As a person with ALS, I am surrounded by things that suck. Now, with a GEIGERRIG pack I can Never Suck Again™. That doesn't suck – that's awesome. And that's why the GEIGERRIG pack is Oso High’s 2012 Adaptive Equipment Innovation of the Year., 117896=1982 with my friend John Bowser (at practice).                               1981. More white guys., 306024=August 1, 2012. \"Balance is an ability to maintain the line of gravity (vertical line from centre of gravity) of a body within the base of support with minimal postural sway. An increase in sway is not necessarily an indicator of poorer balance so much as it is an indicator of decreased neuromuscular control.\", 174045=Days59 -54, April 20-25, 2012. Over the past 48 hours, Montréal has had rain, ice and snow. What could that mean? Obviously… it's business time., 124539=Days 84 and 83 , March 26-27, 2012. The Fear of Falling. Before last night, my most recent fall had been Super Bowl Sunday (in line at U.S. Customs in Phoenix – a very private moment)., 287040=July 13-18, 2012. Peoria, Illinois. A bathroom scale greeted me on the front porch as I entered Lynn Bannon’s Fat Camp for the week. We enjoyed seven days of visits with family. And food. Lots of it – all intended to put more meat back on my frame., 54320=Days 39-131…, February 7-9, 2012. News flash! The Oso High Lobo Classic is off. The Man is holding us down, by which I mean the Lobo Cycling Club’s very well-conceived road use application was denied. The club has promised to produce its September 2012 mountain bike race as a benefit for the ALS Association. While cancellation of the road race is a heinous development, the mountain bike race plan is awesome., 125860=Day 82, March 28, 2012. Didn't I say ski season was over? Paul Mohr called to invite me on a skinning expedition up Sandia Peak. What this means is you put on downhill skiing gear that is modified to allow your heel to be locked down or free to move. Then you attach a piece of material down the full-length of your skis that looks a bit like the stiff side of Velcro with all of the pieces facing backward. These \"skins\" provide enough traction to allow you to walk straight up a snowy mountain. Of course, it makes no sense to do this if your mountain (a) has lifts that (b) work., 107441=40:02, 150690=Patrick Grange played soccer for the University of New Mexico. Since then, he has been \"Coach Pat\" to kids throughout the area. His first ALS symptoms appeared in the summer of 2010, about the same time as I was diagnosed. Pat was diagnosed in November 2011, and passed away today. He was 29. ALS sucks., 77429=For nearly 2 years, I have been struggling with hydration technology. The standard solution for a cyclist is the basic bike water bottle. By 2010, the progression of my ALS had made it difficult to squeeze the hard plastic of a bottle. In fact, I simply couldn't do it with my left hand. Not long after that, I needed two hands to pull a bottle from its cage. I was still racing both mountain and road bikes at that time, so that was the end of the line for bottles for me (I had plenty of other problems trying to knock me off bikes by then, and \"look Ma, no hands\" didn't need to be added to the list)., 89998=Day 109, March 1, 2012. When I wrote the February 18 entry, \"For the Caregivers\", I knew there was a risk in attempting to name all of them. Today it dawned on me I forgot to include Norbert Neumann in that list. In addition to being a very cool cat who raced bikes back when the stretchy pants were wool, Norbert comes to visit occasionally and has enabled me to have one thing that's easier than it was before ALS (unless you count never having to wear a tie). Click here., 146496=Day 72, April 7, 2012. Albuquerque High School sports update. The struggling Bulldog baseball team put together a complete game today, taking down Highland High School 5-4 in extra innings. Jimmy drove in two runs to send the game into the eighth and decisive inning., 315923=Read about the journey to USA Cycling's 2012 Para Cycling National Championships here! , 122880=Day 85, March 25, 2012. So my new favorite hurdler has one race under her belt. It was a nearly perfect first effort. The high school 300 m hurdles consists of eight hurdles, each 35 m apart. Abby got out well from the gun. She felt what it's like to lead a race – the chaos of the competition disappears, and it's just you and your lane. She held the first position until between the third and fourth barriers. Then she got a taste of the training demands of the race, as she faded to second in her heat and sixth overall. Most importantly, she had a big smile on her face while she wheezed at the finish line., 103819=Days 97-95, March 13 -15, 2012. Game on. The planning for our para cycling adventure falls into four categories: (1) training, (2) racing, (3) equipment and (4) logistics (in truth, there is a fifth category, \"Kissing up to Jean\", which I need to attend to since Jean has so far said only \"okay\" in response to every proposal I have made about racing this year)., 197611=Day 39, May 10, 2012. Down (again). Up again., 270188=July 3. Today we are flying to Montreal with our mechanic/Sherpa, Paul Mohr. Today is also the 22nd anniversary of the day Jean, against her better judgment, the advice of her friends, (and, as I learned later, also against the advice of my friends and my mother) contrary to the counsel of her priest, her therapist, her hairstylist, and attorneys and the specific instructions of her parents, said “I do.” We will celebrate somewhere in Canada. Somehow, this airplane doesn’t seem like the place., 270571=With the help of Dan, one of the team mechanics, we were up well into the night trying to get the balance right. After many adjustments and test ride from a ballroom into a large foyer, we put the trike away for the night. We apparently worked right through the Baie-Comeau 4th of July fireworks show., 145457=Day 73, April 6, 2012. John Blueher came over this morning with some tools and his bike for a 9 AM ride. Off like a herd of turtles at noon. The maiden voyage was challenging, but not for the reason I had expected. The unnatural lean of the trike with every elevation change on the road was not as creepy as I had expected. Cornering was likewise. Nonetheless, my general anxiety triggered a higher-than-normal activity of my reflexes. My legs shook the entire bike to the point it was difficult to maintain a grip on the bars. The whole experience was a white knuckle affair for the first hour. By the time we arrived at the Balloon Fiesta Park, however, I was beginning to calm. We rode three laps of the Park. Not as fast as on the Vortex, but very close. A very successful effort. Climb aboard the You Tube for one lap. Click here., 182486=Days 48-47, May 1-2, 2012. A Fair Fight., 12971=January 12: me to ALSA:, 303337=Next came the process of getting up from the floor. As far as I can tell, I can’t do this by myself. It's actually not that easy even with help. Jimmy's bench, dead lift and squat total over 1200 pounds. Jean has guns like a rock climber. The two of them would have had an easier time hoisting a trash bag filled with 160 pounds of Jell-O. Maybe next time I should take a chance on the Schwinn., 27280=Day 49, January 28, 2012. Dude are you okay? Yes, it happened again, but this time there was no blood. On Thursday, I went about 30 miles with Damian Calvert. I need to pause to define \"with\". See, Damian is a genuine cycling badass. I think Damian has won the New Mexico Off-Road Series Pro category 10 times. As a roadie, Damian is a Cat 2 racer, which means he is only one level below this guy. Click here., 296916=July 25 - 26, 2012. I think the fun part of ALS may be almost over. It's all relative, of course, but the ride to today has been really good. We have been surrounded by friends and family as we slogged through the diagnostic process and the disorienting aftermath. We have enjoyed experiences that would never have come our way but for ALS. With varying measures of adaptation I have been able to do just about everything. But the buffers are shrinking, and we are running out of creative ways to keep it real., 269633=June 29-July 2, 2012. The Second Annual Oso High Mountain Bike Race “Do you have Oso High under control?”  Jean must have asked me this question a dozen times leading up to the race. It’s not like we had anything else going on (Montreal, Colorado Springs, Rome and Augusta in the last 8 weeks). “Hell, yes.” The answer was always “Hell, yes.” In truth, while I did have many things under control, my HR department was on vacation. Many people had offered to help, but I hadn’t gotten around to accepting any of their offers.  For almost two years we have lived in a safety net woven of family and friends. They came to the rescue again., 187343=Days 43-41,  May 6-8, 2012.  The United States Olympic Training Center at Colorado Springs, Colorado.  We were invited, but somehow we feel a bit like the White House party crashers. After we toured the University of Colorado, Colorado Springs with Jimmy in a driving rainstorm, we checked in at the OTC. We were issued top secret identification passes that open every door in the place. Then we moved into our small apartment for the week. There are many cool things here, not the least of which is the cruise ship-like availability of food., 9449=January 19: me to ALSA:, 175434=In February 2011, I opened this blog with the words “Yipee/Oh Sh*#”, in reference to the conflicting emotional reaction racers have when they find out they have been accepted to ride the Leadville 100. Thursday we had another “Yipee/Oh Sh*#” moment when the UCI classification panel invited us back into the exam room to tell us “T1 – that’s what we call you.” (The competitive demands of the T1 class are quite low, but that makes sense because the T1 are the most disabled people in all of paracycling. That we find me in a class in which I can credibly compete is, as Jean was quick to point out, yet another freaking silver lining.), 46010=The bare minimum for a US athlete to be eligible for the 2012 Paralympic Games is to participate in the USA Cycling National Para Cycling Championships and a World Cup event. At one or both of those events, the athlete would have to ride a time trial at an average speed greater than the standard for that athlete’s classification. For me, assuming I am classified as a trike competitor, this means 18 mi./h or 20 mi./h for a 9 to 12 mile course, depending upon whether I am classified as a T-1 or as a T-2, another classification distinction based upon physical ability., 63353=Days 126-124, February 14-16, 2012. It's 4 AM, you're not responsible for the grocery shopping, no one will care if you spend your whole day in your boxers, and you can't sleep. What do you think about while you stare at the ceiling? I tried to stay focused on unraveling the mystery of why the Washington Redskins have sucked so thoroughly for the last two decades, but I was continually distracted by: whether anything genuinely bad ever happens; whether Santa Claus and God are the same dude; and identifying worthwhile prayer. Here's where I came out by the time I swung my legs off the side of the bed., 285359=Race day.  The trikes started their time trials at 1:30 in the afternoon. I was third off the line, right after Steve Peace., 204938=Days 36-32, May 13-17, 2012. In the first 24 hours after we left the Olympic Training Center I think I slept 30 hours. In only four days at the OTC, I was on the trike 14 hours. A 14 hour training week is a fairly big week at any level of amateur cycling, and more than double what I have been doing lately. I took Saturday and Sunday off while we celebrated Jessa's 32nd birthday and Mother's Day. We wrapped up a great visit with my dad. On Monday we thought about our new friend Terry traveling home from the OTC with a broken leg. On Thursday, Terry, a hand biker, overcooked a turn and jacked up his tibia when he slammed head-on into a curb. Even so, he maintained a sense of humor even after hours in the emergency room., 31672=Days 45-44, February 1-2, 2012. The highlight of our visit to Cabo San Lucas has been our whale-watching trip. We went out on a 400 horse power, 14 passenger inflatable life raft. Any whale in the Pacific Ocean was within reach. The ride was far from luxurious – indeed, it was wild, wet and fast, but over half the people who set out on this journey with us returned to port., 107748=9:34, 143779=Day 74, April 5, 2012. Trike delivery day. The day began and ended with good news. My work out was on an indoor bike at the health club. Nothing fancy – the kind of exercise bike found in hotel fitness rooms. It has a power meter which reads in watts. Roadie power nerds are now rolling their eyes. True, this device is not as accurate as the $2500 SRM units roadies put on their bikes, but (a) they are consistent, and (b) I still have my $2500 (well, not really, as I have a trike conversion axle). So, using the same health club bike as I did a year ago, I repeated my previous work out with six intervals of 5 min. with a five-minute rest between each.}",
    "TableContextTimeStampAfterTable": "{33292=Days 70-69, January 7-8 , 2012., 36543=Day 71, January 6, 2012. Today I took my longest ride on the Vortex; and it was also my first ride with any significant climbing. I remember when I was thinking about buying my newest mountain bike. I read a review of the bike that described it \"climbing like a spider\". That turned out to be a very reasonable description of the performance of the Superfly. If I were to write a review of The Vortex, I would say it \"climbs like a Rocky Mountain bighorn sheep; specifically, the one that had its brains blown out by my neighbor, Kurt; by which I mean it climbs like a dead thing.\", 55903=Days 93-91, December 15-17, 2011. Fear this… 2011-2012 will be my 42nd ski season. I moved to New Mexico primarily for easy access to the best and most underutilized skiing in the Rocky Mountains. In the 1991 season, I skied 71 days. 70 days is generally accepted as the breakpoint between a \"skier\" and a \"ski bum\". But I had a job. Over the years our family has had our cabin in Angel Fire, we have skied a minimum of 30 days per season. I taught skiing to people with disabilities in 20 different seasons, ending in 2009. I like deep snow and steep mountains, but I've never done anything approaching \"extreme\", and I don't like leaving the ground when I ski. That said, it has been over 30 years since I looked down a mountain with fear. Yesterday, I found myself half way down a run at Angel Fire with snow all over me and quaking knees, unable to move., 52817=Days 90-76, December 18, 2011-January 1, 2012. Merry Christmas! Happy Hanukkah! Happy New Year!, 59637=Days 95 and 94, December 13-14, 2011. More misfortune as a consumer. After a bike workout today, I wanted nothing more than a diet coke, but I was driving home from a gym on the north side of town. Going into a convenience store and pouring a fountain drink has become more trouble than it's worth. A drive through has become the only tenable option when I am traveling solo., 43459=Days 75-73, January 2-4, 2012. The BVI are the kindergarten of Caribbean sailing. The waters are shallow and relatively calm. Navigation is, with one exception, by sight . The winter weather and sailing conditions are dominated by the 15 knot northeasterly trade winds that produce easy but fun sailing. We had those conditions only two of the 10 days we spent on the boat. The remainder of the trip we were treated to a delightfully rolling sea and 20 to 35 kn breezes., 23307=I confess this blog has been long on philosophy and short on mountain bike wrecks lately, but please bear with me one more day. One of my earliest recollections of forging into serious philosophical issues dates back to June 1978. We had just graduated from high school, and my middle school gym teacher had the bad judgment to loan me his single wide in Rehoboth Beach Delaware for a week of celebration with some of my friends. The beer drinking age was 18, and I had my first beer., 29973=My moment arrived in October 1977. Our star quarterback, Brent Boerger, was out for the week. The second team quarterback, Steve Hundley, went down on the first play from scrimmage. My first play was a simple option: if the defensive end keyed on me, I would hand the ball to our fullback, Jon Monk; if the defender drifted to play an outside run, I would fake to Jon and then pitch or keep the ball depending on where the defensive end played after the fake handoff. The ball was snapped to me, the defensive end crashed down toward me, so I handed the ball to Jon. What happened after that is in dispute. According to the Fairfax Journal, the stadium announcer, my coach who hit me upside the head with his clipboard, my girlfriend and my mom: \"Chantilly quarterback Doug Schneebeck fumbled on the second play from scrimmage.\" From my point of view, it was more complicated than that., 61295=Day 96, December 12, 2011. Have you ever been to Hispania? Neither have I. In fact, I don't think there is such a place, except in the estimation of our grocery store. When a grocery store or restaurant offers \"Greek food\" or \"Italian food\", they are not announcing a limitation on the national origin of who they will serve; rather they are making a statement as to the geographic origin of the type of food. Thus, McDonald's serves \"American food\", not \"Caucasian food\"(or, as applied to people from my part of Virginia, \"cracker food\"). Apparently operating from the assumption there is something politically incorrect or offensive about using the word \"Mexican\", our grocery store’s aisle 13 is where you will find \"Hispanic food\". This probably has something to do with the fact the grocery chain, \"Smith’s\" has done quite well since they got their start in Salt Lake City selling \"Mormon food\"., 54168=The boat: \"Obejoyful\", a 2006 Leopard 43 Catamaran, built by Robertson-Caine., 39134=Day 72, January 5, 2012. Walk the plank. In the BVI, that was more difficult than it sounds., 79886=Day 107, December 1, 2011. Here at Oso High Endurance Sports, we are committed to bringing our message to you utilizing the latest in technology, even if everyone else has been using the latest in technology for the last two years. You can receive notice of updates and new blogs by following us at Facebook or Twitter by clicking on your choice., 37719=The route I selected was a counterclockwise trip around Albuquerque with a detour up to the trailhead for the La Luz trail that runs from Albuquerque's high foothills to the crest of the Sandias. From home to the parking lot at La Luz was only about 16 miles, but it took over an hour and a half on account of the 2000 feet of climbing. I fumbled with a bottle of Ensure for about 5 min. to get it out of my gear bag, but I ultimately won. So I kicked back in my portable recliner and sipped on strawberry delight while I enjoyed the view of the city and celebrated my mastery of the universe (except for the part of the universe you can only access with hands)., 23161=Days 68 -67, January 9-10, 2012. Today's topic: Managing Existential Guilt., 69054=Days 102-100, December 6-8, 2011. \"Isn't that what Stephen Hawking has?\" [Translated: \"what's the big deal? He's been around longer than a black hole.\" ] This is one of the most common modern misconceptions about ALS. From the man himself – in an interview with Hawking earlier this year:, 12181=Day 62, January 15, 2012. Content Advisory: today's topic is bladder control, and it won't be pretty, so if you are of normal sensitivity, please turn back to the discussion of existential guilt. We will see you tomorrow, when I anticipate writing about butterflies., 73965=Days 106-103, December 2-5, 2011. Things have been a bit unusual here for a few days. The wind blew 40-70 miles per hour all day on Thursday, which knocked out our phone and Internet until Saturday. We had a bit of snow Friday through Sunday and even more overnight. Today, Albuquerque schools are closed because the roads are so treacherous:, 35489=Following the analytic criteria first set forth by Freud in The Interpretation of Dreams (Die Traumdeutung, 1899 [1900]), it is clear that the aliens, monsters, jet packs, definitely the swords, and especially Charlottesville Virginia all represent penises. But I think there is a more subtle meaning behind this dream. If you believe it can hurt you, it can; if you believe it can't hurt you, it can't., 6084=Days 61-60, January 16-17, 2012. Cutting edge treatments or \"Compassionate use\"., 17292=Days 66-63, January 11-14, 2012. You know how great it feels when you have a problem and you go into the garage and find exactly what you need to fix it? You know, like when there is a leaking breast implant and you find a tube of silicone you had completely forgotten about. Well, that happened to us this week. As my arms and shoulders have grown weaker, my shoulders do not have the muscle support necessary to keep my humeruses (I think that is the plural of \"humerus\", the upper arm bone, but it may be \"humeri\" or \"my arms\"). This is not a big deal when I am sitting down, or even when I am on the bike, because I have external support in the form of arm rests, handlebars etc. However, if I am walking around for a while, the weight of my arms causes a partial dislocation of my shoulder joint, also known as a \"subluxation\". Left untreated, I might one day look like this:, 66868=Days 99-97, December 9-11, 2011. Well, now that's more like it. Thursday, Friday and Sunday I had rides on the Vortex of 29, 50 and 45 miles, respectively. No flats or other unhappy events. Most of those miles were ticked off on a 12 mile ribbon of asphalt, uninterrupted by street crossings or traffic, that is part of Albuquerque's \"Bosque bike path\". The path lies between an irrigation canal and the Rio Grande, skirting the edge of a Cottonwood forest named after Aldo Leopold. There are views of the river to the west, and the Sandia and Manzano Mountains to the east. Access to the path is less than 2 miles from my office, and about 6 miles from our home. I have ridden literally thousands of miles on that section of the path. Aside from the miles I have ridden with Jean on the tandem, the time I have spent on the path lounging in the comfort of the Vortex has been my favorite of all those hours., 5517=Day 59, January 18, 2012. I just spent a half hour trying to plug a flash drive into a USB port on my computer. I am sweating and exhausted. Breathe in. Breathe out. Move on. And remember what you did earlier today. Check it out on The You Tube. Click here. And, no, my knees are not mounted sideways as they appear in this video. That optical effect is a product of the fisheye lens. More on compassionate use tomorrow.}",
    "lastModified": "Wed, 22 Jul 2015 20:02:19 GMT",
    "textBeforeTable": "   Days 61 and 60, April 18 and 19, 2012. Here's a depressing exercise. Make a list of all the physical \"impairments\" you might have 40 years from now as compared with your current condition. Then imagine a neurologist, younger than some of your shoes telling you everything on the list would happen in about two years.  In preparation for my first para cycling competition, I had to put together a list for UCI of my impairments, how they affect me on the bike, and what adaptations I have made to work around the problems. The list looks like so: Game on! Now, where's my walker…? Saturday morning there will be a short road race on the same Formula 1 race track as we will use for the time trial. Friday evening, if the track has been plowed, I will race a 13.2 kilometer time trial. Regardless of my result within my competition, this can determine whether I qualify for the US National Team. There is a qualification standard expressed as a time per kilometer. If I go faster, I'm on the team; if I goes slower, I'm not on the team, but I can try again. This does not determine whether I will go to London for the 2012 Paralympic Games. The London team will be a subset of the members of the US National Team as it stands after the US National Championships in Augusta at the end of June. Tomorrow morning at 9:20 AM, I will spend 20",
    "textAfterTable": "If I had created such a chart 2 1/2 years ago, it would have looked like this.  1. ..... Some days I feel like Kevin Bacon in \"She's Having a Baby\"when, spooked by the pace of changes in his young married life, he envisioned himself strapped to a rocket sled full of explosives scorching its way toward a concrete wall. When that happens, I try to remind myself how lucky we are. Patrick Grange went from first symptom to gone in a bit over a year and a half. My first symptom was nearly 4 years ago. I spent three hours yesterday sipping Diet Coke and watching Jimmy play baseball. Today, my rocket sled has a shiny set of Zipp wheels on it, and I'm going to be focused on final preparation for my first-ever international bike race. And, as if that weren't enough, I am surrounded by family and friends, the Social Security Administration sends me a check every month, and I can wear boxer shorts all day, every day. Jean is in Illinois this week visiting her mom and the Marys, so mom has been my coach, chief mechanic and chauffeur, shuttling me to training locations, making last-minute bike adjustments and keeping my weight up with cinnamon rolls and ice cream. Today, we are headed to the balloon fiesta park to test out the Zipps. Oh yeah. Days 63 and 62, April 16-17, 2012. This is the part of \"Rocky\" where Balboa mixes breakfast drinks with raw",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}