{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Considering this school is so cheap, it is a great first school to attend. It provides great education at a low price and I think that is why so many people love it here.",
            "There are many activities and clubs at EAC that make your college experience fun. This schools makes it very easy for you to have a fun college experience, there are many sports activities, bonfires, and clubs that help make your experience exciting.",
            "There is not a very wide selection of food and dining at EAC, but that doesn't mean that this isn't something that can't be fixed.",
            "I have not experienced dorm life at EAC, but from what I have heard it is very fun and exciting, and definitely not very expensive.",
            "The academic rigor at EAC is pretty fair. It is not too difficult to do what you need to do, the assignments and tests are fairly easy. Overall it is not very challenging to succeed at Eastern Arizona College.",
            "Make sure you have everything you need for classes ahead of time because most things are fast pace. Also, make sure you keep up on homework and class assignments, because it is never fun to be behind in college.",
            "Eastern Arizona College is cheap, affordable, and friendly. This college has a great environment for new college students, and is very easy to find your way around. This college makes it fun to learn, and is overall a fantastic school."
        ]
    ],
    "pageTitle": "Eastern Arizona College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Eastern-Arizona-College/reviews?_escaped_fragment_=/show/42601",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898034303,
    "recordOffset": 897995357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13522=You'll love the outdoors and spectacular scenery as we're right in the tall pine covered hills of Northern Arizona. Hiking is a popular pastime. We have two rodeos each year. The rodeo in May is the longest running continuous rodeo in the United States. There's a multi-plex movie theater and quite a few restaurants and of course the casino. We're a couple hours from the skiing in Flagstaff or the adventure of the Grand Canyon or the breath-taking scenery of Sedona. And, we're just 90 minutes away from the city of Phoenix for any theater events or major shopping for you city slickers., 133430=Tuition is under 1000, if you are into music get a music scholarship. Tuition equals paid., 109987=Tuition is super cheap- (less than $1000 per semester). Most students can get scholarships and student aid and not pay a buck to go here. I pocketed a good amount of money just from choosing to go here., 143976=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/23/2009 Reviewer is A past student here. 6 out of 8 people found this review useful. 1 of 35 Ryan from albuquerque, NM Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Overall, it is a wonderful school! If you are nervous about jumping in to a huge university, EAC is a worthwhile alternative. It has smaller class sizes with helpful teachers, students, and staff. Tips for prospective students If you get involved with the activities happening around campus, you will meet so many people who are similar to you. I guarantee that you will make lasting friendships! The people there are awesome! Bang for the buck There are so many scholarships available to students who take the time to look. The staff is very supportive and helpful and there are plenty of resources around campus that can help steer you in the right direction. Did enjoy being here It's a beautiful small town with strong unity among the community. It is a very positive environment with a variety of people from different cultures, backgrounds, and lifestyles. If you live there, you are like family. Did learn a lot It's a junior college, but you are still expected to work hard and learn the material. You definitely get out what you put in.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}