{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Expensive food, but it is good.",
            "No dorm",
            "The courses are alright",
            "You are on your own, so if you want to do well, you have to work on it.",
            "I give it a B. Good teachers, Cheap tuition , bad parking."
        ]
    ],
    "pageTitle": "Anoka-Ramsey Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Anoka-Ramsey-Community-College/reviews?_escaped_fragment_=/show/87177",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906616071,
    "recordOffset": 906585458,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20234=Many of the classes are relatively easy because most of the classes offered at Anoka-Ramsey are general education requirements. The 2000 level and higher are much, much harder however., 102245=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/05/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 1 out of 1 people found this review useful. 1 of 26 Antonia from NEW BRIGHTON, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Comments Great for these types of students Students who want to finish their generals without paying too much for tuition. This college is for students who are looking to stay at home, because it is so close. Tips for prospective students I would say go to this to do your generals, so that you do not waste your money at an expensive school. And then just transfer to the college you want to graduate from after your general credis are done. Bang for the buck Anoka Ramsey Communtiy College is one of the cheapest colleges in Minnesota.A semester can cost two thousand dollars for 14 credits. Am enjoying being here Since, this college offers PSEO to high school students, there are a lot of juniors and seniors that attend, which I think takes away from the college experience. Am learning a lot The classes that are given at Anoka Ramsey Community College are as top notch as any university. There is also a lot to do, like the multi-cultural club and psychology club. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}