{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very small. And the campus is very safe. And the campus safety officer Marco is the best!!",
            "There's not a Greek Life at this school.",
            "Fashion Majors, Lacrosse and Basketball Players, and Biology/Nursing/Pre-Physical Therapy Majors.",
            "The best thing to do for fun is to get off campus! Go explore the city of Washington D.C. via the Metro. The Metro is the best way to travel around the city. D.C. and the surrounding cities are full of amazing restaurants, clubs, stores, theaters, museums and anything else you could possibly ever want!",
            "The food is really good! There are plenty of options of things to eat for every meal. Plus the staff in the dinning hall are amazing and so funny!",
            "My experience of living in Rowley, the all girls dorm, was far from good. All year the building was under construction. The construction started at 6am and lasted until 5pm. During the summer, it is terribly hot. And the small amount of washer and dryers does not cater to the hundreds of students who need to use them.",
            "The classes are not terribly difficult but they keep you busy. Some words of wisdom, its easier to keep up then it is to catch up!",
            "Get active from the beginning! By becoming active, you meet other students and upperclassmen. Don't be afraid to step out of your comfort zone. If you want to try something new and different, go for it! The older students are very accepting, nice, and helpful!",
            "A small but great community of students and teachers. The amazing location near Washington D.C is full of various opportunities. By the end of the year you will know everyone!"
        ]
    ],
    "pageTitle": "Marymount University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Marymount-University/reviews?_escaped_fragment_=/show/3851",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896824499,
    "recordOffset": 896776715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4332=At Marymount University, you will learn a lot, not only the needed necessities for your intended majors, but just all around information that is vitally important. Right now i am a freshman in the 2009/ 2010 school year, and I am a Fashion Design major, minoring in business. My drawing and technical skills, before starting my drawing classes were horrible and at the end of the first semester i was able to draw wonderful still life's, and my portrait with my face on it, which is really difficult if you ask anyone else. Marymount is also known for Fashion, so its a wonderful school to attend if that is where your heart lies. We also have a really big Medical program, which is important because the campus population is really small, but you will learn above and beyond your expectations, because i surely did., 156203=Excellent! I take most of my classes at night, and I don't feel uncomfortable while waiting for the shuttle at 10:00 pm at all. The campus is well lit and there are security personnels roaming always., 180714=I find that there is a large variety of food choices. Due to the large international student population, it is great to try different cuisines. The only issue that I have as a student athlete is that I usually have daily practice during dinner hours. When I get out of practice at 7:30 - 8:00 pm, the cafe is closed., 206596=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/11/2009 Reviewer is A current student here. 21 out of 21 people found this review useful. 1 of 44 Tynisha from Lorton, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. Marymount University Reviews Marymount University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Dont waste your time! Maybe the education is decent but the life is horrible! Bang for the buck Extremely horribly run school! Don't waste your time coming and visiting! It is totally over rated! If there are any good reviews on this school its probably butt kissing students that were aimed by faculty to write good reviews! Will enjoy being here Ever been sold a horse and given a mule! The dorms at the school are horrible and very old! The meal plans are horrible! They have commuter kitchens that smell horrible! Many students are very stuck up and rude! When you ask for help from the students (that are paid to be courteous and help you) they are very rude and act like they are doing you a favor! Will learn a lot The professors in the program are very young and still treat the students as if they were in high school. The catalog is not written correctly. A student I know there signed up for classes, then found out by ear it is not recommended to take two of them at the same time. Why was it not written in the catalog! Not to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}