{
    "relation": [
        [
            "",
            "Ethan Allen Firing Range (Vermont)",
            "Lake City Ammunition Plant (Missouri)",
            "China Lake Naval Air Warfare Center (California)",
            "NM Institute of Mining & Technology (New Mexico)",
            "Los Alamos National Laboratory (New Mexico)",
            "Jefferson Proving Ground (Indiana)",
            "Aberdeen Proving Ground (Maryland)",
            "Eglin Air Force Base (Florida) - Gunnery Ballistic Facility - High Explosive Test Area",
            "Nellis Air Force Base (Nevada)",
            "Total (known) amount DU fired"
        ],
        [
            "DU Testing",
            "1969 – 1973",
            "until 1985",
            "10 years",
            "since 1972",
            "",
            "1982 - 1988",
            "",
            "1973 - 1978 at present",
            "since 1982",
            ""
        ],
        [
            "Amount of DU",
            "4,500 kg",
            "3,500 kg",
            "11,300 kg",
            "---",
            "100,000 kg",
            "69,000 kg",
            "70,000 kg",
            "100,000 kg",
            "27,800 kg",
            "386,100 kg"
        ]
    ],
    "pageTitle": "DEPLETED URANIUM ALERT!",
    "title": "",
    "url": "http://www.apfn.org/apfn/DU.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 297431675,
    "recordOffset": 297309862,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3497=If you are a 'living being' on this planet earth, this page IS FOR YOU! THE PLAGUE OF 2006}",
    "TableContextTimeStampAfterTable": "{125002=Depleted Uranium: A slow, silent killer A crime against humanity http://www.state.nv.us/nucwaste/news2001/nn11107.htm, 340260=UK radiation jump blamed on Iraq shells http://www.timesonline.co.uk/article/0,,2087-2047373,00.html, 112149=Poison Dust: A New Look At Radioactive Weapons in the Gulf-- Forum at the UN Church Center Tuesday, May 25, 2004 As the brutal occupation of Iraq continues, new revelations of U.S. war crimes emerge every day. One such crime is the use of Depleted Uranium weapons. Depleted Uranium is both chemically toxic and radioactive, and is linked to the symptoms known as Gulf War Syndrome. Today, half of the 697,000 veterans of the First Gulf War suffer serious medical problems and a significant increase in birth defects. The effects on the Iraqi people have been much greater. This crime against humanity must be exposed. The Depleted Uranium Project was formed to expose the impact of this illegal weapon and to put an end to its use. Over the past 6 years, we have produced a great deal of educational material, including a widely-read book and companion video, Medal of Dishonor. To that end, we are currently working on several projects, which include: The production of a new, updated documentary exposing the use and effects of depleted uranium. This film, Poison Dust, will be available to educators, activists, military personnel, and others. This film, which will graphically document the horrifying damage caused by depleted uranium weapons, will be an important tool in building a movement to stop this crime. A national tour to screen the DU film Poison Dust near military bases. The documentary, along with presentations by veterans and health care professionals, will bring this important information directly to military personnel and their families, who are directly affected by depleted uranium. “Poison Dust,” a forum to be held at the UN Church Center on Tuesday, May 25, to launch this new project before the media and the international community and to demand: full testing, full health care and compensation, decontamination, and reparations to all victims of depleted uranium. Speakers will include: former U.S. Attorney General Ramsey Clark; physicist Dr. Michio Kaku; Juan Gonzalez, Daily News reporter and host of Democracy Now; and GIs and Veterans affected by DU weapons. The publication of new educational literature to expose the use of these deadly and illegal weapons of mass destruction by the U.S. military. Please join us in building a movement to stop this war crime. This is an ambitious but urgently needed educational program. A great deal of work has been done already, but much more remains to be done. We need your help to finish the video and educational resources. Please consider sending a tax-deductible donation to the People’s Rights Fund /DU Project to help us with this important work. (All Donors will be listed in the film credits) Yours in the struggle, Dustin Langley, SNAFU Sue Harris, Peoples Video Network Billy Martin, Movement in Motion Sara Flounders, International Action Center , 29527=The Depleted Uranium Alert! The Plague of 2006 Audio:: http://www.apfn.org/audio/Depleted-Uranium-Alert.mp3, 117294=Philip Dru interviews Doug Rokke Ph.D. about depleted uranium. He is a former Army Lieutenant who was in charge of clean up and disposal of Iraqi (and American) tanks that were hit with depleted uranium in 1991. He is now working to have d.u. rounds banned. http://www.apfn.org/apfn/audio/072405cf.mp3, 292066=This maybe a Sci/Fi, but so was the movie 1984, 125540=Teeshirts with large logo printing are relatively cheap at say $6.50 each plus a one time setup fee. Printing back and front gets attention at malls, stores, walking, working.... the message gets out! Ralph Charles Whitley, Sr. a decorated Veteran of One 4532 W. Kennedy Blvd. PMB-276 Tampa, Florida 33609-2042 backflow.prevention@verizon.net, 22354=November 28, 2006 The delivery of at least one hundred GBU-28 \"bunker buster\" bombs containing depleted-uranium warheads by the United States to Israel for use against targets in Lebanon will result in additional radioactive and chemical toxic contamination, with consequent adverse health and environmental effects throughout the Middle East. Israeli tank gunners are also using depleted-uranium tank rounds, as photographs verify. Today, US, British, and now Israeli military personnel are using illegal uranium munitions—America and the United Kingdom's own \"dirty bombs\"—while US Army, US Department of Energy, US Department of Defense (DOD), and UK Ministry of Defence officials deny that there are any adverse health or environmental effects as a consequence of the manufacture, testing, or use of uranium munitions, so that they may avoid liability for the willful and illegal dispersal of a radioactive toxic material—depleted uranium (DU). The use of uranium weapons is absolutely unacceptable and a crime against humanity. Consequently, the citizens of the world and all governments must force the cessation of uranium weapons use. I must demand that Israel now provide medical care to all DU casualties in Lebanon and clean up all DU contamination. American and British officials have arrogantly refused to comply with their own regulations, orders, and directives that require DOD officials to provide prompt and effective medical care to all exposed individuals (\"Medical Management of Unusual Depleted Uranium Casualties,\" DOD, Pentagon, 10/14/93; \"Medical Management of Army Personnel Exposed to Depleted Uranium (DU),\" US Army Medical Command, 4/29/04; Section 2-5 of US Army Regulation 700-48). They also refuse to clean up dispersed radioactive contamination, as required by Army Regulation 700-48, \"Management of Equipment Contaminated With Depleted Uranium or Radioactive Commodities\" (Department of the Army, September 2002) and US Army Technical Bulletin 9-1300-278, \"Guidelines for Safe Response to Handling, Storage, and Transportation Accidents Involving Army Tank Munitions or Armor which Contain Depleted Uranium\" (Department of the Army, July 1996). Specifically, Section 2-4 of United States Army Regulation 700-48 (dated September 16, 2002) requires that: (1) Military personnel identify, segregate, isolate, secure, and label all RCE (radiologically contaminated equipment), (2) Procedures to minimize the spread of radioactivity will be implemented as soon as possible, (3) Radioactive material and waste will not be locally disposed of through burial, submersion, incineration, destruction in place, or abandonment, and (4) All equipment, to include captured or combat RCE, will be surveyed, packaged, retrograded, decontaminated and released. The previous and current use of uranium weapons, the release of radioactive components in destroyed US and foreign military equipment, and releases of industrial, medical, and research-facility radioactive materials have resulted in unacceptable exposures. Therefore, decontamination must be completed as required by US Army Regulation 700-48 and should include releases of all radioactive materials resulting from military operations. The extent of the adverse health and environmental effects of uranium weapons contamination is not limited to combat zones but includes facilities and sites where uranium weapons were manufactured or tested, including Vieques; Puerto Rico; Colonie, New York; Concord, Mass.; Jefferson Proving Grounds, Indiana; and Schofield Barracks, Hawaii. Therefore, medical care must be provided by the United States Department of Defense to all individuals affected by the manufacturing, testing, or use of uranium munitions. Thorough environmental remediation also must be completed without further delay. I am amazed that fifteen years after was I asked to clean up the initial DU mess from Gulf War I, and over ten years since I finished the depleted-uranium project, US Department of Defense officials and others still attempt to justify the use of uranium munitions while ignoring mandatory requirements. I am dismayed that DOD and Department of Energy officials and representatives continue making personal attacks aimed to silence or discredit those of us who are demanding that medical care be provided to all DU casualties and that environmental remediation is completed in compliance with US Army Regulation 700-48. But beyond the ignored mandatory actions, the willful dispersal of tons of solid radioactive and chemically toxic waste in the form of uranium munitions is illegal and does not even pass the test of common sense. According to the US Department of Homeland Security (DHS), DU is a \"dirty bomb.\" The department issued \"dirty bomb\" response guidelines on January 3, 2006 for incidents within the United States, ignoring DOD use of uranium weapons and existing DOD regulations. These guidelines specifically state that \"a radiological incident is defined as an event or series of events, deliberate or accidental, leading to the release, or potential release, into the environment of radioactive material in sufficient quantity to warrant consideration of protective actions. Use of an RDD or IND is an act of terror that produces a radiological incident.\" Thus, the use of uranium munitions is an \"act or terror,\" as defined by DHS. Finally, continued compliance with the infamous March 1991 Los Alamos memorandum that was issued to ensure continued use of uranium munitions cannot be justified. In conclusion, the president of the United States, the prime minister of the United Kingdom, and the prime minister of Israel must acknowledge and accept responsibility for the willful use of illegal uranium munitions—their own \"dirty bombs\"—resulting in adverse health and environmental effects. President Bush, Prime Minister Blair, and Prime Minister Olmert should order medical care for all casualties and thorough environmental remediation, and stop the illegal use of depleted-uranium munitions. Doug Rokke is a Vietnam veteran and the former director of the US Army Depleted Uranium Project. He has a PhD in health physics and was originally trained as a forensic scientist. When the Gulf War started in 1991, he was assigned to prepare soldiers to respond to nuclear, biological, and chemical warfare, and was sent to the Gulf. What he experienced has made him a passionate voice for peace, traveling the country to speak out. :: Article nr. 28618 sent on 29-nov-2006 15:36 ECT :: The address of this page is : http://www.uruknet.info?p=28618 :: The incoming address of this article is : http://www.vvaw.org/veteran/article/?id=662, 151023=In this year's war on Iraq, the Pentagon used its radioactive arsenal mainly in the urban centers, rather than in desert battlefields as in 1991. Many hundreds of thousands of Iraqi people and U.S. soldiers, along with British, Polish, Japanese and Dutch soldiers sent to join the occupation, will suffer the consequences. The real extent of injuries, chronic illness, long-term disabilities and genetic birth defects won't be apparent for five to 10 years., 19245=1,000-2,000 TONS DU Spread Over Iraq's Cities From Leuren Moret 4-30-3 Here is the estimate of the tons of DU the US used in Iraq: 1000-2000 tons - more than three times the amount used in the first Gulf War...only this time it was primarily spread in Iraq's cities, not on the battlefield. The uranium and its radioactive decay products will remain toxic for over 4 billion years...and will slowly destroy the genetic future of the Iraqi people. But the death and destruction will not be contained within the borders of Iraq. Winds will spread it throughout the Middle East and beyond. The US has carried out its homicidal plan now on Afghanistan and Iraq...what country is next? Israel, Palestine, Lebanon, Kuwait, the Gulf States, and Iran will breathe the invisible war too... and they will share the fate of the Iraqi people, the caretakers of the cradle of civilization. Uranium Cancer Check For Returning UK Troops By Paul Brown The Guardian Weekly Soldiers returning from the Gulf will be offered tests on the levels of depleted uranium in their bodies to check if they are in danger of kidney damage and lung cancer as a result of exposure, the Ministry of Defence said this week.The ministry was responding to a warning from the Royal Society, Britain's top scientific body, that soldiers and civilians might be exposed to toxic levels. It challenged assurances from the Defence Secretary, Geoff Hoon, that depleted uranium was not a risk. A ministry spokeswoman said that if soldiers followed instructions correctly and wore respirators in areas where depleted uranium might have been used they would not suffer dangerous exposure, but all would be offered urine tests. The overall results would be published. The ministry said it would also publish details of where and how much depleted uranium was used. Brian Spratt, chairman of the society's working group on depleted uranium, said: \"It is highly unsatisfactory to deploy a large amount of a material that is weakly radioactive and chemically toxic without knowing how much soldiers and civilians have been exposed to it . . . It is vital that this monitoring takes place within a matter of months.\" Experts have calculated that between 1,000 and 2,000 tonnes of depleted uranium were used by the coalition in the Iraq campaign. The Guardian Weekly 20-3-0501, page 4 http://www.lawyersagainstthewar.org/iraqnews/duspread.html, 154292=The Aug. 4 Seattle Post Intelligencer reported elevated radiation levels at six sites from Basra to Baghdad. One destroyed tank near Baghdad had 1,500 times the normal background radiation. \"The Pentagon and the United Nations estimate that the U.S. and Britain used 1,100 to 2,200 tons of armor-piercing shells made of depleted uranium during attacks on Iraq in March and April--far more than the 375 tons used in the 1991 Gulf War,\" wrote the Post Intelligencer., 237410=Listen to Segment || Download Show mp3       Watch 128k stream       Watch 256k stream       Read Transcript http://www.democracynow.org/article.pl?sid=04/09/30/1411222, 97229=At an April press conference, a group of New York Army National Guard vets raised their hands when asked if they have health problems. The soldiers, all from the 442nd Military Police Company, are complaining of headaches and fatigue after what they think is exposure to depleted uranium during their recent tour in Iraq. At an April press conference, a group of New York Army National Guard vets raised their hands when asked if they have health problems. The soldiers, all from the 442nd Military Police Company, are complaining of headaches and fatigue after what they think is exposure to depleted uranium during their recent tour in Iraq. “Military men are just dumb stupid animals to be used as pawns in foreign policy.” - Henry Kissinger, quoted in “Kiss the Boys Goodbye: How the United States Betrayed Its Own POW’s in Vietnam” Vietnam was a chemical war for oil, permanently contaminating large regions and countries downriver with Agent Orange, and environmentally the most devastating war in world history. But since 1991, the U.S. has staged four nuclear wars using depleted uranium weaponry, which, like Agent Orange, meets the U.S. government definition of Weapons of Mass Destruction. Vast regions in the Middle East and Central Asia have been permanently contaminated with radiation. And what about our soldiers? Terry Jemison of the Department of Veterans Affairs reported this week to the American Free Press that “Gulf-era veterans” now on medical disability since 1991 number 518,739, with only 7,035 reported wounded in Iraq in that same 14-year period. This week the American Free Press dropped a “dirty bomb” on the Pentagon by reporting that eight out of 20 men who served in one unit in the 2003 U.S. military offensive in Iraq now have malignancies. That means that 40 percent of the soldiers in that unit have developed malignancies in just 16 months. Since these soldiers were exposed to vaccines and depleted uranium (DU) only, this is strong evidence for researchers and scientists working on this issue, that DU is the definitive cause of Gulf War Syndrome. Vaccines are not known to cause cancer. One of the first published researchers on Gulf War Syndrome, who also served in 1991 in Iraq, Dr. Andras Korényi-Both, is in agreement with Barbara Goodno from the Department of Defense’s Deployment Health Support Directorate, that in this war soldiers were not exposed to chemicals, pesticides, bioagents or other suspect causes this time to confuse the issue. This powerful new evidence is blowing holes in the cover-up perpetrated by the Pentagon and three presidential administrations ever since DU was first used in 1991 in the Persian Gulf War. Fourteen years after the introduction of DU on the battlefield in 1991, the long-term effects have revealed that DU is a death sentence and very nasty stuff. Scientists studying the biological effects of uranium in the 1960s reported that it targets the DNA. Marion Fulk, a nuclear physical chemist retired from the Livermore Nuclear Weapons Lab and formerly involved with the Manhattan Project, interprets the new and rapid malignancies in soldiers from the 2003 war as “spectacular … and a matter of concern.” This evidence shows that of the three effects which DU has on biological systems - radiation, chemical and particulate – the particulate effect from nano-size particles is the most dominant one immediately after exposure and targets the Master Code in the DNA. This is bad news, but it explains why DU causes a myriad of diseases which are difficult to define. In simple words, DU “trashes the body.” When asked if the main purpose for using it was for destroying things and killing people, Fulk was more specific: “I would say that it is the perfect weapon for killing lots of people.” Soldiers developing malignancies so quickly since 2003 can be expected to develop multiple cancers from independent causes. This phenomenon has been reported by doctors in hospitals treating civilians following NATO bombing with DU in Yugoslavia in 1998-1999 and the U.S. military invasion of Iraq using DU for the first time in 1991. Medical experts report that this phenomenon of multiple malignancies from unrelated causes has been unknown until now and is a new syndrome associated with internal DU exposure. Just 467 U.S. personnel were wounded in the three-week Persian Gulf War in 1990-1991. Out of 580,400 soldiers who served in Gulf War I, 11,000 are dead, and by 2000 there were 325,000 on permanent medical disability. This astounding number of disabled vets means that a decade later, 56 percent of those soldiers who served now have medical problems. The number of disabled vets reported up to 2000 has been increasing by 43,000 every year. Brad Flohr of the Department of Veterans Affairs told American Free Press that he believes there are more disabled vets now than even after World War II. They brought it home Not only were soldiers exposed to DU on and off the battlefields, but they brought it home. DU in the semen of soldiers internally contaminated their wives, partners and girlfriends. Tragically, some women in their 20s and 30s who were sexual partners of exposed soldiers developed endometriosis and were forced to have hysterectomies because of health problems. In a group of 251 soldiers from a study group in Mississippi who had all had normal babies before the Gulf War, 67 percent of their post-war babies were born with severe birth defects. They were born with missing legs, arms, organs or eyes or had immune system and blood diseases. In some veterans’ families now, the only normal or healthy members of the family are the children born before the war. The Department of Veterans Affairs has stated that they do not keep records of birth defects occurring in families of veterans. How did they hide it? Before a new weapons system can be used, it must be fully tested. The blueprint for depleted uranium weapons is a 1943 declassified document from the Manhattan Project. Harvard President and physicist James B. Conant, who developed poison gas in World War I, was brought into the Manhattan Project by the father of presidential candidate John Kerry. Kerry’s father served at a high level in the Manhattan Project and was a CIA agent. Conant was chair of the S-1 Poison Gas Committee, which recommended developing poison gas weapons from the radioactive trash of the atomic bomb project in World War II. At that time, it was known that radioactive materials dispersed in bombs from the air, from land vehicles or on the battlefield produced very fine radioactive dust which would penetrate all protective clothing, any gas mask or filter or the skin. By contaminating the lungs and blood, it could kill or cause illness very quickly. They also recommended it as a permanent terrain contaminant, which could be used to destroy populations by contaminating water supplies and agricultural land with the radioactive dust. The first DU weapons system was developed for the Navy in 1968, and DU weapons were given to and used by Israel in 1973 under U.S. supervision in the Yom Kippur war against the Arabs. The Phalanx weapons system, using DU, was tested on the USS Bigelow out of Hunters Point Naval Shipyard in 1977, and DU weapons have been sold by the U.S. to 29 countries. Military research report summaries detail the testing of DU from 1974-1999 at military testing grounds, bombing and gunnery ranges and at civilian labs under contract. Today 42 states are contaminated with DU from manufacture, testing and deployment. Women living around these facilities have reported increases in endometriosis, birth defects in babies, leukemia in children and cancers and other diseases in adults. Thousands of tons of DU weapons tested for decades by the Navy on four bombing and gunnery ranges around Fallon, Nevada, is no doubt the cause of the fastest growing leukemia cluster in the U.S. over the past decade. The military denies that DU is the cause. The medical profession has been active in the cover-up - just as they were in hiding the effects from the American public - of low level radiation from atmospheric testing and nuclear power plants. A medical doctor in Northern California reported being trained by the Pentagon with other doctors, months before the 2003 war started, to diagnose and treat soldiers returning from the 2003 war for mental problems only. Medical professionals in hospitals and facilities treating returning soldiers were threatened with $10,000 fines if they talked about the soldiers or their medical problems. They were also threatened with jail. Reporters have also been prevented access to more than 14,000 medically evacuated soldiers flown nightly since the 2003 war in C-150s from Germany who are brought to Walter Reed Hospital near Washington, D.C. Dr. Robert Gould, former president of the Bay Area chapter of Physicians for Social Responsibility (PSR), has contacted three medical doctors since February 2004, after I had been invited to speak about DU. Dr. Katharine Thomasson, president of the Oregon chapter of the PSR, informed me that Dr. Gould had contacted her and tried to convince her to cancel her invitation for me to speak about DU at Portland State University on April 12. Although I was able to do a presentation, Dr. Thomasson told me I could only talk about DU in Oregon “and nothing overseas … nothing political.” Dr. Gould also contacted and discouraged Dr. Ross Wilcox in Toronto, Canada, from inviting me to speak to Physicians for Global Survival (PGS), the Canadian equivalent of PSR, several months later. When that didn’t work, he contacted Dr. Allan Connoly, the Canadian national president of PGS, who was able to cancel my invitation and nearly succeeded in preventing Dr. Wilcox, his own member, from showing photos and presenting details on civilians suffering from DU exposure and cancer provided to him by doctors in southern Iraq. Dr. Janette Sherman, a former and long-standing member of PSR, reported that she finally quit some time after being invited to lunch by a new PSR executive administrator. After the woman had pumped Dr. Sherman for information all through lunch about her position on key issues, the woman informed Dr. Sherman that her last job had been with the CIA. How was the truth about DU hidden from military personnel serving in successive DU wars? Before his tragic death, Sen. Paul Wellstone informed Joyce Riley, R.N., B.S.N., executive director of the American Gulf War Veterans Association, that 95 percent of Gulf War veterans had been recycled out of the military by 1995. Any of those continuing in military service were isolated from each other, preventing critical information being transferred to new troops. The “next DU war” had already been planned, and those planning it wanted “no skunk at the garden party.” The US has a dirty (DU) little (CIA) secret A new book just published at the American Free Press by Michael Collins Piper, “The High Priests of War: The Secret History of How America’s Neo-Conservative Trotskyites Came to Power and Orchestrated the War Against Iraq as the First Step in Their Drive for Global Empire,” details the early plans for a war against the Arab world by Henry Kissinger and the neo-cons in the late 1960s and early 1970s. That just happens to coincide with getting the DU “show on the road” and the oil crisis in the Middle East, which caused concern not only to President Nixon. The British had been plotting and scheming for control of the oil in Iraq for decades since first using poison gas on the Iraqis and Kurds in 1912. The book details the creation of the neo-cons by their “godfather” and Trotsky lover Irving Kristol, who pushed for a “war against terrorism” long before 9/11 and was lavishly funded for years by the CIA. His son, William Kristol, is one of the most influential men in the United States. Both are public relations men for the Israeli lobby’s neo-conservative network, with strong ties to Rupert Murdoch. Kissinger also has ties to this network and the Carlyle Group, who, one could say, have facilitated these omnicidal wars beginning from the time former President Bush took office. It would be easy to say that we are recycling World Wars I and II, with the same faces. When I asked Vietnam Special Ops Green Beret Capt. John McCarthy, who could have devised this omnicidal plan to use DU to destroy the genetic code and genetic future of large populations of Arabs and Moslems in the Middle East and Central Asia - just coincidentally the areas where most of the world’s oil deposits are located - he replied: “It has all the handprints of Henry Kissinger.” In Zbignew Brzezinski’s book “The Grand Chessboard: American Primacy and Its Geostrategic Imperatives,” the map of the Eurasian chessboard includes four regions strategic to U.S. foreign policy. The “South” region corresponds precisely to the regions now contaminated permanently with radiation from U.S. bombs, missiles and bullets made with thousands of tons of DU. A Japanese professor, Dr. K. Yagasaki, has calculated that 800 tons of DU is the atomicity equivalent of 83,000 Nagasaki bombs. The U.S. has used more DU since 1991 than the atomicity equivalent of 400,000 Nagasaki bombs. Four nuclear wars indeed, and 10 times the amount of radiation released into the atmosphere from atmospheric testing! No wonder our soldiers, their families and the people of the Middle East, Yugoslavia and Central Asia are sick. But as Henry Kissinger said after Vietnam when our soldiers came home ill from Agent Orange, “Military men are just dumb stupid animals to be used for foreign policy.” Unfortunately, more and more of those soldiers are men and women with brown skin. And unfortunately, the DU radioactive dust will be carried around the world and deposited in our environments just as the “smog of war” from the 1991 Gulf War was found in deposits in South America, the Himalayas and Hawaii. In June 2003, the World Health Organization announced in a press release that global cancer rates will increase 50 percent by 2020. What else do they know that they aren’t telling us? I know that depleted uranium is a death sentence … for all of us. We will all die in silent ways. http://www.sfbayview.com/081804/Depleteduranium081804.shtml, 289990=Du Exhibit draws hundreds in Washington, DC on September 24, 2005, 266483=     We are well aware that the radiation fall-out map  \u0013Under the Cloud: Decades of Nuclear Testing\u0014  has demonstrated the effects  of 1200 nuclear weapon tests conducted at the Nevada Test Site; and the US Government admitted in Nov. 2002, that every living person in the US between 1958-63 was exposed to this fall out  resulting in cancer, gene mutation, heart disease, autism, diabetes, Parkinsons, ALS, asthma, chronic fatigue syndrome , hypothyroidism in new-borns, obesity and learning disabilities.  One out of  twelve children in the US is disabled. The fall out did not stop at the US borders.  It travelled around the world, as atmospheric dust and remains even in the biosphere/ sub-orbital space today.  High breast cancer rates have been co-located in the proximity of nuclear power plants in the west and more so in the east coast areas of the US (The Breast cancer map from \u0013The Enemy Within: the high cost of living near nuclear reactors\u0014, quotes US Govt. Disease Control Centers. , 281312=Former Army Colonel: US Forces' Use of Depleted Uranium Weapons is a 'war crime' From: Tim Bruening - view profile Date: Tues, Apr 1 2003 12:27 am Email: Tim Bruening <tsbru...@pop.dcn.davis.ca.us> http://truthout.org/docs_03/040103F.shtml  US forces' Use of Depleted Uranium Weapons is 'Illegal' By Neil Mackay, Investigations Editor Sunday Herald Sunday 30 March 2003 British and American coalition forces are using depleted uranium (DU) shells in the war against Iraq and deliberately flouting a United Nations resolution which classifies the munitions as illegal weapons of mass destruction. DU contaminates land, causes ill-health and cancers among the soldiers using the weapons, the armies they target and civilians, leading to birth defects in children. Professor Doug Rokke, ex-director of the Pentagon's depleted uranium project -- a former professor of environmental science at Jacksonville University and onetime US army colonel who was tasked by the US department of defence with the post-first Gulf war depleted uranium desert clean-up -- said use of DU was a 'war crime'. Rokke said: 'There is a moral point to be made here. This war was about Iraq possessing illegal weapons of mass destruction -- yet we are using weapons of mass destruction ourselves.' He added: 'Such double-standards are repellent.' The latest use of DU in the current conflict came on Friday when an American A10 tankbuster plane fired a DU shell, killing one British soldier and injuring three others in a 'friendly fire' incident. According to a August 2002 report by the UN subcommission, laws which are breached by the use of DU shells include: the Universal Declaration of Human Rights; the Charter of the United Nations; the Genocide Convention; the Convention Against Torture; the four Geneva Conventions of 1949; the Conventional Weapons Convention of 1980; and the Hague Conventions of 1899 and 1907, which expressly forbid employing 'poison or poisoned weapons' and 'arms, projectiles or materials calculated to cause unnecessary suffering'. All of these laws are designed to spare civilians from unwarranted suffering in armed conflicts. DU has been blamed for the effects of Gulf war syndrome -- typified by chronic muscle and joint pain, fatigue and memory loss -- among 200,000 US soldiers after the 1991 conflict. It is also cited as the most likely cause of the 'increased number of birth deformities and cancer in Iraq' following the first Gulf war. 'Cancer appears to have increased between seven and 10 times and deformities between four and six times,' according to the UN subcommission. The Pentagon has admitted that 320 metric tons of DU were left on the battlefield after the first Gulf war, although Russian military experts say 1000 metric tons is a more accurate figure. In 1991, the Allies fired 944,000 DU rounds or some 2700 tons of DU tipped bombs. A UK Atomic Energy Authority report said that some 500,000 people would die before the end of this century, due to radioactive debris left in the desert. The use of DU has also led to birth defects in the children of Allied veterans and is believed to be the cause of the 'worrying number of anophthalmos cases -- babies born without eyes' in Iraq. Only one in 50 million births should be anophthalmic, yet one Baghdad hospital had eight cases in just two years. Seven of the fathers had been exposed to American DU anti-tank rounds in 1991. There have also been cases of Iraqi babies born without the crowns of their skulls, a deformity also linked to DU shelling. A study of Gulf war veterans showed that 67% had children with severe illnesses, missing eyes, blood infections, respiratory problems and fused fingers. Rokke told the Sunday Herald: 'A nation's military personnel cannot wilfully contaminate any other nation, cause harm to persons and the environment and then ignore the consequences of their actions. 'To do so is a crime against humanity. 'We must do what is right for the citizens of the world -- ban DU.' He called on the US and UK to 'recognise the immoral consequences of their actions and assume responsibility for medical care and thorough environmental remediation'. He added: 'We can't just use munitions which leave a toxic wasteland behind them and kill indiscriminately. 'It is equivalent to a war crime.' Rokke said that coalition troops were currently fighting in the Gulf without adequate respiratory protection against DU contamination. The Sunday Herald has previously revealed how the Ministry of Defence had test-fired some 6350 DU rounds into the Solway Firth over more than a decade, from 1989 to 1999. (In accordance with Title 17 U.S.C. Section 107, this material is distributed without profit to those who have expressed a prior interest in receiving the included information for research and educational purposes.) © Copyright 2003 by TruthOut.org http://groups.google.com/group/alt.politics.democrats.d/browse_thread/thread/2af1691988d86e63/142c1a8e03eb9383?lnk=st&q=depleted+uranium&rnum=14&hl=en#142c1a8e03eb9383  , 240703=November 29, 1994, 21998=BREAKING NEWS AND COMMENTARY Last updated: Sun, 03 Dec 2006 00:39:57 GMT http://www.legitgov.org/index.html#breaking_news, 153438=Scott Peterson, a staff writer for the Christian Science Moni tor, reported on May 15 about taking Geiger counter readings at several sites in Baghdad. Near the Republican Palace where U.S. troops stood guard and over 1,000 employees walked in and out of the building, his radiation readings were the \"hottest\" in Iraq, at nearly 1,900 times background radiation levels. Spent shell casings still littered the ground., 269881=    We need not ennumerate the DU munition types used in Iraq 199, Kosovo  1999, Afghanistan 2001-04 and Iraq 2003.  They have been dispensed by all air / ground and sea systems on innocent civilians.  DU burns intensely and is very hard.  It releases Uranium Oxide.  The aerosol contains particles of 0.5-5 microns in size, once they are in the air or dust they are inhaled or ingested, including from contaminated soil.  Once in the lungs one such particle is equivalent to having one X\u0012Ray per hour, for life.  Because it is impossible to remove, the victim is gradually irradiated.  Still births, birth defects, leukemia, damaged central nervous systems and other cancers have been common in children born since 1991. Child leukemia has risen 600 % in areas of Iraq as  reported by the Netherland Visie Foundation.  Beyond just the health consequences, DU munitions are in fact, weapons of \u0011Silent\u0012 Mass Destruction in so far as the consequences of their usage are vast, indiscriminate and violate all Human Rights Conventions . Tora Bora , Kabu , Paktia , Karises or underwater supply tunnels have been contaminated forever. All this has been documented in a comprehensive paper \u0013 Uranium wars : The Pentagon steps up its use of Radio-active Munitions,\u0014 by Marc W. Herold to whom this paper owes sincere acknowledgement. , 61519=The U.S. military's bombardment of Iraq in the current war and in the first Gulf War is also likely a war crime which violates the Geneva Conventions and the War Crimes Act of 1996., 135953=UNITED NATIONS COMMISSION ON HUMAN RIGHTS Fifty-third session Item 5 of the provisional agenda Human Rights and Toxics: Depleted Uranium and the Gulf War Written statement submitted by International Educational Development/Humanitarian Law Project a non-governmental organization on the Roster 1. International Educational Development/Humanitarian Law Project welcomes the progress made on the issue of toxics and the innovative and necessary work of the Commission's rapporteur Fatma-Zohra Ksentini. We have submitted information to the rapporteur on the use of weapons containing depleted uranium by the United States forces in the Gulf War. We are also continuing to compile information on this subject in light of Sub-Commission resolution 1996/[ ] (U.N. Doc. E/CN.4/Sub.2/1996/L.18) which requests that information on the use of weapons of mass destruction, including those containing depleted uranium, is including in a report by the Secretary-General to the Sub- Commission at its forty-ninth session. 2. During the Gulf War up to 800 tons of munitions containing depleted uranium were used by United States forces in military actions in Kuwait and Iraq. This was the first field test of these weapon in actual combat, and they proved to be exceptionally effective anti-tank projectiles due to their superior armour-piercing capacity. It is unclear how much of the discarded shell casings and other radioactive material still remains in Iraq, but several investigators who have traveled to the area reports that shell casings containing depleted uranium are scattered all over the ground in many areas, including in school yards and other similar civilian locales. 3. Depleted uranium contain about 30% less than normal of 235/U, a dangerous radioisotope of uranium used in nuclear bombs and commercial power plants. It is a byproduct of extraction of 235/U form natural uranium. Much of depleted uranium is 238/U with a half life of 4 billion years. 4. Depleted uranium vaporizes when deployed in armour-piercing bullets. Scientific studies indicate if as much as one small particle (<5 microns in diameter) enters the lungs, the lungs and surrounding tissue will be exposed to 270 times the radiation permitted for workers in the radiation industry. 5. We first raised this issue at the fifty-second session of the Commission when, in conjunction with Margarita Papandreou and Women for Mutual Security and the International Commission of Inquiry on Economic Sanctions, we addressed the serious situation of especially children in Iraq. Thousands of children in Iraq suffer from illnesses related to depleted uranium compounded in gravity by the effects of the economic sanctions. Now, children and animals in the area are being born with the serious congenital anomalies and disabilities associated with low grade radiation poisoning. At that session we presented Dr. Horst Gunther who has traveled to Iraq and who has documented, in report and by photograph, the devastating situation in Iraq. 6. Since that time, more evidence of the use of depleted uranium and the Iraqi medical catastrophe has been presented while at the same time the controversy over \"Gulf War Syndrome\" escalates in the United States. It now appears that key information relating to this situation has been removed from top secret files or destroyed. 7. Evidence compiled in the United States indicates as many as 50,000 veterans of the United States forces in the Gulf War and 4,000 or more from the allied countries have conditions that appear to be clear consequences of military service. There are no available statistics on the number of Iraqis showing similar symptoms, although Dr. Gunther's investigations indicate many thousands. 8. In addition to the serious problems faced by those exposed to DU during the Gulf War, there is a worldwide problem of the disposal of DU. These is an estimated billion pounds of DU tailings in the United States, and the United States Department of Energy is seeking opportunities to dispose of it. There are an estimated 30 million KGs DU tailings stored in Europe at URENCO plants. The United States Army Environmental Policy Institute (USAEPI) reports that the United Kingdom, Russia, Turkey, Saudi Arabia, Pakistan, Thailand, Israel, France and other unspecified countries have developed or are developing DU weapons. 9. We urge the Special Rapporteur to investigate the situation of the use of DU in the Gulf War and its effect on human rights. We also urge the Rapporteur to monitor the situation of DU storage and transport. http://www.webcom.com/hrin/parker/c97-5w.html (original UN Report .pdf file is down), 123364=House Passes McDermott Depleted Uranium Study Amendment Possible DU Health Effects on Soldiers Will Be Studied May 11, 2006 For Immediate Release http://www.house.gov/mcdermott/pr060511b.shtml, 276739=      This meeting took place on Hiroshima Day, 6th August, 2003, and to reiterate, the aim was to define a new generation of nuclear weapons to be used on a pre-emptive basis against rogue enemies and terrorist organisations.  (mini-nukes have an explosive capacity between one-third and six times a Hiroshima bomb). , 224537=Depleted Uranium - A Hidden Looming Worldwide Calamity http://www.globalresearch.ca/index.php?context=viewArticle&code=LEN20060119&articleId=1754, 268376=    The long-term effects from over a decade of DU exposures are emerging in Southern  Iraq. They are devastating. The increased  quantities of radio-active material ( including non-depleted uranium), used in Afghanistan are 3 to 5 times greater than Iraq 199.  In Iraq 2003 they are already estimated to be 6 to 10 times 1991 and will travel through a larger area and affect many more people, babies and unborn.  Countries within a 1000 mile radius of Baghdad and Kabul are being affected by radiation poisoning , that includes the Capital, New Delhi, where the ruling elite lives.  The reported coming of an AIDS epidemic last year in India , down wind, may have a relationship to DU bombing in Afghanistan.  If we think cancer is a problem now wait until more DU is released in wars against terror and for \u0011regime change\u0012, on \u0011mistaken\u0012 Intelligence reports. , 18263=Depleted Uranium The Pentagon Betrayal Of GIs And Iraqis John Hanchette editor of USA Today from 1991 to 2001and Pentagon DU expert Dr. Doug Rokke, a serving officer for 30 years. [The Gulf War soldiers were in Iraq a tiny fraction of the time the soldiers are being kept in Iraq.] Rokke says he was ordered to lie about DU, because the military was determined to continue using it, despite the danger to US troops. Watch the Full Movie CLICK HERE., 135602=http://www.mindfully.org/Nucs/2004/DU-Trojan-Horse1jul04.htm, 59986=http://www4.law.cornell.edu/uscode/html/uscode18/usc_sec_18_00002332---a000-.html, 229276=Dr. Keith Baverstock, The World Health Organization's chief expert on radiation and health for 11 years and author of an unpublished study has charged that his report \" on the cancer risk to civilians in Iraq from breathing uranium contaminated dust \" was  also deliberately suppressed. The information released by the U.S. Dept. of Defense is not reliable, according to some sources even within the military. In 1997, while citing experiments, by others, in which 84 percent of dogs exposed to inhaled uranium died of cancer of the lungs, Dr. Asaf Durakovic, then Professor of Radiology and Nuclear Medicine at Georgetown University in Washington was quoted as saying,  \"The [US government's] Veterans Administration asked me to lie about the risks of incorporating depleted uranium in the human body.\" http://www.globalresearch.ca/index.php?context=viewArticle&code=20060503&articleId=2374, 135152=VISIE: http://www.xs4all.nl/~stgvisie/VISIE/du-diagnosis.html  DESERT SHIELD/DESERT STORM website: http://www.ushostnet.com/gulfwar/articles.htm  04/1504, 269320=    More than 500 tons of DU munitions have been dispensed in Afghanistan.  Professor Yagasaki calculated that 800 tons of DU is the atomicity equivalent to 83,000 Nagasaki bombs in a paper presented at the \u0011World Uranium Weapons Conference\u0012 in Hamburg in October 2003 ( 5 months ago ).  The amount of DU used in Iraq in 2003 is equivalent to nearly 250,000 Nagasaki bombs  ( Busby and Leuren Moret have calculated that 1900 tons of DU is equivalent to 60 TBq of Alfa and Beta particulate activity). , 245164=The Waste Isolation Pilot Plant (WIPP) was built to store the transuranic wastes generated by military facilities. The development of the plant was authorized in 1979 and was initially met warmly by local officials. However, some structural failures and changing public attitude in the state of New Mexico have prevented the plant from starting operation. The plant is not expected to start receiving waste until the end of this decade. Even then, WIPP will only store 20 percent of the total transuranic waste., 50418=AUDIO: Wed., June 7, 2006: Playlists: M3U | RAM (Individual MP3: Click Here) Christopher Bollyn speaks with Doug Rokke, and Leuren Moret about the military's use of Depleted Uranium in munitions. Mr.Rokke is the former Director of the US Army Depleted Uranium Project. Ms. Moret is a geophysicist specializing in atmospheric sciences, a nuclear activist, and a former scientist and whistle blower at the Lawrence Livermore Laboratories. http://mp3.rbnlive.com/Piper06.html, 6272=9/6/06 \"The Charles Goyette Show\" KNFX 1100 AM INTERVIEW: RE: Depleted uranium: Dirty bombs, dirty missiles, dirty bullets AUDIO: \"The Whole World is in danger....!\" http://www.apfn.net/pogo/A002I060906AM2.MP3, 158724=This March and April U.S. and British forces fired hundreds of thousands of DU rounds in dense urban areas. Superfine uranium oxide particles were blown about in dust storms. Yet the Pentagon refuses to track, report or mark off where DU was fired. There is no way Iraqis or the occupying soldiers can keep 75 feet away or use respiratory and skin protection in 120-degree heat., 56514=http://caselaw.lp.findlaw.com/scripts/ts_search.pl?title=18&sec=2441, 166988=Sara Flounders is co-director of the International Action Center and coordinator of the DU Education Project. She is an editor and a contributing author of the book \"Metal of Dishonor: Depleted Uranium,\" and helped produce a video by the same name. The IAC helped organize an international effort to bring the issue of DU to the UN Human Rights Commission in Geneva and helped measure radiation levels in Iraq before the 2003 war., 333621=A declassified memo from 1943 regarding DU effects was sent to Rep Jim McDermott in 2003, who is alert to this problem can be found at http://www.mindfully.org/Nucs/2003/Leuren-Moret-Gen-Groves21feb03.htm Sickened Iraq Vets Cite Depleted Uranium http://www.afterdowningstreet.org/node/13727, 62442=Since the use of DU violates the Geneva Conventions of 1949, it also likely violates the War Crimes Act of 1996., 332244=http://www.mindfully.org/Nucs/2004/DU-Trojan-Horse1jul04.htm, 151545=By now, half of all the 697,000 U.S. soldiers involved in the 1991 war have reported serious illnesses. According to the American Gulf War Veterans Association, more than 30 percent of these soldiers are chronically ill and are receiving disability benefits from the Veterans Administration. Such a high occurrence of various symptoms has led to the illnesses being named Gulf War Syndrome., 14384=CNN reports on DU(video). CNN American Morning's Special Investigation Dangers of depleted uranium: Do U.S. troops know about the dangers of depleted uranium? CNN's Greg Hunter reports [Part1](February 5) http://rss.cnn.com/~r/rss/cnn_freevideo/~3/86824503/index.html [Part2](February 6)(not available in cnn.com) http://smartvideochannel.com/search.aspx?q=depleted+uranium&v=search&t=video, 265664=     DU weapons emit \u0011Alpha\u0012 particle dose to a single cell from U-238 which is 50 times the annual dose level. Cancer is initiated with one alpha particle, its daughter isotopes effect generations as the isotopes  bio-concentrate in plants and animals, and travel up the food chain.  It is a nuclear weapon because the energy is derived from the nucleus of the atom.  They enter the body through the lungs, the digestive system or breaks in the skin.  One gram of DU releases more than 12,000 particles per second. The radiation slowly kills the cells that make life possible.  The Gulf War syndrome of 1991 did just that ( reported by Dr Asaf Durakovic, Prof. of Medicine , Georgetown University, and discoverer of the \u0011Gulf War Syndrome\u0012.) , 321626=7/18/2006 3:30:00 PM Depleted uranium at JPG on meeting agenda for tonight Peggy Vlerebome Courier Staff Writer Depleted uranium can cause genetic mutations by attaching itself to the DNA in cells, which can lead to diseases such as cancer, an Arizona biochemist reported in a study published in May. Her study is of interest locally to Save the Valley because of the tons of depleted uranium the Army left behind at Jefferson Proving Ground after 10 years of testing munitions containing it. “We’ve been saying that for years,” said Richard Hill, president of Save the Valley and co-chairman of the JPG Restoration Advisory Board, which for years devoted most of its quarterly meetings to discussing depleted uranium and what the Army is going to do about it. The study findings probably are something concerned residents will want to bring up tonight when the Atomic Safety and Licensing Board Panel has a listening session in Madison. It will be at 6:30 p.m. at the Madison-Jefferson County Public Library. The session was contemplated long before the new study was published. The commission, which is made up of three administrative judges, will be in the area for a prehearing conference to set the final details for a public hearing on the Army’s proposal for how to proceed with decommissioning JPG. Save the Valley has been granted status to participate in the public hearing, whose date and location have not been set. The listening session is for anyone who is not a participant but who has concerns about depleted uranium at JPG, Hill said. The biochemist who published the study has said in interviews that she doesn’t want the public to panic over the study findings. Nonetheless, Save the Valley’s experts are taking a close look at the study, which was published in two scientific journals, Hill said. Depleted uranium is what is left over after uranium is processed for such uses as nuclear power plants. Uranium is found naturally in soil, and large deposits of it are mined for commercial use. Depleted uranium is more concentrated but less radioactive than what is taken out, Hill said. Depleted uranium is a heavy metal and is toxic as well as radioactive. Health problems caused by depleted uranium have long been the topics of study, but the new study is the first to say that regardless of DU’s toxicity or radioactivity, it can cause serious health problems such as cancer by altering the DNA. Depleted uranium stopped being a topic at the JPG Restoration Advisory Board meetings when Hill and the other co-chairman, Paul Cloud, agreed that depleted uranium had never been intended to be a topic of discussion by restoration advisory boards. The government set up local advisory boards when it embarked on massive military base closures. Cloud is a civilian who is the Army’s environmental coordinator for Jefferson Proving Ground. Another new study might pertain to Jefferson Proving Ground as well. It concludes that fires in forests where depleted uranium is present can cause the DU to be carried in the air. The study was done in another state after a wildfire. The study concluded, however, that only small amounts of depleted uranium are dispersed by fires. The study said the dispersal of DU can happen whether a fire is a wildfire or a controlled-burn conducted for forest management. The U.S. Fish and Wildlife Service conducts controlled burns each spring at JPG. Save the Valley wants the federal Nuclear Regulatory Commission to require the Army to include air tests as part of its data-gathering that will go into whatever plan is eventually approved for decommissioning JPG. The Army had to have a Nuclear Regulatory Commission license to possess radioactive material at JPG, which was a munitions testing site. For the last 10 years JPG was in operation, from 1984 to 1994, munitions containing DU were tested there. As a heavy metal, depleted uranium is more dense than lead, and so it has both offensive and defensive uses for the U.S. military. Cladding a missile with DU can enable it to bore right through an enemy’s tanks and reinforced bunkers. Put on the outside of our own tanks can make them impenetrable by enemy weapons. There have been concern, however, around the world about depleted uranium and the health of soldiers and civilians exposed to DU in reinforced tanks that get hit by enemy fire or exposed to the depleted uranium left behind. http://www.madisoncourier.com/main.asp?SectionID=4&SubSectionID=253&ArticleID=31145&TM=57803.59, 326597=7/19/2006 3:00:00 PM Email this article • Print this article Huntington wants depleted uranium testing extended Peggy Vlerebome Courier Staff Writer Five years of collecting data on depleted uranium would not be nearly long enough before the federal Nuclear Regulatory Commission decides whether to allow the Army to decommission Jefferson Proving Ground, Mayor Al Huntington said in a letter Tuesday to the federal agency. “Protection against airborne and surface water migration of potential hazardous chemicals must be assured by expanding the testing period to a minimum of 25 years and expanding the JPG DU testing area with more monitoring wells to the west and southwest,” Huntington wrote. “This concern for human safety is supported by a study at Northern Arizona University which finds that depleted uranium can cause genetic mutations.” His letter was read by city official Betsey Vonderheide at a listening session conducted in Madison by a three-member panel of the Atomic Safety and Licensing Board, which is part of the Nuclear Regulatory Commission. The three-member panel was in Madison primarily for a conference today with attorneys from the NRC staff, the Army and Save the Valley environmental organization to talk about issues Save the Valley has raised in challenging the Army’s request to be given five years to collect data before it seeks decommissioning of JPG. Munitions containing depleted uranium were tested at JPG between 1984 and 1994. The conference today was at City Hall and was open to the public to observe but not participate. The panel will be back in Madison for a public hearing on whichever issues are approved for consideration. The date has not been set. Eighteen people attended the half-hour listening session at the Madison-Jefferson County Public Library. At least half of them are involved in the issue, representing Save the Valley, the Army, the NRC staff and the contractors who work for the Army doing monitoring and studies. The Army had to have an NRC license in order to use depleted uranium at the testing site. Depleted uranium is left over after uranium is processed such as for nuclear power plant fuel. Depleted uranium is radioactive and toxic, and the study Huntington referred to said that DU also can alter DNA. Only two other people spoke at the listening session. They were Joel Wientke, representing the Hoosier Environmental Council, and Joe Robb, refuge manager at the Big Oaks National Wildlife Refuge. Wientke said there are a lot of unanswered questions about the Army’s plans at JPG. Robb said it is good a lot of information is being gathered, because the more data there is, the better decisions can be made. Huntington’s letter also said the Army “must guarantee sufficient appropriations to fund all aspects of the DU liability.” Otherwise, he wrote, problems “ will become the financial burden” of the federal Environmental Protection Agency, the Nuclear Regulatory Commission and the Indiana Department of Environmental Management. The listening session was more informal than the NRC panel is accustomed to. Chairman Alan Rosenthal said he and panel members Paul Abramson and Richard F. Cole were in shirtsleeves in deference to the extreme heat. Ordinarily, he said, they wear suits — “ usually dark suits,” he added with a laugh — and ties. http://www.madisoncourier.com/main.asp?SectionID=4&SubSectionID=253&ArticleID=31163&TM=54285.98, 1431=VIDEO: LEUREN MORET: CONNECTING THE DOTS 9-11 Four Years Later From The A-Bomb To Depleted Uranium And Beyond Geoscientist and radiation expert Leuren Moret This documentary is part of a presentation for Therapists For Social Responsibility in Sacramento, California, on September 11, 2005. http://johnmccarthy90066.tripod.com/id693.html, 14161=Thu Feb 8, 2007 20:07, 226090=A U.N. study names the five most serious environmental hot spots in Iraq. Working with Iraq to clean up contaminated sites throughout the country, The United Nations has released the findings of a study of environmental hot spots. There are five top areas of concern. The most seriously contaminated site found to date is an industrial metal plating facility south of Baghdad that is contaminated with numerous types of hazardous waste, including several tons of cyanide compounds. U.N. environmental officials have secured $900,000 for the cleanup and hope to use some of the funds for at least one of the other top priority spots. U.N. officials warn that the five locales identified in their report released Nov. 10 are likely the tip of the iceberg in terms of environmental hot spots. The country has a significant legacy of contaminated and derelict industrial and military sites, the report says. The report also states that destruction of the Iraqi military arsenal is creating new contamination and hazardous waste problems at scrap yards and munitions dumps that could be better managed through improved working practices. The U.N. estimates that $40 million would be necessary to address all the issues contained in its report. Unfortunately, this first report doesn't seem to address the problem of radioactive waste from US missiles and munitions carrying so-called depleted uranium, or DU. For more news on hazardous waste, in America and many parts of the world, check the daily headlines at wastenews.com http://www.podzy.com/podcasts/Arts?&offset=30, 238716=The health hazards of depleted uranium munitions-Part 1 (Full Report) http://www.royalsoc.ac.uk/document.asp?tip=1&id=1431, 62575=The use of white phosphorous as a weapon against civilians and the use of thousands of metric tons of DU could thus be prosecuted as war crimes under the 1996 Act.  Such actions -- especially when taken together with the numerous war crimes discussed previously -- could provide the basis for imposing life sentences or even the death penalty against the high-level U.S. officials who ordered, condoned or covered up such crimes, including those who provided the philosophical framework which allowed such crimes to occur., 8478=Air Force Colonel Accused of Abuse over Uranium Weapons Coverup by Bob Nichols, Project Censored Award Winner Tuesday, Apr 12 2005, 11:45pm bobnichols@cox.net  address: http://www.axisoflogic.com/artman/publish/article_16798.shtml national / war - militarism / news analysis - opinion Rokke: \"Helbig! Yes or No?\" \"Individuals on web sites throughout the United States have complained over a period of months about the abusive and aggressive actions of an Air Force Lieut. Colonel named Roger Helbig,\" stated Project Censored Award Winning writer Bob Nichols. by Dr. Doug Rokke, US Army Ret., and Bob Nichols, Project Censored Award Winner (Oklahoma City) \"Individuals on web sites throughout the United States have complained over a period of months about the abusive and aggressive actions of an Air Force Lieut. Colonel named Roger Helbig,\" stated Project Censored Award Winning writer Bob Nichols. \"Col. Helbig has consistently misrepresented himself and his participation, voluntarily or on a paid basis, as a 'minder' or enforcer for the DOD 'lie' about Uranium Munitions in direct contravention of US Army Regulations and Orders,\" Nichols stated. \"Col. Helbig apparently is fervently following the Secret Los Alamos Memo about Uranium Weapons (UW), aka so-called 'Depleted Uranium,' instructing personnel to lie about Uranium Weapons to maintain the political viability of the continued use of the Genocidal Weapons: \"weaponized radioactive and poisonous ceramic uranium oxide gas and dust\" in Iraq and throughout Central Asia,\" added Nichols. http://traprockpeace.org/twomemos.html Nichols stated \"Dr. Doug Rokke, Ph.D., is the former Army Officer in charge of the Pentagon's Depleted Uranium Project. Dr Rokke is a career officer, loyal to the Constitution of the United States of America, not to any political party. He is the man the people of the United States can turn to for 'on the level information' about the true nature of Uranium Weapons (UW.)\" Dr. Rokke commented \"LTC Roger Helbig, United States Air Force: I would suggest that since you claim to be so knowledgeable about DU and my specific activities during Gulf War 1 and while I was the Director of the U.S. Army Depleted Uranium that you produce the actual official documents, not some comments by Bob Cherry or Ed Battle or Mike Kilpatrick, your bosses up the line, verifying your comments.\" Rokke added \"Unless you can do so, please cease and go away. But before you go away you still have not answered; why you, as an United States Air Force officer, refuse to support my / our actions to ensure that United States Department of Defense officials provide medical care to all DU casualties and clean up all environmental contamination as required by AR 700-48 and TB 9-1300-278; and, that medical care is provided to all DU casualties as required by Lt General Ron Peake's April 29, 2004 order.\" http://traprockpeace.org/depleted_uranium_regs.html Will you provide us a public endorsement supporting full compliance of these mandatory actions? \"Yes\" or \"No\"? Dr. Rokke concluded \"It is time for you to decide. The question is not about me; but, whether or not United States Department of Defense personnel comply with their own requirements to provide medical care and clean up all environmental contamination as specified in AR 700-48, TB 9-1300-278, and all of the orders mandating medical care for DU casualties.\" More news as it develops on Uranium Weapons. (c)Axis of Logic [End.] http://www.okimc.org/newswire.php?story_id=713&type=newsanalysisopinion&language=all&results_offset=200, 62217=According to a August 2002 report by the UN subcommission, laws which are breached by the use of DU shells include the four Geneva Conventions of 1949., 120459=Learn About Depleted Uranium From The US Army's Expert on Depleted Uranium (DU) : Nuclear Holocaust and The Politics of Radiation http://www.mindfully.org/Nucs/2003/Rokke-Depleted-Uranium-DU21apr03.htm, 7215= full review: http://www.greenleft.org.au/back/2001/442/442p24b.htm further info: http://www.cadu.org.uk/ http://news.bbc.co.uk/1/hi/in_depth/europe/2001/depleted_uranium/ http://www.who.int/mediacentre/factsheets/fs257/en/, 168145=Lebanon to Present Files to UN on Israel's Use of DU Weapons Lebanon will inform the United Nations about Israel's use of depleted uranium (DU) weapons in south Lebanon, the National News Agency NNA reported on Friday. Foreign Minister Mahmoud Hammoud has instructed Lebanese permanent representative to the U.N. Salim Tadmali to contact with concerned U.N. institutes to present files on Israel's use of DU warheads in south Lebanon. Israel invaded Lebanon in 1978 and set up a so-called security zone in south Lebanon in 1985 to allegedly protect its northern areas from attacks by Lebanese Muslim guerrillas. The Jewish state withdrew its occupation troops from Lebanon last May. Steffan de Mistura, the new personal representative of U.N. Secretary General Kofi Annan for south Lebanon, said on Thursday that the world organization was very concerned about the issue. \"We will make investigations on the ground in the south and compare results with those from Europe and Iraq,\" de Mistura said in Beirut. \"If we find that the results were caused by DU weapons, we will make an announcement immediately as it would be a serious matter,\" he added. The Lebanese government was verifying reports that cases of cancer among south Lebanon's 1 million people have increased considerably possibly as a result of Israel's use of DU weapons. Blood cancer cases have trebled among the population of south Lebanon over the past four years, the official NNA said, quoting a report by a hospital in the southern city of Sidon. Israel has admitted limited use of DU weapons during its military occupation of south Lebanon. http://english.people.com.cn/english/200101/20/eng20010120_60955.html, 227892=John Hanchette, a journalism professor at St. Bonaventure University, and one of the founding editors of USA TODAY related the following to Depleted Uranium Dust researcher Leuren Moret. He stated that he had prepared news breaking stories about the effects of Depleted Uranium Dust on Gulf War soldiers and Iraqi citizens, but that each time he was ready to publish, he received a phone call from the Pentagon asking him not to print the story. He has since been replaced as editor of USA TODAY. According to an October 2004 Dispatch from the Italian Military Health Observatory, a total of 109 Italian soldiers have died thus far due to exposure to depleted uranium. A spokesman at the Military Health Observatory, Domenico Leggiero, states \"The total of 109 casualties exceeds the total number of persons dying as a consequence of road accidents. Anyone denying the significance of such data is purely acting out of ill faith, and the truth is that our soldiers are dying out there due to a lack of adequate protection against depleted uranium\". Members of the Observatory have petitioned for an urgent hearing \"in order to study effective prevention and safeguard measures aimed at reducing the death-toll amongst our serving soldiers\"., 122041=Charred bodies Bodies of Iraqi soldiers abandoned in the desert. Charred black by fires ignited by depleted uranium projectiles, they look all too familiar to those of us who have seen the A-bomb Memorial Museum in Hiroshima. (Courtesy of Carol Picou, taken February 1991 in southern Iraq) Click to view larger picture (54K) http://www.chugoku-np.co.jp/abom/uran/special/index2.html, 118153=Some pictures are classified because they reveal the secret ways the United States wages war. http://www.nytimes.com/2004/04/24/politics/24PHOT.html?ex=1398139200&en=61b6f8b9749b1c66&ei=5007&partner=USERLAND, 208466=Warning of uranium contamination risks to NGO staff, Coalition forces, foreign contract personnel and civilians in Iraq  http://www.umrc.net/UMRC_bulletin_07_Feb_2004.asp , 149250=August 18, 2003--Has U.S. use of depleted-uranium weapons turned Iraq into a radioactive danger area for both Iraqis and occupation troops?, 33398=Associated Press 10:20 AM Aug, 12, 2006 NEW YORK -- It takes at least 10 minutes and a large glass of orange juice to wash down all the pills -- morphine, methadone, a muscle relaxant, an antidepressant, a stool softener. Viagra for sexual dysfunction. Valium for his nerves. Four hours later, Herbert Reed will swallow another 15 mg of morphine to cut the pain clenching every part of his body. He will do it twice more before the day is done. Since he left a bombed-out train depot in Iraq, his gums bleed. There is more blood in his urine, and still more in his stool. Bright light hurts his eyes. A tumor has been removed from his thyroid. Rashes erupt everywhere, itching so badly they seem to live inside his skin. Migraines cleave his skull. His joints ache, grating like door hinges in need of oil. There is something massively wrong with Herbert Reed, though no one is sure what it is. He believes he knows the cause, but he cannot convince anyone caring for him that the military's new favorite weapon has made him terrifyingly sick. In the sprawling bureaucracy of the Department of Veterans Affairs, he has many caretakers. An internist, a neurologist, a pain-management specialist, a psychologist, an orthopedic surgeon and a dermatologist. He cannot function without his stupefying arsenal of medications, but they exact a high price. \"I'm just a zombie walking around,\" he says. Reed believes depleted uranium has contaminated him and his life. He now walks point in a vitriolic war over the Pentagon's arsenal of it -- thousands of shells and hundreds of tanks coated with the metal that is radioactive, chemically toxic, and nearly twice as dense as lead. A shell coated with depleted uranium pierces a tank like a hot knife through butter, exploding on impact into a charring inferno. As tank armor, it repels artillery assaults. It also leaves behind a fine radioactive dust with a half-life of 4.5 billion years. Depleted uranium is the garbage left from producing enriched uranium for nuclear weapons and energy plants. It is 60 percent as radioactive as natural uranium. The United States has an estimated 1.5 billion pounds of it, sitting in hazardous waste storage sites across the country. Meaning it is plentiful and cheap as well as highly effective. Reed says he unknowingly breathed DU dust while living with his unit in Samawah, Iraq. He was med-evaced out in July 2003, nearly unable to walk because of lightning-strike pains from herniated discs in his spine. Then began a strange series of symptoms he'd never experienced in his previously healthy life. At Walter Reed Army Medical Center in Washington, D.C, he ran into a buddy from his unit. And another, and another, and in the tedium of hospital life between doctor visits and the dispensing of meds, they began to talk. \"We all had migraines. We all felt sick,\" Reed says. \"The doctors said, 'It's all in your head.' \" Then the medic from their unit showed up. He too, was suffering. That made eight sick soldiers from the 442nd Military Police, an Army National Guard unit made up of mostly cops and correctional officers from the New York area. But the medic knew something the others didn't. Dutch marines had taken over the abandoned train depot dubbed Camp Smitty, which was surrounded by tank skeletons, unexploded ordnance and shell casings. They'd brought radiation-detection devices. The readings were so hot, the Dutch set up camp in the middle of the desert rather than live in the station ruins. \"We got on the Internet,\" Reed said, \"and we started researching depleted uranium.\" Then they contacted The New York Daily News, which paid for sophisticated urine tests available only overseas. Then they hired a lawyer. Reed, Gerard Matthew, Raymond Ramos, Hector Vega, Augustin Matos, Anthony Yonnone, Jerry Ojeda and Anthony Phillip all have depleted uranium in their urine, according to tests done in December 2003, while they bounced for months between Walter Reed and New Jersey's Fort Dix medical center, seeking relief that never came. The analyses were done in Germany, by a Frankfurt professor who developed a depleted uranium test with Randall Parrish, a professor of isotope geology at the University of Leicester in Britain. The veterans, using their positive results as evidence, have sued the U.S. Army, claiming officials knew the hazards of depleted uranium, but concealed the risks. The Department of Defense says depleted uranium is powerful and safe, and not that worrisome. Four of the highest-registering samples from Frankfurt were sent to the VA. Those results were negative, Reed said. \"Their test just isn't as sophisticated,\" he said. \"And when we first asked to be tested, they told us there wasn't one. They've lied to us all along.\" The VA's testing methodology is safe and accurate, the agency says. More than 2,100 soldiers from the current war have asked to be tested; only eight had DU in their urine, the VA said. The term depleted uranium is linguistically radioactive. Simply uttering the words can prompt a reaction akin to preaching atheism at tent revival. Heads shake, eyes roll, opinions are yelled from all sides. \"The Department of Defense takes the position that you can eat it for breakfast and it poses no threat at all,\" said Steve Robinson of the National Gulf War Resource Center, which helps veterans with various problems, including navigating the labyrinth of VA health care. \"Then you have far-left groups that ... declare it a crime against humanity.\" Several countries use it as weaponry, including Britain, which fired it during the 2003 Iraq invasion. An estimated 286 tons of DU munitions were fired by the United States in Iraq and Kuwait in 1991. An estimated 130 tons were shot toppling Saddam Hussein. Depleted uranium can enter the human body by inhalation, the most dangerous method; by ingesting contaminated food or eating with contaminated hands; by getting dust or debris in an open wound, or by being struck by shrapnel, which often is not removed because doing so would be more dangerous than leaving it. Inhaled, it can lodge in the lungs. As with imbedded shrapnel, this is doubly dangerous -- not only are the particles themselves physically destructive, they emit radiation. A moderate voice on the divisive DU spectrum belongs to Dan Fahey, a doctoral student at the University of California at Berkeley, who has studied the issue for years and also served in the Gulf War before leaving the military as a conscientious objector. \"I've been working on this since '93 and I've just given up hope,\" he said. \"I've spoken to successive federal committees and elected officials ... who then side with the Pentagon. Nothing changes.\" At the other end are a collection of conspiracy-theorists and internet proselytizers who say using such weapons constitutes genocide. Two of the most vocal opponents recently suggested that a depleted-uranium missile, not a hijacked jetliner, struck the Pentagon in 2001. \"The bottom line is it's more hazardous than the Pentagon admits,\" Fahey said, \"but it's not as hazardous as the hard-line activist groups say it is. And there's a real dearth of information about how DU affects humans.\" There are several studies on how it affects animals, though their results are not, of course, directly applicable to humans. Military research on mice shows that depleted uranium can enter the bloodstream and come to rest in bones, the brain, kidneys and lymph nodes. Other research in rats shows that DU can result in cancerous tumors and genetic mutations, and pass from mother to unborn child, resulting in birth defects. Iraqi doctors reported significant increases in birth defects and childhood cancers after the 1991 invasion. Iraqi authorities \"found that uranium, which affected the blood cells, had a serious impact on health: The number of cases of leukemia had increased considerably, as had the incidence of fetal deformities,\" the U.N. reported. Depleted uranium can also contaminate soil and water, and coat buildings with radioactive dust, which can by carried by wind and sandstorms. In 2005, the U.N. Environmental Program identified 311 polluted sites in Iraq. Cleaning them will take at least $40 million and several years, the agency said. Nothing can start until the fighting stops. Fifteen years after it was first used in battle, there is only one U.S. government study monitoring veterans exposed to depleted uranium. Number of soldiers in the survey: 32. Number of soldiers in both Iraq wars: more than 900,000. The study group's size is controversial -- far too small, say experts including Fahey -- and so are the findings of the voluntary, Baltimore-based study. It has found \"no clinically significant\" health effects from depleted uranium exposure in the study subjects, according to its researchers. Critics say the VA has downplayed participants' health problems, including not reporting one soldier who developed cancer, and another who developed a bone tumor. So for now, depleted uranium falls into the quagmire of Gulf War Syndrome, from which no treatment has emerged despite the government's spending of at least $300 million. About 30 percent of the 700,000 men and women who served in the first Gulf War still suffer a baffling array of symptoms very similar to those reported by Reed's unit. Depleted uranium has long been suspected as a possible contributor to Gulf War Syndrome, and in the mid-90s, veterans helped push the military into tracking soldiers exposed to it. But for all their efforts, what they got in the end was a questionnaire dispensed to homeward-bound soldiers asking about mental health, nightmares, losing control, exposure to dangerous and radioactive chemicals. But, the veterans persisted, how would soldiers know they'd been exposed? Radiation is invisible, tasteless, and has no smell. And what exhausted, homesick, war-addled soldier would check a box that would only send him or her to a military medical center to be poked and prodded and questioned and tested? It will take years to determine how depleted uranium affected soldiers from this war. After Vietnam, veterans, in numbers that grew with the passage of time, complained of joint aches, night sweats, bloody feces, migraine headaches, unexplained rashes and violent behavior; some developed cancers. It took more than 25 years for the Pentagon to acknowledge that Agent Orange -- a corrosive defoliant used to melt the jungles of Vietnam and flush out the enemy -- was linked to those sufferings. It took 40 years for the military to compensate sick World War II vets exposed to massive blasts of radiation during tests of the atomic bomb. In 2002, Congress voted to not let that happen again. It established the Research Advisory Committee on Gulf War Veterans' Illnesses -- composed of scientists, physicians and veterans' advocates. It reports to the secretary of Veterans Affairs. Its mandate is to judge all research and all efforts to treat Gulf War Syndrome patients against a single standard: Have sick soldiers been made better? The answer, according to the committee, is no. \"Regrettably, after four years of operation neither the Committee nor (the) VA can report progress toward this goal,\" stated its December 2005 report. \"Research has not produced effective treatments for these conditions nor shown that existing treatments are significantly effective.\" And so time marches on, as do soldiers going to, and returning from, the deserts of Iraq. Herbert Reed is an imposing man, broad shouldered and tall. He strides into the VA Medical Center in the Bronx with the presence of a cop or a soldier. Since the Vietnam War, he has been both. His hair is perfect, his shirt spotless, his jeans sharply creased. But there is something wrong, a niggling imperfection made more noticeable by a bearing so disciplined. It is a limp -- more like a hitch in his get-along. It is the only sign, albeit a tiny one, that he is extremely sick. Even sleep offers no release. He dreams of gunfire and bombs and soldiers who scream for help. No matter how hard he tries, he never gets there in time. At 54, he is a veteran of two wars and a 20-year veteran of the New York Police Department, where he last served as an assistant warden at the Riker's Island prison. He was in perfect health, he says, before being deployed to Iraq. According to military guidelines, he should have heard the words depleted uranium long before he ended up at Walter Reed. He should have been trained about its dangers, and how to avoid prolonged exposure to its toxicity and radioactivity. He says he didn't get anything of the kind. Neither did other reservists and National Guard soldiers called up for the current war, according to veterans' groups. Reed and the seven brothers from his unit hate what has happened to them, and they speak of it at public seminars and in politicians' offices. It is something no VA doctor can explain; something that leaves them feeling like so many spent shell rounds, kicked to the side of battle. But for every outspoken soldier like them, there are silent veterans like Raphael Naboa, an Army artillery scout who served 11 months in the northern Sunni Triangle, only to come home and fall apart. Some days he feels fine. \"Some days I can't get out of bed,\" he said from his home in Colorado. Now 29, he's had growths removed from his brain. He has suffered a small stroke -- one morning he was shaving, having put down the razor to rinse his face. In that moment, he blacked out and pitched over. \"Just as quickly as I lost consciousness, I regained it,\" he said. \"Except I couldn't move the right side of my body.\" After about 15 minutes, the paralysis ebbed. He has mentioned depleted uranium to his VA doctors, who say he suffers from a series of \"non-related conditions.\" He knows he was exposed to DU. \"A lot of guys went trophy-hunting, grabbing bayonets, helmets, stuff that was in the vehicles that were destroyed by depleted uranium. My guys were rooting around in it. I was trying to get them out of the vehicles.\" No one in the military talked to him about depleted uranium, he said. His knowledge, like Reed's, is self-taught from the internet. Unlike Reed, he has not gone to war over it. He doesn't feel up to the fight. There is no known cure for what ails him, and so no possible victory in battle. He'd really just like to feel normal again. And he knows of others who feel the same. \"I was an artillery scout, these are folks who are in pretty good shape. Your Rangers, your Special Forces guys, they're in as good as shape as a professional athlete. \"Then we come back and we're all sick.\" They feel like men who once were warriors and now are old before their time, with no hope for relief from a multitude of miseries that has no name. http://www.wired.com/news/wireservice/0,71585-0.html?tw=wn_index_7, 348478=Teeshirts with large logo printing are relatively cheap at say $6.50 each plus a one time setup fee. Printing back and front gets attention at malls, stores, walking, working.... the message gets out! Ralph Charles Whitley, Sr. a decorated Veteran of One 4532 W. Kennedy Blvd. PMB-276 Tampa, Florida 33609-2042 backflow.prevention@verizon.net, 80829=Depleted Uranium Situation Worsens Requiring Immediate Action By President Bush, Prime Minister Blair, and Prime Minister Olmert Dr. Doug Rokke, PhD., former Director, U.S. Army Depleted Uranium project July 24, 2006 The delivery of at least 100 GBU 28 bunker busters bombs containing depleted uranium warheads by the United States to Israel for use against targets in Lebanon will result in additional radioactive and chemical toxic contamination with consequent adverse health and environmental effects throughout the middle east. Today, U.S., British, and now Israeli military personnel are using illegal uranium munitions- America's and England's own \"dirty bombs\" while U.S. Army, U.S. Department of Energy, U.S. Department of Defense, and British Ministry of Defence officials deny that there are any adverse health and environmental effects as a consequence of the manufacture, testing, and/or use of uranium munitions to avoid liability for the willful and illegal dispersal of a radioactive toxic material - depleted uranium. The use of uranium weapons is absolutely unacceptable, and a crime against humanity. Consequently the citizens of the world and all governments must force cessation of uranium weapons use. I must demand that Israel now provide medical care to all DU casualties in Lebanon and clean up all DU contamination. U.S. and British officials have arrogantly refused to comply with their own regulations, orders, and directives that require United States Department of Defense officials to provide prompt and effective medical care to \"all\" exposed individuals. Reference: Medical Management of Unusual Depleted Uranium Casualties, DOD, Pentagon, 10/14/93, Medical Management of Army personnel Exposed to Depleted Uranium (DU) Headquarters, U.S. Army Medical Command 29 April 2004, and section 2-5 of U.S. Army Regulation 700-48. Israeli officials must not do so now. They also refuse to clean up dispersed radioactive Contamination as required by Army Regulation- AR 700-48: \"Management of Equipment Contaminated With Depleted Uranium or Radioactive Commodities\" (Headquarters, Department Of The Army, Washington, D.C., September 2002) and U.S. Army Technical Bulletin- TB 9-1300-278: \"Guidelines For Safe Response To Handling, Storage, And Transportation Accidents Involving Army Tank Munitions Or Armor Which Contain Depleted Uranium\" (Headquarters, Department Of The Army, Washington, D.C., JULY 1996). Specifically section 2-4 of United States Army Regulation-AR 700-48 dated September 16, 2002 requires that: (1) \"Military personnel \"identify, segregate, isolate, secure, and label all RCE\" (radiologically contaminated equipment). (2) \"Procedures to minimize the spread of radioactivity will be implemented as soon as possible.\" (3) \"Radioactive material and waste will not be locally disposed of through burial, submersion, incineration, destruction in place, or abandonment\" and (4) \"All equipment, to include captured or combat RCE, will be surveyed, packaged, retrograded, decontaminated and released IAW Technical Bulletin 9-1300-278, DA PAM 700-48\" (Note: Maximum exposure limits are specified in Appendix F). The previous and current use of uranium weapons, the release of radioactive components in destroyed U.S. and foreign military equipment, and releases of industrial, medical, research facility radioactive materials have resulted in unacceptable exposures. Therefore, decontamination must be completed as required by U.S. Army Regulation 700-48 and should include releases of all radioactive materials resulting from military operations. The extent of adverse health and environmental effects of uranium weapons contamination is not limited to combat zones but includes facilities and sites where uranium weapons were manufactured or tested including Vieques; Puerto Rico; Colonie, New York; Concord, MA; Jefferson Proving Grounds, Indiana; and Schofield Barracks, Hawaii. Therefore medical care must be provided by the United States Department of Defense officials to all individuals affected by the manufacturing, testing, and/or use of uranium munitions. Thorough environmental remediation also must be completed without further delay. I am amazed that fifteen years after was I asked to clean up the initial DU mess from Gulf War 1 and over ten years since I finished the depleted uranium project that United States Department of Defense officials and others still attempt to justify uranium munitions use while ignoring mandatory requirements. I am dismayed that Department of Defense and Department of Energy officials and representatives continue personal attacks aimed to silence or discredit those of us who are demanding that medical care be provided to all DU casualties and that environmental remediation is completed in compliance with U.S. Army Regulation 700-48. But beyond the ignored mandatory actions the willful dispersal of tons of solid radioactive and chemically toxic waste in the form of uranium munitions is illegal ( http://www.traprockpeace.org/karen_parker_du_illegality.pdf  ) and just does not even pass the common sense test and according to the U.S. Department of Homeland Security, DHS, is a dirty bomb. DHS issued \"dirty bomb\" response guidelines, http://www.access.gpo.gov/su_docs/aces/fr-cont.html , on January 3, 2006 for incidents within the United States but ignore DOD use of uranium weapons and existing DOD regulations. These guidelines specifically state that: \"Characteristics of RDD and IND Incidents: A radiological incident is defined as an event or series of events, deliberate or accidental, leading to the release, or potential release, into the environment of radioactive material in sufficient quantity to warrant consideration of protective actions. Use of an RDD or IND is an act of terror that produces a radiological incident.\" Thus the use of uranium munitions is \"an act or terror\" as defined by DHS. Finally continued compliance with the infamous March 1991 Los Alamos Memorandum that was issued to ensure continued use of uranium munitions can not be justified. In conclusion: the President of the United States- George W. Bush, the Prime Minister of Great Britain-Tony Blair, and the Prime Minister of Israel Olmert must acknowledge and accept responsibility for willful use of illegal uranium munitions- their own \"dirty bombs\"- resulting in adverse health and environmental effects. President Bush, Prime Minister Blair, and Prime Minister Olmert should order: 1. medical care for all casualties, 2. thorough environmental remediation, 3. immediate cessation of retaliation against all of us who demand compliance with medical care and environmental remediation requirements, 4. and stop the already illegal the use (UN finding) of depleted uranium munitions. References- these references are copies the actual regulations and orders and other pertinent official documents: http://www.traprockpeace.org/twomemos.html http://www.traprockpeace.org/rokke_du_3_ques.html http://www.traprockpeace.org/du_dtic_wakayama_Aug2002.html http://www.traprockpeace.org/karen_parker_du_illegality.pdf http://www.access.gpo.gov/su_docs/aces/fr-cont.html http://cryptome.org/dhs010306.txt http://www.uruknet.info/?p=m25045&hd=0&size=1&l=e, 51927=Democracy Now! Lebanese President Accuses Israel of Using White Phosphorus Bombs in Lebanon July 25, 2006 Independent journalist Dahr Jamail, who exposed how the U.S. used white phosphorus bombs in Iraq, says Israel is using the same tactic in Lebanon. We speak to him in Beirut. While Human Rights Watch is accusing Israel of using cluster bombs, the Lebanese president Emile Lahoud says Israel is also using white phosphorus. Lebanese doctors have reported witnessing the effects of white phosphorus on their patients. Independent journalist is in Beirut and has spoken to some of those doctors. Audio: http://www.apfn.org/audio/dn2006-0725-1_64kb.mp3 http://www.democracynow.org/article.pl?sid=06/07/25/1442242, 293190=Death By Slow Burn - How America Nukes Its Own Troops What 'Support Our Troops' Really Means By Amy Worthington The Idaho Observer 4-16-3 On March 30, an AP photo featured an American pro-war activist holding a sign: \"Nuke the evil scum, it worked in 1945!\" That's exactly what George Bush has done. America's mega-billion dollar war in Iraq has been indeed a NUCLEAR WAR. Bush-Cheney have delivered upon 17 million Iraqis tons of depleted uranium (DU) weapons, a \"liberation\" gift that will keep on giving. Depleted uranium is a component of toxic nuclear waste, usually stored at secure sites. Handlers need radiation protection gear. Over a decade ago, war-makers decided to incorporate this lethal waste into much of the Pentagon's weaponry. Navy ships carrying Phalanx rapid fire guns are capable of firing thousands of DU rounds per minute.1 Tomahawk missiles launched from U.S. ships and subs are DU-tipped.2 The M1 Abrams tanks are armored with DU.3 These and British Challenger II tanks are tightly packed with DU shells, which continually irradiate troops in or near them.4 The A-10 \"tank buster\" aircraft fires DU shells at machines and people on the battlefield.5 DU munitions are classified by a United Nations resolution as illegal weapons of mass destruction. Their use breaches all international laws, treaties and conventions forbidding poisoned weapons calculated to cause unnecessary suffering. Ironically, support for our troops will extend well beyond the war in Iraq. Americans will be supporting Gulf War II veterans for years as they slowly and painfully succumb to radiation poisoning. U.S and British troops deployed to the area are the walking dead. Humans and animals, friends and foes in the fallout zone are destined to a long downhill spiral of chronic illness and disability. Kidney dysfunction, lung damage, bloody stools, extreme fatigue, joint pain, unsteady gait, memory loss and rashes and, ultimately, cancer and premature death await those exposed to DU. Award-winning journalist Will Thomas wrote: \"As the last Gulf conflict so savagely demonstrated, GI immune systems reeling from multiple doses of experimental vaccines offer little defense against further exposure to chemical weapons, industrial toxins, stress, caffeine, insect repellent and radiation leftover from the last war. This is a war even the victors will lose.\"6 When a DU shell is fired, it ignites upon impact. Uranium, plus traces of plutonium and americium, vaporize into tiny, ceramic particles of radioactive dust. Once inhaled, uranium oxides lodge in the body and emit radiation indefinitely. A single particle of DU lodged in a lymph node can devastate the entire immune system according to British radiation expert Roger Coghill.7 The Royal Society of England published data showing that battlefield soldiers who inhale or swallow high levels of DU can suffer kidney failure within days.8 Any soldier now in Iraq who has not inhaled lethal radioactive dust is not breathing. In the first two weeks of combat, 700 Tomahawks, at a cost of $1.3 million each, blasted Iraqi real estate into radioactive mushroom clouds.9 Millions of DU tank rounds liter the terrain. Cleanup is impossible because there is no place on the planet to put so much contaminated debris. Bush Sr.'s Gulf War I was also a nuclear war. 320 tons of depleted uranium were used against Iraq in 1991.10 A 1998 report by the U.S. Agency for Toxic Substances confirms that inhaling DU causes symptoms identical to those claimed by many sick vets with Gulf War Syndrome.11 The Gulf War Veterans Association reports that at least 300,000 Gulf War I vets have now developed incapacitating illnesses.12 To date, 209,000 vets have filed claims for disability benefits based on service-connected injuries and illnesses from combat in that war.13 Dr. Asaf Durakovic, a professor of nuclear medicine at Georgetown University, is a former army medical expert. He told nuclear scientists in Paris last year that tens of thousands of sick British and American soldiers are now dying from radiation they encountered during Gulf War I. He found that 62 percent of sick vets tested have uranium isotopes in their organs, bones, brains and urine.14 Laboratories in Switzerland and Finland corroborated his findings. In other studies, some sick vets were found to be expressing uranium in even their semen. Their sexual partners often complained of a burning sensation during intercourse, followed by their own debilitating illnesses.15 Nothing compares to the astronomical cancer rates and birth defects suffered by the Iraqi people who have endured vicious nuclear chastisement for years.16 U.S. air attacks against Iraq since 1993 have undoubtedly employed nuclear munitions. Pictures of grotesquely deformed Iraqi infants born since 1991 are overwhelming.17 Like those born to Gulf War I vets, many babies born to troops now in Iraq will also be afflicted with hideous deformities, neurological damage and/or blood and respiratory disorders.18 As an Army health physicist, Dr. Doug Rokke was dispatched to the Middle East to salvage DU-contaminated tanks after Gulf War I. His Geiger counters revealed that the war zones of Iraq and Kuwait were contaminated with up to 300 millirems an hour in beta and gamma radiation plus thousands to millions of counts per minute in alpha radiation. Rokke recently told the media: \"The whole area is still trashed. It is hotter than heck over there still. This stuff doesn't go away.\"19 DU remains \"hot\" for 4.5 billion years. Radiation expert Dr. Helen Caldicott confirms that the dust-laden winds of DU-contaminated war zones \"will remain effectively radioactive for the rest of time.\"20 The murderous dust storms which ensnared coalition troops during the first few days of the current invasion are sure to have significant health consequences. Rokke and his clean-up team were issued only flimsy dust masks for their dangerous work. Of the 100 people on Rokke's decontamination team, 30 have already \"dropped dead.\" Rokke himself is ill with radiation damage to lungs and kidneys. He has brain lesions, skin pustules, chronic fatigue, continual wheezing and painful fibromyalgia. Rokke warns that anyone exposed to DU should have adequate respiratory protection and special coveralls to protect their clothing because, he says, you can't get uranium particles off your clothing. The U.S. military insists that DU on the battlefield is not a problem. Colonel James Naughton of the U.S. Army Material Command recently told the BBC that complaints about DU \"had no medical basis.\"21 The military's own documents belie this. A 1993 Pentagon document warned that \"when soldiers inhale or ingest DU dust they incur a potential increase in cancer risk.\"22 A U.S. Army training manual requires anyone who comes within 25 meters of DU-contaminated equipment to wear respiratory and skin protection.23 The U.S. Army Environmental Policy Institute admitted: \"If DU enters the body, it has the potential to generate significant medical consequences.\"24 The Institute also stated that, if the troops were to realize what they had been exposed to, \"the financial implications of long-term disability payments and healthcare costs would be excessive.\"25 For pragmatic reasons, DOD chooses to lie and deny. Dr. Rokke confirms that the Pentagon lies about DU dangers and is criminally negligent for neglecting medical attention needed by DU-contaminated vets. He predicts that the numbers of American troops to be sickened by DU from Gulf War II will be staggering.26 As they gradually sicken and suffer a slow burn to their graves, the Pentagon will, as it did after Gulf War I, deny that their misery and death is a result of their tour in Iraq. Dr. Rokke's candor has cost him his career. Likewise, Dr. Durakovic's radiation studies on Gulf War I vets were not popular with U.S. officials. Dr. Durakovic was reportedly told his life was in danger if he continued his research. He left the U.S. to continue his research abroad.27 Naive young coalition soldiers now in Iraq are likely unaware of how deadly their battlefield environment is. Gulf War I troops were kept in ignorance. Soldiers handled DU fragments and some wore these lethal nuggets around their necks. A DU projectile emits more radiation in five hours than allowed in an entire year under civilian radiation exposure standards. \"We didn't know any better,\" Kris Kornkven told Nation magazine. \"We didn't find out until long after we were home that there even was such a thing as DU.\"28 George Bush's ongoing war in Afghanistan is also a nuclear war. Shortly after 9-11, the U.S. announced it would stockpile tactical nuclear weapons including small neutron bombs, nuclear mines and shells suited to commando warfare in Afghanistan.29 In late September, 2001, Bush and Russian president Vladimir Putin agreed that the U.S. would use tactical nuclear weapons in Afghanistan while Putin would employ nuclear weapons against the Chechnyans.30 Describing the Pentagon's B-61-11 burrowing nuke bomb, George Smith writes in the Village Voice: \"Built ram tough with a heavy metal casing for smashing through the earth and concrete, the B-61 explodes with the force of an estimated 340,000 tons of TNT. It is lots of bang for the buck, literally two apocalypse bombs in one, a boosted plutonium firecracker called the primary and a heavy hydrogen secondary for that good old-fashioned H-bomb fireball.\"31 Drought-stricken Afghanistan's underground water supply is now contaminated by these nuclear weapons.32 Experts with the Uranium Medical Research Center report that urine samples of Afghanis show the highest level of uranium ever recorded in a civilian population. Afghani soldiers and civilians are reported to have died after suffering intractable vomiting, severe respiratory problems, internal bleeding and other symptoms consistent with radiation poisoning. Dead birds still perched in trees are found partially melted with blood oozing from their mouths.33 Afghanistan's new president, Hamid Karzai, is a puppet installed by Washington. Under the protection of American soldiers, Karzai's regime is setting a new record for opium production. Both UN and U.S. reports confirm that the huge Afghani opium harvest of 2002 makes Afghanistan the world's leading opium producer.34 Thanks to nuclear weapons, Afghanistan is now safe for the Bush-Cheney narcotics industry.35 ABC News asserts that keeping the \"peace\" in Afghanistan will require decades of allied occupation.36 For years to come, \"peacekeepers\" will be eating, drinking and breathing the \"hot\" carcinogenic pollution they have helped the Pentagon inflict upon that nation for organized crime. As governor of Arkansas during the Iran-Contra era, Bill Clinton laundered $multi-millions in cocaine profits for then vice-president George Bush Sr.37 As a partner in the Bush family's notorious crime machine, President Clinton committed U.S. troops to NATO's campaign in the Balkans, a prime heroin production and trans-shipment area. DOD's campaign to control and reorganize the drug trade there for the Bush mafia was yet another nuclear project. For years, the U.S. and NATO fired DU missiles, bullets and shells across the Balkans, nuking the peoples of Serbia, Bosnia and Kosovo. As DU munitions were slammed into chemical plants, the environment became hideously toxic, also endangering the peoples of Albania, Macedonia, Greece, Italy, Austria and Hungary. By 1999, UN investigators reported that an estimated 12 tons of DU had caused irreparable damage to the Yugoslavian environment, with agriculture, livestock and air water, and public health all profoundly damaged.38 Scientists confirm that citizens of the Balkans are excreting uranium in their urine.39 In 2001, a Yugoslavian pathologist reported that hundreds of Bosnians have died of cancer from NATO's DU bombardment.40 Many NATO peacekeepers in the Balkans now suffer ill health. Their leukemias, cancers and other maladies are dubbed the \"Balkans Syndrome.\" Richard Coghill predicts that DU weapons used in Balkans campaign will result in at least 10,000 cases of fatal cancer.41 U.S. citizens at home are also paying a heavy price for criminal militarism gone mad. DOD is a pollution monster. The General Accounting Office (GAO) found 9,181 dangerous military sites in USA that will require $billions to rehabilitate. The GAO reports that DOD has been both slothful and deceitful in its clean-up obligations.42 The Pentagon is now pressing Congress to exempt it from all environmental laws so that it may pollute and poison free from liability.43 The Navy uses prime fishing grounds off the coast of Washington state to test fire DU ammunition. In January, Washington State Rep. Jim McDermott chastised the Navy: \"On one hand you have required soldiers to have DU safety training and to wear protective gear when handling DU...and submarines must stay clear of DU-contaminated waters. These policies indicate there is cause for concern....On the other hand the Department of Defense has repeatedly denied that DU poses any danger whatsoever. There has been no remorse about leaving tons of DU equipment in the soil in foreign countries, and there appears to be no remorse about leaving it in the waters of your own country.\"44 DU has been used in military practice maneuvers in Indiana, Florida, New Mexico, Massachusetts, Maryland and Puerto Rico. After the Navy tested DU weaponry on the Puerto Rican island of Vieques, one third of the island's population developed serious illness. Many people show high levels of uranium in their bodies. Hundreds have filed a class action suit against the Navy for $100 million, claiming DU contamination has caused widespread cancers.45 The Navy's Fallon Naval Air Station near Fallon, Nevada, is a quagmire of 26 toxic waste sites. It is also a target practice zone for DU bombs and missiles. Area residents report bizarre illnesses, including 17 children who have contracted leukemia within five years. A survey of groundwater in the Fallon area showed nearly half of area wells are contaminated with radioactive materials.46 The materials for DU weaponry have been processed mainly at three nuclear plants in Kentucky, Ohio and Tennessee, where workers handling uranium contaminated with plutonium have suffered for decades with cancers and debilitating maladies similar to Gulf War Syndrome.47 Emboldened by power-grabbing successes made possible by his administration's devious 9-11 project, President Bush asserts that the U.S. has the right to attack any nation it deems a potential threat. He told West Point in 2002, \"If we wait for threats to fully materialize, we will have waited too long.\"48 Thus, it is certain that Bush-Cheney future pre-emptive nuclear wars are lined up like idling jetson a runway. Both Cheney's Halliburton Corp. and the Bush family's Carlyle Group are profiteers in U.S. defense contracts, so endless war is just good business.49 The Washington Post reported that the Pentagon will create special nuclear weapons for use on North Korea's underground nuclear facilities.50 Next August, U.S. war makers will meet to consolidate plans for a new generation of \"mini,\" \"micro\" and \"tiny\" nuclear bombs and bunker busters. These will be added to the U.S. arsenal perhaps for use against non-nuclear third-world nations such as Iran, Syria, Lebanon.51 The solution? Americans must stop electing ruthless criminals to rule this nation. We must convince fellow citizens that villains like Saddam Hussein are made in the U.S. as rationale for endless corporate war profits. Saddam was placed in power by the CIA.52 For years U.S. government agencies, under auspices of George Bush Sr., supplied him with chemical and biological weapons.53 Our national nuclear laboratories, along with Unisys, Dupont and Hewlett-Packard, sold Saddam materials for his nuclear program.54 Dick Cheney was CEO of Halliburton in the late 90s when its subsidiaries signed $73 million in new contracts to further supply Saddam.55 The wicked villain of Iraq was nurtured for decades as a cash-cow by U.S. military-industrial piranhas. If America truly supports its troops, it must stop sending them into nuclear holocaust for the enrichment of thugs. Time is running out. If the DU-maniacs at the Pentagon and their coven of nuclear arms peddlers are not harnessed, America will have no able-bodied fighting forces left. All people of the earth will become grossly ill, hideously deformed and short- lived. We must succeed in the critical imperative to face reality and act decisively. Should we fail, there will be no place to hide from Bush-Cheney's merciless nuclear orgies yet to come or from the inevitable nuclear retaliation these orgies will surely breed. Endnotes 1.\"DOD Launches Depleted Uranium Training,\" Linda Kozaryn, American Forces Press Service, 8-13-99. 2.\"Nukes of the Gulf War,\"John Shirley, Zess@aol.com. See this article in archives at www.gulfwarvets.com . 3. BBC News, \"US To Use Depleted Uranium,\" March 18, 2003; U.S. General Accounting Office, Operation Desert Storm: \"Early Performance Assessment of Bradley and Abrams,\" 1-2-92. 4.\"Nukes of the Gulf War,\" op. cit. 5. Ibid. 6. \"Invading Hiroshima,\" William Thomas, 2-4-2003, www.willthomas.net 7. \"US Shells Leave Lethal Legacy,\" Toronto Star, July 31, 1999; also \"Radiation Tests for Peacekeepers in the Balkans Exposed to Depleted Uranium,\" www.telegraph.co.uk, 12-31-02. 8. \"Depleted Uranium May Stop Kidneys In Days,\" Rob Edwards, New Scientist.com, 3-12-02; also \"Uranium Weapons Too Hot to Handle,\" Rob Edwards, New Scientist.co.uk, 6-9-99. 9. \"Navy Seeks Cash for More Tomahawks,\" David Rennie in Washington, Telegraph Group Limited, 1-4-03, news.telegraph.co.uk . 10. \"Going Nuclear in Iraq--DU Cancers Mount Daily,\" Ramzi Kysia, CounterPunch.org, 12-31-01. 11.\"Depleted Uranium Symptoms Match US Report As Fears Spread,\" Peter Beaumont, The Observer (UK) 1-14-01, www.guardianlimited.co.uk . 12. \"Gulf War Illnesses Affect 300,000 Vets,\" Ellen Tomson, Pioneer Press, www.pioneerplanet.com . See also American Gulf War Veterans Association at www.gulfwarvets.com . 13. \"2 of Every 5 Gulf War Vets Are On Disability: 209,000 Make VA Claims,\" World Net Daily, 1-28-03, WorldNetDaily.com. 14. \"Research on Sick Gulf Vets Revisited, \"New York Times, 1-29-01; \"Tests Show Gulf War Victims Have Uranium Poisoning,\" Jonathon Carr-Brown and Martin Meissonnier, The Sunday Times (UK) 9-3-02. 15. \"Catastrophe: Ill Gulf Vets Contaminated Partners With DU,\" The Halifax Herald Limited, Clare Mellor, 2-09-01. This article is available in archives at www.rense.com . 16. \"Iraqi Cancer, Birth Defects Blamed on US Depleted Uranium,\" Seattle Post- Intelligencer, 11-12-02; \"US Depleted Uranium Yields Chamber of Horrors in Southern Iraq, Andy Kershaw, The Independent (London) 12-4-01. 17. \"The Environmental and Human Health Impacts of the Gulf War Region with Special References to Iraq,\" Ross Mirkarimi, The Arms Control Research Centre, May 1992. See also Gulf War Syndrome Birth Defects in Iraq at http://www.xs4all.nl/~stgvisie/VISIE/extremedeformities.html . 18. \"The Tiny Victims of Desert Storm, Has Our Country Abandoned Them?,\" Life Magazine, November 1995; \"Birth Defects Killing Gulf War Babies,\" Los Angeles Times, 11-14-94; \"Depleted Uranium, The Lingering Poison,\" Alex Kirby, BBC News Online, 6-7-99. 19. \"Depleted Uranium, A Killer Disaster,\" Travis Dunn, Disaster News.net, 12-29-02. 20. San Francisco Chronicle, 10-10-02. 21. \"US To Use Depleted Uranium,\" BBC News, 3-18-03. 22. \"Depleted Uranium Symptoms Match US Report As Fears Spread,\" Peter Beaumont, The Observer (UK) 1-14-01. 23. \"Iraqi Cancer, Birth Defects Blamed on US Depleted Uranium,\" Seattle Post- Intelligencer, 11-12-02. 24. \"US To Use Depleted Uranium,\" BBC News, 3-18-03. 25. US Army Environmental Policy Institute: Health and Environmental Consequences of Depleted Uranium in the U.S. Army, Technical Report, June 1995. 26. \"Pentagon Depleted Uranium No Health Risk,\" Dr. Doug Rokke, 3-15-03; also \"The Terrible, Tragic Toll of Depleted Uranium,\" Address by Dr. Rokke before congressional leaders in Washington, D.C.,12-30-02; also \"Gulf War Casualties,\" Dr. Doug Rokke, www.traprockpeace.org . 9-30-02. 27.\"Tests Show Gulf War Victims Have Uranium Poisoning,\" Sunday Times (UK), Jonathon Carr-Brown and Martin Meissonnier, 9-3-00. 28. \"The Pentagon's Radioactive Bullet: An Investigative Report,\" Bill Mesler, The Nation, 5-28-99, see www.thenation.com/issue/961021/1021mesl.htm . 29. \"Tactical Nukes Deployed In Afghanistan,\" World Net Daily, 10-7-01. 30. Ibid. 31. \"The B-61 Bomb,The Burrowing Nuke\" George Smith,VillageVoice.com 12-29-02.; also \"Bunker-busting US Tactical Nuclear Bombs, Nowhere to Hide,\" Kennedy Grey, Wired.com, 10-9-01. 32.\"Perpetual Death From America,\" Mohammed Daud Miraki, Afghan-American Interviews, 2-24-03; also \"Dying of Thirst,\" Fred Pearce, New Scientist, 11-17-2001. 33. Ibid. 34. \"Afghanistan Displaces Myanmar as Top Heroin Producer,\" Agence France-Presse, 3-01-03. This article is at www.copvcia.com .;also \"Opium Trade Flourishing In the `New Afghanistan,'\" Reuters, 3-3-03. 35. \"The Bush-Cheney Drug Empire,\" Michael C. Ruppert, Nexus Magazine, February-March 2000; The Politics of Heroin: CIA Complicity in the Global Drug Trade, Alfred W. McCoy, Lawrence Hill & Co., revised edition due May 2003; Drugging of America, Rodney Stich, Diablo Western Press, 1999; \"Blood for Oil, Drugs for Arms,\" Bob Djurdjevic, Truth In Media, April 2000, www.truthinmedia.org . 36. ABC News, February 27, 2003. 37. Compromised, Clinton Bush and the CIA, Terry Reed and John Cummings, S.P.I. Books, 1994; The Clinton Chronicles and The Mena Cover-up, Citizens for Honest Government, 1996; \"The Crimes of Mena, Grey Money,\" Ozark Gazette, 1995 (see www.copvcia.com .) 38. \"Damage to Yugoslav Environment is Immense, Says a UN Report,\" Bob Djurdjevic, 7-4-99, truthinmedia.org. This report was submitted to the UN Security Council on June 9, 1999; also, \"New Depleted Uranium Study Shows Clear Damage,\" BBC News,8-28-99; also \"NATO Issued Warning About Toxic Ammo,\" Associated Press, 01-08-01. 39. CounterPunch.org, 12-28-01. 40. \"Hundreds Died of Cancer After DU Bombing--Doctor,\" Reuters, 1-13-01. 41.\"Depleted Uranium Threatens Balkan Cancer Epidemic,\" BBC News, 7-30-99. 42. \"Many Defense Sites Still Hazardous,\" Associated Press, 9-24-02; also Old US Weapons Called Hidden Danger, Los Angeles Times, 11-25-02. 43. \"Pentagon Seeks Freedom to Pollute Land, Air and Sea,\" Andrew Gumbel in L.A., 3-13-03, Independent Digital (UK) Ltd. 44. \"Radioactive DU Ammo Is Tested in Fish Areas,\" Seattle Post-Intelligencer, 1-11-03; Letter from Rep. McDermott to Department of the Navy: see \"Navy Fired DU Rounds Into Waters Off Coast of Washington,\" 1-20-03, rense.com. 45.\"Cancer Rates Soar From US Military Use of DU On `Enchanted Island,'\" www.telegraph.co.uk,  2-5-01; also \"Navy Shells With Depleted Uranium Fired in Puerto Rico,\" Fox News Online, 5-28-99. 46. \"The Fallon, NV Cancer Cluster And a US Navy Bombing,\" Jeffrey St. Clair, CounterPunch.org, 8-10-02. 47. \"DU Shells Are Made of A Potentially Lethal Cocktail of Nuclear Waste,\" Jonathon Carr-Brown, www.sunday-times.co.uk , 1-22-01. 48. \"Preventative War Sets Perilous Precedent,\" Helen Thomas, Hearst Newspapers, 3-20-03. 49. PIGS at the Trough, Arriana Huffington, Random House, 2003 (New York Times best seller.); also \"The Best Enemies Money Can Buy, >From Hitler to Saddam Hussein to Osama bin Laden Insider Connections and the Bush Family's Partnership With Killers of Americans;\" Mike Ruppert, From the Wilderness,10-10-01; also \"Bush Sr.'s Carlyle Group Gets Fat on War and Conflict,\" Jamie Doward, The Observer (UK), 3-25-03; also \"Halliburton Wins Contract for Iraq Oil Firefighting, Reuters, 3-7-03; also \"Cashing In-Fortunes in Profits Await Bush Circle After Iraq War, Andrew Gumbel, The Independent (London) 9-15-02; also \"War Could Be Big Business for Halliburton,\" Reuters, 3-23-03. 50. \"Pentagon Seeks a Nuclear Digger,\" Washington Post, March 10, 2003. 51. \"Remember: Bush Planed Iraq War Before Taking Office,\" Neil Mackay, The Sunday Herald (UK) 3-27-03; also \"US Mini-Nukes Alarm Scientists,\" The Guardian (UK) 4-18-01; also \"US Nuclear First-Strike Plan--It Keeps Getting Scarier, Jeffrey Steinberg, Executive Intelligence Review, 2-24-03. 52. Wall Street Journal, 8-16-90: The CIA supported the Baath Party and installed Hussein as Iraqi dictator in 1968. 53. \"United States Dual-Use Exports to Iraq and Their Impact on the Health of Persian Gulf War Veterans,\" Senate Committee on Banking, Housing and Urban Affairs, 1992, 1994; \"U.S. Had Key Role in Iraq Buildup,\" Washington Post, 12-30-02. 54. \"US Government, 24 US Corps Illegally Helped Iraq Build Its WMD,\" Hugh Williamson in Berlin, Financial Times, 12-19-02; \"Full List of US Weapons Suppliers To Iraq,\" Anu de Monterice, coachanu@earthlink.net , 12-19-02. 55. Huffington, op. cit. Amy Worthington is a reporter for The Idaho Observer Observer@coldreams.com http://www.thebirdman.org/Index/Others/Others-Doc-Health&Medicine/Doc-Health&Medicine-DepletedUraniumSickness/DUIsPoisoningEverything.htm, 337797=DEPLETED URANIUM is a WEAPON OF MASS DESTRUCTION The use of depleted uranium is a WAR CRIME !!!!!!!!!!!!!!!!!! http://999prologic999.blog2blog.nl/1001/Depleted+Uranium+WOMD+-+Dulce+New+Mexico+Video.html, 244639=There are currently two sites, Barnwell, SC and Richland, WA, which accept LLW, and Barnwell is expected to shutdown completely by 1996. The Low Level Waste Policy Act of 1980 (LLWPA) placed the responsibility of the disposal of LLW on the states. The federal government encouraged the states to form compacts of two or more states whereby the members of a compact would together site a facility in a host state. So far there have been no new facilities successfully sited among the compacts or in individual states., 268012=    The induction of DU weapons in 1991 in Iraq, the radio-active trash from nuclear plants broke a 46 year taboo. This Trojan Horse of nuclear war, an omnicidal weapon has since then continued to be used more and more. DU remains radioactive longer than the age of the earth  ( estimated at 4.5 billion years. ) , 277659=2. By now, half of all the 697,000 US soldiers involved in the 1991 war have reported serious illnesses.  According the American Gulf War Veterans Association, more than 30% of these soldiers are chronically ill, and receiving disability benefits from the Veterans Administration. 3. The number of disabled veterans is shockingly high . They are in their mid-thirties and should have been in the prime of health. 4. Near the Republican Palace where US troops stood guard and over 1000 employees walked in and out, the radiation readings were the \u0011hottest \u0011 in Iraq, at nearly 1900 times background radiation levels. 5. At a roadside stand, selling fresh bunches of parsley, mint, and onions, children played on a burnt out Iraqi tank  just outside Baghdad, the Geiger counter registered 1000 times normal background radiation. 6. \u0013The Pentagon and the United Nations estimate that the US and Britain used 1,100 to 2,200 tons of armor piercing shells made of DU during attacks in March-April 2003, far more than the 1991 Gulf War (this does not include air dispensed DU munitions and missiles),\u0014 wrote the Post Intelligencer. 7. An otherwise useless by-product of  the uranium enrichment process, DU is attractive to military contractors because it is so cheap and often offered for free by the Government. 8. The long term effects, as Dr Asaf Durakovic elaborates, after the early neurological symptoms are cancer, and related radiation illnesses such as chronic fatigue syndrome, joint and muscle pain, neurological and/or nerve damage, mood disturbances, auto-immuno deficiciencies, lung and kidney damage, vision problems, skin rupture, increase in miscarriages, maternal mortality and genetic birth defects/deformation. 9. For years the US government described the Gulf War Syndrome as a post traumatic stress disorder.  It was labelled as a psychological problem or simply as mysterious unrelated ailments much in the same way as health problems of Vietnam veterans suffering from Agent Orange poisoning.          ( With acknowledgements to Sara Flounders, for 1-9 above, Coordinator of the DU education program ).              I  also gratefully acknowledge the facts learnt  from evidence led by scientists/papers presented and accepted by  the International Criminal Tribunal on  Afghanistan, at Tokyo on 13-16 Decembe, 2003 and earlier at the World Depleted Uranium Weapons Conference, Hamburg 16-19 October, 2003, by Leuren Moret, whose continuing contribution to this cause against \u0011 Silent Wepons of Mass Destruction\u0012 (SWMD),  in defense of humanity, deserves our support. Admiral Vishnu Bhagwat may be contacted at vbhagwat@bom7.vsnl.net.in., 277353=1. In the 2003 war, the IraqiS were subjected to the Pentagon\u0012s radioactive arsenal, mainly in the urban centers, unlike in the deserts in 1991.  The aggregate effects of illnesses and long term disabilities and genetic birth defects will be apparent only 2008 onwards. , 335592=The International Coalition to Ban Uranium Weapons, is writing on the occasion of the International Day for Preventing the Exploitation of the Environment in War and Armed Conflicts to urge the U.N. to consider a ban on uranium weapons, specifically depleted uranium weapons, which have been used in at least four wars and most recently in urban areas in the Iraq War of 2003. 22 November 2006 - ICBUW http://www.bandepleteduranium.org/, 339735=Diabetes and depleted uranium http://www.sfbayview.com/062806/dd062806.shtml, 271309=    In another paper Dr Mohammed Daud Miraki, Director Afghan DU Recovery Fund, quotes George W Bush , \u0013we will smoke them out\u0014, condemning the unborn, the living and the future generations of Afghans and the neighbouring people to a pre-determined, death sentence. \u0013After the destruction of our village, I realised that the Americans had sentenced us all to death. When I saw my deformed grandson I realised my hopes for the future have vanished   This time we are part of the invisible genocide brought on by America a silent death from which we will not escape ( Jooma Khan of Laghman province..March 2003.)  Similar stories are repeated from Paktita province of  \u0011Jelly Babies\u0012. Pregnant women are afraid of  giving birthThis is the legacy of US ushered liberation, freedom and democracy.  DU is cheap for the US, utilising nuclear waste, cheaper than titanium and tungsten, not for the \u0011liberated\u0012 (non-DU is still cheaper as it is the uranium feedstock, pre-enrichment).  , 240549=Department of Nuclear Engineering, University of California, Berkeley, CA 94720-1730, 66994=In 2004, at Walter Reed Army Medical Center in Washington, Lori Brim's son, Army Spc. Dustin Brim, died at 22 of very aggressive cancers. The military physicians who tried to save him said exposure to depleted uranium did not cause his diseases., 264707=     Official Gamma Ray damage caused studies have been deficient in a number of respects..internal contamination, internal dose to individual cells, omissions of diseases other than cancer, mutagenic, long term degeneration ,  oncogenesis, effects of the killer isotopes in particular. The case studies of the years 1945-50 were ignored.  A recent European Parliament Report ECRR 2003 (European Committee on Radiation Risk ) concludes that \u0011A\u0012 Bomb studies underestimate the radiation risk by more than 1000 times and failed to consider the internal exposure and diseases  caused by \u0011Alpha\u0012 and \u0011Beta\u0012 rays.  They did not consider the Manhattan Project  classified memo that, in case the Project objective of producing Plutonium fission and the\u0011A\u0012 Bomb did not succeed , \u0011Depleted Uranium\u0012 munitions would be deployed towards the attainment of the same objective (encl. 1). , 262571=PLEASE PUBLISH, POST, PRINT, PASS AROUND. INTERNATIONAL PHYSICIANS FOR THE PREVENTION OF NUCLEAR WAR (IPPNW) CONFERENCE:   DIALOGUES WITH DECISION MAKERS NEW DELHI,  INDIA, FEBRUARY 29, MARCH 1-2, 2004, 66515=The House passed a similar bill in May, and details are being hashed out in a joint committee. If the proposal becomes law, results of the study would be submitted to Congress within one year from its effective date. But the study comes too late for one Ormond Beach mother of an American soldier who believes exposure to depleted uranium in Iraq killed her son., 214696=Has killing become part of the Pentagon “Press Policy”? 5/29/2006 3:00:00 PM GMT \"Nobody has any idea how many Iraqis may have developed leukemia or fallen ill\" From the few credible reports, from very few news agencies around the world that are keen on presenting truth, we know that Iraq is now descending into a black hole, thanks to the decadent, bloated, demon-possessed, Neo-Con followers, who might now be sitting on their easy chairs, cheering the death of over a hundred thousand innocent people. http://www.aljazeera.com/me.asp?service_ID=11301  , 126435=Imagine a weapon equivalent to Agent Orange combined with a nuclear bomb. Such weapons exists - and are in regular use. They are depleted-uranium weapons, made from the waste products of nuclear power plants and weapons facilities. U.S. forces are using them in Iraq, even after horrific side effects of their use surfaced during the 1991 Gulf war. The United States has no business employing such cruel weapons. The United Nations classifies depleted-uranium ammunition as an illegal weapons of mass destruction because of their long-term impacts on the land over which they explode and the long-term health problems they cause when people are exposed to them. Apparently, the United States is hypocritical enough to disregard a plea not to use weapons of mass destruction. Hundreds of thousands of U.S. soldiers suffer from Gulf war syndrome and have had children with severe birth defects after being exposed to depleted uranium; other health risks include cancer and radiation sickness-like syndromes. Enough studies have confirmed these harmful effects of radiation and heavy metal toxicity. It is not just U.S. soldiers who will feel the effects this time. While much of the depleted uranium use in the Gulf war occurred over desert, in Iraq the weapons are exploding over heavily populated civilian areas. Iraqis will feel the effects of the radiation and uranium years after the United States leaves the scene - U.S. forces are poisoning the very population they are supposedly seeking to liberate. And while U.S. citizens and Iraqis are dying, the Pentagon insists depleted uranium is \"safe\" for U.S. troops. This blatant disregard for scientific, medical proof that these weapons are damaging is a crime against humanity - some justifiably label it a war crime. Just as Agent Orange still affects Vietnam veterans and radiation sickness remains in Hiroshima and Nagasaki, depleted uranium-related illnesses will haunt thousands of soldiers and civilians for years to come. And the number of those affected will steadily increase the longer these weapons remain in use in Iraq. The U.S. armed forces must cease their use and regain an iota of compassion for human suffering. http://www.mndaily.com/articles/2005/09/28/65337, 215917=The Truth about Depleted Uranium More information: http://www.infonature.org/english/cultural_issues/eng-depleted_uranium.htm http://thepowerhour.com/du.htm Flash animation: http://www.bushflash.com/pl_lo.html http://www.amcmh.org/PagAMC/ciar/articulos/cr_fotos.htm DU is a waste product of the process that produces enriched uranium for use in atomic weapons and nuclear power plants. Much like natural uranium, it is both toxic and radioactive. Over a billion pounds of DU exists in the United States and must be safely stored or disposed of by the Department of Energy. With its half-life of 4.5 billion years, DU's radioactivity effectively lasts forever. DU is so abundant the government gives it away to arms manufacturers. Because it is extremely dense--1.7 times as dense as lead--when turned into a metal DU can be used to make a shell that easily penetrates steel. In addition it is pyrophoric--that is, when it strikes steel, heat from the friction causes it to burn. When DU burns, it spews tiny particles of poisonous and radioactive uranium oxide in aerosol form, which can then travel for miles in the wind. Humans can ingest or inhale the small particles. Even one particle, when lodged in a vital organ--which is most likely to happen from inhalation-- can cause illnesses from headaches to cancer. The Pentagon tested DU shells at various sites around the U.S. and used it in combat for the first time against Iraq during the 1991 Gulf War. It was very effective in destroying Iraqi tanks, as well as their occupants and anyone in the area. At least 600,000 pounds of DU and uranium dust was left around Iraq, Kuwait and Saudi Arabia by U.S. and British forces during that war. Although the U.S. government and military continue to minimize the environmental and health dangers from depleted- uranium weapons, even they have to admit these dangers exist. DU is also considered at least a contributing cause to the 130,000 reported cases of \"Gulf War Syndrome.\" The chronic symptoms of this ailment range from sharp increases in cancers to memory loss, chronic pain, fatigue and birth defects in veterans' children. Dr. Mona Kammas is a professor of pathology at Baghdad University and director of a study of the environmental impact of U.S. aggression against Iraq. At the Gijon symposium, she reported on a paper that showed an almost five-fold increase in cancers, a more than three-fold increase in spontaneous abortions, and a nearly three-fold increase in congenital anomalies in a study group of those exposed to combat. The paper also reported on environmental damage due to the Pentagon's destruction of the water-supply and sanitation systems and the destruction of oil refineries and factories that used toxic chemicals in the production process. Iraqi researchers believe that the different relative frequency of various types of cancer now as compared with before 1990 in the Basra region was a significant indication of a major change, and that this pattern continuing long after the war indicated that DU's impact was long- lasting. Besides the contents listed below, the second edition of Metal of Dishonor has chapters reporting on a study from Iraq and from Bosnia, and a new chapter by Dr. Asaf Durakovic, a physicist and medical doctor who examined U.S. troops hit by DU \"friendly fire.\"  http://gaia.org.pt/pipermail/gaia-geral/2005-November/005603.html  , 288655=“You know our freedoms are not under attack from the remnants of Saddam Hussein’s Bathist Party. They’re under attack by the likes of John Ashcroft. They’re trampled by Donald Rumsfeld, they’re disdained by Dick Cheney, and they’re not even understood by George W. Bush.” http://benfrank.net/blog/2005/09/18/treason/, 116235=Israeli aggression on Lebanon July 2006 More photos: http://www.uruknet.info/?s1=55&p=24885&s2=21, 339128=Depleted Uranium: A slow, silent killer http://www.state.nv.us/nucwaste/news2001/nn11107.htm Depleted Uranium For Dummies http://www.countercurrents.org/hall230306.htm, 141157=Iraq's real WMD crime By Lawrence Smallman http://english.aljazeera.net/NR/exeres/E8C356F9-E89F-4CD3-88B5-BBBDF9E085C1.htm Thursday 30 October 2003, 9:55 Makka Time, 6:55 GMT Depleted uranium has a half life of 4.7 billion years; that means thousands upon thousands of Iraqi children will suffer. There are weapons of mass destruction all over Iraq and they were used this year. Iraqi children continue to find them every day. They have ruined the lives of just under 300,000 people during the last decade - and numbers will increase. The reason is simple. Two hundred tonnes of radioactive material were fired by invading US forces into buildings, homes, streets and gardens all over Baghdad. The material in question is depleted uranium (DU). Left over after natural uranium has been enriched, DU is 1.7 times denser than lead - effective in penetrating armoured objects such as tanks. After a DU-coated shell strikes, it goes straight through before exploding into a burning vapour which turns to dust. \"Depleted uranium has a half life of 4.7 billion years; that means thousands upon thousands of Iraqi children will suffer for tens of thousands of years to come. This is what I call terrorism,\" says Dr Ahmad Hardan. As a special scientific advisor to the World Health Organisation, the United Nations and the Iraqi Ministry of Health, Dr Hardan is the man who documented the effects of depleted uranium in Iraq between 1991 and 2002. But this year's invasion and occupation has doubled his workload. Terrible history repeated \"American forces admit to using over 300 tonnes of depleted uranium weapons in 1991. The actual figure is closer to 800. This has caused a health crisis that has affected almost a third of a million people\", Dr Ahmad Hardan, scientific advisor to the World Health Organisation \"This has caused a health crisis that has affected almost a third of a million people. As if that was not enough, America went on and used 200 tonnes more in Baghdad alone this April. I don't know about other parts of Iraq, it will take me years to document that.\" Hardan is particularly angry because he says there is no need for this type of weapon; US conventional weapons are quite capable of destroying tanks and buildings. \"In Basra, it took us two years to obtain conclusive proof of what DU does, but we now know what to look for and the results are terrifying.\" Leukaemia has already become the most common type of cancer in Iraq among all age groups, but is most prevalent in the under-15s. It has increased way above the percentage of population growth in every single province of Iraq without exception. Women as young as 35 are developing breast cancer. Sterility amongst men has increased ten-fold. Barely human But by far the most devastating effect is on unborn children. Nothing can prepare anyone for the sight of hundreds of preserved foetuses, barely human in appearance. Depleted uranium has caused severe deformities in babies There is no doubt that DU is to blame. \"All children with congenital anomalies are subjected to karyotyping and chromosomal studies with complete genetic back-grounding and clinical assessment. Family and obstetrical histories are taken too. These international studies have produced ample evidence to show that DU has disastrous consequences.\" Not only are there 200 tonnes of uranium lying around in Baghdad, the containers which carried the ammunition were discarded. For months afterwards, many used them to carry water &#8211; others used them to sell milk publicly. It is already too late to reverse the effects. After his experience in Basra, Hardan says that within the next two years he expects to see significant rises in congenital cataracts, anopthalmia, microphthalmia, corneal opacities and coloboma of the iris, and that's just in people's eyes. Add to this foetal deformities, sterility in both sexes, an increase in miscarriages and premature births, congenital malformations, additional abnormal organs, hydrocephaly, anencephaly and delayed growth. Soaring cancer rates \"I had hoped the lessons of using DU would have been learnt &#8211; especially as it is affecting American and British troops stationed in Iraq as we speak, they are not immune to its effects either.\" Many affected foetuses are so deformed they cannot survive If the experience of Basra is played out in the rest of the country, Iraq is looking at an increase of over 300% in all types of cancer over the next decade. The signs are already here in Baghdad - the effects are starting to be seen. Every form of cancer has jumped up at least 10% with the exception of bone tumours and skin cancer, which have only reason 2.6% and 9.3% respectively. Another tragic outcome is the delayed growth of children. Skeletal age comparisons between boys from southern Iraq and boys from Michigan show Iraqi males are 26 months behind in their development by the time they are 12-years-old, and girls are almost half a year behind. \"The effects of ionising radiation on growth and development are especially significant in the prenatal child\", adds Dr Hardan. \"Embryonic development is especially affected.\" Action needed Those who have seen the effects of DU hope the US and its allies will never use these weapons again, but it seems no such decision is likely in the foreseeable future. \"A world famous German cancer specialist agreed to come, only to be told later that he would not be given permission to enter Iraq\" Dr Ahmad Hardan, scientific advisor to the World Health Organisation \"I arranged for a delegation from Japan's Hiroshima hospital to come and share their expertise in the radiological related diseases we are likely to face over time,\" says Hardan. The delegation told me the Americans had objected and they had decided not to come. \"Similarly, a world famous German cancer specialist agreed to come, only to be told later that he would not be given permission to enter Iraq.\" Secondly, Hardan believes, the authorities need to produce precise information about what was used and where, and there needs to be a clean-up operation and centres for specialist cancer treatment and radiation-related illnesses. Iraq only has two hospitals that specialise in DU-related illnesses, one in Basra and one in Mawsil; this needs to change and soon. \"I'm fed up of delegations coming and weeping as I show them children dying before their eyes. I want action and not emotion. The crime has been committed and documented; but we must act now to save our children's future.\" http://members.iimetro.com.au/~hubbca/wmd.htm, 163667=In actual fact, Al-Samawah is strategically located on the road from Basra to Baghdad, providing access to a bridge over the Euphrates River. On its march to Baghdad, the U.S. Army encountered fierce resistance from Iraqi forces there, according to American officers. This was well covered by their embedded media., 338285=DEPLETED URANIUM: DEADLY AND INDISCRIMINATE http://www.cuttingedge.org/News/n1930.cfm, 89345=Nuns and Priests File Depleted Uranium Bunker Buster Resolution at Three Weapons Companies by Bill Baue - July 26, 2006 The resolution goes to vote next week at Alliant Techsystems, and already received more than double the support needed to re-file next year at Lockheed Martin and Textron. SocialFunds.com -- Depleted uranium (DU), the radioactive byproduct of uranium enrichment, is in the headlines as the US recently agreed to send 100 Guided Bomb Unit-28 bunker buster bombs containing DU warheads to Israel for use against targets in Lebanon, as reported by Reuters and others. Shareowner activists are also placing DU on the corporate agenda by filing a new resolution expressing health and environmental concerns and asking for a report from three companies on their involvement with DU. Concern centers on the pyrophoric properties of DU, which burns and loses much of its mass upon impact, dispersing a fine radioactive dust that can be carried long distances by winds or absorbed by soil and groundwater--not to mention human bodies. The resolution received 6.4 percent support at Lockheed Martin (ticker: LMT) and 9 percent support at Textron (TXT), both well over the 3 percent threshold required by the SEC for re-filing next year. The proposal goes to vote next week at Alliant Techsystems (ATK), which manufactures 120 mm rounds containing DU for penetrating tanks and light armor vehicles. \"It's one thing to make a weapon that 'does the job' on the battlefield; it's another to manufacture and use one that destroys not only tanks, armored personnel carriers and underground bunkers but may also leave a potentially poisonous legacy in the bodies of the people who return to those areas after hostilities have ceased,\" said John Celichowski, head of the corporate responsibility program for the Province of St. Joseph of the Capuchin Order, which filed the resolution at Alliant. \"We believe that the choice to use particular weapons in areas that are bound to be inhabited or re-inhabited by civilians raises serious moral questions which need to be addressed by our policy-makers, our armed services, the society they claim to be defending, and the companies that make such weapons.\" \"The pyrophoric qualities of these weapons also creates potential risks for our own soldiers,\" he told SocialFunds.com. The resolutions make not only a moral and ethical case, but also a business case against DU. \"The business case against DU centers around the potential liability for human and environmental impacts and damage to the companies' reputations,\" said Valerie Heinonen, a corporate social responsibility consultant to the Sisters of Mercy Regional Community of Detroit Charitable Trust, which filed the resolution at Lockheed. \"Rather than seeking a market for radioactive waste, the federal government and corporations should work with NGOs to find solutions for long-term storage.\" PROXY Governance, one of the three major proxy advisory firms, recommends voting for the resolution at Alliant \"PROXY Governance acknowledges that there are serious concerns regarding the health effects of using munitions containing depleted uranium (DU),\" states PROXY Governance. \"While we are not aware of significant litigation involving the health and safety of workers at DU munitions production facilities at this time, the potential for future such litigation exists.\" In fact, Richard David of the UK filed suit against Honeywell in 2004 claiming adverse health effects from working at a munitions factory during the first Gulf War where DU was used in manufacturing, according to an article in The Observer. \"And while the World Health Organization and others have stated that there is no conclusive medical evidence linking DU to health problems, reports by the United Nations Commission on Human Rights have suggested that the weapons may well be illegal under The Geneva Conventions, The Hague Conventions and other international law,\" continues the PROXY Governance report. \"Such a finding could complicate efforts by DU weapons manufacturers to defend themselves against potential future litigation involving health effects or environmental clean-up efforts.\" The Alliant board argues in its proxy statement that the company discloses information regarding its military- and defense-related contracting in its SEC filings, but PROXY Governance notes that these filings do not discuss the specific matters brought up in the resolution. PROXY Governance also recommended voting for the resolution at Lockheed, but against it at Textron, as the company's board points out in its proxy statement that the company is not involved in DU production and has no plans to be. Both ISS and Glass Lewis recommend voting against the resolution at all three companies. \"We were in conversation with Textron management following the filing of the resolution, but we did not get satisfactory answers and therefore the lead filer, the Sisters of Charity of the Blessed Virgin Mary decided to leave the resolution on the ballot,\" Sr. Heinonen told SocialFunds.com. \"The vote at Textron may lead to further, more satisfactory conversation.\" http://www.socialfunds.com/news/article.cgi/2067.html, 291024=Photos: http://www.traprockpeace.org/depleted_uranium_092405/}",
    "lastModified": "Tue, 06 Aug 2013 06:25:21 GMT",
    "textBeforeTable": "                    US Proving Grounds with DU Test Firing Ranges   The U.S. radiates civilians with depleted uranium http://www.aljazeera.com/cgi-bin/review/article_full_story.asp?service_ID=10745 The Truth about Depleted Uranium More information: http://www.infonature.org/english/cultural_issues/eng-depleted_uranium.htm http://thepowerhour.com/du.htm Flash animation: http://www.bushflash.com/pl_lo.html http://www.amcmh.org/PagAMC/ciar/articulos/cr_fotos.htm DU is a waste product of the process that produces enriched uranium for use in atomic weapons and nuclear power plants. Much like natural uranium, it is both toxic and radioactive. Over a billion pounds of DU exists in the United States and must be safely stored or disposed of by the Department of Energy. With its half-life of 4.5 billion years, DU's radioactivity effectively lasts forever. DU is so abundant the government gives it away to arms manufacturers. Because it is extremely dense--1.7 times as dense as lead--when turned into a metal DU can be used to make a shell that easily penetrates steel. In addition it is pyrophoric--that is, when it strikes steel, heat from the friction causes it to burn. When DU burns, it spews tiny particles of poisonous and radioactive uranium oxide in aerosol form, which can then travel for miles in the wind. Humans can ingest or inhale the small particles. Even one particle, when lodged in a vital organ--which is most likely to happen from inhalation-- can",
    "textAfterTable": "More: http://www.laka.org/teksten/Vu/where-how-much-01/main.html Broadcast Exclusive: U.S. Soldiers Contaminated With Depleted Uranium Speak Out Listen to Segment || Download Show mp3       Watch 128k stream       Watch 256k stream http://www.democracynow.org/article.pl?sid=04/04/05/1356248 Iraqi cancers, birth defects blamed on U.S. depleted uranium Nation / World News http://seattlepi.nwsource.com/national/95178_du12.shtml Depleted Uranium - A Hidden Looming Worldwide Calamity http://www.globalresearch.ca/index.php?context=viewArticle&code=LEN20060119&articleId=1754   DEPLETED URANIUM ETHICS OF THE SILVER BULLET http://cseserv.engr.scu.edu/StudentWebPages/IPesic/ResearchPaper.htm Depleted Uranium Congressman Dennis Kucinich The United States must order an end to illegal use of depleted uranium munitions and lead an international effort to recover depleted uranium. We must promote environmental remediation. Also, we must develop a program to provide care and restitution for people suffering as a result of the United States' use of depleted uranium munitions, nuclear weapons, nuclear weapons production, nuclear testing, and uranium mining. More: http://www.kucinich.us/issues/depleted_uranium.php   A U.N. study names the five most serious environmental hot spots in Iraq. Working with Iraq to clean up contaminated sites throughout the country, The United Nations has released the findings of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}