{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Other",
            "Mainline Protestant",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "801,850",
            "302,320",
            "161,530",
            "74,992",
            "10,857",
            "7,828",
            "1,735,936"
        ],
        [
            "Congregations",
            "115",
            "974",
            "349",
            "211",
            "52",
            "19",
            "-"
        ]
    ],
    "pageTitle": "Lakeside, California (CA 92040) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Lakeside-California.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 380866743,
    "recordOffset": 380736604,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{58882=According to our research of California and other state lists there were 66 registered sex offenders living in Lakeside, California as of July 31, 2015. The ratio of number of residents in Lakeside to the number of sex offenders is 313 to 1., 1668=2012 Presidential Elections Results, 22848=Air Quality Index (AQI) level in 2012 was 126. This is significantly worse than average., 5706=School Enrollment by Level of School (%) in 2013, 19264=Particulate Matter (PM10) [µg/m3] level in 2012 was 43.5. This is significantly worse than average. Closest monitor was 4.6 miles away from the city center., 172257=Zip codes: 92040., 182331=Lakeside: The morning of the Oct. 2003 Fire Lakeside,Lakeview area, 2812=1996 Presidential Elections Results, 17747=Lead (Pb) [µg/m3] level in 2012 was 0.0326. This is significantly worse than average. Closest monitor was 4.6 miles away from the city center., 6104=Educational Attainment (%) in 2013, 20710=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.161. This is significantly better than average. Closest monitor was 4.6 miles away from the city center., 22189=Carbon Monoxide (CO) [ppm] level in 2012 was 0.525. This is significantly worse than average. Closest monitor was 4.6 miles away from the city center., 2526=2000 Presidential Elections Results, 21454=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 12.2. This is significantly worse than average. Closest monitor was 4.6 miles away from the city center., 18497=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.74. This is about average. Closest monitor was 4.6 miles away from the city center., 1384=Graphs represent county-level data. Detailed 2008 Election Results, 1954=2008 Presidential Elections Results, 19963=Ozone [ppb] level in 2012 was 31.6. This is about average. Closest monitor was 4.6 miles away from the city center., 2240=2004 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{95061=Total of 145 patent applications in 2008-2015., 7531=5.24% of this county's 2010 resident taxpayers moved to other counties in 2011 ($46,699 average adjusted gross income), 5300=5.38% of this county's 2011 resident taxpayers lived in other counties in 2010 ($45,585 average adjusted gross income), 96402=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc.}",
    "textBeforeTable": "Religion statistics for Lakeside CDP (based on San Diego County data) Winter Gardens neighborhood Lakeside neighborhood Eucalyptus Hills neighborhood Lakeside, California Neighborhood Map) Neighborhoods in Lakeside:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 574 San Diego County: 1.94 / 10,000 pop. California: 2.14 / 10,000 pop. Number of supercenters and club stores: 17 This county: 0.06 / 10,000 pop. State: 0.04 / 10,000 pop. Number of convenience stores (no gas): 227 San Diego County: 0.77 / 10,000 pop. California: 0.62 / 10,000 pop. Number of convenience stores (with gas): 487 San Diego County: 1.65 / 10,000 pop. State: 1.49 / 10,000 pop. Number of full-service restaurants: 2,238 Here: 7.56 / 10,000 pop. State: 7.42 / 10,000 pop. Adult diabetes rate: This",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}