{
    "relation": [
        [
            "Time",
            "19:00",
            "19:00",
            "19:00",
            "19:00",
            "19:00",
            "19:00",
            "19:00",
            "19:00"
        ],
        [
            "Match",
            "Red Star FC v US Créteil-Lusitanos",
            "AJ Auxerre v Stade Brest",
            "Ajaccio AC v Dijon FCO",
            "Chamois Niort v Valenciennes",
            "Clermont v FC Sochaux",
            "Bourg-Péronnas v Le Havre",
            "Nîmes Olympique v Évian Thonon Gaillard FC",
            "Paris FC v Stade Laval"
        ]
    ],
    "pageTitle": "Ukraine, Poland angry at racism charges - Yahoo! Eurosport",
    "title": "Football | Ligue 2",
    "url": "https://uk.sports.yahoo.com/29052012/2/ukraine-poland-angry-racism-charges.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893630427,
    "recordOffset": 893610950,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7364=The neighbours, who will share matches between 16 countries throughout June leading to a July 1 final in the Ukrainian capital, moved to counteract a BBC Panorama investigative programme on soccer violence filmed in their countries., 3764=UEFA 2012 director Markiyan Lubkivsky, faced with a barrage of questions on racism following the Panorama programme, pleaded to journalists to declare a \"moratorium\" on negative information about the championship., 3316=He said UEFA saw no threat to citizens of various nationalities who came to Ukraine for Euro 2012. \"There are no threats,\" he said., 7632=Poland and Ukraine on Tuesday reacted sharply to British press charges of racism and mob violence on their terraces and gave assurances that foreign footballers and fans alike would be safe during the Euro 2012 tournament they will co-host next month., 7744=* Euro 2012 will run from June 8-July 1 (Releads with Poland reaction, other Ukraine comments), 4395=Striker Andriy Shevchenko, who formerly played for the English club Chelsea, said: \"We do not have any real problems with racism here. Ukraine is a very peaceful country and people here are very friendly. I know that everything will be done for Euro 2012 to take place at a high level.\", 8206=Tue, 29 May 14:40:00 2012, 7900=* Two countries are co-hosts of Euro 2012 soccer tournament, 6041=For Ukraine, the racism allegations have only added to a deluge of other bad publicity ahead of Euro 2012, a competition which the former Soviet republic had hoped would showcase it as a modern state eligible to join the European Union., 5787=The jailing of opposition leader Yulia Tymoshenko has triggered charges of backsliding on democracy from the EU, some of whose politicians are threatening to boycott Euro 2012., 5095=Ukrainian authorities and sports figures were particularly stung by comments by former England international Sol Campbell who, in the Panorama programme, warned England fans not to travel to Euro 2012 because of the threat of racism and violence.}",
    "textBeforeTable": "Jul 31 Foolad v Rah-Ahan 16:05 Perspolis v Padideh 16:05 Malavan v Zob-Ahan 15:20 Teraktor-Sazi v Naft Tehran 14:30 Match Time | Iran Persian Gulf League Football Jul 31 Lechia Gdansk v Pogon Szczecin 19:30 Piast Gliwice v Górnik Zabrze 17:00 Match Time | Ekstraklasa Football Jul 31 Vittsjö GIK v Eskilstuna United 18:30 Match Time | Damallsvenskan Football Jul 31 FC Midtjylland v OB 19:30 Viborg FF v Esbjerg fB",
    "textAfterTable": "Aug 1 Football | Primera A Time Match 22:00 Atlético Rafaela v Aldosivi Jul 31 Football | Pro League Time Match 19:30 AA Gent v Racing Genk Jul 31 Football | Regionalliga Bayern Time Match 17:30 SV Schalding-Heining v TSV Rain 18:00 Wacker Burghausen v SpVgg Unterhaching 18:00 Jahn Regensburg v 1. FC Schweinfurt 05 Jul 31 Football | Regionalliga Nordost Time Match 17:00 Germania Halberstadt v BFC Dynamo Jul 31 Football | Regionalliga",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}