{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Has to be on of the most secure campuses I've been on. The crime rate in the city of Decatur is low.",
            "Agnes Scott has to have one of the best values for a Private Institution. Almost every one admitted receives some kind of financial aid.",
            "The food is delicious! When visiting, I had never eaten anything that I did not like from the cafeteria.",
            "Although Freshman have to stay in the community styled dorms, they're actually really nice. One of the advantages is that the dorms have walk-in closets. The bathrooms are clean and the dorm rooms are pretty big.",
            "The courses are rigorous, but the professors are very helpful and the classes are small. This usually makes students feel comfortable about asking questions and seeking the help that is needed.",
            "Get to know your admissions counselor before you are even admitted to the school. They are very helpful and encouraging. Agnes Scott literally looks for the well-rounded student, so make sure you are versatile. Lastly, show leadership and dedication.",
            "Agnes Scott College is a small liberal-arts women's college with a gorgeous campus! They truly care about their students, and strive to create leaders. I recommend this school for any young woman."
        ]
    ],
    "pageTitle": "Agnes Scott College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Agnes-Scott-College/reviews?_escaped_fragment_=/show/100280",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894863555,
    "recordOffset": 894826960,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84780=Black Cat Week is an exceptional week on campus in October where each class expresses its class pride. The week includes a concert, bonfire, parties, and even a formal dance,, 150106=© 2015, Cappex.com, LLC, 65896=we have black cat, which is a whole week in october that started a long time ago because of a prank. on sunday at midnight, students rush the quad and decorate it with props of their class color. each class has a party day where they decorate the dining hall for dinner. on thursday we have bonfire where all the classes dress up in their class color and sing songs that we made up to our sister class. friday is junior production where the junior class puts on a show. saturday is the black cat formal which is held at a classy location.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 32 Kristina from Thonotosassa, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Comments Great for these types of students This women's college will make everyone in the campus feel welcome and enjoy the faulty and social life. Once the female students step in the campus and touring around the school they will feel right at home. Tips for prospective students More comfortable space, because it's a women's college that every women will feel comfortable and enjoy around the school. The academics are excellent! The faulty encourages the students to succeed. Bang for the buck I will do anything to go a women's college whether my family is poor or not, because i don't like the environment I've been experience here at Bellevue and going to the female school is my biggest dream than any other of my dreams. Will enjoy being here I always wanted to go a women's college when i grow ever since and i know my experiences will change more than I have at my school experiences here. Plus, I saw the video in the website that holds loads of information that made me realized that this kind of college would be the perfect college for me till I graduate from high school. Will learn a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}