{
    "relation": [
        [
            "Citing Patent",
            "US7708761 *",
            "US7837713",
            "US8021392 *",
            "US8162981",
            "US8202305",
            "US8308779",
            "US8388667",
            "US8409257",
            "US8414648",
            "US8425570",
            "US8444693",
            "US8470004",
            "US8696708",
            "US8740942",
            "US8795285",
            "US8945193",
            "US8951254",
            "US8986355",
            "US8992533",
            "US8992587",
            "US8998905",
            "US8998953",
            "US9039743",
            "US9044321",
            "US9050144",
            "US9060787",
            "US20120010620 *",
            "WO2012006216A1",
            "WO2013134004A1"
        ],
        [
            "Filing date",
            "22 Sep 2005",
            "13 Mar 2009",
            "25 Sep 2008",
            "22 May 2008",
            "22 Jul 2010",
            "25 Feb 2008",
            "5 Oct 2010",
            "10 Nov 2010",
            "6 Dec 2010",
            "6 Dec 2010",
            "6 Dec 2010",
            "6 Dec 2010",
            "5 Mar 2009",
            "23 Jan 2013",
            "19 Oct 2011",
            "6 Mar 2012",
            "20 Oct 2009",
            "11 Jul 2011",
            "18 Aug 2010",
            "18 Jul 2011",
            "29 Apr 2011",
            "30 Aug 2011",
            "16 May 2014",
            "8 Mar 2013",
            "29 Aug 2008",
            "14 Aug 2012",
            "",
            "30 Jun 2011",
            "25 Feb 2013"
        ],
        [
            "Publication date",
            "4 May 2010",
            "23 Nov 2010",
            "20 Sep 2011",
            "24 Apr 2012",
            "19 Jun 2012",
            "13 Nov 2012",
            "5 Mar 2013",
            "2 Apr 2013",
            "9 Apr 2013",
            "23 Apr 2013",
            "21 May 2013",
            "25 Jun 2013",
            "15 Apr 2014",
            "3 Jun 2014",
            "5 Aug 2014",
            "3 Feb 2015",
            "10 Feb 2015",
            "24 Mar 2015",
            "31 Mar 2015",
            "31 Mar 2015",
            "7 Apr 2015",
            "7 Apr 2015",
            "26 May 2015",
            "2 Jun 2015",
            "9 Jun 2015",
            "23 Jun 2015",
            "12 Jan 2012",
            "12 Jan 2012",
            "12 Sep 2013"
        ],
        [
            "Applicant",
            "Minsurg International, Inc.",
            "Minsurg International, Inc.",
            "Minsurg International, Inc.",
            "Vg Innovations, Llc",
            "Si-Bone Inc.",
            "Si-Bone, Inc.",
            "Si-Bone, Inc.",
            "Warsaw Othopedic, Inc.",
            "Si-Bone Inc.",
            "Si-Bone Inc.",
            "Si-Bone Inc.",
            "Si-Bone Inc.",
            "DePuy Synthes Products, LLC",
            "Spinal Elements, Inc.",
            "Brian Kwon",
            "X-Spine Systems, Inc.",
            "Ww Technology Ag",
            "DePuy Synthes Products, LLC",
            "Spinal Elements, Inc.",
            "X-Spine Systems, Inc.",
            "Warsaw Orthopedic, Inc.",
            "Spinal Elements, Inc.",
            "Si-Bone Inc.",
            "Si-Bone Inc.",
            "Gmedelaware 2 Llc",
            "Spinal Elements, Inc.",
            "Petersen David A",
            "X-Spine Systems, Inc.",
            "X-Spine Systems, Inc."
        ],
        [
            "Title",
            "Spinal plug for a minimally invasive facet joint fusion system",
            "Methods and surgical kits for minimally-invasive facet joint fusion",
            "Methods and surgical kits for minimally-invasive facet joint fusion",
            "Method and apparatus for spinal facet fusion",
            "Systems and methods for the fixation or fusion of bone",
            "Systems and methods for the fixation or fusion of bone",
            "Systems and methods for the fixation or fusion of bone using compressive implants",
            "Systems and methods for facet joint stabilization",
            "Apparatus, systems, and methods for achieving trans-iliac lumbar fusion",
            "Apparatus, systems, and methods for achieving anterior lumbar interbody fusion",
            "Apparatus, systems, and methods for achieving lumbar facet fusion",
            "Apparatus, systems, and methods for stabilizing a spondylolisthesis",
            "Facet interference screw",
            "Vertebral facet joint prosthesis and method of fixation",
            "Spinal facet fusion device and method of operation",
            "Minimally invasive spinal facet compression screw and system for bone joint fusion and fixation",
            "Method for fusing a human or animal joint as well as fusion device and tool set for carrying out the method",
            "Facet fusion implant",
            "Vertebral facet joint drill and method of use",
            "Spinal facet compression screw with variable pitch thread zones and buttress head",
            "Methods and instruments for use in vertebral treatment",
            "Vertebral facet joint prosthesis and method of fixation",
            "Systems and methods for the fusion of the sacral-iliac joint",
            "Integrated implant",
            "System and method for implant anchorage with anti-rotation features",
            "Method of using a vertebral facet joint drill",
            "Methods and surgical kits for minimally-invasive facet joint fusion",
            "Spinal stabilization system utilizing screw and external facet and/or lamina fixation",
            "Minimally invasive spinal facet compression screw and system for bone joint fusion and fixation"
        ]
    ],
    "pageTitle": "Patent US7223269 - Facet fusion system - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7223269",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472835928,
    "recordOffset": 472819960,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20371=This application claims priority to copending U.S. provisional application entitled, “Facet Fusion Apparatus and Method of Use,” having Ser. No. 60/430,311, filed on Dec. 2, 2002, which is entirely incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations It should be emphasized that the above-described embodiments of the present invention, particularly, a “preferred” embodiment, are merely possible examples of implementations, merely set forth for a clear understanding of the principles of the invention. Many variations and modification may be made to the above-described embodiment(s) of the invention without departing substantially from the spirit and principles of the invention. All such modifications and variations are intended to be included herein within the scope of this disclosure and the present invention and protected by the following claims. illustrates an optional stapling device 60. The stapling device 60 can be implemented after the appropriate size implant 50, 55 is selected and positioned on the facet joint 100 such that the device 60 engages the facet joint 100 and the implant 50, 55. The stapling device 60 secures the implant 50, 55 in position in the facet joint 100. The stapling device 60 comprises any suitable material that can be heated to allow for some compression, such as Nitinol, or the like. FIG. 6 illustrates an embodiment of a synthetic implant 55 that may be implemented in the facet fusion system. The synthetic implant 55 comprises a fusion portion 57 and a cap 58. The fusion portion 57 is adapted to engage an internal portion of the facet joint. The cap 58 is adapted to engage a posterior portion of the",
    "textAfterTable": "US8998905 29 Apr 2011 7 Apr 2015 Warsaw Orthopedic, Inc. Methods and instruments for use in vertebral treatment US8998953 30 Aug 2011 7 Apr 2015 Spinal Elements, Inc. Vertebral facet joint prosthesis and method of fixation US9039743 16 May 2014 26 May 2015 Si-Bone Inc. Systems and methods for the fusion of the sacral-iliac joint US9044321 8 Mar 2013 2 Jun 2015 Si-Bone Inc. Integrated implant US9050144 29 Aug 2008 9 Jun 2015 Gmedelaware 2 Llc System and method for implant anchorage with anti-rotation features US9060787 14 Aug 2012 23 Jun 2015 Spinal Elements, Inc. Method of using a vertebral facet joint drill US20120010620 * 12 Jan 2012 Petersen David A Methods and surgical kits for minimally-invasive facet joint fusion WO2012006216A1 30 Jun 2011 12 Jan 2012 X-Spine Systems, Inc. Spinal stabilization system utilizing screw and external facet and/or lamina fixation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}