{
    "relation": [
        [
            "Date",
            "Apr 10, 2001",
            "Aug 8, 2003",
            "Jan 16, 2008",
            "Jan 18, 2012",
            "Jun 25, 2012",
            "Jun 26, 2012",
            "Feb 24, 2014"
        ],
        [
            "Code",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Free format text: NUNC PRO TUNC ASSIGNMENT;ASSIGNOR:HOLLIDAY, RANDALL A.;REEL/FRAME:028437/0783 Effective date: 20120614 Owner name: RHPS VENTURES, LLC, COLORADO",
            "Effective date: 20111231 Free format text: MERGER;ASSIGNOR:RHPS VENTURES, LLC;REEL/FRAME:028442/0581 Owner name: BELDEN INC., MISSOURI",
            "Owner name: PPC BROADBAND, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BELDEN, INC.;REEL/FRAME:032283/0517 Effective date: 20130926"
        ]
    ],
    "pageTitle": "Patent US6089913 - End connector and crimping tool for coaxial cable - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6089913?dq=5,241,671",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474340987,
    "recordOffset": 474317751,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23073=This application is a continuation-in-part of Ser. No. 08/747,539, filed Nov. 12, 1996, now U.S. Pat. No. 5,863,220 for the END CONNECTOR FITTING WITH CRIMPING DEVICE by Randall A. Holliday.}",
    "textBeforeTable": "Patent Citations It is therefore to be understood that the above and other modifications and changes may be readily made in the construction and arrangement of elements comprising the preferred and modified forms of invention without departing from the spirit and scope of the invention as defined by the appended claims and reasonable equivalents thereof. The crimping tool 74, the end connector 20 and the splice connector 210 thus provide a significant advantage over the related elements described in the above referenced patents since the tool 74 is relatively inexpensive in comparison to the professional quality crimping tools designed for use with more conventional end connectors, such as, the tool described in U.S. Pat. No. 5,743,131. Additionally, the end connector 20 and the splice connector 210 together with the pre-installed crimping rings 22 can be manufactured at a lower cost than the corresponding threaded connectors and threaded crimping devices described in said U.S. patent application Ser. No. 08/747,539. At this point, the crimping process on the left connecting end 212 is complete. The process for crimping the right crimping ring 220 to the right connecting end 214 is essentially identical to that for the left ring 218 and the left connecting end 212. Specifically, the splice connector 210 is turned around within the groove 190 of the tool 74 so that the rear end of the band 98 on the right crimping ring 220 is placed against the",
    "textAfterTable": "Connector and method of operation US6637101 Jun 22, 2001 Oct 28, 2003 Radio Frequency Systems, Inc. Coaxial cable preparation tool US6671944 May 4, 2001 Jan 6, 2004 International Communications Manufacturing Corporation Multipurpose coaxial cable tool US6733336 Apr 3, 2003 May 11, 2004 John Mezzalingua Associates, Inc. Compression-type hard-line connector US6769933 Nov 27, 2002 Aug 3, 2004 Corning Gilbert Inc. Coaxial cable connector and related methods US6780052 Dec 4, 2002 Aug 24, 2004 John Mezzalingua Associates, Inc. Compression connector for coaxial cable and method of installation US6783394 Mar 18, 2003 Aug 31, 2004 Randall A. Holliday Universal multi-stage compression connector US6790081 May 8, 2002 Sep 14, 2004 Corning Gilbert Inc. Sealed coaxial cable connector and related method US6817897 Sep 29, 2003 Nov 16, 2004 Alexander B. Chee End connector for coaxial cable US6830479 Jul 8, 2003",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}