{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34"
        ],
        [
            "",
            "State",
            "Northern Mariana Islands",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "2013 Statute Number",
            "4 CMC § 5101 Short Title.",
            "4 CMC § 5102 Consumer Protection: Findings and Purpose.",
            "4 CMC § 5103 Consumer Counsel: Findings and Purpose",
            "4 CMC § 5104 Definitions.",
            "4 CMC § 5105 Unlawful Acts or Practices.",
            "4 CMC § 5106 Exemptions.",
            "4 CMC § 5107 Restraint of Prohibited Acts.",
            "4 CMC § 5108 Unnecessary Elements of Unfair Competition.",
            "4 CMC § 5109 False or Misleading Statement.",
            "4 CMC § 5110 Statute of Limitations.",
            "4 CMC § 5111 Remedies Cumulative.",
            "4 CMC § 5112 Private and Class Actions.",
            "4 CMC § 5113 Non-Negotiability of Consumer Paper.",
            "4 CMC § 5114 Assurances of Voluntary Compliance.",
            "4 CMC § 5115 Investigation Authorized",
            "4 CMC § 5116 Authority of Attorney General to Issue Subpoenas, Administer Oaths, Conduct Hearings, and Promulgate Rules and Regulations.",
            "4 CMC § 5117 Service of Notices, Demands or Subpoenas",
            "4 CMC § 5118 Orders for Enforcement of Subpoenas or Investigative Demands.",
            "4 CMC § 5119 Regulations.",
            "4 CMC § 5120 Discrimination.",
            "4 CMC § 5121 Civil Penalities.",
            "4 CMC § 5122 Criminal Penalities.",
            "4 CMC § 5123 Construction.",
            "4 CMC § 5181 Alien and Immigrant Consumer Protection Act Definitions.",
            "4 CMC § 5182 Exemptions.",
            "4 CMC § 5183 Permissible Services.",
            "4 CMC § 5184 Prohibited Conduct.",
            "4 CMC § 5185 Surety Required.",
            "4 CMC § 5186 Written Contract Required.",
            "4 CMC § 5187 Signage Required.",
            "4 CMC § 5188 Advertising Requirements.",
            "4 CMC § 5189 Penalties and Remedies.",
            "4 CMC § 5190 Rule-making Authority"
        ],
        [
            "",
            "2013 Statute Language",
            "This article may be cited as the Consumer Protection Act.",
            "(a) The legislature finds that: (1) The public interest requires that consumers be protected from abuses in commerce which deprive them of the full value and benefit of their purchases of goods and services or which deceive them regarding the availability and nature of goods or services for sale. (2) These abuses create an unhealthy climate for business and restrict the economic growth of the Commonwealth. (3) The consumer often does not have sufficient information to make a rea-soned judgment regarding available goods or services. (4) Other practices in commerce need to be instituted or restricted in order to protect the interests of consumers. (5) In addition to the general public, merchants themselves, especially small business people, are consumers of goods and services from other mer-chants and can benefit from a curb on unethical marketing practices. (6) Consumers and merchants alike benefit from an orderly market envi-ronment in which both parties are aware of their rights and obligations. (b) It is the purpose of this article to: (1) Prohibit practices by merchants which deceive, mislead, or confuse the consumer. (2) Clarify the relationship between consumers and merchants and their re-spective rights and obligations. (3) Require or restrict commercial practices in order to further an orderly market environment. (4) Provide a mechanism for resolving disputes between merchants and consumers. (5) Provide civil and criminal remedies and penalties for violations of this article.",
            "(a) The legislature declares that the public health, welfare and interest require a strong and effective consumer protection program to protect the interests of both the consumers and the businesses. The legislature further declares that government can best advance the interests of consumers by facilitating the proper functioning of the free enterprise market economy by: (1) Educating the consumer about the choices available in the marketplace. (2) Protecting the consumer from the use of deceptive methods, acts, or practices in the sale of goods or services. (3) Fostering competition. (4) Promoting effective representation of consumers’ interests in all branches and levels of government. (b) A consumer counsel is designated within the office of the Attorney Gen-eral to coordinate preventive and remedial consumer protection programs of the Commonwealth government and to vigorously prosecute those who violate the consumer protection laws of the Commonwealth.",
            "As used in this article: (a) “Business practice” means any conduct carried out in a business context, whether an isolated act or a continuing series of related acts. (b) “Commerce” and “trade” mean the sale, advertising, offering for sale, contracting for sale, exchange, distribution for consideration, or solicitation for purchase to the general public of any goods or other property, real, personal, or tangible, or of any service, including any lottery, game of chance, or entertain-ment, or any other article, commodity, or thing of value, wherever situated or performed. (c) “Consumer counsel” means the attorney employed by the office of the Attorney General who is designated as consumer counsel, and includes any designees of the consumer counsel. (d) “Expiration date” means that date indicated on a product as a “use before”, “best before”, or “sell before” date or otherwise indicated on the product, its packaging, case, or lot by date or code designed to convey expiration or deterio-ration information. (e) “Expired merchandise” means any merchandise for which the expiration date has passed. (f) “Merchant” means any person required to have a business license from the Commonwealth to engage in commerce or any person who, from without the Commonwealth, engages in commerce within the Commonwealth or in any act essential to this commerce, or any person who conducts any lottery, game of chance, or entertainment within the Commonwealth, or any agent, broker, or other representative of such person. (g) “Person” means natural persons, corporations, firms, partnerships, joint stock companies, and associations or other organizations of persons. (h) “Unfair competition” means an unlawful, unfair or fraudulent business practice and unfair, untrue or misleading advertising and any activity prohibited in 4 CMC § 5105.",
            "The following unfair methods of competition and unfair or deceptive acts or practices in the conduct of any trade or commerce are hereby declared to be unlawful: (a) Passing off goods or services as those of another; (b) Causing likelihood of confusion or of misunderstanding as to the source, sponsorship, approval, or certification of goods or services; (c) Causing likelihood of confusion or misunderstanding as to affiliation, connection, or association with, or certification, by another; (d) Using deceptive representations or designations of geographic origin in connection with goods or services; (e) Representing that goods or services have sponsorship, approval, character-istics, ingredients, uses, benefits, or quantities that they do not have or that a person has a sponsorship, approval, status, affiliation, or connection that the person does not have; (f) Representing that goods are original or new if they are beyond their expira-tion date, deteriorated, altered, reconditioned, reclaimed, used or secondhand; (g) Representing that goods or services are of a particular standard, quality, or grade, or that goods are of a particular style or model, if they are of another; (h) Disparaging the goods, services, or business of another by false or mis-leading representation of fact; (i) Advertising goods or services with intent not to sell them as advertised; (j) Advertising goods or services with intent not to supply reasonably expecta-ble public demand, unless the advertisement discloses a limitation of quantity; (k) Making false or misleading statements of fact concerning the reasons for, existence of, or amounts of price reductions; (l) Engaging in any other conduct which similarly creates a likelihood of con-fusion or of misunderstanding; and (m) Engaging in any act or practice which is unfair or deceptive to the consumer; (n) Representing that any food, food product, beverage, drug, or any other substance is fit for human consumption, if it is not fit for human consumption; (o) Representing that goods or services are fit for any particular purpose, if they are not fit for that purpose; (p) Failing to reveal any known defect in or damage to any item entered in commerce, unless the item is stated to be so entered on an “as is” or similar basis; (q) Representing that a service is provided by a person qualified to perform the service, if the merchant knows or should know that the person is not so qualified; (r) Introducing into commerce any good or service which the merchant knows or should know is unsafe or which the merchant knows or should know may cause an unsafe condition in normal use, including performing a service which may cause an unsafe condition; (s) Engaging in automotive sales and services with the intent not to supply parts for a reasonably expectable public demand; (t) Engaging in price fixing which bears no reasonable relationship to the cost of the merchandise; (u) Stocking merchandise on shelves or on display without also displaying the price of the merchandise in a location which is close to the merchandise and clearly visible to the consumer; (v) Stocking expired merchandise on shelves or on display with merchandise that has not yet reached its expiration date in manner which does not clearly segregate the expired merchandise from other merchandise; (w) Selling expired merchandise without displaying a notice that the mer-chandise has expired or selling expired merchandise at more than half of the original retail price; (x) Increasing the cost of merchandise which has previously been placed into the stream of commerce by having been offered to the public for sale at a specific price, indicated by the price tag or marking placed on the goods; (y) Increasing the price of goods, solely on the basis of a shortage of supply caused by natural disaster or any other emergency situation; (z) Advertising goods without clearly indicating that such goods are unassem-bled, if such is the case; (aa) Advertising the price of unassembled furniture without clearly indicating the assembled price of such furniture, if the same furniture is available assembled from the seller; (bb) Representing that a transaction confers or involves rights, remedies, or obligations which it does not confer or involve, or which are prohibited by law; (cc) Representing that a part, replacement, or repair service is needed when it is not; (dd) Representing that the subject of a transaction has been supplied in ac-cordance with a previous representation when it has not; (ee) Representing that the consumer will receive a rebate, discount, or other economic benefit as the result of a transaction, if the earning of the benefit is contingent on an event to occur subsequent to the consummation of the transaction; (ff) Misrepresenting the authority of a salesman, representative, or agent to negotiate the final terms of a transaction with a consumer; and (gg) Inserting an unconscionable provision in a contract. (hh) Any violation of the Notaries Public Act, 4 CMC §§ 3311-3326.",
            "Nothing in this article shall apply to: (a) Actions or transactions carried out by the Commonwealth government, any branch thereof or any other governmental agency; or (b) Actions or transactions carried out by any person in the communication media, including any television or radio station or any publisher of a newspaper, magazine, or other publication, which broadcasts or publishes an advertisement without knowledge of its false, deceptive or misleading character.",
            "(a) Whenever the Attorney General has reason to believe that any person is using, has used, or is about to use any method, act or practice declared in 4 CMC § 5105 to be unlawful, and that proceedings would be in the public interest, the Attorney General may bring a civil action in the name of the Commonwealth against the person to restrain by temporary or permanent injunction the use of that method, act or practice. The notice must state generally the relief sought and must be served at least three days before the hearing of the action. The action may be brought in the Commonwealth Superior Court. The court may issue temporary or permanent injunctions to restrain and prevent violations of this article, and such injunctions shall be issued without bond. (b) The court may make such additional orders or judgments, including the appointment of a receiver, as may be necessary to prevent the use or employment by any person of any practice which constitutes unfair competition, or as may be necessary to restore to any person in interest any money or property, real or personal, which may have been acquired by means of any practice in this article declared to be unlawful.",
            "In order to prove an act of unfair competition, it is not necessary to show harm to a consumer or the presence of competition.",
            "(a) It is an offense for any person, or any employee or agent, with intent di-rectly or indirectly to dispose of real or personal property, or to perform services, professional or otherwise, or to induce the public to enter into any obligation relating thereto, to make or disseminate or cause to be made or disseminated before the public in this Commonwealth or from this Commonwealth before the public in any state or territory or foreign country, in any newspaper or other publication, or any advertising device, or by public outcry or proclamation, or in any other manner or means whatsoever, any statement, concerning such real or personal property or services, professional or otherwise, or concerning any circumstances or matter of fact connected with the proposed performance or disposition thereof, which is untrue or misleading, and which is known, or which by the exercise of reasonable care should be known, to be untrue or misleading. (b) It is an offense for any such person, firm or corporation to make or dissem-inate or cause to be so made or disseminated any such statement as part of a plan or scheme with the intent not to sell such personal property, real property or services, professional or otherwise, so advertised at the price so stated therein, or as so advertised. (c) A person convicted under this section may be punished by not more than six months imprisonment, or a fine of not more than $1,000, or both.",
            "Any action to enforce any cause of action pursuant to this article shall be commenced within four years after the cause or action accrued.",
            "Unless otherwise expressly provided, the remedies or penalties provided by this article are cumulative to each other and to the remedies or penalties available under all other laws of the Commonwealth.",
            "(a) Any person aggrieved as a result of a violation of this article may bring an action in the Commonwealth Superior Court for such legal or equitable relief as the court may order. In addition to actual damages, the court shall award liqui-dated damages in an amount equal to the actual damages in cases of willful violations, and shall award costs and reasonable attorney’s fees if the plaintiff prevails. (b) If the court finds that there are numerous other persons similarly situated, it may permit any person bringing an action under this section to constitute a class together with other persons, and, where individual notice is impractical, the court may permit notice to be given to the other persons by publication in lieu of personal notification. (c) Any permanent injunction judgment or order of the court made under 4 CMC § 5107 shall be prima facie evidence in an action brought under this section that the respondent used a method, act, or practice declared unlawful by 4 CMC § 5105. (d) In the context of third party liability claims, the term “third party” or “third party claimant” ordinarily refers to a claimant who is making a claim for damag-es against an insured who is, or claims to be, covered by a policy of insurance issued by an insurer. A third party claimant is not a “consumer” for purposes of this article. This article does not confer upon any such third party claimant any right, cause of action or remedy against any such insurer. A third party claimant who has asserted a claim against an insured does not have any right, cause of action or remedy against the insured’s insurer in relation to such claim based upon this article and does not have standing to assert any such right, cause of action or remedy against the insured’s insurer. No right, cause of action or remedy against an insurer pursuant to this Article shall be assignable to any such third party claimant.",
            "(a) If any contract for sale or lease of consumer goods or services on credit entered into between a retail seller and a retail buyer requires or involves the execution of a promissory note or instrument or other evidence of indebtedness of the buyer, such note, instrument or evidence of indebtedness shall have printed on the face of it the words “consumer paper,” and such note, instrument or evidence of indebtedness with the words “consumer paper” printed thereon shall not be a negotiable instrument. (b) Notwithstanding the absence of such notice on a note, instrument or evi-dence of indebtedness arising out of a consumer credit sale or consumer lease as described in this section, an assignee of the rights of the seller or lessor is subject to all claims and defenses of the buyer or lessee against the seller or lessor arising out of the sale or lease. Any agreement to the contrary shall be of no force or effect in limiting the rights of a consumer under this section. The assignee’s liability under this section may not exceed the amount owing to the assignee at the time the claim or defense is asserted against the assignee. Failure to imprint the words “consumer paper” on the note, instrument or evidence of indebtedness shall subject the seller or other responsible person to appropriate civil and criminal sanctions as provided in this article.",
            "In the administration of this article, the Attorney General may accept an assur-ance of voluntary compliance with respect to any method, act or practice deemed to be violative of the article from any person who has engaged in or is about to engage in such method, act or practice. Any such assurance shall be in writing and shall be filed with and subject to the approval of the Commonwealth Superi-or Court. Such assurance of voluntary compliance shall not be considered an admission of violation for any purpose. Matters thus closed may at any time be reopened by the Attorney General for further proceedings in the public interest, pursuant to 4 CMC § 5107.",
            "(a) When it appears to the Attorney General that a person has engaged in, is engaging in, or is about to engage in any act or practice declared to be unlawful by this article, or when the Attorney General believes it to be in the public interest that an investigation should be made to ascertain whether a person in fact has engaged in, is engaging in or is about to engage in such act or practice, the Attorney General may execute in writing and cause to be served upon any person who is believed to have information, documentary material or physical evidence relevant to the alleged or suspected violation, an investigative demand requiring the person to furnish, under oath or otherwise, a report in writing setting forth the relevant facts and circumstances of which the person has knowledge, or to appear and testify or to produce relevant documentary material or physical evidence for examination, at such reasonable time and place as may be stated in the investiga-tive demand. (b) At any time before the return date specified in an investigative demand, or within 20 days after the demand has been served, whichever period is shorter, a petition to extend the return date, or to modify or set aside the demand, stating good cause, may be filed in Commonwealth Superior Court.",
            "To accomplish the objectives and to carry out the duties prescribed by this article, the Attorney General, in addition to other powers conferred upon him by this article, may: (a) Issue subpoenas to any person; (b) Administer an oath or affirmation to any person; (c) Conduct hearings in aid of any investigation or inquiry; and (d) Prescribe such forms and promulgate such rules and regulations as may be necessary, which rules and regulations upon approval of the Governor shall have the force of law; provided, that none of the powers conferred by this article shall be used for the purpose of compelling any natural person to furnish testimony or evidence which might tend to incriminate or subject that person to a penalty or forfeiture; and provided further, that information obtained pursuant to the powers conferred by this article shall not be made public or disclosed by the Attorney General or his or her employees beyond the extent necessary for law enforcement purposes in the public interest.",
            "Service of any notice, demand or subpoena under this article shall be made personally within the Commonwealth, but if personal service cannot be obtained, substituted service may be made in the following manner: (a) Personal service thereof without the Commonwealth; or (b) The mailing thereof by registered or certified mail to the last known place of business, residence or abode within or without the Commonwealth of such person for whom the same is intended; or (c) As to any person other than a natural person, in the manner provided in the Rules of Civil Procedures as if a complaint or the pleading which institutes a civil proceeding had been filed; or (d) Such service as the Commonwealth Superior Court may direct in lieu of personal service within the Commonwealth.",
            "(a) If any person fails or refuses to file any statement or report, to or obey any subpoena or investigative demand issued by the Attorney General, the Attorney General may, after notice, apply to the Commonwealth Superior Court, and after hearing thereon, request an order: (1) Granting injunctive relief to restrain the person from engaging in the advertising or sale of any merchandise or the conduct of any trade or com-merce that is involved in the alleged or suspected violation; (2) Vacating, annulling, or suspending the corporate charter of a corpora-tion created by or under the laws of the Commonwealth, revoking or suspend-ing the business permit in the Commonwealth of a foreign corporation or revoking or suspending any other licenses, permits or certificates issued pur-suant to law to such person which are used to further the allegedly unlawful practice; and (3) Granting such other relief as may be required, until the person files the statement or report, or obeys the subpoena or investigative demand. (b) Any disobedience of any final order entered under this section by any court shall be punished as a contempt.",
            "(a) The consumer counsel with the concurrence of the Attorney General may promulgate regulations to carry out the purposes of this article. (b) In addition to any other regulation required under this article, the counsel may issue regulations to specify or clarify the terms of implied warranties, the conditions under which these terms are or are not applicable, and any conditions or methods pursuant to which these terms may be excluded, modified, or voided by the merchant or consumer. These regulations shall also provide for the resolution of disputes regarding warranties, either express or implied. (c) Within six months from the date of his or her initial appointment, the counsel shall issue regulations consistent with this article, regarding matters such as open dating and grading of perishable merchandise (such as eggs), unit pricing, marking of quantity and unit price on pre-measured bulk items, increas-ing prices of previously marked goods, or any other matter which the counsel finds necessary to regulate in order to protect the interests of consumers or to clarify the relationship between merchants and consumers; provided, that no regulation issued under this article shall fix the price of any goods or services or establish a formula by which such price shall be fixed. (d) The counsel, with respect to the implementation of this article, and the Director of Health and Environmental Services, with respect to his duties under any other law, shall cooperate with each other regarding the entry into commerce of food for human consumption, the sanitation of premises on which such food is prepared, stored, or sold, the sanitation of the premises of merchants generally, and hazardous substances, drugs, medicines, and remedies. (e) The counsel, with respect to the implementation of this article, and the Director of Natural Resources, with respect to his powers and duties under any other law, shall cooperate with each other regarding the inspection and grading of animal parts and products, including fish, eggs, and the entry into commerce of plants, plant parts and products, and food for animal consumption. (f) The regulations issued under this article shall be clear and understandable to consumers. When technical language is necessary, the regulations shall be accompanied by an explanation of their effect which is understandable to consumers.",
            "It is an offense for any merchant to discriminate in commerce with any person on the basis of the race, color, creed, religion, sex, age, ethnic background, national origin, citizenship, or place of birth or residence of the person.",
            "(a) Any person who violates the terms of an injunction issued under 4 CMC § 5107 shall forfeit and pay to the Commonwealth a civil penalty of not more than $10,000 per violation. For the purposes of this section, the Commonwealth court issuing an injunction shall retain jurisdiction, and the cause shall be continued, and in such cases the Attorney General, acting in the name of the Commonwealth, may petition for recovery of civil penalties. Where the conduct constituting a violation is of a continuing nature, each day of such conduct is a separate and distinct violation. In determining any amount of the civil penalty under this article, the court shall consider all relevant circumstances, including, but not limited to, the extent of the harm caused by the conduct constituting the violations, the nature and persistence of the conduct, the length of time over which the conduct occurred, and the assets, liabilities and net worth of the person, whether corporate or individual. (b) Any person who violates any provision of this article shall be liable for a civil penalty not to exceed $2,500 for each violation, which shall be assessed and recovered in a civil action brought in the name of the people of the Common-wealth by the Attorney General. (c) For the purposes of this section, a willful violation occurs when the party committing the violation knew or should have known that his or her conduct was a violation of 4 CMC § 5105. (d) Upon petition by the Attorney General, the court may, at its discretion, order the dissolution or suspension or forfeiture of franchise or corporate charter of any corporation which violates the terms of any injunction issued under 4 CMC § 5107.",
            "(a) Any merchant who knowingly or recklessly violates any provision of this article shall, upon conviction, be fined not more than $2,000, or imprisoned for not more than six months, or both. Each violation shall be a separate offense. (b) Whenever a corporation or other entity is subject to prosecution under subsection (a) of this section, any officer or agent of the corporation or legal entity who knowingly and willfully authorized, ordered or carried out the proscribed activity shall be subject to the same penalties as provided in subsec-tion (a) of this section.",
            "(a) In interpreting this article, the courts of the Commonwealth shall construe any ambiguity in any provision of this article, or in any regulation or order issued under this article, or in any implied or expressed warranty covered by this article, or any similar ambiguity, in favor of the consumer. (b) Except as otherwise provided in this article, the administrative remedies and penalties, criminal penalties, and private actions described in this article shall be cumulative, and the exercise of one shall not preclude the exercise of others, and these remedies, penalties, and actions shall be in addition to any other remedy, penalty or action afforded by any other law or regulation, including the common law. (c) Compliance with the requirements of this article shall not relieve, exempt, or excuse any merchant from any obligation arising from any legal duty to exercise due care or caution, or from liability for injury resulting from a breach of such duty, or in any other manner alter, modify, or diminish the responsibilities of the merchant.",
            "For the purposes of this Article, the following terms have the following meanings: (a) “Immigration or residency matter” means any proceeding, filing, or action affecting the nonimmigrant, immigrant, residency, non-residency or citizenship status of any person that arises under Commonwealth or federal labor, immigra-tion and/or naturalization law, executive order or presidential proclamation of the United States or any foreign country, executive order of the Governor of the Commonwealth, or that arises under action of the United States Immigration and Naturalization Service, or its successor agency, however constituted and named, the United States Department of Labor, the United States Department of State, or any entity of the Commonwealth government including any of its departments or agencies. (b) “Immigration or residency assistance service” means any advice, guidance, information, or action provided or offered to customers or prospective customers relating to any immigration or residency matter. (c) “Compensation” means money, property, services, promise of payment, or anything else of value. (d) “Employed by” means that a person is on the payroll of the employer and the employer deducts or should deduct from the employee’s paycheck any applicable taxes, or receives compensation from the employer on a commission basis or as an independent contractor. (e) “Reasonable costs” means actual costs or, if actual costs cannot be calcu-lated, reasonably estimated costs of such things as photocopying, telephone calls, document requests, and filing fees for immigration forms, and other nominal costs incidental to assistance in an immigration or residency matter.",
            "(a) The following persons and entities are exempt from this Article, provided they prove the exemption by the preponderance of the evidence: (1) An attorney licensed to practice law in any state or territory of the Unit-ed States or of any foreign country, when authorized by the Commonwealth Supreme Court, to the extent the attorney renders immigration or residency assistance service in the course of his or her practice as an attorney as permit-ted by the Commonwealth Supreme Court; (2) A legal intern, as described by the rules of the Commonwealth Supreme Court, employed by and under the direct supervision of a licensed attorney and rendering immigration or residency assistance service in the course of the intern’s employment, or acting in any other manner permitted by the Com-monwealth Supreme Court; (3) A not-for-profit organization recognized by the Board of Immigration Appeals under 8 C.F.R. § 292.2(a) and employees of those organizations ac-credited under 8 C.F.R. § 292.2(d); (4) Any organization employing or desiring to employ an alien or nonim-migrant alien, where the organization, its employees or its agents provide advice or assistance in immigration or residency matters to alien or nonimmi-grant alien employees or potential employees without compensation from the individuals to whom such advice or assistance is provided; (5) Any person approved by the Attorney General to represent applicants for Refugee Protection under Public Law 13-61 [codified at 3 CMC § 4344(d)]. (b) Nothing in this Article shall regulate any business to the extent that such regulation is prohibited or preempted by Commonwealth law, federal law or Rules of the Commonwealth Superior Court or Commonwealth Supreme Court. (c) All other persons providing or offering to provide immigration or residen-cy assistance service shall be subject to this Article.",
            "(a) Any person who provides or offers to provide immigration or residency assistance service may perform only the following services: (1) Completing a government agency form, requested by the customer and appropriate to the customer’s needs, only if the completion of that form does not involve a legal judgment for that particular matter; (2) Transcribing responses to a government agency form which is related to an immigration or residency matter, but not advising a customer as to his or her answers on those forms; (3) Translating information on forms to a customer and translating the cus-tomer’s answers to questions posed on those forms; (4) Securing for the customer supporting documents currently in existence, such as birth and marriage certificates, which may be needed to be submitted with government agency forms; (5) Translating documents from a foreign language into English, Chamorro or Carolinian; (6) Notarizing signatures on government agency forms, if the person per-forming the service is a notary public of the Commonwealth; (7) Making referrals, without fee, to attorneys who could undertake legal representation for a person in an immigration or residency matter; (8) Preparing or arranging for the preparation of photographs and finger-prints; (9) Arranging for the performance of medical testing and the obtaining of reports of such test results; (10) Conducting English, Chamorro and/or Carolinian language and civics courses; (11) Other services that the Attorney General determines by rule may be appropriately performed by such persons in light of the purposes of this Article. (b) The Attorney General may promulgate rules establishing maximum fees that may be charged for the services described in this section. The maximum fees must be reasonable in light of the costs of providing those services and the degree of professional skill required to provide the services.",
            "(a) No person subject to this Article shall charge fees directly or indirectly for referring an individual to an attorney or for any immigration or residency matter not authorized by this Article, provided that a person may charge a fee for notarizing documents as permitted by the Public Law 14-52, the Notaries Public Act [codified at 4 CMC §§ 3311-3326]. (b) No person engaged in providing immigration or residency services shall do any of the following: (1) Make any statement that the person can or will obtain special favors from or has special influence with the United States Immigration and Natural-ization Service or any other federal or Commonwealth government agency or department; (2) Retain any compensation for service not performed; (3) Refuse to return documents supplied by, prepared on behalf of, or paid for by the customer upon the request of the customer. These documents must be returned upon request even if there is a fee dispute between the immigra-tion or residency assistant and the customer; (4) Represent or advertise, in connection with the provision assistance in immigration or residency matters, other titles of credentials, including but not limited to “notary public” or “immigration consultant,” that could cause a customer to believe that the person possesses special professional skills or is authorized to provide advice on an immigration or residency matter; provided that a notary public appointed and commissioned by the Attorney General pursuant to the Notaries Public Act may use the term “notary public” if the use is accompanied by the statement that the person is not an attorney; (5) Give any legal advice concerning an immigration or residency matter; (6) Make any misrepresentation of false statement, directly or indirectly, to influence, persuade, or induce patronage.",
            "Any person performing immigration or residency services shall register with the Attorney General and submit verification of malpractice insurance or of a surety bond in an amount to be determined by regulation or rule promulgated by the Attorney General.",
            "(a) Except as provided otherwise in this subsection, before providing any assistance in an immigration or residency matter a person shall provide the customer with a written contract that includes the following: (1) An explanation of the services to be performed; (2) Identification of all compensation and costs to be charged to the cus-tomer for the services to be performed; (3) A statement that documents submitted in support of an application for nonimmigrant, immigrant, residency, non-residency or naturalization status may not be retained by the person for any purpose, including payment of compensation or costs. (b) This section does not apply to a not-for-profit organization that provides advice or assistance in immigration or residency matters to clients without charge beyond a reasonable fee to reimburse the organization’s or clinic’s reasonable costs relating to providing immigration services to that client. (c) A copy of the contract shall be provided to the customer upon the custom-er’s execution of the contract. (d) A customer has the right to rescind a contract required by this section within 72 hours after his or her signing of the contract. (e) The written contract shall be in both the language of the customer and either English, Chamorro or Carolinian.",
            "Any person who provides or offers immigration or residency assistance ser-vice and is not exempted from this Article, shall post signs at his or her place of business, setting forth information in English, Chamorro or Carolinian and in every other language in which the person provides or offers to provide immigra-tion or residency assistance service. Each language shall be on a separate sign. Signs shall be posted in a location where the signs will be visible to customers. Each sign shall be at least 11 inches by 17 inches, and shall contain the following: (a) The statement “I AM NOT AN ATTORNEY LICENSED TO PRACTICE LAW AND MAY NOT GIVE LEGAL ADVICE OR ACCEPT FEES FOR LEGAL ADVICE.” (b) The statement “I AM NOT ACCREDITED TO REPRESENT YOU BEFORE THE UNITED STATES IMMIGRATION AND NATURALIZATION SERVICE, THE IMMIGRATION BOARD OF APPEALS, THE COURTS OF THE COMMONWEALTH OR THE DEPARTMENT OF LABOR.” (c) The fee schedule. (d) The statement that “You may cancel any contract for my immigration or residency services within 3 working days and get your money back for services not performed.” (e) Additional information the Attorney General may require by rule.",
            "(a) Every person engaged in immigration or residency assistance service who is not an attorney who advertises immigration or residency assistance service in a language other than English, whether by radio, television, signs, business cards, pamphlets, newspapers, or other written communication, electronic or otherwise, with the exception of a single desk plaque, shall post or otherwise include with such advertisement a notice in English and the language in which the advertise-ment appears. This notice shall be of a conspicuous size, if in writing, and shall state: “I AM NOT AN ATTORNEY LICENSED TO PRACTICE LAW AND MAY NOT GIVE LEGAL ADVICE OR ACCEPT FEES FOR LEGAL ADVICE.” If such advertisement is by radio or television, the statement may be modified but must include substantially the same message. (b) Literal translation of the word “licensed” into a language other than English is prohibited. For the purposes of this Section, “literal translation” of a word or phrase from one language to another means the translation of a word or phrase without regard to the true meaning of the word or phrase in the language which is being translated.",
            "(a) Any person who violates any provision of this Article, or the rules and regulations promulgated under this Article, shall be guilty of a misdemeanor for a first offense punishable by a fine not to exceed $ 500.00, a term of imprisonment not to exceed one year, or both. For a second or subsequent offense committed within 5 years of a previous conviction for the same offense, a person may be punished by a fine not to exceed $ 2,000.00, a term of imprisonment not to exceed two years, or both. (b) Upon his or her own information or upon the complaint of any person, the Attorney General or his or her designee may maintain an action for injunctive relief and also seek a civil penalty not exceeding $10,000 in the Superior Court against any person who violates any provision of this Article. These remedies are in addition to, and not in substitution for, other available remedies. (c) If the Attorney General or the Attorney General’s designee fails to bring an action as provided under subsection (b), any person may file a civil action to enforce the provisions of this Article and maintain an action for injunctive relief or for such additional relief as may be appropriate to deter, prevent, or compen-sate for the violation. In order to deter violations of this Article, courts shall not require a showing of the traditional elements for equitable relief. A prevailing plaintiff may be awarded punitive damages, attorney’s fees, and costs of bringing an action under this Article. (d) It is the express intention of the Legislature that remedies for violation of this Article be cumulative.",
            "The Attorney General shall issue rules or regulations not inconsistent with this Article for the implementation, administration, and enforcement of this Article. The rules or regulations may provide for the following: (a) The content, print size, and print style of the signs and notices required by Sections 5187 and 5188. Print sizes and styles may vary from language to language. (b) Standard forms for use in the administration of this Article. (c) Any additional requirements deemed necessary."
        ]
    ],
    "pageTitle": "Northern Mariana Islands CPS",
    "title": "",
    "url": "https://docs.google.com/spreadsheets/d/19N_5zY26MljdP-ypH8Z1_cyj0H0F-gWAIvUcu80NTPI/pub?output=html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 867349687,
    "recordOffset": 867327423,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Northern Mariana Islands CPS : Sheet1",
    "textAfterTable": "Published by Google Sheets – Report Abuse – Updated automatically every 5 minutes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}