{
    "relation": [
        [
            "Date",
            "May 12, 2006",
            "Dec 18, 2008",
            "Mar 2, 2010",
            "May 18, 2012",
            "May 14, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PELIKAN TECHNOLOGIES, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:FREEMAN, DOMINIQUE;BOECKER, DIRK;ALDEN, DON;AND OTHERS;SIGNING DATES FROM 20060201 TO 20060407;REEL/FRAME:017891/0299",
            "Owner name: GENERAL ELECTRIC CAPITAL CORPORATION,CONNECTICUT Free format text: SECURITY AGREEMENT;ASSIGNOR:PELIKAN TECHNOLOGIES, INC.;REEL/FRAME:021998/0381 Effective date: 20081031",
            "Owner name: PELIKAN TECHNOLOGIES, INC.,CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION;REEL/FRAME:024016/0492 Effective date: 20100302 Owner name: PELIKAN TECHNOLOGIES, INC., CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GENERAL ELECTRIC CAPITAL CORPORATION;REEL/FRAME:024016/0492 Effective date: 20100302",
            "Owner name: SANOFI-AVENTIS DEUTSCHLAND GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PELIKAN TECHNOLOGIES, INC.;REEL/FRAME:028236/0935 Effective date: 20120131",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7850622 - Tissue penetration device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7850622?dq=5685792",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 497288539,
    "recordOffset": 497199367,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6265=FIG. 97 illustrates 901 distal end 901 of a hypodermic needle 902 being driven into layers of skin tissue 903 by an electromagnetic controllable driver 904. The electromagnetic controllable driver 904 of FIG. 79 can have any suitable configuration, such as the configuration of electromagnetic controllable drivers discussed above. The layers of skin 903 being penetrated include the stratum corneum 905, the stratum lucidum 906, the stratum granulosum 907, the stratum spinosum 908, the stratum basale 909 and the dermis 911. The thickness of the stratum corneum 905 is typically about 300 micrometers in thickness. The portion of the epidermis excluding the stratum corneum 905 includes the stratum lucidum 906, stratum granulosum 907, and stratum basale can be about 200 micrometers in thickness. The dermis can be about 1000 micrometers in thickness. In FIG. 97, an outlet port 912 of the hypodermic needle 902 is shown disposed approximately in the stratum spinosum 908 layer of the skin 903 injecting an agent 913 into the stratum spinosum 908.}",
    "TableContextTimeStampAfterTable": "{304240=Adjacent the lancet exit port 754 within the sample input cavity 715′ is the sample input port 741 that is configured to accept a fluid sample that emanates into the sample input cavity 715′ from target tissue 233 at a lancing site after a lancing cycle. The dimensions of the sample input port 741 can a depth of about 60 to about 70 microns, a width of about 400 to about 600 microns. The sample input cavity can have a transverse dimension of about 2 to about 5 times the transverse dimension of the lancet 183, or about 400 to about 1000 microns. The sample input cavity serves to accept a fluid sample as it emanates from lanced tissue and direct the fluid sample to the sample input port 741 and thereafter the sample flow channel 742. The sample flow channel 742 is disposed between and in fluid communication with the sample input port 741 and the analytical region 743. The transverse dimensions of the sample flow channel 742 can be the same as the transverse dimensions of the sample input port 741 with a depth of about 60 to about 70 microns, a width of about 400 to about 600 microns. The length of the sample flow channel 742 can be about 900 to about 1100 microns. Thus, in use, target tissue is disposed on the sampling site 715 and a lancing cycle initiated. Once the target tissue 233 has been lanced and the sample begins to flow therefrom, the sample enters the sample input cavity 715′ and then the sample input port 741. The sample input cavity 715′ may be sized and configured to facilitate sampling success by applying pressure to a perimeter of target tissue 233 before, during and after the lancing cycle and hold the wound track open after the lancing cycle to allow blood or other fluid to flow from the wound track and into the sample input cavity 715′. From the sample input port 741, the sample in then drawn by capillary or other forces through the sample flow channel 742 and into the analytical region 743 and ultimately into the control chamber 744. The control chamber 744 may be used to provide indirect confirmation of a complete fill of the analytical region 743 by a sample fluid. If a fluid sample has been detected in the control chamber 744, this confirms that the sample has completely filled the analytical region 743. Thus, sample detectors may be positioned within the control chamber 744 to confirm filling of the analytical region 743., 299816=The lancet channel 736 has a proximal end 752 and a distal end 753 and includes a series of lancet bearing guide portions 749-751 and sample flow stopping structures 747-748. The lancet guides 749-751 may be configured to fit closely with the shaft of the lancet 183 and confine the lancet 183 to substantially axial movement. At the distal end 753 of the lancet channel 736 the distal-most lancet guide portion 749 is disposed adjacent the sample input port 741 and includes at its distal-most extremity, the lancet exit port 754 which is disposed adjacent the sample input cavity 715′. The sample input cavity can have a transverse dimension, depth or both, of about 2 to 5 times the transverse dimension of the lancet 183, or about 0.2 to about 2 mm, specically, about 0.4 to about 1.5 mm, and more specifially, about 0.5 to about 1.0 mm. The distal-most lancet guide 749 can have inner transverse dimensions of about 300 to about 350 microns in width and about 300 to about 350 microns in depth. Proximal of the distal-most lancet guide portion 749 is a distal sample flow stop 747 that includes a chamber adjacent the distal-most lancet 749. The chamber has a transverse dimension that is significantly larger than the transverse dimension of the distal-most lancet guide 749. The chamber can have a width of about 600 to about 800 microns, and a depth of about 400 to about 600 microns and a length of about 2000 to about 2200 microns. The rapid transition of transverse dimension and cross sectional area between the distal-most lancet bearing guide 749 and the distal sample flow stop 747 interrupts the capillary action that draws a fluid sample through the sample input cavity 715′ and into the lancet channel 736., 49008=This application is a divisional of U.S. Ser. No. 10/127,395 filed Apr. 19, 2002 now U.S. Pat. No. 7,025,774, which claims the benefit of U.S. Provisional Patent Application Ser. No. 60/298,055 filed Jun. 12, 2001; U.S. Provisional Patent Application Ser. No. 60/298,126 filed Jun. 12, 2001; U.S. Provisional Patent Application Ser. No. 60/297,861 filed Jun. 12, 2001; U.S. Provisional Patent Application Ser. No. 60/298,001 filed Jun. 12, 2001, U.S. Provisional Patent Application Ser. No. 60/298,056 filed Jun. 12, 2001; U.S. Provisional Patent Application Ser. No. 60/297,864 filed Jun. 12, 2001; and U.S. Provisional Patent Application Ser. No. 60/297,860 filed Jun. 12, 2001; all U.S. patent applications stated above being hereby incorporated by reference., 297172=In one lancet 183 embodiment, the drive head 198 of the lancet 183 can have a width of about 0.9 to about 1.1 mm. The thickness of the drive head 198 of the lancet 183 can be about 0.4 to about 0.6 mm. The drive head slot 714 of the sampling module 709 should have a width that allows the drive head 198 to move freely within the drive head slot 714. The shaft portion 201 of the lancet 183 can have a transverse dimension of about 50 μm to about 1000 μm. Typically, the shaft portion 201 of the lancet 183 has a round transverse cross section, however, other configurations are contemplated., 96225=The embodiment described above generally uses the principles of a magnetic attraction drive, similar to commonly available circular stepper motors (Hurst Manufacturing BA Series motor, or “Electrical Engineering Handbook” Second edition p 1472-1474, 1997). These references are hereby incorporated by reference. Other embodiments can include a linear induction drive that uses a changing magnetic field to induce electric currents in the lancet assembly. These induced currents produce a secondary magnetic field that repels the primary field and applies a net force on the lancet assembly. The linear induction drive uses an electrical drive control that sweeps a magnetic field from pole to pole, propelling the lancet before it. Varying the rate of the sweep and the magnitude of the field by altering the driving voltage and frequency controls the force applied to the lancet assembly and its velocity., 301762=A center lancet bearing guide 750 is disposed proximal of the distal lancet channel stop 747 and can have dimensions similar to those of the distal-most lancet bearing guide 749. Proximal of the center lancet guide 750 is a proximal lancet channel stop 748 with a chamber. The dimensions of the proximal lancet channel stop can be the same or similar to those of the distal lancet channel stop 747. The proximal lancet channel stop 748 can have a width of about 600 to about 800 microns, and a depth of about 400 to about 600 microns and a length of about 2800 to about 3000 microns. Proximal of the proximal lancet channel stop 748 is a proximal lancet guide 751. The proximal lancet guide 751 can dimensions similar to those of the other lancet guide 749 and 750 portions with inner transverse dimensions of about 300 to about 350 microns in width and about 300 to about 350 microns in depth. Typically, the transverse dimension of the lancet guides 749-751 are about 10 percent larger than the transverse dimension of the shaft portion 201 of the lancet 183 that the lancet guides 749-751 are configured to guide., 105494=In another embodiment, a feedback loop can use a commercially available LED/photo transducer module such as the OPB703 manufactured by Optek Technology, Inc., 1215 W. Crosby Road, Carrollton, Tex., 75006 to determine the distance from the fixed module on the stationary housing to a reflective surface or target mounted on the lancet assembly. The LED acts as a light emitter to send light beams to the reflective surface, which in turn reflects the light back to the photo transducer, which acts as a light sensor. Distances over the range of 4 mm or so are determined by measuring the intensity of the reflected light by the photo transducer. In another embodiment, a feedback loop can use a magnetically permeable region on the lancet shaft itself as the core of a Linear Variable Differential Transformer (LVDT)., 189635=By calibrating the intensity of reflected light from the reflective member 319 for various positions of the lancet 297 during the operating cycle of the driver coil pack 295, the position of the lancet 297 can thereafter be determined by measuring the intensity of reflected light at any given moment. In one embodiment, the sensor 296 uses a commercially available LED/photo transducer module such as the OPB703 manufactured by Optek Technology, Inc., 1215 W. Crosby Road, Carrollton, Tex., 75006. This method of analog reflective measurement for position sensing can be used for any of the embodiments of lancet actuators discussed herein. In addition, any of the lancet actuators or drivers that include coils may use one or more of the coils to determine the position of the lancet 297 by using a magnetically permeable region on the lancet shaft 303 or magnetic member 301 itself as the core of a Linear Variable Differential Transformer (LVDT)., 49803=This application is also related to copending U.S. patent application Ser. No. 10/127,201 filed Apr. 19, 2002 and U.S. Patent Application Ser. No. 60/374,304 filed Apr. 19, 2002, both of which are hereby incorporated by reference in their entirety., 306882=The analytical region 743 is disposed between and in fluid communication with the sample flow channel 742 and the control chamber 744. The analytical region 743 can have a depth of about 60 to about 70 microns, a width of about 900 to about 1100 microns and a length of about 5 to about 6 mm. A typical volume for the analytical region 743 can be about 380 to about 400 nanoliters. The control chamber 744 is disposed adjacent to and proximal of the analytical region 743 and can have a transverse dimension or diameter of about 900 to about 1100 microns and a depth of about 60 to about 70 microns.}",
    "textBeforeTable": "Patent Citations Other embodiments of the invention will be apparent to those skilled in the art from consideration of the specification and practice of the invention disclosed herein. It is intended that the specification and examples be considered as exemplary only, with a true scope and spirit of the invention being indicated by the appended claims. allows for alignment of various sampling module portions 948 and lancet module portions 950 with relative rotational movement, other embodiments that function similarly are also contemplated. For example, lancet module portions, sampling module portions or both, could be arranged in a two dimensional array with relative x-y motion being used to align the module portions in a functional arrangement. Such relative x-y motion could be accomplished with position sensors and servo motors in such an alternative embodiment order to achieve the alignment. FIGS. 102-106 The cartridge bodies 946 and 947 may have features, dimensions or materials that are the same as, or similar to, features, dimensions or materials of the sampling cartridges and lancet cartridges, or any components thereof, discussed above. The module portions 948 and 950 may also have features, dimensions or materials that are the same as, or similar to, features, dimensions or materials of the lancet or sampling modules, or any components thereof, discussed above. In addition, the cartridge 945 can be coupled to, or positioned adjacent any of the drivers discussed above, or",
    "textAfterTable": "US4353984 Jan 4, 1980 Oct 12, 1982 Kabushiki Kaisha Kyoto Daiichi Kagaku Composition and test piece for measuring glucose concentration in body fluids US4360016 Jul 1, 1980 Nov 23, 1982 Transidyne General Corp. Blood collecting device US4388922 * Jul 29, 1981 Jun 21, 1983 Becton, Dickinson And Company Suction canister system for serial collection of fluids US4391905 Mar 15, 1982 Jul 5, 1983 Miles Laboratories, Inc. System for the determination of glucose in fluids US4391906 Mar 15, 1982 Jul 5, 1983 Miles Laboratories, Inc. System for the determination of glucose in fluids US4414975 May 15, 1981 Nov 15, 1983 Ryder International Corp. Blood lancet US4420564 Nov 4, 1981 Dec 13, 1983 Fuji Electric Company, Ltd. Blood sugar analyzer having fixed enzyme membrane sensor US4426451 Jan 28, 1981 Jan 17, 1984 Eastman Kodak Company Multi-zoned reaction vessel having pressure-actuatable control means between zones",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}