{
    "relation": [
        [
            "Date",
            "Feb 19, 2002",
            "Mar 14, 2011",
            "Sep 12, 2011",
            "Jan 31, 2012",
            "Feb 10, 2012",
            "Jan 30, 2013",
            "Feb 8, 2013",
            "Nov 15, 2013",
            "Sep 30, 2014",
            "Mar 12, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: GENESYS TELECOMMUNICATIONS LABORATORIES, INC., CAL Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PETROVYKH, YEVGENIY;REEL/FRAME:012627/0506 Effective date: 20020219",
            "Year of fee payment: 4",
            "Owner name: ALCATEL LUCENT, FRANCE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;REEL/FRAME:026887/0371 Effective date: 20090309",
            "Owner name: GOLDMAN SACHS LENDING PARTNERS LLC, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;REEL/FRAME:027623/0096 Effective date: 20120131",
            "Owner name: GENESYS TELECOMMUNICATIONS LABORATORIES, INC., CAL Free format text: ASSIGNMENT OF 50% INTEREST;ASSIGNOR:ALCATEL LUCENT;REEL/FRAME:027685/0989 Effective date: 20120130",
            "Owner name: CREDIT SUISSE AG, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:LUCENT, ALCATEL;REEL/FRAME:029821/0001 Effective date: 20130130 Owner name: CREDIT SUISSE AG, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:ALCATEL LUCENT;REEL/FRAME:029821/0001 Effective date: 20130130",
            "Owner name: GOLDMAN SACHS BANK USA, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;REEL/FRAME:029778/0939 Effective date: 20130208 Owner name: GENESYS TELECOMMUNICATIONS LABORATORIES, INC., CAL Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GOLDMAN SACHS LENDING PARTNERS LLC;REEL/FRAME:029778/0060 Effective date: 20130208",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS COLLATERAL AGENT, DE Free format text: SECURITY AGREEMENT;ASSIGNORS:GENESYS TELECOMMUNICATIONS LABORATORIES, INC.;ANGEL.COM INCORPORATED;UTOPY, INC.;AND OTHERS;REEL/FRAME:031644/0814 Effective date: 20131113",
            "Owner name: ALCATEL LUCENT, FRANCE Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CREDIT SUISSE AG;REEL/FRAME:033868/0001 Effective date: 20140819",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20020087648 - System and apparatus for pre-routing network events - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20020087648?dq=7,339,580",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477787531,
    "recordOffset": 477757403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25670=[0001] The present patent application is a Continuation In Part (CIP) to a patent application Ser. No. 09/599,045 entitled, “System For Routing Electronic Mails”, filed on Jun. 21, 2000, which is a divisional application of patent application, Ser. No. 08/998,268, now issued as which is a divisional application of Ser. No. 08/795,680. The prior applications are incorporated herein in their entirety by reference.}",
    "textBeforeTable": "Patent Citations [0075] The invention has been described with reference to exemplary embodiments thereof. Various modification and changes may be made thereunto without departing from the broad spirit and scope of the invention. The specification and drawings are, accordingly, to be regarded in an illustrative rather than a restrictive sense; the invention is limited only by the provided claims. [0074] Referring now to FIG. 1, pre-routing server 401 would be implemented between adaptor 110 and router 116 and would have access to all machines connected to LAN 128. Moreover, pre-routing server 401 would have additional connection with network routing apparatus and automated systems (not shown). In a virtual queue embodiment, separate types of media would not have to be en-queued in media specific queues until the point of interaction with an agent after agent-level routing has been approved and performed. Information from the virtual queue position of each event can be used to direct the agent in pursuing his or her responses and treatments with regards to which queues to work from etc. There are many possibilities. [0073] In still another embodiment, a gatekeeper (not shown) could be provided on the agent side of pre-routing server 401 and be adapted as an additional screening mechanism. In this case, all events having a special code or pre-set phrase are sent to the gatekeeper, which then filters the events further, perhaps using",
    "textAfterTable": "Delegating instant messaging sessions * Cited by examiner Classifications U.S. Classification 709/206, 348/E07.083, 348/E07.082 International Classification G06Q10/10, H04N7/15, H04L12/58, H04M3/53, H04M3/51, H04M3/42, H04L12/56, H04M7/00, H04N7/14 Cooperative Classification H04L12/5855, H04L51/14, H04M3/42323, H04M3/42102, H04M3/5183, H04M3/5191, H04N7/148, H04M2242/22, G06Q10/107, H04L45/00, H04L45/306, H04M7/0006, H04M3/5166, H04L51/26, H04M7/0009, H04M3/5307, H04L45/308, H04N7/15, H04M2201/50 European Classification G06Q10/107, H04L45/306, H04L45/308, H04L45/00, H04L51/14, H04N7/15, H04N7/14A4, H04L12/58G, H04M3/51R, H04M3/51T2 Legal Events Date Code Event Description Feb 19, 2002 AS Assignment Owner name: GENESYS TELECOMMUNICATIONS LABORATORIES, INC., CAL",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}