{
    "relation": [
        [
            "Citing Patent",
            "US7333150 *",
            "US7610359 *",
            "US7660831 *",
            "US7668907 *",
            "US7715694",
            "US7739410",
            "US7761414",
            "US7778523",
            "US7778971",
            "US7805403",
            "US7849145 *",
            "US7949634",
            "US7966309",
            "US7966321",
            "US7991738",
            "US7995900",
            "US8005822",
            "US8010688 *",
            "US8126845",
            "US8161195 *",
            "US8209540",
            "US8239504",
            "US8295679",
            "US8326858",
            "US8332898",
            "US8375112",
            "US8391677",
            "US8392826",
            "US8489591",
            "US8620520 *",
            "US8626771 *",
            "US8671279",
            "US8676028",
            "US8699854",
            "US8838729",
            "US8886600",
            "US8966407",
            "US8996507",
            "US9021136 *",
            "US20040133661 *",
            "US20040148601 *",
            "US20040260839 *",
            "US20090006434 *",
            "US20100251240 *",
            "US20120041762 *",
            "US20130262706 *",
            "WO2009006084A2 *",
            "WO2009023433A1 *"
        ],
        [
            "Filing date",
            "May 14, 2004",
            "Dec 4, 2003",
            "Jan 7, 2007",
            "Aug 16, 2001",
            "Aug 3, 2009",
            "Jan 7, 2007",
            "Jan 7, 2007",
            "Jul 29, 2009",
            "Jan 7, 2007",
            "Jan 7, 2007",
            "Jul 27, 2005",
            "Feb 8, 2010",
            "Jan 17, 2007",
            "Jan 17, 2007",
            "Aug 9, 2010",
            "Dec 4, 2003",
            "Jan 17, 2007",
            "Jan 12, 2004",
            "Sep 24, 2010",
            "Mar 25, 2009",
            "Jun 28, 2007",
            "Jan 7, 2007",
            "Apr 28, 2009",
            "Jan 17, 2007",
            "Aug 9, 2007",
            "Aug 3, 2012",
            "Jan 7, 2005",
            "Jun 24, 2009",
            "Jun 2, 2011",
            "May 6, 2009",
            "Jun 29, 2007",
            "Jun 19, 2012",
            "Jan 25, 2010",
            "Jan 25, 2010",
            "Jun 29, 2007",
            "Feb 24, 2012",
            "Jan 17, 2007",
            "Aug 22, 2011",
            "Apr 2, 2012",
            "Dec 4, 2003",
            "Jan 14, 2004",
            "Jan 12, 2004",
            "Jun 29, 2007",
            "",
            "Dec 7, 2010",
            "Apr 2, 2012",
            "Jun 24, 2008",
            "Jul 29, 2008"
        ],
        [
            "Publication date",
            "Feb 19, 2008",
            "Oct 27, 2009",
            "Feb 9, 2010",
            "Feb 23, 2010",
            "May 11, 2010",
            "Jun 15, 2010",
            "Jul 20, 2010",
            "Aug 17, 2010",
            "Aug 17, 2010",
            "Sep 28, 2010",
            "Dec 7, 2010",
            "May 24, 2011",
            "Jun 21, 2011",
            "Jun 21, 2011",
            "Aug 2, 2011",
            "Aug 9, 2011",
            "Aug 23, 2011",
            "Aug 30, 2011",
            "Feb 28, 2012",
            "Apr 17, 2012",
            "Jun 26, 2012",
            "Aug 7, 2012",
            "Oct 23, 2012",
            "Dec 4, 2012",
            "Dec 11, 2012",
            "Feb 12, 2013",
            "Mar 5, 2013",
            "Mar 5, 2013",
            "Jul 16, 2013",
            "Dec 31, 2013",
            "Jan 7, 2014",
            "Mar 11, 2014",
            "Mar 18, 2014",
            "Apr 15, 2014",
            "Sep 16, 2014",
            "Nov 11, 2014",
            "Feb 24, 2015",
            "Mar 31, 2015",
            "Apr 28, 2015",
            "Jul 8, 2004",
            "Jul 29, 2004",
            "Dec 23, 2004",
            "Jan 1, 2009",
            "Sep 30, 2010",
            "Feb 16, 2012",
            "Oct 3, 2013",
            "Jan 8, 2009",
            "Feb 19, 2009"
        ],
        [
            "Applicant",
            "Pixel Instruments Corporation",
            "Lg Electronics Inc.",
            "Apple Inc.",
            "Microsoft Corporation",
            "Lg Electronics Inc.",
            "Apple Inc.",
            "Apple Inc.",
            "Lg Electronics Inc.",
            "Apple Inc.",
            "Apple Inc.",
            "Nhn Corporation",
            "Apple Inc.",
            "Google Inc.",
            "Google Inc.",
            "Apple Inc.",
            "Lg Electronics Inc.",
            "Google Inc.",
            "Panasonic Corporation",
            "Apple Inc.",
            "Microsoft Corporation",
            "Apple Inc.",
            "Apple Inc.",
            "Lg Electronics Inc.",
            "Google Inc.",
            "Echostar Technologies L.L.C.",
            "Apple Inc.",
            "Panasonic Corporation",
            "Sonic Solutions Llc",
            "Google Inc.",
            "Robert Bosch Gmbh",
            "Microsoft Corporation",
            "Apple Inc.",
            "Lg Electronics Inc.",
            "Lg Electronics Inc.",
            "Microsoft Corporation",
            "Apple Inc.",
            "Google Inc.",
            "Google Inc.",
            "F-Secure Corporation",
            "Lg Electronics Inc.",
            "Kroening James L.",
            "Sen'ichi Onoda",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Pixel Instruments Corporation",
            "F-Secure Corporation",
            "Microsoft Corp",
            "Echostar Technologies Llc"
        ],
        [
            "Title",
            "Method, system, and program product for eliminating error contribution from production switchers with internal DVEs",
            "Method and apparatus for reproducing data recorded on an interactive recording medium in conjunction with associated auxiliary data recorded in multiple locations",
            "Synchronization methods and systems",
            "Method and system for selectively viewing participants of a multimedia network conference",
            "Apparatus and method of reproducing audio/video data and additional data associated with the audio/video data",
            "Synchronization methods and systems",
            "Asynchronous data synchronization amongst devices",
            "Method for reproducing data recorded on an interactive recording medium in conjunction with associated auxiliary data",
            "Synchronization methods and systems",
            "Synchronization methods and systems",
            "Method and system for providing joint viewing service of moving picture",
            "Synchronization methods and systems",
            "Providing relevance-ordered categories of information",
            "Presentation of local results",
            "Synchronization methods and systems",
            "Method of presenting auxiliary data for an interactive recording medium",
            "Location in search queries",
            "Content use management system, content use management method, and client device",
            "Synchronization methods and systems",
            "Adaptable management in sync engines",
            "Incremental secure backup and restore of user settings and data",
            "Synchronization methods and systems",
            "Method of presenting auxiliary data for an interactive recording medium",
            "Synchronization of fixed and mobile data",
            "Apparatus, systems and methods to synchronize communication of content to a presentation device and a mobile device",
            "Synchronization methods and systems",
            "Recording medium, reproduction device, program, reproduction method",
            "Methods and systems for use in maintaining media data quality upon conversion to a different data format",
            "Presentation of local results",
            "Method for controlling devices, and a device in a communications network in a motor vehicle",
            "Container reputation",
            "Incremental secure backup and restore of user settings and data",
            "Method for reproducing data recorded on an interactive recording medium in conjunction with associated auxiliary data",
            "Method for reproducing data recorded on an interactive recording medium in conjunction with associated auxiliary data",
            "Gathering statistics based on container exchange",
            "Synchronization methods and systems",
            "Expandable homepage modules",
            "Location in search queries",
            "Data synchronisation",
            "Method for reproducing data recorded on an interactive recording medium in conjunction with associated auxiliary data",
            "Method and system for calculation and use of a disk image identifer",
            "Content use management system, content use management method, and client device",
            "Container Reputation",
            "Adaptable management in sync engines",
            "Dialogue Detector and Correction",
            "Data Syncronisation",
            "Portable synchronizable data container",
            "Apparatus, systems and methods to synchronize communication of content to a presentation device and a mobile device"
        ]
    ],
    "pageTitle": "Patent US7188193 - System, method and article of manufacture for a synchronizer component in a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7188193?dq=7800613",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484233335,
    "recordOffset": 484175833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6246=FIG. 18 illustrates a logical sequence diagram 1800 that shows server side collaboration. As shown, server ISAPI extension receives a BroadcastVideoEvents request. It calls IA_BusinessServer via BeginProcess, to retrieve configuration information. Configuration information contains a playback connector. Playback connector identifies whether the server will have to communicate with a reference player or will it perform playback from the database.}",
    "TableContextTimeStampAfterTable": "{100514=Thereafter, in operation 1004, the command is sent to the corresponding client apparatus for beginning the playback of the event simultaneously with the playback of the event on each of the remaining client apparatuses., 82588=An example setting forth details relating to identifying DVDs will now be set forth. First, a content owner (such as studio) requests use of the BCA on their DVDs. Based on request, the replicator (examples include WAMO, Panasonic, Nimbus, Technicolor, Pioneer, Crest) adds unique BCA number to every DVD. Adding BCA number to each DVD requires a special (YAG) laser. This may be the very last step in the manufacturing process. The BCA numbers for a specific DVD must then be entered into InterActual's BCA database. Information to track includes: DVD title, i.e. “Lost in Space”; BCA #/range, i.e. 12345687890; and Shipping Packaging/Tracking Container, i.e. Box 52221 to Hollywood Video., 67740=Thus, through the development of frameworks for solutions to various problems and programming tasks, significant reductions in the design and development effort for software can be achieved. A preferred embodiment of the invention utilizes HyperText Markup Language (HTML) to implement documents on the Internet together with a general-purpose secure communication protocol for a transport medium between the client and the Newco. HTTP or other protocols could be readily substituted for HTML without undue experimentation. Information on these products is available in T. Berners-Lee, D. Connoly, “RFC 1866: Hypertext Markup Language—2.0” (November 1995); and R. Fielding, H, Frystyk, T. Bemers-Lee, J. Gettys and J. C. Mogul, “Hypertext Transfer Protocol—HTTP/1.1: HTTP Working Group Internet Draft” (May 2, 1996). HTML is a simple data format used to create hypertext documents that are portable from one platform to another. HTML documents are SGML documents with generic semantics that are appropriate for representing information from a wide range of domains. HTML has been in use by the World-Wide Web global information initiative since 1990. HTML is an application of ISO Standard 8879; 1986 Information Processing Text and Office Systems; Standard Generalized Markup Language (SGML)., 31841=Further details concerning technical aspects of multicasting may be found in the Internet documents Request for Comments (RFC) 1112 and 1458 which are reproduced at Appendices A and B of the Savetz book and in D. P. Brutaman et al., “MBONE provides Audio and Video Across the Internet,” IEEE Computer, Vol. 27, No. 4, pp. 30–36 (April 1994), all of which are incorporated herein by reference., 100021=In operation 1000, a type of the playback devices of the client apparatuses is first identified. Such “type” may refer to a make, model, or any other distinguishing characteristic of the particular playback devices. A command associated with the identified type of the playback device is then looked up in a look-up table. Note operation 1002. Such table may be located at the host server, or at any other location such as the client apparatuses., 39052=A standard referred to as Digital Video Interactive (DVI) format developed by Intel Corporation is a compression and storage format for full-motion video and high-fidelity audio data. The DVI standard uses interframe compression techniques similar to that of the MPEG standard and uses ADPCM compression for audio data. The compression method used in DVI is referred to as RTV 2.0 (real time video), and this compression method is incorporated into Intel's AVK (audio/video kernel) software for its DVI product line. IBM has adopted DVI as the standard for displaying video for its Ultimedia product line. The DVI file format is based on the Intel i750 chipset and is supported through the Media Control Interface (MCI) for Windows. Microsoft and Intel jointly announced the creation of the DV MCI (digital video media control interface) command set for Windows 3.1 in 1992.}",
    "textBeforeTable": "Patent Citations Although only a few embodiments of the present invention have been described in detail herein, it should be understood that the present invention may be embodied in many other specific forms without departing from the spirit or scope of the invention. Therefore, the present examples and embodiments are to be considered as illustrative and not restrictive, and the invention is not to be limited to the details given herein, but may be modified within the scope of the appended claims. Post-conditions: None. Pre-conditions: None. Parameters: void Return type: void FinalConstruct: Calls the “CLayerFactoryImpl” FinalConstruct COM class object. Post-conditions: None. Pre-conditions: None. Parameters: void Return type: void This will added to shared memory queue and written to a file. Public interface: getServerLayer: “Fires” an event to create a business layer with the properties retrieved from the pipe object. Return type: void Parameters: void Pre-conditions: None. Post-conditions: None. put_set_layer: call the “CLayerFactoryImpl” add( ) method. Supplying the “businesslayer” object. Base class and implemented interfaces: Collaborations: CBusinessLayer CDBConnect This server object supports connections to sink interfaces. These sink interfaces reside on the client side and are equivalent to the “call back” functions in Windows. This COM object",
    "textAfterTable": "US5809250 Oct 23, 1996 Sep 15, 1998 Intel Corporation Methods for creating and sharing replayable modules representive of Web browsing session US5809471 Mar 7, 1996 Sep 15, 1998 Ibm Corporation Retrieval of additional information not found in interactive TV or telephony signal by application using dynamically extracted vocabulary US5812661 Aug 1, 1995 Sep 22, 1998 Fujitsu Limited Software reproduction apparatus US5819284 Mar 24, 1995 Oct 6, 1998 At&T Corp. Personalized real time information display as a portion of a screen saver US5822291 Nov 21, 1995 Oct 13, 1998 Zoom Television, Inc. Mass storage element and drive unit therefor US5825876 Feb 12, 1996 Oct 20, 1998 Northern Telecom Time based availability to content of a storage medium US5857021 Oct 10, 1996 Jan 5, 1999 Fujitsu Ltd. Security system for protecting information stored in portable storage media US5860068 Dec 4, 1997 Jan 12, 1999 Petabyte Corporation Method and system for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}