{
    "relation": [
        [
            "Date",
            "Mar 30, 1998",
            "Apr 25, 2003",
            "Mar 17, 2004",
            "Mar 20, 2008",
            "Mar 23, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: AMERITECH CORPORATION, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MADOCH, PITSA;HEINMILLER, WAYNE ROBERT;LEBEAU, CHRISTOPHER MICHAEL;AND OTHERS;REEL/FRAME:009090/0644;SIGNING DATES FROM 19980113 TO 19980212",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6141409 - Method of operating a virtual private network - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6141409?ie=ISO-8859-1&dq=5,890,152",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484837999,
    "recordOffset": 484818510,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Thus there has been described a method of operating a virtual private network works across several LATAs and several service providers. While the invention has been described in conjunction with specific embodiments thereof, it is evident that many alterations, modifications, and variations will be apparent to those skilled in the art in light of the foregoing description. Accordingly, it is intended to embrace all such alterations, modifications, and variations in the appended claims. When the signaling indicator is not included, a query is sent to a second SCP to determine if the POTS number and the originating number are part of the same virtual private network at step 154. When the POTS number and the originating number are part of the same virtual private network, the call is routed over a private line at step 152. The call is connected to the SSP of the third carrier at step 140, which ends the process at step 142. When the POTS number and the originating number are not part of the same virtual private network, the call is routed over the public network at step 156. The call is received at the SSP in the third carrier at step 140, which ends the process at step 142. When the call does not include the POTS number translation of the custom number, the switch of the second carrier sends a query to a network SCP at step 144.",
    "textAfterTable": "US5475749 * Feb 28, 1994 Dec 12, 1995 At&T Corp. Connections between a toll network and multiple local networks US5483582 * Sep 28, 1992 Jan 9, 1996 Messager Partners Applications platform for a telephone system gateway interface US5515427 * Jul 19, 1994 May 7, 1996 At&T Corp. Completion of intelligent network telephone calls US5517562 * Nov 1, 1994 May 14, 1996 Independent Telecommunications Network, Inc. Method and system for providing a distributed service network for telecommunications service providers US5539817 * Dec 11, 1995 Jul 23, 1996 Stentor Resource Centre, Inc. Wide area centrex toll service with novel translation US5550912 * Jul 17, 1995 Aug 27, 1996 At&T Corp. Connections between a toll network and multiple local networks US5757894 * Sep 9, 1996 May 26, 1998 Bell Atlantic Network Services, Inc. Virtual foreign exchange",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}