{
    "relation": [
        [
            "Date",
            "Sep 10, 1991",
            "Nov 19, 1993",
            "Nov 19, 1999",
            "Jul 18, 2000",
            "Aug 19, 2003",
            "Aug 19, 2003",
            "Jun 14, 2004",
            "Nov 20, 2006",
            "Jan 3, 2007",
            "Apr 25, 2007",
            "May 23, 2007",
            "Jul 17, 2007",
            "Jul 19, 2007",
            "Oct 10, 2007",
            "Nov 12, 2007",
            "Nov 14, 2007",
            "Nov 15, 2007",
            "Nov 15, 2007",
            "Nov 27, 2007"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY",
            "SULP",
            "AS",
            "AS",
            "AS",
            "REMI",
            "AS",
            "AS",
            "AS",
            "REIN",
            "PRDP",
            "AS",
            "SULP",
            "FPAY",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Assignment",
            "Assignment",
            "Reinstatement after maintenance fee payment confirmed",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Assignment",
            "Surcharge for late payment",
            "Fee payment",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SMARTDISKETTE GMBH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:BARRETT, PAUL;EISELE, RAYMUND;REEL/FRAME:005868/0248;SIGNING DATES FROM 19910801 TO 19910828",
            "Year of fee payment: 4",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "",
            "Owner name: ADDISON FISCHER, FLORIDA Free format text: SECURITY AGREEMENT;ASSIGNOR:SCANDISK CORPORATION;REEL/FRAME:018616/0199 Effective date: 20061017",
            "Owner name: FISCHER, ADDISON, FLORIDA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE ASSIGNOR PREVIOUSLY RECORDED ON REEL 018616 FRAME 0199. ASSIGNOR(S) HEREBY CONFIRMS THE SECURITY AGREEMENT;ASSIGNOR:SMARTDISK CORPORATION;REEL/FRAME:018688/0956 Effective date: 20061017",
            "",
            "Owner name: FISCHER, ADDISON M, MR, FLORIDA Free format text: SECURITY AGREEMENT;ASSIGNOR:SMARTDISK;REEL/FRAME:019331/0269 Effective date: 20070206",
            "Owner name: SMARTDISK CORPORATION, FLORIDA Free format text: RELEASE;ASSIGNOR:SILICON VALLEY BANK;REEL/FRAME:019588/0384 Effective date: 20070706",
            "Owner name: SMARTDISK CORPORATION, FLORIDA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:FISCHER, ADDISON;REEL/FRAME:019573/0925 Effective date: 20070705",
            "",
            "Effective date: 20071115",
            "Owner name: MITSUBISHI KAGAKU MEDIA CO., LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SMARTDISK CORPORATION;REEL/FRAME:020112/0559 Effective date: 20070630",
            "",
            "Year of fee payment: 12",
            "Effective date: 20071010"
        ]
    ],
    "pageTitle": "Patent US5457590 - Insertable element for a disk station of EDP equipment with connections to ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5457590?dq=%22robert+sheehan%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477061575,
    "recordOffset": 477040166,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35081=The insertable elements 1 illustrated in FIGS. 1 and 2 are expanded by an external component 2, which is equipped with a keyboard 3, a display 4, a chip-card read/write device 5, into which a chip-card 6 can be inserted. The external component 2 can be pulled out from the insertable element 1. The insertable element 1 is basically constructed as it is described in the earlier European patent application 89121870.3. Only a rotor 7, which can be the component of a current generator, and the special interface 8 are schematically illustrated. Optionally the insertable element 1 of the external component 2 are furnished with one or more batteries 9 (cf. FIGS. 3 and 4)., 23926=This application is a continuation-in-part of application Ser. No. 07/448,093, filed Dec. 12th, 1989., 24131=From the earlier European patent application 89121870.3, an insertable element which is constructed as a diskette and is equipped with a special interface is known for EDP equipment. The interface is constructed so that a data transmission can be carried out between a processor which is on the diskette, and read/write devices which are present in the EDP equipment. The particular advantage connected with these features is that a data exchange between the processor of the diskette and the EDP equipment is feasible without the need of additional interfaces.}",
    "textBeforeTable": "Patent Citations Large storage capacity (many megabytes). Saves space and is portable High rate of data flow (approximately 500 kbit) No hardware installation expenses No problems regarding standardization, standardized interfaces are already available Independent from the recording density of the disk drive Independent from the available interfaces and slots in the PC Independent from the PC's capacity and operating system Can be inserted in laptops and notebooks Can be used on every PC and on every work station with 31/2\" drive Advantages include: Integrated speech input/output Co-processor (size irrelevant, does not depend on the thickness of the diskette) Unlimited storage space (many megabytes) Data exchange with external devices, like streaming tape, optical disk storage, other PCs, etc. Remote data transmission over integrated modem and telephone cable leading from the modem Communication between the chip-card and the PC Communication between user and chip-cards Display of information PIN input through keyboard Read/write device for chip-cards Possible applications include: From the following list the multitude of possible applications of an insertable element constructed in accordance with the invention will become obvious together with the associated advantages. The insertable element 1, illustrated in FIG. 5, besides the processor 11 and the further devices (not illustrated here) contains an additional storage 14 with a capacity of several magabytes, which can be used with a speed of approximately 500 kbps to back up data stored on a hard disk. Furthermore, the additional storage 14",
    "textAfterTable": "Reference 1 \"IC-Cards-Neue Aspekte der Informationsverarbeitung\" Datentechnik, Electronik 19/19.9 1986, pp. 99-101. 2 \"Personal Transaction Card\" IBM Technical Disclosure Bulletin, vol. 30, No. 3, Aug. 1987, pp. 1262-1265. 3 \"Stiffened Card With Integrated Circuit\" IBM Technical Disclosure Bulletin, vol. 28, No. 11, Apr. 1986, pp. 4723-4725. 4 \"Transaction Handling System Using A Bank Card With Display, Input and Memory Functions\" IBM Technical Disclosure Bulletin, vol. 28, No. 6, Nov. 1985, pp. 2568-2570. 5 * IC Cards Neue Aspekte der Informationsverarbeitung Datentechnik, Electronik 19/19.9 1986, pp. 99 101. 6 * Personal Transaction Card IBM Technical Disclosure Bulletin, vol. 30, No. 3, Aug. 1987, pp. 1262 1265. 7 * Stiffened Card With Integrated Circuit IBM Technical Disclosure Bulletin, vol. 28, No. 11, Apr. 1986, pp. 4723 4725. 8 * Transaction Handling System Using A Bank Card With Display, Input and Memory Functions IBM Technical Disclosure Bulletin, vol. 28, No. 6, Nov. 1985,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}