{
    "relation": [
        [
            "Measure",
            "Influenza vaccination",
            "Pneumococcal vaccination",
            "Mammogram",
            "Pap test",
            "Colorectal cancer screeningb",
            "Cholesterol screeningc",
            "Tetanus– diphtheria vaccinationc"
        ],
        [
            "Definition",
            "Received in past 12 months",
            "Ever received",
            "Received in past 2 years",
            "Received in past 3 years",
            "Received FOBT in past 12 months or endoscopy in past 10 years",
            "Every 5 years",
            "Every 10 years"
        ],
        [
            "Age Groups for Which Services Are Recommended",
            "Men and women ≥50",
            "Men and women ≥65",
            "Women ≥40",
            "Women ≥18 with intact cervix",
            "Men and women ≥50",
            "Men ≥35; women ≥45",
            "Men and women ≥18 years"
        ],
        [
            "Men 50-64",
            "X",
            "",
            "",
            "",
            "X",
            "X",
            "X"
        ],
        [
            "Women 50-64",
            "X",
            "",
            "X",
            "X",
            "X",
            "X",
            "X"
        ],
        [
            "Men ≥65",
            "X",
            "X",
            "",
            "",
            "X",
            "X",
            "X"
        ],
        [
            "Women ≥65",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X"
        ]
    ],
    "pageTitle": "Preventing Chronic Disease: July 2005: 05_0021",
    "title": "",
    "url": "http://www.cdc.gov/pcd/issues/2005/jul/05_0021.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 17,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 347288527,
    "recordOffset": 347246362,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{353943=Figure 2. Median and range of state-specific results for percentage of adults aged ≥50 years who were up-to-date for cancer screening and immunizations, Behavioral Risk Factor Surveillance System (BRFSS), 2002. Data from 49 states and the District of Columbia. Illinois data are not included because the state used a split sample for some preventive service questions. [A text description of this graph is also available.], 388438=Volume 2: No. 3, July 2005, 322137=aEmpty cells indicate that the service does not apply to the demographic category. bIncludes receiving fecal occult blood test (FOBT) or endoscopy (sigmoidoscopy or colonoscopy) within recommended time frames. cThese services are recommended by the USPSTF, but data were not collected by all states in the Behavioral Risk Factor Surveillance System (BRFSS), 2002, and were not analyzed as part of this study., 349876=Not only are reasons for racial and ethnic disparities not clear from the data but these disparities also are confounded by disparities in being up-to-date according to educational, socioeconomic, and insurance status. Respondents who have a college degree are 1.5 to 2 times more likely to be up-to-date than respondents who do not have a high school degree. Receipt of clinical preventive services is also consistently associated with higher income level for each of the four age and sex groups. Large differences exist between people who have medical insurance and people who do not. People with health insurance or personal physicians have approximately two to three times the rate of clinical preventive service delivery as people without either of them. According to the U.S. Census, 11.1% of whites, 19.6% of blacks, 18.8% of Asians, and 32.7% of Hispanics lacked insurance in 2003 (13). These findings are consistent with those of other studies that have found significant disparities in the delivery of cancer screening (14-16) and adult vaccinations (17,18) when measured by race/ethnic group, education, and income., 355052=Figure 1. Prevalence estimates of adults aged ≥50 years who were up-to-date for cancer screening and vaccinations by age group, sex, and state, Behavioral Risk Factor Surveillance System (BRFSS), 2002. Data from 49 states and the District of Columbia. Results were divided into quartiles, and the middle two quartiles were combined. Illinois data are not included because the state used a split sample for some preventive service questions. [A text description of these maps is also available.], 363589=We used data from the 2002 BRFSS; the BRFSS is an ongoing state-based telephone survey of randomly selected adults and is coordinated by the Centers for Disease Control and Prevention (CDC). The survey collects data from noninstitutionalized adults aged 18 and older on health practices that are related to the leading causes of death and disability (5). We limited our analysis to data from adults aged 50 and older, including 105,860 respondents in 49 states and the District of Columbia. Illinois data are not reported because approximately half of the female respondents in that state were not asked questions about breast and cervical cancer screening. All results are based on weighted data that account for different probabilities of selection and are adjusted to the total adult population in each state by age and sex or age, race, and sex., 364761=There is currently no index that combines data on the use of all recommended clinical preventive services among adults. In this article, we present a composite measure of cancer screening services and vaccinations obtained by adults aged 50 years and older as a first step toward assessing overall clinical preventive service delivery. We chose to begin our assessment by combining these two sets of interventions because they are universally recommended and data on their use in all 50 states and the District of Columbia are available through the 2002 BRFSS. Composite indices have long been used for the surveillance of childhood vaccinations (4)., 347853=This work builds on the analysis of others (20). The BRFSS has followed state rates for clinical preventive service delivery for more than 20 years, and a recent study has provided a comprehensive overview of trends (21). Combined measurements of mammography, clinical breast exam, and Pap testing have been made using data from the 1990 NHIS of Health Promotion and Disease Prevention (22). A methodology for building a prevention index has also been developed using electronic medical records. This index can serve as a combined quality assessment measure and be compared with consensus measures or with selected Health Plan Employer Data and Information Set (HEDIS) scores for health management organizations (23)., 344543=The building blocks of composite measures will change as recommendations for individual interventions evolve. For example, colorectal cancer screening guidelines for Healthy People 2010 objectives have not yet been updated to match USPSTF recommendations. (Healthy People 2010 objectives for Pap test, mammography, and adult vaccinations are consistent with USPSTF recommendations for women aged 50 and older.), 357933=The median state response rate for the 2002 BRFSS was 58.3% (range 42.2%–82.6%) (11). Results for the individual preventive health services for each of the age and sex groups are presented in Appendix Tables A–D. All other results are for being up-to-date on cancer screening and vaccinations as defined above., 365251=The delivery rates of cancer screenings and adult vaccinations have typically been measured separately through population-based surveys, including the Behavioral Risk Factor Surveillance System (BRFSS) and the National Health Interview Survey (NHIS). Although this approach is well suited for assessing progress toward Healthy People 2010 objectives, it does not measure the extent to which individuals receive the full complement of recommended clinical preventive services., 368210=Suggested citation for this article: Shenson D, Bolen J, Adams M, Seeff L, Blackman D. Are older adults up-to-date with cancer screening and vaccinations? Prev Chronic Dis [serial online] 2005 Jul [date cited]. Available from: URL: http://www.cdc.gov/pcd/issues/2005/ jul/05_0021.htm., 341551=This study reports low composite rates of adult clinical preventive service delivery based on 2002 BRFSS data for adults aged 50 and older and highlights significant disparities among groups. We must redouble our efforts to develop more effective approaches to delivering these basic adult clinical preventive services., 367315=Methods We analyzed state data from the 2002 Behavioral Risk Factor Surveillance System, which included 105,860 respondents aged 50 and older. We created a composite measure that included colonoscopy or sigmoidoscopy within 10 years or a fecal occult blood test in the past year, an influenza vaccination in the past year, a Papanicolaou test within 3 years for women with an intact cervix, a mammogram, and for adults aged 65 and older, a pneumonia vaccination during their lifetime. We performed separate analyses for four age and sex groups: men aged 50 to 64, women aged 50 to 64, men aged 65 and older, and women aged 65 and older., 362714=We analyzed responses to the BRFSS core questions on the use of clinical preventive services recommended by the USPSTF for adults aged 50 and older: colorectal cancer screening, mammography, Papanicolaou (Pap) test, and influenza and pneumococcal vaccinations (Table 1). These questions were asked in all states and territories that participated in the 2002 BRFSS survey. All measures of preventive health services were dichotomized as yes or no based on receipt of the service according to schedules recommended by the USPSTF. The USPSTF recommends influenza vaccination for adults aged 50 and older (6); other agencies support this recommendation (7). We used a 10-year interval for endoscopy (colonoscopy or sigmoidoscopy) because the BRFSS question did not distinguish between the two interventions. The USPSTF does not recommend intervals for the use of sigmoidoscopy or colonoscopy; other national guidelines recommend a 5-year interval for sigmoidoscopy and a 10-year interval for colonoscopy (8-10). For all services, people who had never had the test or had the tests outside the designated schedule were included in the group who answered no. Our analysis excluded respondents with missing values except for respondents missing one colorectal cancer screening value. Because colorectal cancer screening recommendations involve receiving either endoscopy or fecal occult blood testing (FOBT), we did not exclude respondents with missing values for one test if they had the other test within the recommended interval., 340884=Corresponding Author: Douglas Shenson, MD, MPH, MS, 76 Prince St, Newton, MA 02465. The author is affiliated with Sickness Prevention Achieved through Regional Collaboration (SPARC), Lakeville, Conn. Telephone: 617-796-7966. E-mail: dshenson@sparc-health.org., 365949=Healthy People 2010 is a national initiative that has set specific health and health care objectives (1). These performance targets include the delivery of adult clinical preventive services such as cancer screening and vaccinations. Studies of the effectiveness of these services have been reviewed by the U.S. Preventive Services Task Force (USPSTF) (2), and recommendations for providing the services have been developed by the Guide to Community Preventive Services (3). Both efforts emphasize the importance of providing routine screening for breast cancer, cervical cancer, and colorectal cancer as well as vaccinations against influenza and pneumococcal disease.  }",
    "lastModified": "Thu, 04 Apr 2013 12:38:14 GMT",
    "textBeforeTable": "Tables Table 1. Clinical Preventive Services Recommended for Adults Aged 50 Years and Older by the United States Preventive Services Task Force (USPSTF), 2004a   Back to top Thompson RS, Taplin SH, McAfee TA, Mandelson MT, Smith AE. Primary and secondary prevention services in clinical practice. Twenty years’ experience in development, implementation, and evaluation. JAMA 1995; 273(14):1130-5. Shenson D, Quinley J, DiMartino D, Stumpf P, Caldwell M, Lee T. Pneumococcal immunizations at flu clinics: the impact of community-wide outreach. J Community Health 2001;26(3):191-01. Shenson D, Cassarino L, DiMartino D, Marantz P, Bolen J, Good B, et al. Improving access to mammography through community-based influenza clinics: a quasi-experimental study. Am J Prev Med 2001;20(2):97-102. Pronk NP, Peek CJ, Goldstein MG. Addressing multiple behavioral risk factors in primary care. Am J Prev Med 2004;27(2S):1-110. Agency for Healthcare Research",
    "textAfterTable": "aEmpty cells indicate that the service does not apply to the demographic category. bIncludes receiving fecal occult blood test (FOBT) or endoscopy (sigmoidoscopy or colonoscopy) within recommended time frames. cThese services are recommended by the USPSTF, but data were not collected by all states in the Behavioral Risk Factor Surveillance System (BRFSS), 2002, and were not analyzed as part of this study. Table 2. Respondents Aged 50 Years and Older Who Are Up-To-Date for Cancer Screening and Adult Immunization by Age and Sex Group and Demographic Characteristics, Behavioral Risk Factor Surveillance System (BRFSS), 2002a    Men 50-64b % (95% CI) Women 50-64c % (95% CI) Men ≥65d % (95% CI) Women ≥65e % (95% CI) All Adults ≥50 % (95% CI) Race/ethnicity White (non-Hispanic) 22.7 (21.8-23.7) 22.2 (21.4-23.0) 41.7 (40.3-43.0) 34.6 (33.6-35.6) 29.2 (28.7-29.7)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}