{
    "relation": [
        [
            "Player",
            "Adam Dunn",
            "Rob Deer",
            "Mike Piazza",
            "Frank Howard",
            "Richie Sexson",
            "Barry Bonds",
            "Reggie Jackson",
            "Ryan Howard",
            "Jim Thome",
            "Alfonso Soriano",
            "Mark Teixeira",
            "Sammy Sosa",
            "Rick Monday",
            "Mark McGwire",
            "Willie McCovey",
            "Harmon Killebrew"
        ],
        [
            "G",
            "1570",
            "1155",
            "1912",
            "1895",
            "1367",
            "2986",
            "2820",
            "1027",
            "2485",
            "1606",
            "1374",
            "2354",
            "1986",
            "1874",
            "2588",
            "2435"
        ],
        [
            "PA",
            "6561",
            "4512",
            "7745",
            "7353",
            "5604",
            "12606",
            "11416",
            "4409",
            "10127",
            "6916",
            "6034",
            "9896",
            "7162",
            "7660",
            "9686",
            "9831"
        ],
        [
            "HR",
            "365",
            "230",
            "427",
            "382",
            "306",
            "762",
            "563",
            "286",
            "604",
            "340",
            "314",
            "609",
            "241",
            "583",
            "521",
            "573"
        ],
        [
            "SF",
            "29",
            "22",
            "45",
            "43",
            "36",
            "91",
            "68",
            "35",
            "74",
            "43",
            "40",
            "78",
            "32",
            "78",
            "70",
            "77"
        ],
        [
            "HR/SF",
            "12.59",
            "10.45",
            "9.49",
            "8.88",
            "8.50",
            "8.37",
            "8.28",
            "8.17",
            "8.16",
            "7.91",
            "7.85",
            "7.81",
            "7.53",
            "7.47",
            "7.44",
            "7.44"
        ]
    ],
    "pageTitle": "Adam Dunn Does Not Like Sacrificing Flies | Value Over Replacement Grit",
    "title": "",
    "url": "http://valueoverreplacementgrit.com/2012/02/10/adam-dunn-does-not-like-sacrificing-flies/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 244172631,
    "recordOffset": 244136342,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{216=Here is the list of players with at least 1,500 games played, with the fewest career sac flies since 1954 (when the sac fly rule was finally installed for good):, 1403=Obviously, he had the power and type of swing to loft a fly ball almost at will.  Prior to 2004, in his first three years in the Majors, Dunn compiled a 0.58 groundball:flyball ratio.  In those three years, he drove in 173 runners, but only seven by a sacrifice fly.  And its not like he didn’t have opportunities to do so.  He came to the plate 76 times with a runner on third and less than two out, walked 17 times, and hit four homers in his remaining 51 at-bats., 1930=While recently admiring the statistical oddities of Adam Dunn‘s career (beyond his “TTO” status and the four consecutive seasons of exactly 40 homers), I stumbled upon a factoid that baffled and befuddled me.  In 2004, “The Big Donkey,” while hitting 46 dingers and driving in 102, failed to knock anyone in via a sac fly., 464=For his career, he’s had 267 at-bats with a man on third and less than two out situations.  He’s gone yard 16 times, and hit a sac fly only 29 times.  So, is his 2004 sac fly “bagel” historic?  What about his career?}",
    "TableContextTimeStampAfterTable": "{48647=Dunn’s 2004 campaign had the 13th-most plate appearances without a sacrifice fly:, 189140=So just what happened to Dunn in 2004.  I used the Baseball Reference Play Index to find the Dunn’s sac fly opportunities.  He had 44 plate appearances with less than two out and a runner on third (he averages about 36 such situations per full year for his career).  Now of course, anything can happen in a sample of 44 plate appearances.  But Dunn managed to do just about everything except hit a sacrifice fly:, 42974=Dunn is currently 58th on the list of homers for players whose careers started in 1954 or later (365).  With those measly 29 sac flies, he’s averaging one per 12.6 homers, the worst rate amongst the top 200 homer hitters since 1954., 274483=So, if you see Dunn at bat with less than two outs and a runner on third, odds are Dunn won’t be hitting a simple fly ball.  (Yes, even in his horrible 2011 season he had two sac flies.)   But if he does hit a sac fly, cherish the moment., 91733=Dunn’s 2004 season is one of only ten in which a qualifier for the batting title slugged at least .500 but did not have a sacrifice fly:, 36444=Of those who started their careers in 1954 or later, Dunn’s 922 RBI ranks 204th.  His 29 sac flies make up 3.15% of his RBI total, the lowest percentage of those 204 run producers.  Here’s the “worst sac fly percentage but lots of RBI list”:}",
    "textBeforeTable": "Dunn is currently 58th on the list of homers for players whose careers started in 1954 or later (365).  With those measly 29 sac flies, he’s averaging one per 12.6 homers, the worst rate amongst the top 200 homer hitters since 1954. And in case you are wondering, Amos Otis leads the group of 204, with 10.2% of his RBI coming via the sacrifice fly (103 out of 1007). 4.50% 70 1555 521 9686 2588 Willie McCovey 4.42% 74 1674 604 10127 2485 Jim Thome 4.41% 47 1065 275 7150 1829 Jorge Posada 4.38% 43 981 315 6579 1694 Jeromy Burnitz 4.38% 46 1051 281 7303 1807 Torii Hunter 4.37% 43 983 305 7043 1777 Reggie Sanders 4.35% 52 1196 240 11155 2426 Derek Jeter 4.28% 64 1496 449 9059 2147 Vladimir Guerrero 4.23% 45 1064 328 6410 1512 Mo Vaughn 4.22% 50 1185 252 8801 2209 Joe Torre 4.07% 58 1425 399 8916 2257 Andres Galarraga",
    "textAfterTable": "And again, for those of you curious about the flip side, Robin Yount has the best rate, at 2.04 homers per sac fly (251 homers, 123 SF). Dunn’s 2004 campaign had the 13th-most plate appearances without a sacrifice fly: Player PA SF Year Tm G 2B HR",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}