{
    "relation": [
        [
            "RK",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20"
        ],
        [
            "DRIVER",
            "Jimmie Johnson",
            "Kasey Kahne",
            "Kyle Busch",
            "Brad Keselowski",
            "Dale Earnhardt Jr.",
            "Clint Bowyer",
            "Greg Biffle",
            "Carl Edwards",
            "Matt Kenseth",
            "Paul Menard",
            "Jeff Gordon",
            "Jamie McMurray",
            "Joey Logano",
            "Kevin Harvick",
            "Kurt Busch",
            "Ricky Stenhouse Jr.",
            "Tony Stewart",
            "Aric Almirola",
            "Denny Hamlin",
            "Danica Patrick"
        ],
        [
            "WINS",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "CHANGE",
            "4",
            "2",
            "-",
            "2",
            "4",
            "7",
            "-",
            "2",
            "1",
            "1",
            "7",
            "5",
            "2",
            "1",
            "3",
            "2",
            "1",
            "2",
            "9",
            "-"
        ],
        [
            "HIGH/LOW",
            "1/7",
            "2/15",
            "1/16",
            "1/16",
            "1/14",
            "2/15",
            "4/18",
            "1/19",
            "1/9",
            "9/20",
            "3/18",
            "11/18",
            "3/19",
            "1/15",
            "2/19",
            "13/21",
            "1/20",
            "8/20",
            "1/19",
            "2/23"
        ],
        [
            "COMMENTS",
            "Rarely does anyone put on the kind of old-fashioned butt-kicking that Johnson administered at Martinsville on Sunday. Then again, only two drivers in NASCAR history have more championships than Johnson. Team: Home | Stats | News | Gear",
            "After a brief stumble at the start of the season, Kahne has one victory and three top-four finishes in his last four races. With a fourth-place finish at Martinsville, he’s red-hot right now. Team: Home | Stats | News | Gear",
            "Martinsville isn’t one of Kyle Busch’s better tracks, but he posted a fifth-place finish and led 56 laps. Busch is on track for a breakout season this year. Team: Home | Stats | News | Gear",
            "One of only two drivers with five top 10s in the first six races, the defending NASCAR Sprint Cup champion was seventh at Martinsville. Team: Home | Stats | News | Gear",
            "For the first time all year, Junior failed to finish in the top 10. Or the top 20, for that matter. That said, he’s still off to a great start on the season. Team: Home | Stats | News | Gear",
            "A great rebound for Bowyer after losing an engine in California two weeks ago. Despite getting caught in a wreck, Bowyer recovered to finish second at Martinsville. Team: Home | Stats | News | Gear",
            "Martinsville is not a place where Biffle usually runs well, but he finished in the top 10 on Sunday. Team: Home | Stats | News | Gear",
            "Like his Roush Fenway Racing teammates, Edwards usually struggles at Martinsville. This week was no exception, as he finished 15th. Team: Home | Stats | News | Gear",
            "Although he led more laps than anyone not named Johnson, Kenseth had to settle for a 14th-place finish, not what he hoped for. Team: Home | Stats | News | Gear",
            "Certainly, Menard was looking for something better than a 19th-place finish, but he’s still in the top 10 in points. Team: Home | Stats | News | Gear",
            "Third place was the best finish of the year so far for the four-time Sprint Cup champion. Team: Home | Stats | News | Gear",
            "A nice seventh-place result for McMurray, who is quietly moving up in the points. Team: Home | Stats | News | Gear",
            "No controversy for Logano this week, but no good finish, either, as he was 23rd. Team: Home | Stats | News | Gear",
            "Six races into his final season with Richard Childress Racing and Harvick has just one top 10 to his credit. Team: Home | Stats | News | Gear",
            "A horrible day for the elder Busch after his car went up in flames. Still, he’s been strong this year. Team: Home | Stats | News | Gear",
            "For the second race in a row, Stenhouse failed to finish in the top 20. Team: Home | Stats | News | Gear",
            "The tough season for the three-time champ continued on Sunday, as Stewart finished 17th. Team: Home | Stats | News | Gear",
            "A 20th-place run wasn’t too bad for Almirola and the No. 43 Richard Petty Motorsports Ford. Team: Home | Stats | News | Gear",
            "Obviously, Hamlin didn’t race on Sunday. Lots of folks think he can still make the Chase for the Sprint Cup. Team: Home | Stats | News | Gear",
            "An impressive run for Patrick, who came from two laps down to finish 12th. Team: Home | Stats | News | Gear"
        ]
    ],
    "pageTitle": "NASCAR Power Rankings - Top 20 NASCAR Sprint Cup Race Car Drivers - FOX Sports on MSN",
    "title": "",
    "url": "http://www.foxsports.com/nascar/powerRankings/2013/7",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 451523123,
    "recordOffset": 451496027,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "FOX SPORTS NASCAR POWER RANKINGS -9 +7 This week’s list: After crushing the field at Martinsville Speedway, Jimmie Johnson moves back into a familiar place: The No. 1 spot in the FOXSports.com/SPEED.com Power Rankings. Posted April 08, 2013 08:21 AM EDT   38 37 36 35 34 33 32 31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 Pre",
    "textAfterTable": "More Power Rankings : NFL | MLB | COLLEGE FOOTBALL | NBA | NHL | COLLEGE BASKETBALL | NASCAR   Please note by clicking on \"Post comment\" you acknowledge that you have read the Terms of Use and the comment you are posting is in compliance with such terms. Be Polite. Inappropriate posts may be removed by the moderator.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}