{
    "relation": [
        [
            "Indicator",
            "GDP (US$ billions)",
            "Per capita GDP (in US $)",
            "GDP growth (in %)",
            "Share of GDP (in %) Agriculture",
            "Industry",
            "Services",
            "International trade - GDP"
        ],
        [
            "Afghanistan",
            "2.96",
            "143.00",
            "6.50",
            "32.60",
            "27.80",
            "39.60",
            "NA"
        ],
        [
            "Bangladesh",
            "65.42",
            "419.41",
            "6.63",
            "19.61",
            "17.21",
            "52.48",
            "44.22"
        ],
        [
            "Bhutan",
            "0.70",
            "1086.34",
            "8.47",
            "22.34",
            "7.37",
            "39.77",
            "76.79"
        ],
        [
            "China",
            "2095.95",
            "1597.77",
            "10.70",
            "11.71",
            "48.48",
            "39.91",
            "72.39"
        ],
        [
            "India",
            "703.33",
            "633.74",
            "9.20",
            "17.53",
            "16.28",
            "54.58",
            "48.78"
        ],
        [
            "Myanmar",
            "8.80",
            "174.00",
            "2.90",
            "50.00",
            "35.00",
            "15.00",
            "NA"
        ],
        [
            "Nepal",
            "6.70",
            "242.48",
            "2.80",
            "34.36",
            "7.68",
            "49.31",
            "45.29"
        ],
        [
            "Pakistan",
            "100.89",
            "634.50",
            "6.92",
            "19.39",
            "19.47",
            "53.41",
            "38.61"
        ],
        [
            "Sri Lanka",
            "21.27",
            "1069.66",
            "7.35",
            "16.46",
            "13.93",
            "56.47",
            "74.78"
        ]
    ],
    "pageTitle": "Rio+20 : Submission",
    "title": "",
    "url": "http://www.uncsd2012.org/index.php?page=view&nr=261&type=510&menu=20&template=529&str=Gender",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 787384439,
    "recordOffset": 787282019,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Table 1. HKH regional area (Total estimated area: 3,441,719 sq.km) The HKH region spreads over 3.44 million sq. km. and has a population of around 210.5 million (ICIMOD 2009). 1.2.2 Geographic features of the HKH Mountains The Himalayan range alone has the snow and ice cover of 35,110 sq.km containing 3,735 cu. km. of eternal snow and ice (Qin 2002). The total snow and ice cover for the HKH region is about 60,000 sq. km. (ICIMOD 2011). Hills and mountains, particularly the HKH mountain system, have been the sites of adaptation, mitigation, and resilience of the local people. Since time immemorial, they have maintained a rich cultural identity, food security and biogenetic diversity within the parameters of their own traditions. Figure 2. The ten river basins of the HKH region (UNDESA: Please Reference Full Submission for Figure) The geographic qualifier 'Hindu Kush-Himalaya' is not very precise. The region extends 3,500 km over all or parts of eight countries from Afghanistan in the west to Myanmar in the east and is the source of 10 major Asian river systems -? the Amu Darya, Indus, Ganges, Brahmaputra (Yarlungtsanpo), Irrawaddy, Salween (Nu), Mekong (Lancang), Yangtse (Jinsha), Yellow River (Huanghe), and Tarim (Dayan). These rivers provide water, ecosystem services, and the basis for livelihoods to about 210.5 million people (see Figure 2). People living in the basins of these rivers directly depend on the water mainly for irrigation, drinking, sanitation, and industrial uses (Jianchu et al 2009).",
    "textAfterTable": "244806 244857 51 0.021 4 Brahmaputra 529447 529449 2 0.000 433842 433855 13 0.003 5 Irrawady 426501 426393 -108 -0.025 202745 202769 24 0.012 6 Salween 363778 363898 120 0.033 211122 211205 83 0.039 7 Mekong 841322 841337 15 0.002 138876 138908 32 0.023 8 Yangste 2065763 2066050 288 0.014 565102 565162 60 0.011 9 Yellow River 1073168 1073443 276 0.026 250540 250574 33 0.013 10 Tarim 929003 929254 252 0.027 26729 26738 9 0.035 11 Total 8991813 8993153 1340 0.015 2795898 2796377 479 0.017 Note: - Details of projection parameters and technical literatures are available at MENRIS Division, ICIMOD. Figure 3. Major basin boundaries in the Hindu Kush-Himalaya (ICIMOD, 2011) (UNDESA: Please Reference Full Submission for Figure) 1.3 Trends in the HKH region over the last 20 years 1.3.1 Demographic changes Birth and death rates in Europe have shifted from very high to very low over the last 2-3 centuries. This model of demographic change seems useful to understand global population change including those of developing countries, albeit with some modifications. One such modification is the quicker rate of demographic change in developing countries starting only half a century ago. For remote mountain areas of the HKH, this change began much later, only a few decades before 1992. The more remote the area, the longer the time lag for major demographic shifts due to the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}