{
    "relation": [
        [
            "Company",
            "Boston Pizza",
            "Boston Pizza",
            "Boston Pizza",
            "Domino's Pizza",
            "Domino's Pizza",
            "Domino's Pizza",
            "Panago",
            "Pizza Hut",
            "Pizza Hut",
            "Pizza Hut",
            "Pizza Pizza",
            "Pizza Pizza",
            "Pizza Pizza"
        ],
        [
            "Product Name/ Description",
            "Deluxe",
            "Deluxe13",
            "Deluxe14",
            "Deluxe",
            "Deluxe13",
            "Deluxe14",
            "Classic",
            "Supreme Lover's",
            "Supreme Lover's13",
            "Supreme Lover's14",
            "Classic Super",
            "Classic Super13",
            "Classic Super14"
        ],
        [
            "Sampling Date",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007",
            "February 2008",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007",
            "October 2007"
        ],
        [
            "Fat (% by weight of food)",
            "7.2",
            "2.7",
            "1.2",
            "9.6",
            "7.1",
            "2.7",
            "7.7",
            "8.1",
            "5.3",
            "3.4",
            "6.7",
            "4.9",
            "2.1"
        ],
        [
            "TFA (% of total fat)",
            "3.4",
            "2.1",
            "1.7",
            "3.5",
            "2.2",
            "1.6",
            "2.6",
            "3.7",
            "2.3",
            "2.0",
            "3.1",
            "2.1",
            "1.0"
        ],
        [
            "SFA (% of total fat)",
            "47.0",
            "33.7",
            "28.0",
            "44.8",
            "31.3",
            "19.3",
            "44.8",
            "46.8",
            "33.3",
            "21.1",
            "44.8",
            "32.8",
            "22.1"
        ],
        [
            "TFA + SFA (% of total fat)",
            "50.4",
            "35.8",
            "29.7",
            "48.3",
            "33.5",
            "20.9",
            "47.4",
            "50.5",
            "35.6",
            "23.1",
            "47.9",
            "34.9",
            "23.1"
        ]
    ],
    "pageTitle": "ARCHIVED - Trans Fat Monitoring Program: Second Set of Trans Fat Monitoring Data, July 2008 [Health Canada, 2008]",
    "title": "",
    "url": "http://www.hc-sc.gc.ca/fn-an/nutrition/gras-trans-fats/tfa-age2-eng.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484202107,
    "recordOffset": 484176352,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73424=15. The company has informed us that they have switched to a new type of french fry. The data presented in the table does not reflect the switch. 16. Data provided by company. The new data reflects the change in frying oils used by all Boston Pizza full service restaurants since May 2007. 17. Data provided by company. The new data reflects the change in the par-frying oils used by Burger King restaurants. 18. Data provided by company. The new data reflects the change in frying oil used for french fries by Dairy Queen. 19.. Data provided by company. The new data reflects the change in frying oils used by McDonald's restaurants 20. Data provided by company. 21. Data provided by company. The new data reflects the change in frying oils used by Wendy's restaurants., 109692=28. Chicken analyzed only. 29. The company has informed us that they have made changes to their cooking and frying oils. The data presented in the table does not reflect the change. 30. Data provided by company. The new data reflects the change in frying oils used by all Boston Pizza full service restaurants since May 2007. 31. The company has informed us that since January 2007 all KFC restaurants have changed their frying oils. The data in the table is not reflective of this change. 32. Data provided by company. The new data reflects the change in frying oils used by Wendy's restaurants., 7236=This content was archived on June 24 2013., 39320=5. soft or tub margarines are generally used in spreading applications 6. Reference: W.M.N. Ratnayake, C. Gagnon, L.Dumais, W. Lillycrop, L.Wong, M. Meleta and P. Calway. Trans Fatty Acid Content of Canadian Margarines Prior to Mandatory Trans Fat Labelling. J.Am. Oil Chem. Soc. (2007) 84:817-825 7. Data provided by company. The new data reflects the change in oils used to manufacture margarine by Canbra Foods Ltd. 8. Data provided by company. 9. The company has informed us that the product was discontinued and replaced with \"Lactantia Healthy Attitude Omega-3\" in 2004/05. The data in the table is reflective of the product sampled in March 2005. 10. The company has informed us that the product was discontinued in the fall 2005. The data in the table is reflective of the product sampled in March 2005., 87758=24. Data provided by company. The new data reflects the reformulation in the product. 25. Data provided by company. The new data reflects the change in frying oils used in McDonald's restaurants. 26. The company has informed us that since March 2008 they have reformulated their Mexi Fries. The data presented in the table is not reflective of this change. 27. Data provided by company. The company has informed us that the product has been reformulated. The new data reflects this change.}",
    "textBeforeTable": "Table 8: Fatty acid composition of restaurant pizzas collected in 2007 and 2008 Top of Page 12. Data provided by company. The new data is reflective of the reformulated pizza. 42.4 32.6 9.8 5.4 October 2007 Compliments, Value Deluxe Sobeys 48.2 45.1 3.1 6.4 October 2007 Premiere,  Deluxe McCain Foods Canada 45.5 43.1 2.4 8.0 November 2007 Crescendo, Rising Crust Deluxe12 McCain Foods Canada 55.2 43.4 11.8 10.4 October 2007 Crescendo, Rising Crust Deluxe McCain Foods Canada 35.5 38.2 7.3 11.4 October 2007 President's Choice, Chicago Style Loblaws Inc. 37.0 34.8 2.2 9.8 October 2007 No Name, Rising Crust Pepperoni Loblaws Inc. 44.1 41.8 2.3 6.6 October 2007 Delissio, Rising Crust Deluxe Kraft Canada Inc. TFA + SFA (% of total fat) SFA (% of total fat) TFA (% of total fat) Fat (% by weight of food) Sampling Date Product Name/ Description Company Table 7: Fatty acid composition of frozen pizzas collected in 2007",
    "textAfterTable": "13. pizza was analyzed without the cheese; analysis was done on the dough, sauce, pepperoni, and vegetables 14. pizza was analyzed without the cheese and meat; analysis was done on the dough, sauce, and vegetables Top of Page Table 9: Fatty acid composition of pizza dipping sauces collected in 2007 and 2008 Company Product Name/ Description Sampling Date Fat (% by weight of food) TFA (% of total fat) SFA (% of total fat) TFA + SFA (% of total fat) Panago Italian Garlic February 2008 44.6 1.7 9.1 10.8 Panago Jalapeno Ranch February 2008 44.7 2.0 7.9 9.9 Pizza Hut Honey Roasted Creamy Garlic October 2007 40.4 0.9 17.1 18.0 Pizza Hut Marinara October 2007 0.1 3.6 43.3 46.9 Pizza Hut Ranch October 2007 52.2 1.1 15.9 17.0 Pizza Pizza Cheddar Jalapeno October 2007 9.3 1.0 11.3 12.3 Pizza Pizza Creamy Garlic October 2007 8.4 0.9 8.7 9.6 Pizza Pizza Italian Marinara October 2007 1.3 1.0 18.3 19.3",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}