{
    "relation": [
        [
            "Member State",
            "EU",
            "Austria",
            "Belgium",
            "Bulgaria",
            "Croatia",
            "Cyprus",
            "Czech Republic",
            "Denmark",
            "Estonia",
            "Finland",
            "France[3]",
            "Germany",
            "Greece",
            "Hungary",
            "Ireland",
            "Italy",
            "Latvia",
            "Lithuania",
            "Luxembourg",
            "Malta",
            "Netherlands",
            "Poland",
            "Portugal",
            "Romania",
            "Slovakia",
            "Slovenia",
            "Spain",
            "Sweden",
            "United Kingdom"
        ],
        [
            "Population",
            "507,416,607",
            "8,507,786",
            "11,203,992",
            "7,245,677",
            "4,246,700",
            "858,000",
            "10,512,419",
            "5,627,235",
            "1,315,819",
            "5,451,270",
            "65,856,609",
            "80,780,000",
            "10,992,589",
            "9,879,000",
            "4,604,029",
            "60,782,668",
            "2,001,468",
            "2,943,472",
            "549,680",
            "425,384",
            "16,829,289",
            "38,495,659",
            "10,427,301",
            "19,942,642",
            "5,415,949",
            "2,061,085",
            "46,507,760",
            "9,644,864",
            "64,308,261"
        ],
        [
            "Percent of total EU pop.",
            "100.00%",
            "1.68%",
            "2.21%",
            "1.43%",
            "0.84%",
            "0.17%",
            "2.07%",
            "1.11%",
            "0.26%",
            "1.07%",
            "12.98%",
            "15.92%",
            "2.17%",
            "1.95%",
            "0.91%",
            "11.98%",
            "0.39%",
            "0.58%",
            "0.11%",
            "0.08%",
            "3.32%",
            "7.59%",
            "2.05%",
            "3.93%",
            "1.07%",
            "0.41%",
            "9.17%",
            "1.90%",
            "12.67%"
        ],
        [
            "Land area km2",
            "4,324,782",
            "83,858",
            "30,510",
            "110,912",
            "56,594",
            "9,250",
            "78,866",
            "43,094",
            "45,226",
            "337,030",
            "643,548",
            "357,021",
            "131,957",
            "93,030",
            "70,280",
            "301,320",
            "64,589",
            "65,200",
            "2,586",
            "316",
            "41,526",
            "312,685",
            "92,931",
            "238,391",
            "48,845",
            "20,253",
            "504,782",
            "449,964",
            "244,820"
        ],
        [
            "Percent of total EU land area",
            "100.00",
            "1.9",
            "0.7",
            "2.5",
            "1.3",
            "0.2",
            "1.8",
            "1.0",
            "1.0",
            "7.6",
            "14.6",
            "8.1",
            "3.0",
            "2.1",
            "1.6",
            "6.8",
            "1.5",
            "1.5",
            "0.1",
            "0.0",
            "0.9",
            "7.1",
            "2.1",
            "5.4",
            "1.1",
            "0.5",
            "11.4",
            "10.2",
            "5.5"
        ],
        [
            "Pop. density People/km2",
            "116.0",
            "99.7",
            "352.0",
            "68.5",
            "75.8",
            "86.6",
            "132.8",
            "128.1",
            "29.6",
            "15.8",
            "99.6",
            "229.9",
            "85.4",
            "107.8",
            "64.3",
            "200.4",
            "35.0",
            "51.4",
            "190.1",
            "1,305.7",
            "396.9",
            "121.9",
            "114.4",
            "90.2",
            "110.8",
            "101.4",
            "93.4",
            "20.6",
            "251.7"
        ]
    ],
    "pageTitle": "Demographics of the European Union - Wikipedia, the free encyclopedia",
    "title": "Population and land area of the 28 member states of the European Union (1 January 2014 estimate[2])",
    "url": "https://en.wikipedia.org/wiki/Demographics_of_the_European_Union",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 853435343,
    "recordOffset": 853396853,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85907=A low fertility rate, without supplement from immigration, also suggests a declining overall EU population,[28] which further suggests economic contraction or even a possible economic crisis.[29] Some media have noted the 'baby crisis' in the EU,[30] some governments have noted the problem,[31] and the UN and other multinational authorities continue to warn of a possible crisis.[32] At this point however such a decrease in the population of the EU is not observed as the overall natural growth remains positive and the EU continues to attract large numbers of immigrants. In 2010, a breakdown of the population by citizenship showed that there were 20.1 million foreign citizens living in the EU representing 4% of the population.[26], 30134=The European union has a significant number of global cities. It contains 13 of the 60 cities which compose the 2008 Global Cities Index,[4] as well as 16 of the 41 \"alpha\" global cities classified by GaWC (including London, Paris, Milan, Amsterdam and Brussels among others).[5] The following is a list of the ten most populous cities, urban areas and urban zones in the European Union, with their population:, 83715=After hitting a historical low of 1.47 children born per female, the total fertility rate of the EU started to increase again, to reach a level of 1.60 in 2008.[26] The positive trend was observed in all member states with the exception of Luxembourg, Malta and Portugal. The largest increases over this period were observed in Bulgaria (from 1.23 children per woman in 2003 to 1.57 in 2009), Slovenia (from 1.20 to 1.53), the Czech Republic (from 1.18 to 1.49) and Lithuania (from 1.26 to 1.55).[26] In 2009, the Member States with the highest fertility rates were Ireland (2.06), France (2.00), Sweden (1.94), and the United Kingdom (1.90), all approaching the replacement level of 2.1 children born per female.[26] The lowest rates were observed in Latvia (1.31), Hungary and Portugal (both 1.32) and Germany (1.36). The increasing fertility rate has also been accompanied by an upward trend in the natural increase of the population which is due to the moderate increase of the crude birth rate that reached 10.9 births per 1000 inhabitants in 2008, an increase of 0.3 compared with 2007. The increase was observed in all member countries except Germany. The EU crude death rate remained stable at 9.7 per 1000 inhabitants.[22] The relatively low fertility rate means retirement age workers are not entirely replaced by younger workers joining the workforce. The EU faces a potential future dominated by an ever-increasing population of retired citizens, without enough younger workers to fund (via taxes) retirement programs or other state welfare agendas.[27], 117657=In 2012, 34.3 million foreign citizens lived in the 27 European Union member states, accounting for 6.8% of the European Union population,[39] of whom 20.5 million were third country nationals (i.e. nationals of non-EU countries). The number of foreign-born (which includes those who have naturalised or are dual nationals) was 48.9 million or 9.7 per cent of the total population.[40], 74091=The net migration rate for the EU in 2008 was 3.1 per 1,000 inhabitants;[22] this figure is for migration into and out of the European Union, and therefore excludes any internal movements between member states. Annual net migration has varied from 1.5 to 2.0 million people since 2003.[22], 88105=In 2008, EUROPA released projections for 2035 and 2060. Overall the population of the EU would increase to 520 million then decrease to 505 million in 2060., 72390=Spain in particular receives most of the immigrants coming illegally to Europe from Africa, probably due to its large coastal area and its proximity to and land borders with Morocco at Ceuta and Melilla; African immigrants try to enter the country by boat from Morocco or Senegal or by jumping the border fences. For example, during just the first weekend of September 2006, more than 1,300 illegal immigrants arrived on beaches in the Canary Islands[20] and estimates are that between 50,000 and 70,000 people enter the European Union illegally through Spanish borders or beaches. Border fences have been built at both the Ceuta and Melilla borders in an attempt to stop illegal entrance to the country. Illegal immigration is an issue in Spanish politics, and also a big human rights problem, since many people die during the journey. Spain has been Europe's largest absorber of migrants for the past six years, with its immigrant population increasing fourfold as 2.8 million people have arrived, mostly from Latin America. Spectacular growth in Spain's immigrant population came as the country's economy created more than half of all the new jobs in the European Union between 2001 and 2006.[21], 79246=Today, theism is losing prevalence in Europe in favour of atheism and agnosticism, and religion is losing prevalence in favour of secularism. European countries have experienced a decline in church attendance, as well as a decline in the number of people professing a belief in a god. The Eurobarometer Poll 2005 found that, on average, 52% of the citizens of EU member states state that they believe in a god, 27% believe there is some sort of spirit or Life Force while 18% do not believe there is any sort of spirit, god or Life Force, and 3% declined to answer., 121313=Sex ratio: (2006 est.), 82018=The first official languages of each of the 28 member countries has the status of an official language of the European Union. In total there are 23, with Irish, Bulgarian and Romanian gaining official language status on 1 January 2007, when the last two countries joined the union., 119730=Age structure: (2006 est.), 118255=A total of 8.0 million citizens from European countries outside of the EU-27 were residing in the EU at the beginning of 2012; among these more than half were citizens of Turkey, Albania or Ukraine. The next biggest group was from Africa (24.5%), followed by Asia (22.0%), the Americas (14.2%) and Oceania (0.8%). Romanians (living in another EU Member State) and Turkish citizens made up the biggest groups of non-nationals living in the EU-27 in 2012. There were 2.4 million Romanian citizens living outside of Romania within the EU-27 and 2.3 million Turkish citizens living in the EU-27; each of these two groups of people accounted for 7.0% of all foreigners living in the EU-27 in 2012. The third largest group was Moroccans (1.9 million people, or 5.6% of all foreigners).[41], 71806=In 2010, 47.3 million people living in the EU, or 9.4% of the total population, had been born outside their resident country. Of these, 31.4 million (6.3%) had been born outside the EU; 16.0 million (3.2%) had been born in another member state. The largest absolute numbers of people born outside the EU were in Germany (6.4 million), France (5.1 million), the United Kingdom (4.7 million), Spain (4.1 million), Italy (3.2 million), and the Netherlands (1.4 million).[19], 4877=The demographics of the European Union show a highly populated, culturally diverse union of 28 member states. As of 1 January 2014, the population of the EU is about 507.4 million people.[1], 116660=In 2011, almost a quarter of new EU citizens were Moroccans, Turks, Ecuadorian or Indians. The new citizens in the EU27 in 2011 came mainly from Africa (26% of the total number of citizenships acquired), Asia (23%), non-EU27 Europe (19%), North and South America (17%) or another EU27 Member State (11%). In 2011, the largest groups that acquired citizenship of an EU27 Member State were citizens of Morocco (64 300 persons, of which 55% acquired citizenship of France or Spain), Turkey (48 900, 58% acquired German citizenship), Ecuador (33 700, 95% acquired Spanish citizenship) and India (31 700, 83% acquired British citizenship).[38], 87278=Over the last 50 years, life expectancy at birth in the EU27 has increased by around 10 years for both women and men, to reach 82.4 years for women and 76.4 years for men in 2008. The life expectancy at birth rose in all Member States, with the largest increases for both women and men recorded in Estonia and Slovenia.[26]}",
    "lastModified": "Sun, 26 Jul 2015 17:09:51 GMT",
    "textBeforeTable": "The most populous member state is Germany, with an estimated 82.1 million people, and the least populous member state is Malta with 0.4 million. Birth rates in the EU are low with the average woman having 1.6 children. The highest birth-rates are found in Ireland with 16.876 births per thousand people per year and France with 13.013 births per thousand people per year. Germany has the lowest birth rate in Europe with 8.221 births per thousand people per year. Population by nation[edit] 12 External links 11 References 10 Notes 9 See also 8 Miscellaneous statistics 7 Ethnic composition 6.1 Population projections 6 Demographic future 5 Language 4 Religion 3.2 Immigration and emigration 3.1 Migration 3 Population shifts 2 Most populous areas 1 Population by nation Contents The demographics of the European Union show a highly",
    "textAfterTable": "Most populous areas[edit] The European union has a significant number of global cities. It contains 13 of the 60 cities which compose the 2008 Global Cities Index,[4] as well as 16 of the 41 \"alpha\" global cities classified by GaWC (including London, Paris, Milan, Amsterdam and Brussels among others).[5] The following is a list of the ten most populous cities, urban areas and urban zones in the European Union, with their population: City proper (2011) mill. Urban area (2005) mill. LUZ (2001) mill. London 7.5 Paris 10.2 London 12.0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}