{
    "relation": [
        [
            "Sun",
            "",
            "",
            "3/27",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC",
            "4/3",
            "DL: 8a\u009611p DCA: 10a\u009610p SL"
        ],
        [
            "Mon",
            "3/21",
            "DL: 9a\u009610p DCA: 10a\u00967p SL/SC",
            "3/28",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC",
            "4/4",
            "DL: 9a\u00968p DCA: 10a\u00967p"
        ],
        [
            "Tues",
            "3/22",
            "DL: 9a\u009610p DCA: 10a\u00967p SL/SC",
            "3/29",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC",
            "4/5",
            "DL: 9a\u00968p DCA: 10a\u00967p"
        ],
        [
            "Wed",
            "3/23",
            "DL: 9a\u009610p DCA: 10a\u00967p SL/SC",
            "3/30",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC",
            "4/6",
            "DL: 9a\u00968p DCA: 10a\u00967p"
        ],
        [
            "Thurs",
            "3/24",
            "DL: 9a\u009610p DCA: 10a\u00967p SL/SC",
            "3/31",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC",
            "4/7",
            "DL: 9a\u00968p DCA: 10a\u00967p"
        ],
        [
            "Fri",
            "3/25",
            "DL: 8a\u0096Mid DCA: 10a\u00969p SL/SC",
            "4/1",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL",
            "4/8",
            "DL: 9a\u0096Mid DCA: 10a\u00969p SL"
        ],
        [
            "Sat",
            "3/26",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC/DX",
            "4/2",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC/DX",
            "4/9",
            "DL: 8a\u0096Mid DCA: 10a\u009610p SL/SC/DX"
        ]
    ],
    "pageTitle": "Disneyland Park Update (Disneyland Resort Update) by MousePlanet Staff",
    "title": "",
    "url": "http://www.mouseplanet.com/6551/Disneyland_Park_Update",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 605048412,
    "recordOffset": 605026440,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{24642=In addition, anyone who buys a copy of his new \u0093Golden Anniversary Special Edition\u0094 of Mouse Tales: A Behind-the-Ears Look at Disneyland is invited to join David Sunday April 17 on a \u00931955 tour\u0094 of the park. To keep the group size as manageable as possible, two one-hour-long tours are scheduled\u0097departing at 1:00 and again at 2:30 from the front of Compass Books & Cafe in Downtown Disney. Books can be purchased at the NFFC event, at Compass, or through online venues such as MouseShoppe.com. One tour participant per book bought. Park admission is not included, and the tours are not affiliated with Disneyland or Compass Books., 42866=4-Day Park Hopper Bonus tickets ($129/$129) ($159/$129) \u0096 The park hopper bonus tickets currently include one early entry admission to Fantasyland, and a $10 ESPN Zone game card. If the Disneyland resort portion of your trip concludes by May 11, 2005, take advantage of the \u0093Adults Play for the Kids' Price\u0094 special. Through this advance purchase offer, 4-day park hopper tickets for ages 3 and up are $129, a savings of $30-60 off the main gate price. These tickets expire 13 days after first use or May 11, 2005, whichever comes first., 35269=According to the official promotion details, Southern California residents can buy up to eight passes per day, but on only two days in any seven day period. Expect each member of your party must be able to provide proof of Southern California (zip codes 90000 through 93599) or Baja California (zip codes 21000 through 22999) residency when presenting the tickets at the main entrance., 35080=Tickets: $73 for ages 10 and older, $63 for ages 3 to 9. You must use the second day of admission within 30 days of the first admission, or by April 28, 2005, whichever comes first., 50160=If you book an Alaska Airlines Southern California Vacations package for travel through June 29, one child (age 2-11) can fly free with each paid adult ticket. The package also includes four nights at the Holiday Inn Buena Park and airport transfers via Karmel Shuttle (children 2-11 are free). The packages, including airfare and hotel, start at $429 per person., 46586=If you plan to visit the Disneyland Resort after April 28, take advantage of the Advance Purchase discount and save $40 per ticket, as detailed in above. These tickets expire 13 days after first use or January 15, 2006, whichever comes first., 11835=On March 15, 50 days until the official start date, the Disneyland Resort released more details about the shows and attractions planned for the 18-month celebration of Disneyland's 50th anniversary. During a no-cameras-allowed preview, journalists examined the floats from Disney's Parade of Dreams, saw one of the Golden Ride Vehicles, watched the dynamic Steven Davidson's \u0093human storyboard\u0094 presentation of the new fireworks show, and learn more about the \u0093First 50 Years\u0094 exhibit moving into the Main Street Opera House., 48909=Several readers report that their local AAA offices do not offer this ticket, or that the benefits differ. You may remember that this also happened with the 2004 version of this package. MousePlanet has contacted AAA offices around the country, and encountered the same problem. If your local AAA office does not offer the ticket, check with another AAA office in your area. The decision to offer this ticket seems to depend on which regional AAA \u0093club\u0094 you belong to, and in some cases rests with the office manager at each location., 22356=May 4 is generally announced as a day Disneyland Park will be closed to put the finishing touches on the celebration. This contest lets about 5,000 guests into the park, various radio stations are offering contests that include VIP admission and there is a full slate of media events scheduled for the day. While there will probably be some work getting done it seems May 4 is more about VIP and press parties than painting and decorating., 42387=Good Neighbor Hotel Park Hopper Plus tickets ($134/$134) through April 28, 2005 \u0096 Disneyland Resort Good Neighbor hotels can offer a 4-Day Park Hopper Plus ticket for $134, ages 3 and up (Adults and children pay the same price). No advance purchase is required, and some hotels may even sell them to visitors who are not staying at that property. Valid through April 28, 2005., 51123=Finally, if you book the package through alaskaair.com, you get 1500 Alaska Airlines Mileage Plan Bonus Miles per passenger. For more information, visit the Alaska Airlines Web site (link). You must book packages by March 21, 2005., 18462=Children from Green Elementary School in Lawndale, California participated in the grand opening celebration for Buzz Lightyear Astro Blasters at Disneyland on March 17. The \u0093Little Green Men\u0094 first joined Buzz Lightyear in front of Sleeping Beauty Castle, and then marched down Main Street with a troop of Toy Story Green Army Men. Once they made their way back to Tomorrowland, four of the children were given \u0093blasters\u0094 and asked to shoot at a \u0093target\u0094 on the panel concealing the ride entrance. Pyrotechnics and green confetti filled the air as they blasted the target, . Click here to view video of the ceremony (WMV format, 8 minutes 41 seconds, 8.8MB; video by Karl Buiter)., 50915=If Buena Park is too far away from Disneyland for you, you can upgrade to a Disneyland Resort hotel and receive up to $200 Disney Dollars with a stay of four nights or more before April 24, 2005., 10271=A 4-year-old boy was injured last Wednesday when his finger were caught between the boat and dock while passengers were exiting. Dean Fryer, spokesman for the California Division of Occupational Safety and Health told MousePlanet that the accident occured around 11:00 a.m. as the boat was docked in the unload area., 32968=Southern California 2Fer Ticket ($53/$43) through April 28, 2005 \u0096 The spring \u0093resident salute\u0094 discount is a 2Fer ticket, with one admission to Disneyland and one admission to Disney's California Adventure on two different days. Purchase the \u0093ticket card\u0094 in advance at Southern California-area Vons and Pavillions grocery stores (or at the Disneyland Web site), scanned and activated at the time of purchase. Walk up to the main entrance, present the ticket card and proof of Southern California residency to gain admission., 58716=Visit our Annual Passholders Blockout Dates 2005 page to see more dates. You can see future calendar schedules at Disneyland.com here., 47398=Alaska Airlines \u0093Kids Fly Free\u0094 promotion through April 28, 2005 \u0096 If you have to fly to Southern California, Alaska Airlines has a package that includes either a free 5-day park hopper with each paid adult ticket, or an adult 5-day park hopper for the children's price. You must book packages by March 21, and like most current promotions, travel must be completed by April 28. Visit the Alaska Airlines Web site (link) for more details., 13621=The parade uses Phil Collins' \u0093Welcome\u0094 song from Brother Bear its theme music, but like the Main Street Electrical Parade's \u0093Baroque Hoedown,\u0094 each float has its own musical identity. The second float is titled \u0093Dream of Enchantment,\u0094 and features the cast of Beauty and the Beast with the musical theme, \u0093Be Our Guest.\u0094 The Cogsworth and Mrs. Potts characters are puppets, while Lumiere is an animatronic figure. Taking a cue from the Broadway production, Beast is depicted by a \u0093face\u0094 character. Angela Lansbury, David Ogden Stiers and the late Jerry Orbach provide the vocal narration for their film characters, Orbach having recorded his lines a week before his death in 2004. The dancers accompanying this unit are dressed as household items, such as plates and flatware, caught in mid-transformation back to their human guises., 33702=Tickets: $53 for ages 10 and older, $43 for ages 3 to 9. You must use the second admission within 30 days of the first admission, or by April 28, 2005, whichever comes first., 52567=The \u0093Happiest Homecoming on Earth\u0094 package is available for arrival dates through December 31, 2005. The package can be booked through the Disneyland Web site (link), or by calling (714) 520-5060., 37639=City Pass ($172/$129) through March 31, 2005 \u0096 The CityPass includes a three-day Disneyland Resort park hopper ticket, one-day admission to Knott's Berry Farm, one-day admission to SeaWorld in San Diego, and one-day admission to either the San Diego Zoo or the San Diego Wild Animal Park. The CityPass is $172 for ages 10 and up, and $129 for ages 3-9, and expires 14 days after first use or April 1, whichever comes first. You can buy CityPass at the Disneyland Web site, at the Disneyland Resort, at the other theme parks included in the pass, or directly from the CityPass Web site (link)., 33884=According to the official promotion details, Southern California residents can buy up to eight 2Fer tickets per day, but each member of your party must be able to provide proof of Southern California (zip codes 90000 through 93599) or Baja California (ZIP codes 21000 through 22999) residency to use the tickets., 25680=All expectations are that Haunted Mansion will still get the overlay, even without the merchandise event. Refurbishment schedules are starting to show the attraction closed in September and again in January 2006., 23942=MousePlanet columnist and author David Koenig presents the first of a series of \u0093Back to 1955\u0094 talks Saturday March 26 at the NFFC Chapter at the Park's monthly meeting in Garden Grove, California. He promises to \u0093re-create the first days of Disneyland through anecdotes, rare old photos, and interpretive dance.\u0094 The meeting is free and open to the public. A chapter business meeting begins at 1:30, with the guest speaker appearing at 2:00. The site, the Garden Grove Historical Society at 12174 Euclid, also houses the small garage where the Walt Disney Company got its start. The makeshift studio was originally on Kingswell Avenue in Los Feliz and belonged to Walt's and Roy's uncle., 44321=Disney's AAA Passport Plus Package 2005 ($169/$139) \u0096 The 5-day Passport Plus park hopper ticket is $169 for ages 10 and up, and $139 for ages 3-9. This package includes:, 38447=City Pass ($185/$127) effective April 1, 2005 \u0096 Starting April 1, 2005, the cost of a CityPass increases to $185 for ages 10 and up, but decrease to $127 for ages 3-9. The pass also comes with one early admission into Disneyland. The CityPass still expires 14 days after first use. Purchase CityPass through the Disneyland Web site, at the Disneyland Resort, at the other theme parks included in the pass, or directly from the CityPass Web site (link)., 46013=5-Day Park Hopper Bonus tickets ($139/$139) ($169/$139) \u0096 The park hopper bonus tickets currently include one early entry admission to Fantasyland, and a $10 ESPN Zone game card. If the Disneyland Resort portion of your trip concludes by May 11, 2005, take advantage of the \u0093Adults Play for the Kids' Price\u0094 special. Through this advance purchase offer, 5-day park hopper tickets for ages 3 and up are $139, a savings of $40-70 off the main gate price. These tickets expire 13 days after first use or May 11, 2005, whichever comes first., 43439=If you plan to visit the Disneyland Resort after April 28, you can still take advantage of the Advance Purchase discount and save $30 per ticket, as detailed above. These tickets expire 13 days after first use or January 15, 2006, whichever comes first., 37143=Good Neighbor Hotel Park Hopper Plus tickets ($114/$114) through April 28, 2005 \u0096 Disneyland resort Good Neighbor hotels can offer a 3-Day Park Hopper Plus ticket for $114, ages 3 and up. (Adults and children pay the same price) No advance purchase is required, and some hotels may even sell them to visitors who are not staying at that property. These tickets are valid through April 28, 2005., 21504=Every Annual Passholder has likely received the information in the mail by now, but Disney is running a contest in which 2,500 passholders (plus a guest) will be selected to attend the 50th Anniversary Premiere Event on May 4 at Disneyland. To enter, you just need to register at Disneyland.com's Annual Pass page (link). If you have previously done so, you are already entered into the contest. Eash pass needs to be registered separately and the passholder needs to be 18 to enter. The entry deadline is April 9., 39921=3-Day Park Hopper Bonus tickets ($109/$109) ($139/$109) \u0096 The park hopper bonus tickets currently include one early entry admission to Fantasyland and a $10 ESPN Zone game card. If the Disneyland resort portion of your trip concludes by May 11, 2005, you can take advantage of the \u0093Adults Play for the Kids' Price\u0094 special. Through this advance purchase offer, 3-day park hopper tickets for ages 3 and up are $109, a savings of $20-50 off the main gate price. Expires 13 days after first use or May 11, 2005, whichever comes first., 42168=The ticket is valid through June 23, 2005, or until the fourth admission is used. The ticket is not valid March 19 \u0096 April 2, 2005., 22136=Details are a bit lacking, but presumably winners will receive just the ability to enter Disneyland on May 4, a day the park is otherwise closed, with it being up to the winners to get themselves to the park., 34527=Southern California 2-Day Park Hopper at 1-Day Park Hopper Price through April 28, 2005 \u0096 Residents of Southern California and Baja California, Mexico, can purchase a standard 2-Day Park Hopper pass for the price of a 1-Day Park Hopper. It appears this offer is available only online at Disney's Web site (you need to enter an eligible ZIP code)., 50536=Even better, if you travel through April 28, you also receive a free child's 5-day Disneyland Resort park hopper for each paid adult. If you are traveling without children, you can instead purchase the adult 5-day park hopper ticket at the children's price. Be aware, however, that Disneyland considers 11-year-olds to be adults for the purpose of admission pricing., 35741=Good Neighbor Hotel Park Hopper Plus tickets ($105/$85) through April 28, 2005 \u0096 Disneyland resort Good Neighbor hotels can offer a 2-Day Park Hopper Plus ticket at $105 for ages 10 and up, or $85 for ages 3 to 9. No advance purchase is required, and some hotels may even sell them to visitors who are not staying at that property. These tickets are valid through April 28. 2005., 20168=Though Buzz Lightyear Astro Blasters is now open daily, and despite the media event heralding the new attraction, Disney still considers this to be a \u0093sneak peak\u0094 of a new ride that officially opens on May 5 as part of Disneyland's 50th anniversary celebration., 40488=If you plan to visit the Disneyland resort after April 28, take advantage of the Advance Purchase discount to save $20 per ticket, as detailed above. Expires 13 days after first use or January 15, 2006, whichever comes first., 39115=Costco City Pass promotion ($149.99/$114.99) through March 31, 2005 \u0096 Costco is offering the Southern California CityPass for $149.99 for adults, and $114.99 for children ages 3 to 9. You must use the first admission by March 31, 2005, and the pass expires 13 days after the first admission is used., 48140=Disney's AAA Passport Plus Package 2005 \u0096 The Parkhopper Plus package may be available in 6- or 7- day increments at participating AAA offices. Check with your local AAA office for availability and pricing:, 45137=Several readers report that their local AAA offices do not offer this ticket, or that the benefits differ. You may remember that this also happened with the 2004 version of this package.}",
    "textBeforeTable": "DX \u0096 Deluxe Annual Pass SC \u0096 Southern California Annual Pass SL \u0096 Southern California Select Annual Pass DL: Disneyland DCA: Disney's California Adventure Annual Pass blockout dates: Park Schedule/Blockout Dates If you sign up online for ESPN Zone's MVP Club (link) you can receive a $20 voucher (for food, merchandise, or game cards), a 40-point game card (about $10 worth), and an ESPN Zone mini-cooler. ESPN Club in Orlando is excluded from this offer. You must pick up these items in person, although they do not have to be used as the same store from which you get them. There are some fairly strick requirements for registering and getting your rewards, so make sure you read the details carefully (link). ESPN Zone MVP Club The \u0093Happiest Homecoming on Earth\u0094 package is available for arrival dates through December 31, 2005. The package can be booked through the Disneyland Web site (link), or by calling (714) 520-5060. Walt Disney Travel Co. fun book (one per package) Walt Disney Travel Co. luggage tag Walt Disney Travel Co. lanyard and pin (one per person) Entry into Mickey's Toontown Madness Preferred seating to select shows at Disney's California Adventure Park Hopper bonus ticket, which includes one early entry into Fantasyland and a $10 ESPN Zone game",
    "textAfterTable": "Visit our Annual Passholders Blockout Dates 2005 page to see more dates. You can see future calendar schedules at Disneyland.com here. Entertainment schedule: Go directly to the Disneyland Resort schedule for this week at Disneyland.com here. Talk about this article and more, on the MousePad community forums. (Send an email to MousePlanet Staff) © 2000-2015 MousePlanet Legal information and privacy policy | About/contact us | Link to us | Find us on Google+ MousePlanet® is not associated in any official way with the Walt Disney Company, its subsidiaries, or its affiliates. The official Disney site is available at www.disney.com. This MousePlanet Web site provides independent news articles, commentary, editorials, reviews, and guides primarily about the theme park resorts of the Walt Disney Co. All information on this site is subject to change. Please call destinations in advance to confirm the most up-to-date information.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}