{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Video Name",
            "TRAILER: Season 5 of \"Art in the Twenty-First Century\" (2009)",
            "PREVIEW: Jeff Koons in Season 5 of \"Art in the Twenty-First Century\" (2009)",
            "SEGMENT: Jeff Koons in \"Fantasy\"",
            "EPISODE: \"Fantasy\"",
            "SHORT: Jeff Koons: Versailles",
            "SHORT: Jeff Koons: Money & Value",
            "SHORT: Jeff Koons: Potential",
            "SHORT: Jeff Koons: Art History",
            "U.S. Department of State Honors Five Art21 Featured Artists"
        ],
        [
            "Description",
            "Trailer for Season 5 of the Peabody Award-winning series, \"Art in the Twenty-First Century\" (premiered Fall 2009 on PBS). Featured artists...",
            "Jeff Koons plucks images and objects from popular culture, framing questions about taste and pleasure. His contextual sleight-of-hand, which...",
            "“Art should be something really powerful,” says Jeff Koons, “but at the same time, there’s morality that comes along with that.” The segment begins...",
            "This episode presents artists whose works defy convention and transport us to unreal worlds and altered states of consciousness. With works at times...",
            "From his studio in New York City, Jeff Koons discusses his 2008 exhibition at the Château de Versailles in France. Koons explores the power and...",
            "Artist Jeff Koons discusses themes of money, desire, perfection, and moral responsibility. Filmed in his busy New York studio and surrounded by...",
            "Jeff Koons tells a story from his childhood about finding a sense of self through making art, asserting that art has the potential to inspire similar...",
            "Jeff Koons describes how he likes to \"communicate with other artists\" by making art historical references—from Classical to Modern—in his sculptures...",
            "Beginning in November 2012, the U.S. Department of State celebrates the 50th anniversary of Art in Embassies (AIE), a program that facilitates the..."
        ],
        [
            "Duration",
            "5:12",
            "1:08",
            "0:00",
            "0:00",
            "2:49",
            "3:04",
            "2:32",
            "2:38",
            "5:54"
        ],
        [
            "Release date",
            "04/10/2009",
            "08/06/2009",
            "10/14/2009",
            "10/14/2009",
            "10/29/2009",
            "03/19/2010",
            "06/04/2010",
            "07/02/2010",
            "11/29/2012"
        ]
    ],
    "pageTitle": "Videos | Jeff Koons | ART21",
    "title": "",
    "url": "http://www.art21.org/artists/jeff-koons/videos?order=field_release_date_value&sort=asc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 299998366,
    "recordOffset": 299990164,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 01 Aug 2015 08:07:47 GMT",
    "textBeforeTable": "Videos 1-9 of 9 activities texts images videos info Jeff Koons PBS Shop Magazine About Support ART21 Teach Ideas Artists Films Search this site:",
    "textAfterTable": "Videos 1-9 of 9 Jeff Koons \"The definition of being a modern person is to examine yourself, to reflect on yourself and to be a self-knowledgeable person.\" —Josiah McElheny \"Art in the Twenty-First Century,\" Season 7 New York Close Up: New artists, New films Artist to Artist: A New Film Series",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}