{
    "relation": [
        [
            "First Name",
            "Lonnie",
            "Jeanne"
        ],
        [
            "Last Name",
            "Johnson",
            "Mitchell"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=9CE3FF2C-1063-4834-8A96-F79549845A2C&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 212266797,
    "recordOffset": 212258595,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20731=HR 2766: Fracturing Responsibility and Awareness of Chemicals Act of 2009; provisions related to hydraulic fracturing HR 3082: Continuing Appropriations and Surface Transportation Extensions Act of 2011; provisions related to revenue and funding HR 5116: America Competes Reauthorization Act of 2010; provisions related to research, innovation and science, technology, engineering and math education HR 5809: Diesel Emission Reduction Act; provisions related to impacts HR 6523: Ike Skelton National Defense Authorization Act for Fiscal Year 2011; provisions related to emissions HJ Res 101: Making further continuing appropriations for fiscal year 2011, and for other purposes; provisions related to revenue and funding and extension of programs HJ Res 105: Making further continuing appropriations for fiscal year 2011, and for other purposes; provisions related to revenue and funding and extension of programs S 3072: Stationary Source Regulations Delay Act of 2010; provisions related to Clean Air Act regulations S 3516: Outer Continental Shelf Reform Act of 2010; provisions related to oil spill response, drilling regulation, and liability S 3815: Promoting Natural Gas and Electric Vehicles Act of 2010; provisions related to revenue and funding S 3916: A bill to require the Consumer Product Safety Commission to study and report on the impact on consumers of permitting an increase in the amount of ethanol blended with gasoline for use in gasoline-powered engines used in vehicles operated in interstate commerce, on public streets and roads, or off-road, appliances such as lawn mowers and other non-vehicular devices, and marine engines, and to require the National Highway Traffic Safety Administration to study and report on any safety or reliability impact of such an increase on motor vehicle engines and fuel systems; provisions regarding ethanol requirements of Renewable Fuel Standard S 3973: Diesel Emissions Reduction Act of 2010; provisions related to revenue and funding Discussion regarding oil spill regulations and policies, 17978=HR 1260/S 515: Patent Reform Act of 2009; provisions related to lawsuits and damages and revision and update of existing patent law, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 43630=HR 3619: Coast Guard Authorization Act for the fiscal years 2010 and 2011; provisions related to offshore regulations HR 5175: Democracy is Strengthened by Casting Light on Spending in Elections (DISCLOSE) Act; provisions related to proxy access, executive compensation, and disclosure of payments for resource extraction HR 5356: Oil Spill Response and Assistance Act; provisions related to oil and gas regulations HR 5629: Oil Spill Accountability and Environmental Protection Act of 2010; provisions related to access and drilling regulation H. Res. 252: Affirmation of the United States Record on the Armenian Genocide Resolution; provisions related to trade, 38582=HR 847: 9/11 Health and Compensation Act; provisions related to alternative offset proposals HR 1782 / S. A. 4885: Continuing Resolution for Budget through March 4, 2011; provisions related to revenue and funding HR 4853: Tax Relief, Unemployment Insurance Reauthorization and Job Creation Act of 2010; provisions related to revenue and funding, and corporate aviation services HR 6467: Middle Class Tax Relief Act of 2010; provisions related to revenue and funding HJ Res 101: Making further continuing appropriations for fiscal year 2011, and for other purposes; provisions related to revenue and funding and extension of programs HJ Res 105: Making further continuing appropriations for fiscal year 2011, and for other purposes; provisions related to revenue and funding and extension of programs S 3793: Job Creation and Tax Cuts Act of 2010; provisions related to revenue and funding S 3815: Promoting Natural Gas and Electric Vehicles Act of 2010; provisions related to revenue and funding Presidents Fiscal Year 2011 Budget Proposals; revenue raising provisions related to oil and gas and other business related tax provisions, 34192=HR 2194/ S 2799: Comprehensive Iran Sanctions, Accountability and Divestment Act of 2010; provisions related to sanctions and Presidential discretion H. Res. 252: Affirmation of the United States Record on the Armenian Genocide Resolution; all provisions of the bill, 31306=HR 4173/S 3217: Dodd-Frank Wall Street Reform and Consumer Protection Act (Restoring American Financial Stability Act of 2010 as passed in Senate); provisions related to competitive issues, corporate governance, executive compensation, and proxy access}",
    "textBeforeTable": "",
    "textAfterTable": "City IRVING State TX Zip Code 75039 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  COURTNEY S. WALKER  9724441181  courtney.s.walker@exxonmobil.com 5. Senate ID#  14017-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}