{
    "relation": [
        [
            "Column Name",
            "UOM_ID",
            "UNIT_OF_MEAS_NAME",
            "SHORT_NAME",
            "UNIT_OF_MEAS_TYPE",
            "TARGET_UOM_ID",
            "FACTOR_B",
            "FACTOR_C",
            "INFORMATION_SOURCE",
            "DATA_SOURCE",
            "IS_LEGACY",
            "LEGACY_CODE"
        ],
        [
            "Data Type",
            "NUMBER(10)",
            "VARCHAR2(2083)",
            "VARCHAR2(80)",
            "VARCHAR2(50)",
            "NUMBER(10)",
            "NUMBER",
            "NUMBER",
            "VARCHAR2(254)",
            "VARCHAR2(40)",
            "VARCHAR2(5)",
            "NUMBER(10)"
        ],
        [
            "Description",
            "ID number of the unit of measurement. Example: 10032",
            "Name of the unit of measurement; can also be a URL or URI. Example: Meter",
            "Short name (if any) of the unit of measurement. Example: METER",
            "Type of measure for which the unit is used: angle for angle unit, area for area unit, length for distance unit, scale for scale unit, or volume for volume unit.",
            "ID number of a target unit of measurement. Corresponds to the TARGET_UOM_CODE column in the EPSG Unit of Measure table, which has the following description: \"Other UOM of the same type into which the current UOM can be converted using the formula (POSC); POSC factors A and D always equal zero for EPSG supplied units of measure.\"",
            "Corresponds to the FACTOR_B column in the EPSG Unit of Measure table, which has the following description: \"A quantity in the target UOM (y) is obtained from a quantity in the current UOM (x) through the conversion: y = (B/C).x\" In a user-defined unit of measurement, FACTOR_B is usually the number of square meters or meters equal to one of the unit. For information about user-defined units, see Section 2.10.1.",
            "Corresponds to the FACTOR_C column in the EPSG Unit of Measure table. For FACTOR_C in a user-defined unit of measurement, see Section 2.10.1.",
            "Origin of this information. Example: ISO 1000.",
            "Organization providing the data for this record. Example: EPSG",
            "TRUE if the unit of measurement definition was included in Oracle Spatial before release 10.2; FALSE if the unit of measurement definition is new in Oracle Spatial release 10.2.",
            "For any EPSG unit of measure that has a semantically identical legacy (in Oracle Spatial before release 10.2) counterpart, the UOM_ID value of the legacy unit of measure."
        ]
    ],
    "pageTitle": "Coordinate Systems (Spatial Reference Systems)",
    "title": "",
    "url": "https://docs.oracle.com/cd/E11882_01/appdev.112/e11830/sdo_cs_concepts.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877042163,
    "recordOffset": 876985266,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18575=As a result of the transformation in Example 6-2, (4, 55, 1) is transformed to (4.0001539, 55.0000249, 4.218)., 23127=The supported compound coordinate reference systems are listed in the SDO_CRS_COMPOUND view, described in Section 6.7.12., 25140=The supported geographic 3D coordinate reference systems are listed in the SDO_CRS_GEOGRAPHIC3D view, described in Section 6.7.16., 1592=Most of the rest of this section explains these tables and views, in alphabetical order. (Many column descriptions are adapted or taken from EPSG descriptions.) Section 6.7.28 describes relationships among the tables and views, and it lists EPSG table names and their corresponding Oracle Spatial names. Section 6.7.29 describes how to find information about EPSG-based coordinate systems, and it provides several examples., 44648=To create a query window for certain operations on geodetic data, use an MBR (minimum bounding rectangle) by specifying an SDO_ETYPE value of 1003 or 2003 (optimized rectangle) and an SDO_INTERPRETATION value of 3, as described in Table 2-2 in Section 2.2.4. A geodetic MBR can be used with the following operators: SDO_FILTER, SDO_RELATE with the ANYINTERACT mask, SDO_ANYINTERACT, and SDO_WITHIN_DISTANCE., 32326=By default, then, Spatial applies certain transformation methods for each supported transformation between specific pairs of source and target coordinate systems. For example, there are over 500 supported transformations from specific coordinate systems to the WGS 84 (longitude/latitude) coordinate system, which has the EPSG SRID value of 4326. As one example, for a transformation from SRID 4605 to SRID 4326, Spatial can use the transformation method with the COORD_OP_ID value 1445, as indicated in the SDO_COORD_OPS table (described in Section 6.7.8), which contains one row for each transformation operation between coordinate systems., 59031=The term coordinate reference system has the same meaning as coordinate system for Spatial, and the terms are used interchangeably. European Petroleum Survey Group (EPSG) specifications and documentation typically use the term coordinate reference system. (EPSG has its own meaning for the term coordinate system, as noted in Section 6.7.11.)}",
    "TableContextTimeStampAfterTable": "{127474=Origin of this information. Example: ISO 1000., 48799=Name of the coordinate system. Example: Ellipsoidal 2D CS. Axes: latitude, longitude. Orientations: north, east. UoM: dec deg, 169729=Name of the datum. Specify a value (Oracle-supplied or user-defined) from this column in the DATUM specification of the WKT for any user-defined coordinate system. Examples: Adindan, Afgooye, Ain el Abd 1970, Anna 1 Astro 1965, Arc 1950, Arc 1960, Ascension Island 1958., 224539=A geographic 3D CRS is the combination of a geographic 2D CRS with ellipsoidal height. Example 6-13 shows the statement that created the geographic 3D CRS with SRID 4327, which is included with Spatial. This definition refers to an existing projected coordinate system (ID 6401; see Section 6.7.11, \"SDO_COORD_SYS Table\") and datum (ID 6326; see Section 6.7.22, \"SDO_DATUMS Table\")., 220422=A vertical CRS has only one dimension, usually height. On its own, a vertical CRS is of little use, but it can be combined with a two-dimensional CRS (geodetic or projected), to result in a compound CRS. Example 6-11 shows the statement that created the vertical CRS with SRID 5701, which is included with Spatial. This definition refers to an existing (one-dimensional) coordinate system (ID 6499; see Section 6.7.11, \"SDO_COORD_SYS Table\") and vertical datum (ID 5101; see Section 6.7.22, \"SDO_DATUMS Table\")., 140428=As mentioned in Section 6.7.29.1, the WKT is a human-readable summary of a CRS, but the actual EPSG data is stored in the Spatial coordinate systems data structures. The following example shows the WKT string for a projected coordinate system:, 185470=Ratio of the unit to 1 meter. For example, the conversion factor for a meter is 1.0, and the conversion factor for a mile is 1609.344., 145064=The following example returns the projection unit of measure for the projected CRS 32040. (The projection unit might be different from the length unit used for the projection parameters.), 187976=Name of the ellipsoid (spheroid). Specify a value from this column in the SPHEROID specification of the WKT for any user-defined coordinate system. Examples: Clarke 1866, WGS 72, Australian, Krassovsky, International 1924.}",
    "lastModified": "Fri, 03 Jul 2015 16:43:39 GMT",
    "textBeforeTable": "Table 6-26 SDO_UNITS_OF_MEASURE Table The SDO_UNITS_OF_MEASURE table contains one row for each unit of measurement. This table contains the columns shown in Table 6-26. 6.7.27 SDO_UNITS_OF_MEASURE Table Organization that supplied the data for this record (if not Oracle). Example: EPSG VARCHAR2(254) DATA_SOURCE Origin of this information. Example: Bundesamt fur Landestopographie VARCHAR2(254) INFORMATION_SOURCE ID number of the unit of measurement for the prime meridian. Matches a value in the UOM_ID column of the SDO_UNITS_OF_MEASURE table (described in Section 6.7.27). Example: 9110 for sexagesimal degree NUMBER(10) UOM_ID Longitude of the prime meridian as an offset from the Greenwich meridian. Example: 7.26225 FLOAT(49) GREENWICH_LONGITUDE Name of the prime meridian. Example: Bern VARCHAR2(80) PRIME_MERIDIAN_NAME ID number of the prime meridian. Example: 8907 NUMBER(10)",
    "textAfterTable": "6.7.28 Relationships Among Coordinate System Tables and Views Because the definitions in Spatial system tables and views are based on the EPSG data model and dataset, the EPSG entity-relationship (E-R) diagram provides a good overview of the relationships among the Spatial coordinate system data structures. The EPSG E-R diagram is included in the following document: http://www.epsg.org/CurrentDB.html However, Oracle Spatial does not use the following from the EPSG E-R diagram: Area of Use (yellow box in the upper center of the diagram) Deprecation, Alias, and others represented by pink boxes in the lower right corner of the diagram In addition, Spatial changes the names of some tables to conform to its own naming conventions, and it does not use some tables, as shown in Table 6-27 Table 6-27 EPSG Table Names and Oracle Spatial Names EPSG Name Oracle Name Coordinate System SDO_COORD_SYS Coordinate Axis SDO_COORD_AXES Coordinate Reference",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}