{
    "relation": [
        [
            "",
            "1040 State Edition",
            "1065 State Edition",
            "1120S State Edition",
            "1120 State Edition"
        ],
        [
            "Anticipated Release Date",
            "Released",
            "Released",
            "Released",
            "Released"
        ],
        [
            "E-file Available",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "TaxACT State List - 1040 Tax Software and Tax Help",
    "title": "",
    "url": "http://www.taxact.com/products/all_list.asp?yr=12",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 739506143,
    "recordOffset": 739457224,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10259=For returns originally due April 2013TaxACT 2014 State DetailsOther Previous Years' Software, 4392=TaxACT State 1040 covers all income-taxing & part year/non-resident states. View our list of covered states and their anticipated release dates.}",
    "TableContextTimeStampAfterTable": "{71745=Simple or complex, we have your return covered! Supports 1040, 1040A, & 1040EZ, Schedules A, B, C, D and much more., 72185=Have more than one W-2, 1099, 1098 or other tax documents? No problem! Enter as many supporting forms as you need., 290584=TaxACT 2012 Deluxe Edition must be installed on your computer in order to run TaxACT 2012 State Edition(s)., 71962=Use TaxACT's easy step-by-step interview or enter data directly into forms, including W-2 and 1099 data, if you choose.}",
    "textBeforeTable": "Federal Editions – Tax Year 2012 For release dates of TaxACT Preparer's Editions, please visit our Preparer's release dates page. E-filing will be available starting in January 2013 for Free Federal Edition, Deluxe and Business (1065, 1120S and 1120) returns. Preview versions of Free Federal Edition and Deluxe release in October (for 1040 returns). Final versions, as well as Business Editions (1065, 1120S and 1120), release in January. TaxACT Federal Editions Trusted by millions for over 14 years TaxACT is the pioneer of free online tax filing, with over 14 years of experience providing free tax software to everyone with no gimmicks, rebates or restrictions. Read More Accuracy Guarantee Rest assured the calculations in TaxACT are correct! TaxACT Free Edition includes a 100% Accuracy Guarantee. If you are assessed a penalty due to a calculation error in TaxACT Online Free Edition, we'll pay the penalty and interest. Read More Maximum Refund Pledge TaxACT Online Free Edition includes a maximum federal refund pledge for accepted federal e-filed returns. View and navigate to specific forms in your return quickly and easily. My Forms",
    "textAfterTable": "TaxACT Business 1120 Released TaxACT State Editions State Editions start releasing in January. They are released shortly after states make the necessary forms available. Anticipated release dates are given below. State 1040 Editions are available for all 44 income-taxing states and include ALL part-year and non-resident forms. State Editions – Tax Year 2012 Anticipated Release Date E-file Available 1040 State Edition 1065 State Edition 1120S State Edition 1120 State Edition Alabama – Tax Year 2012",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}