{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "it's really safe on campus, just be sure to always use common sense - don't walk alone at night, be careful who you bring back to campus with you etc. security guards are available if you need anything. just need to be careful on main drag next to campus can be a little sketch.",
            "none here.",
            "there are a lot of things to get involved with on campus. go to the club fair at the beginning of the year to get a preview!",
            "go explore downtown denver, or downtown boulder. take a hike or go up to the mountains. also in denver, visit the aquarium and zoo!",
            "the food is decent, but meal plans can be spendy! the main cafe tries to add variety, but does not always work out. there are three different places to find food on campus, which is nice to have options. and we have a starbucks.",
            "freshman dorms are decent, but small living spaces. people do not generally leave their dorms open a lot, making it difficult to mingle. there are events that the resident life coordinators put on and those are great for meeting people in your dorm!",
            "some classes are more difficult than others. it's helpful to look online and see how students rate the teachers they have had when you are looking at what courses to take. some teachers are more helpful and interesting than others.",
            "visit campus before you decide to come here. the campus is beautiful, but the size throws off some people. talk to professors and students that go here and ask lots of questions. know what you're looking for in a college and see what students say when you ask what their favorite thing is about going to school.",
            "perfect size to be personal, yet open to new things. can be anything you make of it - can help spirituality, help involvement in community, and much more. people here are so nice and friendly, if you need help you can always ask."
        ]
    ],
    "pageTitle": "Regis University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Regis-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916615727,
    "recordOffset": 916543999,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167355=I am unsure of the rigor as of right now because I don't start until the end of August., 67148=One of the best things about attending Regis University is the small class sizes. I love the fact that there are only 15-25 kids in each of my classes and that all my professors know me by name. Also, as a liberal arts school with widespread core requirements, I am taking classes in disciplines I never would have thought of and have found new subjects that are interesting to me. Another great thing about Regis is the fact that they have a free tutoring program, that's right free! There are tutors for nearly every subject and it is actually part of their workstudy to help you, so all you have to do is make an appointment. They also have a great Writing Center and Library where people are willing to help you with any part of writing a paper, whether it's research, grammar, or format., 160262=Regis University is a wonderful school with caring professors. It is a writing intensive university which has prepared me for my Master's program. Upon graduating in May, I feel I got a good education worth all the money I spent on the tuition., 354027=© 2015, Cappex.com, LLC, 188621=There are about 11 trees on campus that have state and national recognition for their size, form and species. They are well cared for and tours are often taken on campus by botanical societies and gardeners. The campus is well groomed and cared for. Another interesting note is the Statue of Sacred Heart of Jesus at Regis University with Latin writing. A Latin scholar once read it and verified that there is no meaning to the words that are inscribed on the plaque. The statue however is beautiful, and one of many statues on campus which receive attention and recognition. Main Hall is the oldest building, built in 1887 and it marks the highest point in the Denver vicinity. It also supposedly has a cell phone tower transponder in the cross on top of the building because of its location., 126385=One fun activity to do on your own or with a friend on a cool September evening is walk around campus and find all the benches and study spots.}",
    "textBeforeTable": "07/24/2009 Reviewer is A current student here. 5 out of 8 people found this review useful. 1 of 83 Lucy from Arvada, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am learning a lot All of my classes have been taught by brilliant and passionate professors who really care about teaching and want students to succeed, both on tests and in life. Regis provides you with a challenging academic curriculum, but professors and tutors are always very easy to get in contact with if you need help. The small class sizes create a close-knit academic community where you learn from each other as well. The honors program offers an even more rigorous curriculum and an even tighter community of students. Login to rate or flag the reviews Danielle from Franktown, CO 12/29/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 83 Categories Comments Great for these types of students Anyone who is committed to their future, hard-workers, and people who love other people! Tips for prospective students Visit the campus in the fall and during the winter. You need to get a good idea of what the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}