{
    "relation": [
        [
            "Code or Value",
            "19 to 80",
            "777",
            "999",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Refused",
            "Don't know",
            "Missing"
        ],
        [
            "Count",
            "283",
            "0",
            "9",
            "3453"
        ],
        [
            "Cumulative",
            "283",
            "283",
            "292",
            "3745"
        ],
        [
            "Skip to Item",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2009 - 2010: Reproductive Health (RDC) Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/limited_access/RHQ_F_R.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 352574059,
    "recordOffset": 352552129,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{6854=Title: Reproductive Health (RDC) (RHQ_F_R ) Contact Number: 1-866-441-NCHS Years of Content: 2009 - 2010 First Published: September, 2011 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:Questions on menstrual history, pregnancy history, lactation, oral contraceptive and hormone replacement therapy use and other related conditions, including information, for females 12-19 years, not available in public files. Record Source: NHANES 2009 - 2010 Survey Methodology: NHANES 2009 - 2010 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Tue, 25 Jun 2013 12:27:37 GMT",
    "textBeforeTable": "0 to 120 Hard Edits: Females only 12 YEARS - 150 YEARS Target: CODE \"0\" IF HAVEN'T STARTED YET. CAPI INSTRUCTION: SOFT EDIT VALUES: 8-25 YEARS. HARD EDIT VALUES: AGE OF 1ST PERIOD CANNOT BE GREATER THAN CURRENT AGE. ENTER AGE IN YEARS. English Instructions: The next series of questions are about {your/SP's} reproductive history. I will begin by asking about {your/SP's} periods or menstrual cycles. How old {were you/was SP} when {you/SP} had {your/her} first menstrual period? English Text: Age when first menstrual period occurred SAS Label: RHQ010 Variable Name: RHQ010 - Age when first menstrual period occurred Females only 12 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies N/A. References NHANES Tutorial for further details on the use of sample weights and other analytic issues. NHANES Analytic Guidelines and the on-line  Please refer to the  MEC exam sample weights should be used for the analyses.",
    "textAfterTable": ". Missing 498 3745 RHQ015 - CHECK ITEM Variable Name: RHQ015 English Instructions: BOX 1 CHECK ITEM RHQ015: IF PERIODS HAVEN'T STARTED (CODED '0'), GO TO END OF SECTION. IF PERIODS HAVE STARTED AND SP REPORTS AGE (CODED '1' - '76') IN RHQ010, OR IF SP REFUSES AGE (CODED '77') IN RHQ010, GO TO RHQ031. OTHERWISE, CONTINUE WITH RHQ020. Target: Females only 12 YEARS - 150 YEARS RHQ020 - Age range at first menstrual period Variable Name: RHQ020 SAS Label: Age range at first menstrual period English Text: {Were you/Was SP}... Target: Females only 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Younger than 10, 0 0 2 10 to 12, 14 14 3 13 to 15, or 12 26 4 16 or older? 2 28 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}