{
    "relation": [
        [
            "First Name",
            "Misty",
            "Matthew",
            "Jack"
        ],
        [
            "Last Name",
            "McGowen",
            "Koch",
            "Gerard"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=F3F05E4F-AC40-4B12-BB87-B114B4D5D501&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223886354,
    "recordOffset": 223878152,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28071=Whole Bills: S. 1666, A bill to require the Administrator of EPA to satisfy certain conditions before issuing to producers of mid-level ethanol blends a waiver from certain requirements under the Clean Air Act, and other for other purposes. 74 Fed. Reg. 24904, Notice of Proposed Rulemaking on Renewable Fuel Standard; 75 Fed. Reg. 14670, Regulation of Fuels and Fuels Additives: Changes to Renewable Fuel Standard Program. Regulatory efforts concerning EPA E-15 waiver request; Legislative efforts concerning renewable fuel standards and renewable fuel standards waiver requirements; Legislative efforts concerning potential aviation gas legislation; Legislative efforts concerning refinery and drilling workplace safety., 24673=S. 1462, American Clean Energy Leadership Act, provisions related to Section 526 of EISA 2007; H.R. 5136, National Defense Authorization Act for FY 2011, provisions relating to Section 526 of EISA 2007., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15628=Whole Bills: S. 1733, Clean Energy Jobs and American Power Act; H.R. 2766, Fracturing Responsibility and Awareness of Chemicals Act; S. 1215, Fracturing Responsibility and Awareness of Chemicals Act; S. 2877, Carbon Limits and Energy for America's Renewal (CLEAR) Act; S. 3209, Safe Chemicals Act; S. 3464, Practical Energy and Climate Plan Act; H.R. 5088, America's Commitment to Clean Water Act; S. 3072, Stationary Source Regulations Delay Act; H.J. Res. 76, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under Section 202(a) of the Clean Air Act; S.J. Res. 26, Disapproving a rule submitted by the Environmental Protection Agency relating to the endangerment finding and the cause or contribute findings for greenhouse gases under Section 202(a) of the Clean Air Act; Toxic Chemicals Safety Act (proposal, unnumbered). Draft NEPA Guidance on Consideration of the Effects of Climate Change and Greenhouse Gas Emissions, Feb. 18, 2010 Memorandum from Nancy Sutley, CEQ; 74 Fed. Reg. 56260, Mandatory Reporting of Greenhouse Gases, Final Rule; 75 Fed. Reg. 31895, National Emissions Standards for Hazardous Air Pollutants for Area Sources: Industries, Commercial, and Institutional Boilers, Proposed Rule. Legislative efforts concerning proposed amendments to the Toxic Substances Control Act; 75 Fed. Reg. 2938, National Ambient Air Quality Standards for Ozone, Proposed Rule; Legislative efforts concerning potential Kerry-Graham-Lieberman energy bill; Legislative efforts concerning vessel discharges; Legislative efforts concerning hydraulic fracturing., 45953=Whole Bills: H.R. 4213, American Jobs and Closing Tax Loopholes Act. Presidential FY 2010 budget submission; Presidential FY 2011 budget proposal, provisions relating to dual capacity taxpayers and tax increases., 49948=Whole Bills: H.R. 2194, Comprehensive Iran Sanctions, Accountability, and Divestment Act., 37550=S. 3516, Outer Continental Shelf Reform Act, provisions relating to the Oil Spill Liability Trust Fund; Whole Bills: S. 3516, Outer Continental Shelf Reform Act; H.R. 3534, Consolidated Land, Energy, and Aquatic Resources Act; S. 3305, Big Oil Bailout Prevention Liability Act; S. 3306, Big Oil Bailout Prevention Trust Fund Act; S. 3472, Big Oil Bailout Prevention Unlimited Liability Act; S. 3542, Oil Spill Compensation Act; S. 3514, Guaranteed Oil Spill Compensation Act; S. 3375, Oil Spill Response and Assistance Act; S. 3346, Outer Continental Shelf Lands Act Amendments Act; S. 3309, Oil Spill Liability Trust Fund Improvement Act; H.R. 5214, Big Oil Bailout Prevention Act; H.R. 5572, Oil Spill Prevention Act; S. 3509, Safer Oil and Gas Production Research and Development Act; S. 3492, Emergency Relief Well Act; S. 3473, A bill to amend the Oil Pollution Act of 1990 to authorize advances from Oil Spill Liability Trust Fund for the Deepwater Horizon oil spill; H.R. 5499, To amend the Oil Pollution Act of 1990 to authorize advances from Oil Spill Liability Trust Fund for the Deepwater Horizon oil spill; H.R. 5629, Oil Spill Accountability and Environmental Protection Act; H.R. 5626, Blowout Prevention Act; H.R. 5525, To terminate the moratorium on deepwater drilling issued by the Secretary of the Interior; H.R. 5519, Gulf Coast Jobs Preservation Act; H.R. 5503, Securing Protections for the Injured from Limitations on Liability Act; H.R. 5481, To give subpoena power to the National Commission on the BP Deepwater Horizon Oil Spill and Offshore Drilling; H.R. 5241, BP Deepwater Horizon Disaster Inquiry Commission Act; Preliminary Revised Program, Outer Continental Shelf Oil and Gas Leasing Program, 2007-2012. Legislative efforts concerning proposed bill amending EPACT 05 regarding drilling technologies (not yet introduced); Legislative efforts concerning the Deepwater Horizon incident; Legislative and regulatory efforts concerning the Deepwater Horizon Gulf of Mexico incident, oil spill liability and response efforts, offshore drilling equipment and safety; Legislative and regulatory efforts concerning a moratorium on offshore oil and gas drilling in the Gulf of Mexico and Notice to Lessees Nos. 2010-N04, 2010-N05, 2010-N06., 32037=Whole Bills: S. 2996, Continuing Chemical Facilities Antiterrorism Security Act., 52070=S. 3217, Restoring American Financial Stability Act, Title I and VII, provisions relating to Section 527 of EISA 2007, the authority of the CFTC to regulate certain derivatives transactions on over-the-counter markets, the establishment of the Financial Stability Oversight Council and the Office of Financial Research (OFR) and Amendments 3732, 3980, 4050, 4141 and 4142 relating to extractive industries; H.R. 4173, Restoring American Financial Stability Act, Title VII, provisions relating to authority of the SEC to oversee activities and entities associated with the national securities exchanges, Leahy amendment., 12204=Whole Bill: H.R. 3619, Coast Guard Authorization Act for Fiscal Years 2010 and 2011. Presidential FY 2010 budget submission; Presidential FY 2011 budget proposal, provisions relating to dual capacity taxpayers.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  STACY LINDEN  2026828229  lindens@api.org 5. Senate ID#  3060-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}