{
    "relation": [
        [
            "Property Type",
            "Apartments",
            "Apartments"
        ],
        [
            "Bedrooms",
            "2bhk",
            "3bhk"
        ],
        [
            "Area",
            "1125-1397 sq.ft",
            "1517-1521 sq.ft"
        ],
        [
            "Price",
            "47.25L - 58.67L",
            "63.71L - 63.88L"
        ]
    ],
    "pageTitle": "Residential Projects by Trinity Developers | Find Properties by Trinity Developers in Kochi",
    "title": "",
    "url": "https://www.commonfloor.com/all-projects-by-trinity-developers-in-kochi/bpc-pldw0z-609",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901092915,
    "recordOffset": 901036155,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87458=Trinity-Periyar Sands is in the heart of Cochins Satellite town, Aluva at Desom. Trinity Perivar Sands is designed to ensure that every apartment has a view of the river Periyar. Common amenities of the project include Clubhouse, Health club, Swimming pool, Indoor games, Party area etc. Each apartment will be a spacious 2000 sq.ft.Thoughtfully designed expanse coupled with excellent finishes and luxury amenities!, 3283=Established in 2005 by construction and business entrepreneurs, Trinity Builders and Developers has emerged to be one of Cochins leading builders in a short span of time. Trinitys directors include Mr. C.J Mathew I.R.S (Retd.), Mr. Roy, head of the well known RJ constructions, a civil contracting and engineering firm, and Mr. Louis owner of Jos Electricals (Agencies), which runs the largest lighting showroom in South India. Though relatively young as an organization, the decades-long experience of Trinitys directors makes it extremely effective. Positioned as a thinking builder, Trinity carefully selects and plans its projects. The company has successfully delivered 6 projects to date and another half a dozen are underway. Trinitys core advantage is its speed and ability to understand customer needs, a fact that Trinitys peers in the industry have themselves acknowledged. Customer preferences are researched extensively and these preferences are the building blocks on which projects are designed. Trinitys collaborations with talented architects have resulted in innovative and aesthetic living options.}",
    "textBeforeTable": "Unit Types Trinity World Trinity World is premium Luxury apartment project coming up in 6 acres of Land, in a unique & aesthetic Podium based development consisting of 4 Magnificent Towers: Jupiter, Mercury, Neptune & Venus,  resplendent with beautiful Landscaping and State-of-the art amenities like: Swimming Pool; Party Area, Kids Play Area; Indoor Games Facility; Library; Home Theatre; Yoga court, beautifully designed atrium  & much more! Overview More Details Enquire Now _gaq.push(['_trackEvent','Enquiry form-lf','Enquire','CAP']);\"> Sale: 1     Listings Available : From Dec 2016 Possession : 2BHK, 3BHK Unit Type: Apartments Property Type: Trinity Developers Builder: 1214Sq ft - 1770Sq ft Rs. 38.61L - 58.38L ongoing",
    "textAfterTable": "Approvals We are working hard to collect this information. Please do send us an enquiry in case you need it urgently!> Map Amenities Swimming Pool Play Area Club House Gymnasium Indoor Games Home Theatre About Builder Established in 2005 by construction and business entrepreneurs, Trinity Builders and Developers has emerged to be one of Cochins leading builders in a short span of time. Trinitys directors include Mr. C.J Mathew I.R.S (Retd.), Mr. Roy, head of the well known RJ constructions, a civil contracting and engineering firm, and Mr. Louis owner of Jos Electricals (Agencies), which runs the largest lighting showroom in South India. Though relatively young as an organization, the decades-long experience of Trinitys directors makes it extremely effective. Positioned as a thinking builder, Trinity carefully selects and plans its projects. The company has successfully delivered 6 projects to date and another half a dozen are underway. Trinitys core advantage is its speed and ability to understand customer needs, a fact that Trinitys peers in the industry have themselves acknowledged. Customer preferences are",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}