{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "we always have guards on campus to ensure our safety and also curfew.",
            "we have all types of clubs, and the best part is if we don't have it you can make the club yourself.",
            "on tradition we have is the Bluffton Olympics. We all gather in the big field to see play games to allow our freshman to get to know each other.",
            "For fun I go to the movies and there is also always a fun event on Friday nights on the campus. Also we are a dry campus so we have fun without all the consequences.",
            "The one tip that all prospective students should take into consideration is go and visit the school. Its defiantly worth it.",
            "Bluffton University is a very small school, but worth the time to apply. At Bluffton I have learned about community and friendship. I give the University a 10, because it is so diverse and beautiful!"
        ]
    ],
    "pageTitle": "Bluffton University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bluffton-University/reviews?_escaped_fragment_=/show/16447",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887572091,
    "recordOffset": 887537057,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{91618=We have a tennis ball golf course on campus that everyone needs to play at least once while they are there. We have a weird tradition of several freshmen doing a May poll dance the day before graduation eery year., 118083=© 2015, Cappex.com, LLC, 104174=May Day is a big deal at Bluffton. It happens every graduation weekend with a musical special dance and festival., 84710=May Day is a festival that happens every spring and I had never heard of it before coming here. It's definitely worth checking out.}",
    "textBeforeTable": "01/28/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 2 out of 5 people found this review useful. 1 of 28 Zachary from Bainbridge, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Bluffton University Reviews Bluffton University › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "It worries me that both of the reviews for this school have blatant spelling errors. Login to rate or flag the reviews Rachel 10/14/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 28 Categories Comments Bang for the buck The facilities are all clean and newer than other colleges I have checked out. The education experience is also better because since its a small school there is more one on one help, if needed. Am enjoying being here I enjoy the people and professors here but on the weekends it really dies down and there is really not much going on. Am learning a lot Since Bluffton University is a liberal arts school I have been learning about other things on top of my own major. This is a positive because",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}