{
    "relation": [
        [
            "Date",
            "Edit Delete View CVT 1995",
            "Edit Delete View CVT 2007"
        ],
        [
            "Inductee",
            "-",
            "-"
        ],
        [
            "Hall of fame",
            "Naismith Memorial Basketball Hall of Fame",
            "National Collegiate Basketball Hall of Fame"
        ],
        [
            "Category",
            "Basketball player",
            "Basketball player"
        ],
        [
            "Note",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Kareem Abdul-Jabbar - Freebase",
    "title": "",
    "url": "http://www.freebase.com/en/kareem_abdul-jabbar",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459153007,
    "recordOffset": 459098529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{364814=Kareem Abdul-Jabbar is a retired American professional basketball player who played 20 seasons in the National Basketball Association for the Milwaukee Bucks and Los Angeles Lakers. During his career as a center, Abdul-Jabbar was a record six-time NBA Most Valuable Player, a record 19-time NBA All-Star, a 15-time All-NBA selection, and an 11-time NBA All-Defensive Team member. A member of six NBA championship teams as a player and two as an assistant coach, Abdul-Jabbar twice was voted NBA Finals MVP. In 1996, he was honored as one of the 50 Greatest Players in NBA History. NBA coach Pat Riley and players Isiah Thomas and Julius Erving have called him the greatest basketball player of all time. After winning 71 consecutive basketball games on his high school team in New York City, Lew Alcindor attended college at UCLA, where he played on three consecutive national championship basketball teams and was a record three-time MVP of the NCAA Tournament. Drafted by the one-season-old Bucks franchise in the 1969 NBA Draft with the first overall pick, Alcindor spent six seasons in Milwaukee. [ - ]}",
    "lastModified": "Tue, 28 Jul 2015 02:00:22 UTC",
    "textBeforeTable": "Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value Kareem Abdul-Jabbar (born Ferdinand Lewis Alcindor, Jr., April 16, 1947) is a retired American... Article (deprecated) /common/topic/article View history Query by property Flag as reviewed -",
    "textAfterTable": "Identity is not asserted on this topic. Assert type now. Add new value Flag as reviewed Query by property View history Daylife Topic /common/identity/daylife_topic Daylife Topic Edit Delete 059CbbT7U40BF Edit Delete 065l16W7ip629",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}