{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-09301",
            "",
            "FDA-2013-N-0365"
        ]
    ],
    "pageTitle": "21 CFR Part 1 - GENERAL ENFORCEMENT REGULATIONS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/21/part-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904492683,
    "recordOffset": 904472995,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58120=§ 1453 - Requirements of labeling; placement, form, and contents of statement of quantity; supplemental statement of quantity, 3097=The Food and Drug Administration (FDA) is correcting a final rule entitled “Administrative Detention of Drugs Intended for Human or Animal Use” that appeared in the Federal Register of May 29, 2014 (79 FR 30716). The rule sets forth the procedures for detention of drugs believed to be adulterated or misbranded and amends the scope of FDA's part 16 regulatory hearing procedures to include the administrative detention of drugs. The rule published with incorrect statements regarding the impact of the final rule on small entities. This document corrects those errors., 51333=The Food and Drug Administration (FDA) is announcing the availability of a guidance entitled “Questions and Answers Regarding Establishment and Maintenance of Records by Persons Who Manufacture, Process, Pack, Transport, Distribute, Receive, Hold, or Import Food (Edition 5).” This guidance provides updated information pertaining to the establishment and maintenance of records by persons who manufacture, process, pack, transport, distribute, receive, hold, or import food in the United States under the Federal Food, Drug, and Cosmetic Act (FD&C Act), as amended by the FDA Food Safety and Modernization Act (FSMA) of January 4, 2011., 58856=§ 1490 - General orders, 22925=The Food and Drug Administration (FDA or we) published a final rule in the Federal Register on November 30, 2010, amending certain regulations to include tobacco products, where appropriate, in light of FDA's authority to regulate these products under the Family Smoking Prevention and Tobacco Control Act (Tobacco Control Act). The final rule inadvertently deleted an authority citation and language related to the definition of “package.” We are restoring the inadvertent deletions and making a corresponding technical change., 31128=The Food and Drug Administration (FDA) is issuing a final rule that adopts, without change, the interim final rule (IFR) entitled “Information Required in Prior Notice of Imported Food” that published in the Federal Register (76 FR 25542; May 5, 2011) (2011 IFR). This final rule adopts the IFR's requirement of an additional element of information in a prior notice of imported food, specifically that a person submitting prior notice of imported food, including food for animals, must report the name of any country to which the article has been refused entry., 58307=§ 1454 - Rules and regulations, 58399=§ 1455 - Procedure for promulgation of regulations, 58041=§ 1333 - Labeling, 58941=§ 1491 - Unclaimed merchandise; disposition of forfeited distilled spirits, wines and malt liquor, 62247=Title 21 published on 2015-04-01, 35752=The Food and Drug Administration (FDA) is issuing a final regulation that adopts, without change, the interim final rule (IFR) entitled “Criteria Used to Order Administrative Detention of Food for Human or Animal Consumption” that published in the Federal Register on May 5, 2011, (the 2011 IFR). This final rule affirms the IFR's change to the criteria for ordering administrative detention of human or animal food as required by the FDA Food Safety Modernization Act (FSMA). Under the new criteria, FDA can order an administrative detention if there is reason to believe that an article of food is adulterated or misbranded. This final rule does not make any changes to the regulatory requirements established by the IFR. The final regulation also responds to comments submitted in response to the request for comments in the IFR.}",
    "lastModified": "Tue, 07 Jul 2015 02:59:34 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 22403 - Administrative Detention of Drugs Intended for Human or Animal Use; Correction 2015-04-22; vol. 80 # 77 - Wednesday, April 22, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 21. Title 21 published on . 26426224324142 U.S.C. 216393387c387a387382381374371362360b355352350d350c343335a334333 42 FR 15553, Mar. 22, 1977, unless otherwise noted. Source: . , , , , ; , , , , , , , , , , , , , , , , ,",
    "textAfterTable": "DEPARTMENT OF HEALTH AND HUMAN SERVICES, Food and Drug Administration Final rule; correction. Effective April 22, 2015 and applicable beginning June 30, 2014. 21 CFR Parts 1 and 16 Summary The Food and Drug Administration (FDA) is correcting a final rule entitled “Administrative Detention of Drugs Intended for Human or Animal Use” that appeared in the Federal Register of May 29, 2014 (79 FR 30716). The rule sets forth the procedures for detention of drugs believed to be adulterated or misbranded and amends the scope of FDA's part 16 regulatory hearing procedures to include the administrative detention of drugs. The rule published with incorrect statements regarding the impact of the final rule on small entities. This document corrects those errors. 2015-04-03; vol. 80 # 64 - Friday, April 3, 2015 80 FR 18087 - Food and Drug Administration Regulations; Change of Addresses; Technical Amendment GPO FDSys XML | Text",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}