{
    "relation": [
        [
            "Name",
            "Cleanliness",
            "Landscape",
            "Structural"
        ],
        [
            "Acceptable",
            "Glass Graffiti Litter Weeds",
            "Trees Water Bodies",
            "Benches Fences"
        ],
        [
            "Unacceptable",
            "",
            "",
            ""
        ],
        [
            "Not Rated",
            "",
            "Horticultural Areas Lawns Trails",
            "Paved Surfaces"
        ]
    ],
    "pageTitle": "Prospect Park Inspections : NYC Parks",
    "title": "",
    "url": "http://www.nycgovparks.org/parks/prospect-park/inspections/B073-ZN17",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 606695366,
    "recordOffset": 606678972,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{218=Wednesday, February 11, 2015}",
    "TableContextTimeStampAfterTable": "{45640=Starting July 6, 2015, Prospect Park's West Drive will be permanently car-free after 9 a.m. on weekdays and 24 hours a day on weekends and holidays. For more information, please visit on.nyc.gov/1MOAh40., 24714=Tuesday, September 26, 2006, 20029=Tuesday, September 9, 2008, 56437=Zip Code: 11215 Community Board: 06, 07, 14, 09, 08 Council Member:Brad Lander Park ID: B073 Acreage: 526.25 Property Type: Flagship Park, 12206=Friday, January 20, 2012, 10691=Friday, May 25, 2012, 23105=Tuesday, March 13, 2007, 44714=The Long Meadow Ballfields will be closed at Prospect Park for construction. The reconstruction of the Long Meadow Ballfields is a multi-phase project encompassing 34 acres of fields, paths and woodlands. The project incorporates contemporary storm water management techniques that support our goal of capturing and retaining storm water runoff. These improvements will also help to filter runoff before it enters our watercourse. Designed to revitalize the park’s sporting community, the first phase will restore Field One, pedestrian and bridle paths, drinking fountains, benches, and include new tree plantings. Anticipated Completion: Summer 2015, 18444=Tuesday, December 30, 2008, 34726=Thursday, January 3, 2002, 27855=Friday, December 3, 2004, 26302=Thursday, March 3, 2005, 44224=The Prospect Park Well House is under reconstruction in order to build a new composting latrine. The park remains open while the building gets reconstructed. Anticipated Completion: Winter 2015, 33200=Thursday, May 2, 2002, 6070=Friday, March 29, 2013, 16891=Thursday, October 8, 2009, 7618=Friday, December 28, 2012, 15342=Thursday, March 4, 2010, 9169=Tuesday, September 11, 2012, 13723=Wednesday, February 9, 2011, 31712=Wednesday, April 2, 2003, 30860=Wednesday, January 21, 2004, 4552=Friday, October 4, 2013, 36347=Thursday, August 2, 2001, 29374=Wednesday, May 5, 2004, 39463=Thursday, April 13, 2000, 2967=Thursday, January 23, 2014, 21585=Friday, January 4, 2008, 37866=Thursday, January 25, 2001, 1379=Thursday, July 31, 2014}",
    "textBeforeTable": "Overall Condition: Acceptable Cleanliness: Acceptable Thursday, January 25, 2001 Sidewalks Paved Surfaces Fences Benches Structural Water Bodies Trees Trails Lawns Landscape Weeds Litter Graffiti Glass Cleanliness Not Rated Unacceptable Acceptable Name Overall Condition: Acceptable Cleanliness: Acceptable Thursday, August 2, 2001 Paved Surfaces Sidewalks Fences Benches Structural Trails Water Bodies Trees Lawns Landscape Litter Weeds Graffiti Glass Cleanliness Not Rated Unacceptable Acceptable Name Overall Condition: Unacceptable Cleanliness: Acceptable Thursday, January 3, 2002 Paved Surfaces Fences Benches Structural Water Bodies Trees Trails Lawns Horticultural Areas Landscape Weeds Litter Graffiti Glass Cleanliness Not Rated Unacceptable Acceptable Name Overall Condition: Acceptable Cleanliness: Acceptable Thursday, May 2, 2002",
    "textAfterTable": "Thursday, April 13, 2000 Overall Condition: Acceptable Cleanliness: Acceptable Name Acceptable Unacceptable Not Rated Cleanliness Glass Graffiti Weeds Litter Landscape Lawns Trails Trees Water Bodies Structural Fences Paved Surfaces Park Information Main Events Highlights News Map Monuments Inspections Videos Projects Lost and Found Information Directions to Prospect Park Starting Address I am traveling by: Public TransportationBikingWalkingCar",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}