{
    "relation": [
        [
            "Make",
            "Arai",
            "Shoei"
        ],
        [
            "Model",
            "XD 3",
            "Hornet DS"
        ],
        [
            "MSRP",
            "$569.95",
            "$456.99 - $489.99"
        ]
    ],
    "pageTitle": "CleanMPG Reviews the 2009 Shoei Hornet DS dual sport helmet - CleanMPG Forums",
    "title": "",
    "url": "http://www.cleanmpg.com/forums/showthread.php?p=205584",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366545459,
    "recordOffset": 366521796,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "2009 Shoei Hornet DS - Competitive Comparisons Shoei product development is focused not only on maximum impact protection but also on comfort; according to the company, this has a critical influence on rider concentration and thus overall safety. Models guaranteeing a perfect fit provide enhanced protection and few in the industry do this better than Shoei. Shoei helmet philosophy be seen\u0094. All black is not recommended due to visibility issues, but a black helmet is much better than no helmet at all! An uncomfortable or non-aesthetically pleasing helmet is much less likely to be worn; be sure to get a proper, comfortable fit along with a \u0093cool factor\u0094 so you'll actually want to wear the gear. any time you straddle the bike and turn the key. When choosing a helmet, be sure to pick one with a color to \u0093 A motorcycle helmet should be worn Motorcycle Helmet Performance: Blowing the Lid Off - Searching for the truth behind motorcycle helmet design, helmet standards and actual head protection. It provided a detailed overview of motorcycle helmet certification standards and attributes however its conclusions are not even close to actual accident reality and some of its authors have disavowed being a part of the slapped together study and its conclusions... In June 2005, Motorcyclist wrote up an unorthodox article entitled Auto",
    "textAfterTable": "2009 Shoei Hornet DS \u0096 Comfort and Features Dual Sport riders have been faced with a predicament since the first on-off road bikes came into existence. Should they ride with a full face, on-road helmet lacking the air flow, visibility, eye shade, and style of a motocross helmet... or use the motocross helmet, goggles, and buffeting visor on the street with its limited face protection, high levels of wind noise, and lack of thermal protection in temperatures below 60 degrees F? The crossover Shoei Hornet DS Dual Sport presents a solution to this dilemma. The Hornet DS was first introduced in 2007 and with the removable visor detached; riders can hit the streets without sacrificing comfort, performance, or safety. When it's time to go off-road, they can attach the visor, remove the shield, and (after adding goggles) play in the dirt all-day long with full frontal ventilation. This helmet truly offers the best of both worlds. As most bikers will discover, a simple \u0093Just wear it\u0094 is where the Hornet DS excels. Offering two helmets for the price of one without sacrificing capability under any scenario is a win-win for any rider. Besides looking the part on a Dual Sport rider's head (yes, it really does \u0093 look cool\u0094 ), the Hornet DS offers features which will satisfy even the purist road rider.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}