{
    "relation": [
        [
            "Semester",
            "Summer Term 3, 2014",
            "Summer Term 3, 2015"
        ],
        [
            "Instructor",
            "V. Staff",
            "M. Miller"
        ],
        [
            "Time",
            "",
            ""
        ]
    ],
    "pageTitle": "Roanoke College | Campus Directory",
    "title": "",
    "url": "https://directory.roanoke.edu/course/engl/all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869358119,
    "recordOffset": 869345434,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20268=A study of the structure of contemporary English grammar. Also explores question s of style and usage. Students analyze a nd diagram sentences and apply principle s of grammar and style to their own and others writing. Designed for English ma jors and for those preparing to teach la nguage and communication skills. Lecture : 3 hrs/wk. 1 Unit}",
    "textBeforeTable": "Offerings Critical reading and literary analysis of major texts surrounding a focused top ic of particular interest to the introdu ctory study of literature. A variety of genres (poetry, prose, and drama, as rel evant) will be included. Lecture: 3 hrs/ wk. 1 Unit ENGL 220 Sp Top: Whitman and Civil War } margin-top:0px !important; p{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; h4{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; }h3{ color:#1894e5 !important; padding-bottom: 0px !important; margin-top:0px !important; margin-bottom: 2px !important; h2{",
    "textAfterTable": "ENGL 220 Sp Top: Art of Short Story Critical reading and literary analysis of major texts surrounding a focused top ic of particular interest to the introdu ctory study of literature. A variety of genres (poetry, prose, and drama, as rel evant) will be included. Lecture: 3 hrs/ wk. 1 Unit Offerings Semester Instructor Time Spring 2014 D. Whiteside T/Th 2:50PM-4:20PM ENGL 220 Sp Top: Ecosystem of Narrativ Critical reading and literary analysis of major texts surrounding a focused top ic of particular interest to the introdu ctory study of literature. A variety of genres (poetry, prose, and drama, as rel evant) will be included. Lecture: 3 hrs/ wk. 1 Unit Offerings Semester Instructor Time Spring 2014 M. Almeder T/Th 1:10PM-2:40PM ENGL 220 Sp Top: Contemporary Kid Lit Critical reading and literary analysis of major texts surrounding a focused top ic of particular interest to the introdu ctory study of literature. A variety of genres (poetry, prose, and drama, as rel evant) will be included. Lecture: 3 hrs/ wk. 1 Unit Offerings Semester Instructor Time",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}