{
    "relation": [
        [
            "Box",
            "8",
            "8",
            "8",
            "8",
            "8"
        ],
        [
            "Reel (Frames)",
            "5720 (223-227)",
            "5720 (228-237)",
            "5720 (238-254)",
            "5720 (255-262)",
            "5720 (263-273)"
        ],
        [
            "",
            "Boston Redevelopment Parcel 8 Competition, Boston, Massachusetts, 1964 (letters from Breuer to Sverud Associates and Jaros Baum & Bolles)",
            "Potsdamer Platz, Berlin, Germany, 1928-1929 (photographs of plans for traffic clover-leaf pattern for a multi-level traffic circulation system)",
            "Sadat City Ministries Complex, Cairo, Egypt, 1976-1981 (oversized material housed in Box 36)",
            "South Boston Redevelopment Project, Boston, Massachusetts, 1943-1944",
            "Stuyvesant Six (housing development), New York, New York, 1943-1944"
        ]
    ],
    "pageTitle": "Detailed description of the Marcel Breuer papers, 1920-1986 - Digitized Collection | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/marcel-breuer-papers-5596/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 271590011,
    "recordOffset": 271461467,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{54163=In 1925, Gropius enticed Breuer to return to the Bauhaus, now relocated in Dessau, by offering him a post as master of the carpentry workshop and a commission to design the interiors of the new Bauhaus buildings. Inspired by his new bicycle's handlebars, Breuer designed his first tubular steel chair, the Wassily chair, named for his friend Wassily Kandinsky. This chair and dozens of other Breuer designs for furnishings were mass-produced by the Thonet Brothers in Germany., 52412=In 1937, Breuer accepted an invitation from Walter Gropius to join the faculty of the School of Design at Harvard University to teach architecture, and he moved to the United States. Among his students were Edward Larrabee Barnes, Ulrich Franzen, Philip Johnson, I. M. Pei, and Paul Rudolph. Breuer formed a partnership with Gropius in Cambridge, Massachusetts, from 1937 to 1941. Their firm was engaged primarily in the design of private homes., 848=Marcel Breuer papers, 1920-1986. Archives of American Art, Smithsonian Institution., 49315=Due to failing health in 1972, Breuer sold his New Canaan house and moved into Manhattan so he could more easily commute to the office. By 1976, Breuer's health had declined further, and he retired from practice. The name of his firm was subtly changed from Marcel Breuer and Associates to Marcel Breuer Associates, and later to MBA/Architects and Planners., 50518=After several moves to increasingly larger office space in New York, Breuer established his largest office at 635 Madison Avenue and 59th Street in 1965. After suffering the first of a series of heart attacks, Breuer reduced his travel to Europe, eventually leaving the management of the Paris office in the hands of Mario Jossa., 51498=Breuer's architectural reputation was greatly enhanced when, in 1953, he was commissioned to design, in collaboration with Pier Luigi Nervi and Bernard Zehrfuss, the United Nations Educational, Scientific and Cultural Organization (UNESCO) World Headquarters in Paris. During this year, he also began work on a series of innovative buildings for St. John's Abbey and University in Collegeville, Minnesota., 51952=In 1946, Breuer moved to New York City, where he established an office in an East 88th Street townhouse. The number of his commissions began to grow slowly, and it was during this time he constructed his own notable residence in New Canaan, Connecticut. He developed the bi-nuclear, or \"two-center\" house, which was designed to meet the living requirements of modern families by creating functional areas for separate activities., 48943=Marcel Breuer died on July 1, 1981, in New York City., 50174=Between 1965 and 1973, Marcel Breuer and Associates continued to receive many diverse and important commissions, including the Department of Housing and Urban Development Headquarters Building (Washington, D.C.), showrooms for Scarves by Vera (New York City), the IBM Corporation (La Gaude, France), the Baldegg Convent (Lucerne, Switzerland), Bryn Mawr School for Girls (Baltimore, Maryland), a third power plant for the Grand Coulee Dam, the Australian Embassy (Paris, France), the Armstrong Rubber Company (New Haven, Connecticut), and the State University of New York Engineering Complex (Buffalo). Breuer also designed residences including a second Gagarin House (Litchfield, Connecticut), the Saier House (Glanville-Calvados, France), the Soriano House (Greenwich, Connecticut), and a third Rufus Stillman House (Litchfield, Connecticut)., 9352=There are address lists of colleagues and patrons and résumés from architects contained within the series on Notes, while the Writings Series contains typescripts of lectures and articles written by Breuer concerning architecture and its history. Writings by others are about Breuer and his work, including typescripts, galleys, and photographs of architectural and design projects used in the publication of the book Marcel Breuer Buildings and Projects, 1921-1961 by Cranston Jones., 54437=Founded and directed by Walter Gropius, the Bauhaus combined the teaching of the pure arts with training in functional technology. Breuer received a master's degree from the Bauhaus in 1924, then studied architecture in Paris, where he first met Le Corbusier., 2496=The collection was donated to the Archives of American Art in five installments, 1985-1999, by Constance Breuer, widow of Marcel Breuer., 55488=Marcel Lajos Breuer was born on May 21, 1902, in the Danube valley town of Pécs, Hungary, to Jacques Breuer, a physician, and Franciska (Kan) Breuer. His siblings were Hermina and Alexander. Throughout his life, Breuer used his first name only on official documents and preferred that his friends use his middle name, the Hungarian form of \"Louis.\" The diminutive form of this name was usually spelled \"Lajkó\" and pronounced \"Lye-ko.\", 2019=This collection was processed by Jean Fitzgerald in 2000-2001 and was subsequently microfilmed on reels 5708-5739 with funding provided by the Gerta Charitable Trust. The microfilm of the collection was digitized in 2006 with funding provided by the Terra Foundation for American Art., 52837=The Nazis closed the Bauhaus in 1933. The following year, Breuer designed the Dolderthal Apartments in Zurich for the Swiss architectural historian Sigfried Giedion. From 1935 to 1937, Breuer settled in London, and became partners with F. R. S. Yorke. During this time he designed for the Isokon (\"isometric unit construction\") Control Company laminated plywood furniture that became widely imitated., 11642=The Marcel Breuer papers span the years 1920 to 1986 and measure 37.6 linear feet. They consist of biographical material, correspondence, business and financial records, interviews, notes, writings, sketches, project files, exhibition files, photographs, and printed material that document Breuer's career as an architect and designer. This material reflects the prolificacy and diversity of his creations, from tubular steel chairs to private residences, college campuses, factories, department stores, and international, municipal, and corporate headquarters and complexes., 53672=Two years later, in 1928, Breuer left the Bauhaus to begin a private architecture practice in Berlin, emphasizing prefabricated housing and the use of concrete in building. During this time Breuer worked on a designs for the Potsdamer Platz, Spandau-Haselhorst Housing, and a hospital in Elberfeld, and he completed work on the Lewin House and the Harnischmacher Apartment. Due to the deteriorating economic and political conditions in Germany, Breuer closed his Berlin office in 1931 and traveled to Budapest, Zurich, Morocco, Greece, and Spain. Returning to Germany in the following year, he began designing furniture in aluminum. Breuer established his reputation as an architect upon completion of the Harnischmacher House in Wiesbaden, a house notable for the use of contrasting materials and distinctive interiors., 51078=Between 1963 and 1964, Breuer began work on what is perhaps his best-known project, the Whitney Museum of American Art, in New York City. He also established an office with the name Marcel Breuer Architecte, in Paris, to better orchestrate his European projects. Also during this time, Herbert Beckhard, Murray Emslie, Hamilton Smith, and Robert F. Gatje became partners in Marcel Breuer and Associates. When Murray Emslie left a year later, he was replaced by Tician Papachristou, who had been recommended by Breuer's former student, I. M. Pei., 54995=In 1920, Breuer graduated from the Magyar Királyi Föreáliskola in Pécs. He had received a scholarship to study art in Vienna but took an immediate dislike to the Art Academy there, so searched elsewhere for training. He started working in the studio of a Viennese architect and soon became interested in training in the cabinetmaking shop of the architect's brother. Breuer was not satisfied with this arrangement either, and, upon hearing about the year-old Bauhaus school in Germany, he departed for Weimar in 1921.}",
    "TableContextTimeStampAfterTable": "{916760=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       , 733571=Photographs 1938-circa 1940 include Breuer with friends in Concord, Massachusetts, 1938; Herbert Bayer, Marian Willard, Ise Gropius, Ati Gropius in Breuer House, Lincoln, Massachusetts, circa 1940; Constance Breuer, Dottie Noyes, and Christopher Tunnan; Breuer with Mercedes Matter, Konrad Wachsmann, and Alexander Calder; and Breuer with Joan McVitty, Edward Larrabee Barnes, Mary Barnes, and Alexander Calder in Breuer House I, New Canaan, Connecticut., 734040=Photographs 1955-1958 include Breuer with Matta at UNESCO cocktail party, 1957; Breuer with Walter Gropius in Paris for UNESCO. Photographs 1958-1961 include Breuer with George Salle in Paris, 1958; Breuer with Eduardo Catalano in Argentina; Breuer on a jury with unidentified South American colleagues, on a panel with unidentified colleagues and in Philip Johnson's house, 1961., 131925=This series contains typescripts of lectures and articles written by Breuer concerning architecture and its history. Writings by others are about Breuer and his work and include typescripts, galleys, and photographs of architectural and design projects used in the publication of the book Marcel Breuer Buildings and Projects, 1921-1961 by Cranston Jones., 758679=This series has been divided into 8 chronologically arranged file groups, according to the type of material. Exhibition Announcements and Catalogs for Others includes material relating to Nadia Benois; Lyonel Feininger, 1936; László Moholy-Nagy, 1940; Decima Triennale di Milano, 1954; American Academy of Arts and Letters, 1959; Eric Rutherford, 1964; \"Erfahrungen, Strukturen, Imaginationen\" group exhibition with André Bloc, Hans Glaube, Sergius Ruegenberg, and Eckhard Schulze-Fielitz, 1965; Sidney Wolfson, 1965; Fred Woell and Hui Ka Kwong, 1967; Robert and Ella Bergmann Michel, 1968; and Walter Gropius, 1970. Miscellaneous Printed Material includes rosters of registered architects in Connecticut (1951 and 1971) and Who's Who Among Professionals of Hungarian Origin in the Americas (1961)., 734435=Photographs 1961-1978 include Breuer with Eric Boissonnas and Flaine Architects at Hunter College, 1961; at a reception with Dino Gavina in Milan, 1962; Breuer on a panel at College of Architecture and Design, University of Michigan, with Chet LaMore, David Reider, Robert Iglehart, and William Muschenheim, 1963; Birthday party [80th birthday of Walter Gropius?], 1963; Breuer on jury for R. S. Reynolds Memorial Award, 1965, with William Stephen Allen, George Harrell, Vernon DeMars, and Mario Pani; Breuer with Yuichiro Kojiro at Breuer House II in New Canaan, Connecticut, 1966; Breuer receiving the George Washington Award at American Hungarian Studies Foundation ceremony, Plaza Hotel, New York, 1967.}",
    "textBeforeTable": "The files are arranged by type of material and then chronologically. Series 1 contains résumés, identity cards, licenses, diplomas, certificates, applications, and awards that list or certify significant events or associations attained by Breuer during his career. (Boxes 1, 36; Reel 5708; 0.4 linear feet) Biographical Material, 1920-1981 Series 1: Detailed Description and Container Inventory Return to top Marcel Breuer papers, 1920-1986. Archives of American Art, Smithsonian Institution. How to Cite this Collection The microfilm for this collection has been digitized as is available online via the Archives of American Website. Available Formats The Marcel Breuer papers are owned by the Archives of American Art, Smithsonian Institution. Literary rights as possessed by the donor have been dedicated to public use for research, study, and scholarship. The collection is subject to all copyright laws. Ownership & Literary Rights The microfilm for this collection has been digitized and is available online via the Archives of American Art website. Restrictions on Use How to Use the Collection This collection was processed by Jean Fitzgerald in 2000-2001 and was subsequently microfilmed on reels 5708-5739 with funding provided by the Gerta Charitable Trust. The microfilm of the collection was digitized in 2006 with funding provided by the Terra Foundation for American Art. How the Collection was Processed A presentation book for the IBM Research Center in",
    "textAfterTable": "Box Reel 1 5708 Honorary Diplomas 1 5708 (104-131) Pratt Institute, 1969 (oversized material housed in Box 36) 1 5708 (132-137) Harvard University, 1970 1 5708 (138-144) Parsons School of Design, 1980 (oversized material housed in Box 36) Box Reel 36 5708 Pratt Institute, 1969 (oversized material scanned with Box 1, Reel 5708, Frames 104-131) 36 5708 Parsons School of Design, 1980 (oversized material scanned with Box 1, Reel 5708, Frames 138-144) Box Reel (Frames) 1 5708 (145-150) Membership Cards and Certificates, 1947-1976 1 5708 Membership Applications 1 5708 (151-174) Fellowship nomination, American Institute of Architects, 1958 1 5708 (175-191) Membership application for title of Architecte étranger in L'Ordre des Architectes, France, 1963-1964 1 5708 (192-227) Fellowship proposal, Royal Society of Arts,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}