{
    "relation": [
        [
            "System Code",
            "00",
            "00",
            "01",
            "01",
            "00",
            "01",
            "00",
            "00",
            "01",
            "H00",
            "00",
            "98",
            "00",
            "41",
            "49",
            "41B",
            "46",
            "41",
            "42",
            "06",
            "07",
            "05",
            "00"
        ],
        [
            "User Defined Code",
            "PY",
            "CN",
            "GD",
            "LP",
            "S",
            "PH",
            "MC",
            "TS",
            "SC",
            "TA",
            "PY",
            "IC",
            "UM",
            "I",
            "BX",
            "PG",
            "EQ",
            "I",
            "FR",
            "G",
            "MS",
            "HQ",
            "CN"
        ],
        [
            "Category",
            "SUPPLIER_PAYMENT_METHOD",
            "COUNTRY",
            "GENDER",
            "LANGUAGE",
            "STATE",
            "FIN_PHONE_USAGE",
            "DIVISION_TYPE",
            "FIN_ORG_STRUCTURE",
            "PROFITCNTR_GRP",
            "TAX_CODE",
            "PAYMENT_METHOD",
            "ACCT_DOC~STATUS",
            "UOM",
            "STORAGE_TYPE",
            "HAZARD_MTL",
            "PROD_GRP",
            "CONTAINER",
            "PRODUCT_TYPE",
            "FRGHT_TERMS",
            "JOB",
            "MARITAL_STATUS",
            "DISABILITY",
            "NATIONAL_ID_TYPE"
        ]
    ],
    "pageTitle": "Configuring Common Areas and Dimensions",
    "title": "",
    "url": "http://docs.oracle.com/cd/E14847_01/bia.796/e14844/anyimp_oracle_apps.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70196859,
    "recordOffset": 70146671,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{123450=When a user maps a GL natural account to an incorrect group account number, incorrect accounting entries might be inserted into the fact table. For example, the natural account 1210 is mistakenly classified under 'AR' group account number when it should be classified under 'AP' group account number. When this happens, the ETL program will charge all the GL journal lines to account 1210 and try to reconcile these GL journal lines against subledger accounting records in the AR fact table (W_AR_XACT_F). Since these GL journal lines did not come from AR, the ETL program will not be able to find the corresponding subledger accounting records for these GL journal lines. In this case, the ETL program will insert 'Manual' records into the AR fact table because it thinks that these GL journal lines are 'Manual' journal entries created directly in the GL system charging to the AR accounts. This entire process is called the GL reconciliation process., 15842=Section 3.1.4.13, \"How to use a fiscal calendar loaded via the Universal adapter\", 163887=HIER3_AXIS_SET_ID - 1003, 105704=131939, 125679=FROM ACCT = 1210, 206554=2340, 105992=152121, 257728=The W_MCAL_CAL_D table stores the calendar information. Every distinct Fiscal Date Pattern stored in the Fiscal Date Pattern table (F0008) has an entry in this table. The grain of this dimension is the Date Pattern Type, which identifies the Calendar in the Oracle Business Analytics Warehouse. This dimension does not have an association with the Fiscal year for that pattern. The MCAL_CAL_WID column is a four digit number that is reset to 1000 each time the ETL is run and incremented by one for each date pattern type stored in W_MCAL_CAL_D., 164012=This row indicates that for all of the GL accounts with CHART_OF_ACCOUNTS=101 and DATASOURCE_NUM_ID=2, assigning hierarchies with axis_set_id=1001, null, 1003, null, null, null to HIER1~HIER6 columns respectively. Therefore, after extraction and loading, for those affected GL account rows, HIER1 column will be the foreign key to the income statement hierarchy row ID in W_HIERARCHY_D, and HIER3 column will be the foreign key to the balance sheet hierarchy row ID in W_HIERARCHY_D., 68811=DATE columns should be of the format YYYYMMDDHHMMSS (for example, 20000202000000 for 2nd February, 2000)., 106069=152401, 15464=Section 3.1.4.10, \"How to set up a World calendar using an Oracle JD Edwards World source system\", 125382=TO ACCT = 1110, 42005=If there is a week (starting on a Sunday and ending on a Saturday) that falls across two calendar years, the week is counted in both years. For example, the week that starts on 12/30/2007 will be counted in both 2007 and 2008. In 2007, the week start date will 12/30/2007 and the end date will be 12/31/2007. In 2008, this will be the first week with start date as 01/01/2008 and end date as 01/05/2008., 14771=Section 3.1.4.17, \"ETL Process Flow Diagrams\", 106434=171901, 107530=261100, 107453=261000, 206198=2334, 15733=Section 3.1.4.12, \"How to set up a 4-4-5 calendar\", 108262=251120, 43346=By default, Oracle BI Applications can generate up to 65536 rows. If you need more than 65536 rows, you can increase the capacity to 262144 rows (718 years) by doing the following:, 163848=HIER1_AXIS_SET_ID - 1001, 106357=171101, 105343=101099, 108184=251100, 107819=181011, 108481=In the table above, in the first row, all accounts within the account number range from 101010 to 101099 that have a Chart of Account (COA) ID equal to 1 are assigned to Current Asset (that is, CA). Each row maps all accounts within the specified account number range and within the given chart of account ID., 16225=Section 3.1.4.16, \"How to Reload the Time Dimension Tables After the Data Warehouse Is Loaded\", 15620=Section 3.1.4.11, \"How to set up a 13 Period calendar\", 6472=When you set the Initial Extract Date parameter, make sure that you set it to the beginning of an accounting period and not a date in the middle of an accounting period. For example, if you decide to extract data from June 2005, and the June 2005 accounting period starts on June 5, set the date to June 5, 2005., 105266=101010, 16971=Gregorian - regular calendar that starts on January 1st and ends on December 31st., 80738=ORA_R1211, 186890=In the Table above, in the first row, all accounts within the account number range from 101010 to 101099 containing a Business Unit equal to AUS01 are assigned to AP. Each row maps all accounts within the specified account number range and with the given Business Unit. If you need to assign a new group of account numbers, you can then assign GL accounts to the new group of account numbers in the file_group_acct_codes_psft.csv file., 124417=In order to revert these 'Manual' entries in the AR fact table, you will need to utilize the 'Group Account Number Cleanup' program provided in Oracle BI Applications. This program will revert the 'Manual' entries in the fact table (in this case, AR fact table), and then try to do the GL reconciliation process again. This time, the ETL program will try to look for the corresponding subledger accounting records in the AP fact (W_AP_XACT_F), provided that you have re-assigned the natural account 1210 to the 'AP' group account number in the file_group_acct_codes_ora.csv file., 162981=For example, suppose you have an income statement FSG report and a balance sheet FSG report and you want to input both of their hierarchy structures into the data warehouse. Oracle BI Applications assumes that both reports are derived from the same set of GL accounts with CHART_OF_ACCOUNTS=101. The axis_set_id of the income statement is 1001, and for the balance sheet, it is 1003. The DATASOURCE_NUM_ID for this application is 2., 105627=131010, 95701=UNSPSC Codes are created automatically by the SDE_UNSPSC process in the adapter. This process loads the UNSPSC codes from the file_unspsc.csv into the W_PROD_CAT_DHS table. Make sure that the DATASOURCE_NUM_ID in the file is the same as that defined for the Oracle EBS Adapter. The default values are '9' for Oracle EBS R12 and '4' for Oracle EBS R11510., 16101=Section 3.1.4.15, \"Examples of Configuring the Universal Adapter\", 167932=Then, set HIER_CODE=1001 (this is the Axis_set_id of Income Statement hierarchy) in logical table to restrain the output of logical table to be Income Statement Hierarchy only (right-click logical table Dim_IncomeStatement_FSGHierarchy_D – click properties – choose Source tab – select Dim_IncomeStatement_FSGHierarchy_D – click Edit button – choose Content tab – fill (\"Oracle Data Warehouse\".\"Catalog\".\"dbo\".\"Dim_W_HIERARCHY_D_FSG1\".\"HIER_CODE\" =1001) into 'use WHERE clause…' text box)., 15982=Section 3.1.4.14, \"How to use a PeopleSoft Summary calendar\", 125358=FROM ACCT = 1110, 6154=Initial Extract Date is required when you extract data for a full load. It reduces the volume of data in the initial load. The specified initial extract date will be used as a filter on the creation date of the transactional data in the selected full extract mapping. The default date is January 01, 1970., 125703=TO ACCT = 1210, 107896=181918}",
    "lastModified": "Fri, 10 Sep 2010 10:14:38 GMT",
    "textBeforeTable": "Table 3-18 List of UDCs for the file_udc_category_mapping_jde.csv Flat File Table 3-18 contains the UDCs that you can map using the file_udc_category_mapping_jde.csv flat file (in the order listed in the file). In the CSV file, you specify the system code and user defined code and associate it with the category to which you want the UDCs loaded. This data is loaded into UDC_CATEGORY_MAP_TMP table, which leverages the data and loads the relevant codes into the Code dimension. 00 CN COUNTRY Categories in W_CODE_D are used to group together codes intended for a similar purpose. For example, UDC 00||CN stores the country code and description. To store this under the COUNTRY category in W_CODE_D, enter the following row in the CSV file: There are three columns in the CSV file. The first two columns are used to identify the system codes and user defined codes. Together, these columns are used to identify the UDCs that will be loaded into W_CODE_D. The third column is the category into which you want to load the codes in W_CODE_D. Before you configure the CSV file, identify the UDCs that you need depending on the functional module that you are loading. Choose only the UDCs in transactional tables that are involved in the ETL process. Oracle recommends preparing a list of UDCs that you can refer to when configuring the CSV file. The file_udc_category_mapping_jde.csv file loads Oracle's JD Edwards EnterpriseOne or JD",
    "textAfterTable": "The temporary table in the data warehouse stores the UDC to Category mappings. When the ETL for Code dimension is started, all UDCs that are found in this table, along with their mappings to respective categories, are extracted from the source and loaded into the W_CODE_D table. Determining how to associate UDCs with categories requires looking at the SILO mappings, where the descriptions are resolved through lookups in W_CODE_D. The category is hard coded in the lookups. To resolve descriptions from W_CODE_D, you must ensure that the UDCs are loaded into the proper categories. For information on creating categories and configuring the Code dimension for Oracle's JD Edwards EnterpriseOne or JD Edwards World category codes, see the Knowledge Article posted on Metalink 3. 3.5.1.3 About Configuring Quarters for a Fiscal Pattern and Fiscal Year of Time Dimensions Oracle's JD Edwards EnterpriseOne and JD Edwards World do not have a concept of defining the quarters for a fiscal pattern or a fiscal year. Therefore, a configurable flat file is provided to populate quarter information. This configuration file enables you to feed quarter information such as Quarter Number for each period, Quarter Start Date, and Quarter End Date. For information about how to configure this flat file, see Section 5.2.4.9, \"How to Configure the file_lkp_fiscal_period_Qtr_Config_jde.csv\".Each fiscal pattern can have a varying number of periods",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}