{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "164,661",
            "99,508",
            "99,126",
            "35,767",
            "16,476",
            "2,650",
            "482,805"
        ],
        [
            "Congregations",
            "445",
            "131",
            "17",
            "72",
            "42",
            "5",
            "-"
        ]
    ],
    "pageTitle": "Raleigh, North Carolina (NC) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Raleigh-North-Carolina.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362676859,
    "recordOffset": 362493143,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7924=According to our research of North Carolina and other state lists there were 1,037 registered sex offenders living in Raleigh, North Carolina as of August 03, 2015. The ratio of number of residents in Raleigh to the number of sex offenders is 408 to 1., 136533=Raleigh: Raleigh, NC Spring 2004, 137446=Raleigh: Raleigh,NC Summer 2004, 134601=Raleigh: Raleigh Winter 2004}",
    "TableContextTimeStampAfterTable": "{109189=2012 Presidential Elections Results, 78939=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.31. This is about average. Closest monitor was 2.4 miles away from the city center., 20618=On 11/23/1992, a category F3 (max. wind speeds 158-206 mph) tornado 24.2 miles away from the city center injured 44 people and caused between $500,000 and $5,000,000 in damages., 108617=2004 Presidential Elections Results, 20297=On 11/28/1988, a category F4 (max. wind speeds 207-260 mph) tornado 6.9 miles away from the Raleigh city center killed 4 people and injured 154 people and caused between $50,000,000 and $500,000,000 in damages., 104821=Educational Attainment (%) in 2013, 108331=2000 Presidential Elections Results, 76001=Carbon Monoxide (CO) [ppm] level in 2012 was 0.282. This is about average. Closest monitor was 2.4 miles away from the city center., 290390=6.28% of this county's 2010 resident taxpayers moved to other counties in 2011 ($52,082 average adjusted gross income), 75349=Air Quality Index (AQI) level in 2012 was 91.0. This is worse than average., 76718=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.574. This is significantly better than average. Closest monitor was 1.5 miles away from the city center., 288166=7.53% of this county's 2011 resident taxpayers lived in other counties in 2010 ($50,020 average adjusted gross income), 109473=Graphs represent county-level data. Detailed 2008 Election Results, 108903=2008 Presidential Elections Results, 108045=1996 Presidential Elections Results, 468279=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 59629=Tourist attractions: African American Cultural Complex (Museums; 119 Sunnybrook Road) (1), A ACC (Museums; 119 Sunnybrook Road) (2), Contemporary Art Museum (409 West Martin Street) (3), Joel Lane House Inc (Cultural Attractions- Events- & Facilities; 728 West Hargett Street) (4), Haywood Hall & Gardens (Historical Places & Services; 211 New Bern Place) (5), Cyberstation (Amusement & Theme Parks; 4325 Glenwood Avenue) (6), Gamestop Inc (Amusement & Theme Parks; 7840 Alexander Promnde Place) (7), Consultants (Amusement & Theme Parks; 5650 Six Forks Road) (8), Bingo Paradise (Amusement & Theme Parks; 2626 South Saunders Street) (9). Display/hide their approximate locations on the map, 105219=School Enrollment by Level of School (%) in 2013, 466921=Total of 9806 patent applications in 2008-2015., 60699=Hotels: Hampton Inn - Capital Blvd. North (3621 Spring Forest Road) (1), Best Western Raleigh Inn (3618 New Bern Avenue) (2), Diamond Hospitality Inc (5884 Faringdon Place) (3), Comfort Suites (1200 Hurricane Alley) (4), Hampton Inn Raleigh-Capital Blvd. N. (3621 Spring Forest Rd) (5), Days Inn Raleigh Downtown (300 North Dawson Street) (6), Crickett Inn-North Raleigh (3201 Old Wake Forest Road) (7), Candlewood Suites Raleigh Raleigh-Glenwo OD (4433 Lead Mine Road) (8), Crabtree Inn (3920 Arrow Drive) (9). Display/hide their approximate locations on the map, 77465=Ozone [ppb] level in 2012 was 25.4. This is better than average. Closest monitor was 2.4 miles away from the city center., 78170=Particulate Matter (PM10) [µg/m3] level in 2012 was 14.0. This is significantly better than average. Closest monitor was 1.5 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Raleigh city (based on Wake County data) Young at Cambel Road neighborhood Yorkshire Downs neighborhood Yorkchester at Six Forks neighborhood Yester Oaks neighborhood Yates Mill neighborhood Yarborough Park neighborhood Wyntree neighborhood Wynstone neighborhood Wynnewood Park neighborhood Wyngate neighborhood Wynford Place neighborhood Wynfield neighborhood Wyndham neighborhood Wyndfield neighborhood Wyndfall neighborhood Wyndcroft neighborhood Wynbrooke neighborhood Wyman Park neighborhood Wycombe Manor Townhomes neighborhood Wyckford neighborhood Worthington neighborhood Worthdale Forest neighborhood Worthdale neighborhood Woody Leadmine Townhomes neighborhood Woodvalley neighborhood Woodstream neighborhood Woodstone neighborhood Woodscreek at Southall neighborhood Woods of Westlake neighborhood Woods of Tiffany neighborhood Woods of Saint Albans neighborhood Woods of North Ridge neighborhood Woods of Ashbury neighborhood Woods at Harrington Grove neighborhood Woods at Greystone Village neighborhood Woodrow Park neighborhood Woodmere Hills neighborhood Woodlawn neighborhood Woodlands neighborhood Woodland Ridge neighborhood Woodhaize neighborhood Woodgreen neighborhood Woodglen neighborhood Woodcrest neighborhood Woodbury Estates neighborhood Woodbridge neighborhood Wood Valley neighborhood Wood Spring neighborhood Womble neighborhood Wolf Crossing Townhomes neighborhood Winter Park neighborhood Winston Hills neighborhood Winslow Ridge at Sunnybrook neighborhood",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 176 Wake County: 2.12 / 10,000 pop. North Carolina: 2.05 / 10,000 pop. Number of supercenters and club stores: 10 This county: 0.12 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 68 Wake County: 0.82 / 10,000 pop. North Carolina: 0.92 / 10,000 pop. Number of convenience stores (with gas): 281 Wake County: 3.39 / 10,000 pop. State: 4.75 / 10,000 pop. Number of full-service restaurants: 648 Here: 7.81 / 10,000 pop. State: 7.57 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}