{
    "relation": [
        [
            "Area",
            "Northern area:",
            "Alaska",
            "Aleutians",
            "Ellis-Gilberts-Samoa Area",
            "Marshalls",
            "Marianas",
            "Central Pacific:",
            "Peleliu; Ulithi",
            "Iwo Jima",
            "Hawaii",
            "Transport planes",
            "(Philippine Islands)",
            "Ryukyu Islands (Nansei Shoto)",
            "New Guinea-Australia Area:",
            "Eastern New Guinea",
            "Western New Guinea",
            "Australia",
            "South Pacific:",
            "Solomon Islands",
            "New Caledonia; Espiritu Santo",
            "Fiji",
            "New Zealand",
            "India-Burma Theater",
            "China:",
            "American Air Force",
            "American-Chinese Air Force",
            "India-China transport planes",
            "Fleet Air Forces",
            "Totals"
        ],
        [
            "End of July",
            "",
            "400",
            "300",
            "150",
            "200",
            "1,000",
            "",
            "250",
            "500",
            "900",
            "200",
            "3,100",
            "600",
            "",
            "300",
            "600",
            "250",
            "",
            "200",
            "300",
            "100",
            "100",
            "1,500",
            "",
            "700",
            "150",
            "400",
            "3,700",
            "16,000"
        ],
        [
            "End of August",
            "",
            "400",
            "300",
            "150",
            "200",
            "1,000",
            "",
            "250",
            "500",
            "1,200",
            "200",
            "4,100",
            "650",
            "",
            "300",
            "600",
            "250",
            "",
            "200",
            "300",
            "100",
            "100",
            "2,000",
            "",
            "800",
            "150",
            "400",
            "3,800",
            "17,850"
        ],
        [
            "End of September",
            "",
            "400",
            "300",
            "150",
            "200",
            "1,000",
            "",
            "250",
            "500",
            "1,500",
            "200",
            "5,100",
            "870",
            "",
            "300",
            "600",
            "250",
            "",
            "200",
            "300",
            "100",
            "100",
            "2,000",
            "",
            "800",
            "150",
            "400",
            "3,800",
            "19,370"
        ]
    ],
    "pageTitle": "HyperWar: USSBS: Japan's Struggle to End the War",
    "title": "",
    "url": "http://ibiblio.org/hyperwar/AAF/USSBS/JapansStruggle/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109101239,
    "recordOffset": 109043864,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27678=By December 1944 private conversations among the top ruling factions, including Kido, Konoye, Yonai, Okawa, Baron Kiiehiro Hiranuma, etc., were addressed to problems created by urgent need for peace. The Emperor on his own initiative in February 1945 had a series of interviews with the senior statesmen whose consensus was that Japan faced certain defeat and should seek peace at once., 113499=Anticipated supply and demand of rice of 1945 (estimate made 1-10 June), 7534=The \"political target\" comprised a ganglion of Army, Navy, Government, and Imperial household factions which together decided major questions of national policy. Fortunately, most of the pertinent questions relating to how Japan was brought to acceptance of the Potsdam Declaration find their answers in the simple chronology of events which can now be narrated in some detail for the period from the collapse of Tojo in July 1944, to the imperial rescript of 15 August 1945. The evidence is chiefly in the testimony obtained by Survey interrogation of the Army, Navy, Government, and Imperial household leaders who participated or were influential in the struggle within Japan over whether to continue the war or to accept surrender. The inquiry might have benefited from testimony of certain key figures who were not available to the Survey. Tojo, Koiso, Togo, and a few others impounded for trial as war criminals could not be interrogated. A few, notably General Anami, the War Minister in the Suzuki cabinet, had committed suicide. Since the Emperor's participation in the crucial events of the period preceding surrender had been revealed and corroborated by other participants, an interview with Hirohito would not have been productive. It is felt that the general picture of the course of events would not have been changed materially had these persons been available for interrogation., 169433=Higashikuni was an Imperial Prince who had been little more than a figurehead in any of his army posts. Early in 1942 he was reported to have been associated with Prince Konoye in organizing the Showa. Kenkyu Kai for the purpose of overthrowing the TOJO regime and getting a peace with the United States while Japan still had vast empire and before the United States could rearm. In December 1944, it was again reported that he was active in organizing a party to overthrow the present regime, especially if the United States were to invade Japan proper., 176322=Until General Tojo took over full power in October 1941, Baron Hiranuma was unquestionably the most powerful and influential figure in Japanese politics. As Minister-without-Portfolio in the second Konoye cabinet, he was in effect the, 75854=Shipping capacity.-- The total transport capacity for the fiscal year 1941 was 53,000,000 tons. At the outbreak of war, Japan will have ships totalling 6,100,000 tons at her disposal. The total estimated transport capacity for the fiscal year 1942 is approximately 85 percent of the 1941 total or 45,000,000 tons., 13264=To explain the dilemmas and activities of those leaders who felt in the spring of 1944 that Japan was facing certain defeat or at least that the time had come for positive steps to end the war, it is useful to restate briefly the basis on which Japan began the war in December, 1941. Japan entered the war securely in the hands of the radical military clique that originally rose to power in Manchuria and was led and symbolized by Tojo. This group had already achieved a police state and the controlling position in Japanese policy during its uneasy coalition with the conservatives in the two preceding Konoye governments. It is noteworthy that the clique took Japan to war without concrete minimum or maximum objectives nor any clear conception as to how the war could be brought to a close. The decision to attack was roughly calculated as a two-way gamble. If the European Axis defeated Soviet Russia, Japan would require chips to play on the winning side at the peace settlement with the United States and Britain that might well follow. On the other side, and independent of European events, a quick drive to the Southern Resources Area accompanied by a series of stunning and crippling defeats of the United States forces would redress Japan's relative strength and create a situation in which the United States might be willing to negotiate a peace by trading out the issues on terms favorable to Japan. Great confidence was put in the eventual superiority of Japan's fighting spirit over the potential material superiority of the United States. This calculation, whatever its other shortcomings, obviously contained at least two serious misreadings regarding the United States, first, in failing to appreciate the tenacious and passionate finality with which America would prosecute the war, and second, in underestimating the military importance of the enormously greater economic potential with which the United States would create and bring to bear a technically superior force., 50370=The terminal conference was held before the Emperor at 1000. Present were the 16 Cabinet ministers, the two chiefs of staff, Hiranuma representing the Privy Council, the chiefs of the bureaus of military and naval affairs, and the chief cabinet secretary, Sakomizu. Suzuki announced that the Emperor had called the meeting to consider the American reply in his presence, so that everyone who had an opinion should express it freely. Anami, Umezu, and Toyoda stated that the American reply was insufficient, that they favored asking again for a more concrete answer, or if that were impossible the war should be continued. All the others favored acceptance. Then the Emperor, as quoted by Sakomizu, said:, 156507=Estimate for the coming attack on the Kyushu Area in about September., 70170=7. The sequence of events just recited also defines the effect of Russia's entry into the Pacific war on 8 August 1945. Coming 2 days after the Hiroshima bomb, the move neither defeated Japan nor materially hastened the acceptance of surrender nor changed the votes of the Supreme War Direction Council. Negotiation for Russia to intercede began the forepart of May 1945 in both Tokyo and Moscow. Konoye, the intended emissary to the Soviets, stated to the Survey that while ostensibly he was to negotiate, he received direct and secret instructions from the Emperor to secure peace at any price, notwithstanding its severity. Sakomizu, the chief cabinet secretary, alleged that while awaiting the Russian answer on mediation, Suzuki and Togo decided that were it negative direct overtures would be made to the United States. Efforts toward peace through the Russians forestalled by the imminent departure of Stalin and Molotov for Potsdam, were answered by the Red Army's advance into Manchuria. The Kwantung army, already weakened by diversion of its units and logistics to bolster island defenses in the South and written off for the defense of Japan proper, faced inescapable defeat., 175052=After World War I, Baron Hiranuma lent his support to various patriotic societies, the purpose of which was to combat Leftist tendencies among the students. Together with the leaders of these societies he formed a group to carry on nationalistic propaganda beyond the university. This group formed the basis for the Kokuhonsha. As CHairman of the House of Peers in 1924 and Vice President of the Privy Council in 1926, under his guidance this institution restrained even the insignificant attempts of the Kato and Wakatsuki cabinets to introduce reforms. Finally in the conflict arising with the Wakatsuki cabinet over the question of granting aid to the Bankrupt Bank of Taiwan, Hiranuma secured the fall of the Wakatski cabinet and the assumption of the premiership by the leader of the most reactionary wing of the Japanese bourgeoise, Gen. Giichi Tanaka. When he became Premier in 1939 his extreme reactionary views toned down.The attempts on his life in 1941 were instigated by Nakano, Seigo, of the Tokokai, in collaboration with certain members of the German Embassy. He was reported opposed to the war with the United States. Five members of his cabinet were in Koiso's cabinet. Koiso's Justice Minister Matsuzaka, Hiromasa, wa a protege of Hiranuma., 23040=Nor is it possible to exaggerate the central importance of this committee, for certainly from early May of 1945 until the August surrender the enemy's principal problem was to give expression to its political decision to end the war. During that period the military and economic and morale effects of our operations were significant chiefly as they bore directly upon the top political decision already made and the struggle between those political leaders who had already determined to find a way out of the war and the militarists who were determined to continue it. Cumulative difficulties and defeats bred further determination among the peace seekers who increasingly opposed the intransigency of the militarists., 21248=Among the first moves of the new Koiso government was the creation of the Supreme War Direction Council. On 5 August, 1944, 3 weeks after the fall of Tojo, this new Inner Cabinet was formed. Announced purpose of the Council was \"to formulate a fundamental policy for directing the war and to adjust the harmonization of the combined strategy for politics and war\". It comprised six regular members--the Premier, Foreign Minister, Army Minister, Navy Minister, Army Chief of Staff, and Navy Chief of Staff--who could, however, bring in any other Cabinet minister as a regular member when necessary. In addition, the two deputy chiefs of staff attended meetings but did not vote, and the Council had a secretariat. The group was formed originally as a liaison between the military and the Cabinet, but its composition and dominant role made it in practice an inner war cabinet concerned with the highest policies and plans such as measures to maintain fighting strength, central economic decisions, whether to continue the war, etc. The agenda originated within the Council itself. Its decisions had to be ratified by the full cabinet before becoming final. It also bad direct access to the Emperor and the Emperor could himself initiate meetings with the Council. The Council, like the Cabinet, did not work on majority votes, but on general agreement or \"unity\". Important issues on which unity was lacking were presented to the Emperor usually in the form of alternatives for his choice. To one acquainted with the Japanese talent for divided authority and controls, piecemeal responsibility and decisions, and considering the past failures to cope administratively with the necessities of total war, the Council may be taken as an outstanding accomplishment., 20464=At this time, in the late summer of 1944, intensive air assault on the home islands had not yet begun. But output of a number of essential items had already passed the peak, shipping losses had reduced imports of essential materials below the needs of the existing industrial plant capacity. Japan faced a declining output of such war necessities as aircraft, oil, transport, steel, and coal. Although public confidence in the war remained high, morale of the leaders and \"intelligentsia\" was falling, principally as knowledge of previous defeats and difficulties became more, 136402=2. Of ships and vessels badly damaged in the operation for the defense of Okinawa, about half were made operational during the period from February to March, while the other half were rendered operational from March to April., 69237=(c) Consideration of the Potsdam terms within the Supreme War Direction Council revealed the same three-to-three cleavage which first appeared at the Imperial conference on 20 June. On the morning of 9 August Premier Suzuki and Hirohito decided at once to accept the Potsdam terms; meetings and moves thereafter were designed to legalize the decision and prepare the Imperial rescript. At the conclusive Imperial conference, on the night of 9-10 August, the Supreme War Direction Council still split three-to-three. It was necessary for the Emperor finally to repeat his desire for acceptance of the Potsdam terms., 57296=1. Blockade of Japan's sea communications exploited the basic vulnerability of an island enemy which, with inherently second-power resources, was struggling to enlarge its capabilities by milking the raw materials of a rich conquered area. Acute dependence upon imports of such basic items as oil, iron ore, coal, bauxite, food, etc., caused Japan's shipping position even in the fall of 1941 to appear deficient to several members of the Jushin, whose opinions were declared to Tojo before the Pearl Harbor attack. These fears were, 219305=Sato favored friendly relations with Russia, was considered liberal and an internationalist and was reported to have stated in 1942 that the war between Japan and the United States was a regrettable mistake, but \"we cannot stop now.\", 24813=Early in September 1944, Yonai, who had become Vice Premier and Navy Minister under Koiso, directed Takagi to resume his secret studies of steps to get out of the war. Working with Yonai and the Navy Vice Minister, Vice Adm. Seibi Inouye, Takagi considered such questions as (1) how to get Army agreement to end the war; (2) issues involved in possible Allied terms such as demands on Japan after the war, reparations, protection of the \"national polity\"; (3) the problem of public opinion and morale in the event of peace; (4) how to reach the Emperor and work through him to accomplish their purpose. As these studies progressed, private briefing sessions were held with Prince Fumimaro Konoye, Kido, Marquis Tsuneo Matsudaira, the Imperial Household Minister, Okada, and a number of others. Sometime later Admiral Koshiro Oikawa, the chief of naval staff, and Admiral Jisaburo Ozawa, the deputy chief of naval staff, were informed of these maneuvers. Contacts were also established with Army people. Takagi testified that quite a number of them were convinced and some, in fact, brought pressure upon the Army minister. This served, however, only to stiffen the Army's attitude against all peace moves and many on the Army side recanted for reasons of discipline and personal safety., 44462=Suzuki, Yonai, and Togo favored the first opinion, whereas Anami, Umezu, and Toyoda supported the second. When this three-to-three split could not be resolved, the full. Cabinet was called in, and after an explanation by Togo, nine voted for unconditional acceptance, three voted for the conditional acceptance and three others favored intermediate positions. After a session lasting until 2000 without achieving unity, the cabinet declared an intermission. In this impasse Suzuki decided to request an Imperial conference for the Inner Cabinet at which the conflicting views could be presented and the Emperor's own decision sought. At 2330 on the 9th the conference was held, with chief cabinet secretary Sakomizu and Hiranuma, the Privy Council president, also attending. The Potsdam Declaration was first read to the Emperor, then Togo expressed his opinion, followed by all of the others who stated their views. Around 0300 on the 10th Suzuki announced (as paraphrased by Sakomizu's testimony):, 237398=In December 1936, upon his retirement as Grand Chamberlain, he was given the title \"Baron.\" He continued to serve on the Privy Council although he remained in virtual retirement. In June 1940, he was named Vice President of the Privy Council and in 1944 became President., 28877=In this desperate situation, and since important elements both within the government and among the leaders outside were favoring and initiating peace moves, it is legitimate to ask why the Koiso cabinet did not end the war in the fall of 1944. Members of Japan's original war-making coalition, though no longer in full control, still had great strength within the top Army command, the middle ranks of both services, and the bureaucracy of the Government. They constituted a distinct threat of revolt or a coup in the estimate of the civilian and Imperial household leaders. Certain general and psychological factors also determined the further conduct of the war and the central decision by the Koiso regime: (1) It is clear that the Japanese leaders entered the war deeply convinced that they were fighting for their very national existence and life, whereas the United States they believed was merely pressing for economic advantages and a set of principles, but not for vital security. (2) Japan had no specific plan other than negotiation for ending the war she began. A predilection for negotiation--demonstrated in terminating the Russo-Japanese war, efforts to enlist the United States in bringing the China Incident to a close, etc.--maintained a hope that Japan could trade it out with the Allies. (3) The Casablanca statement and the Cairo Declaration setting forth Allied terms for unconditional surrender were still considered by Japan's leaders to be just declarations, not actual final terms to be imposed. (4) The desire to save face, to preserve the Tenno system, and fear of the military and the police at this period helped the factions favoring continued resistance. (5) The information policy of minimizing United States successes and capabilities, while distorting their own losses and exaggerating their ability to con- duct effective operations, had left the people ignorant of the fact of Japan's actual military situation at this time. Some Government factions feared internal chaos, \"communistic revolts and disorganization\" if the true situation became known., 31479=The Okinawa landings on 1 April were quickly followed by Koiso's fall on 8 April and the designation of Admiral Baron Kantaro Suzuki as Premier., 28076=Discussed at least, during March 1945, was the plan to initiate peace steps through the mediation of China. Prince Naruhiko Higashikuni was the chief advocate of this scheme, and it received some consideration and support among the Jushin and at the foreign office. Choice of China as Allied negotiator was based in part on the ingenuous notion that since \"she was a neighbor and fellow member of the co-prosperity sphere\", her mediation would be more suitable than direct approaches to the United States. Terms were to be based on Japan returning to her pre-1931 boundaries. There is no clear evidence available to the Survey as to how far the plan was carried, but what is significant here is that at least by March 1945, a specific peace overture was under cabinet discussion., 251482=Able and forceful, extremely nationalistic and anti-foreign. He is noted for his work as Commander in Chief of Tsingtao landing, and as leader of Kwangcho-wan landing, 1937-38., 38923=On 8 June the six regular members of the Council conferred with the Emperor. The statement was read by the Emperor who made no comment at this meeting. Each of the others expressed his own official opinion, but none as yet expressed his real feelings. On 20 June the Emperor on his own initiative called the six council members to a conference and stated that it was necessary to have a plan to close the war at once, as well as a plan to defend the home islands. He asked what the council thought of that idea. The Prime Minister, the Foreign Minister and the Navy Minister stated that they fully concurred with the Imperial view and that such steps were then being taken to that end. Then the Emperor in turn asked when the ministers expected they would be able to send a special ambassador to Moscow. The reply was that it was uncertain but they hoped he could be sent before the Potsdam conference. Sakomizu testified that after this expression from the Emperor, Suzuki decided he could stop the war; when he returned from the conference he told Sakomizu \"Today the Emperor said what everyone has wanted to say but yet was afraid to say.\", 59500=2. While the blockade was definitive in strangling Japan's war mobilization and production, it cannot be considered separately from the pressure of our concurrent military operations, with which it formed a shears that scissored Japan's military potential into an ineffectual remnant. In the early engagements that stemmed the Japanese advance and in the subsequent battle for bases, the application of our air power against vital forces which Japan committed piecemeal in defense of these perimeter positions enabled us largely to destroy her navy and reduce her air forces to impotence before the home islands could be brought under direct air attack. Throughout these operations we were employing air power effectively and potently in ways the. Japanese leaders understood and feared, and had no adequate defense to withstand. Although a core of bitter-end resistance lay in Japan's army and navy until the Imperial rescript was signed, it should be noted that Tojo's collapse and the introduction of peace-making factions into the succeeding Koiso government quickly followed the loss of Saipan in July 1944. Also, after the costly and vitiating defeats in the Palaus, Philippines, and at Iwo Jima, Koiso was in turn succeeded shortly after our Okinawa landings of I April 1945 by the Suzuki cabinet, which was formed with the specific mandate to terminate the war. In these campaigns, dictated by our need for air mastery arid won by immediate air control, while Japan's loss of effective naval and land-based air forces was over- whelming, her military attrition was not complete, since our operations used up by no means all of her ground and Kamikaze forces. Japan's principal land armies were in fact never defeated, a consideration which also supported the military's continued last-ditch resistance to the surrender decision. It nevertheless appears that after the loss of the Marianas in July-August 1944, the military commands, though unconvinced of final victory, viewed defense against our subsequent operations as affording an opportunity for only a limited success, a tactical victory which might, so they hoped, have created a purchase from which to try for a negotiated peace under terms more favorable than unconditional surrender., 42515=On 6 August in the midst of these discussions an atomic bomb was dropped on Hiroshima. Early reports to Tokyo described very great damage, but the military did not think it was an atomic bomb until President Truman's announcement and a mission of Japanese scientists sent to Hiroshima confirmed it. On the morning of 7 August Suzuki and Togo conferred and then reported the news to the Emperor, stating that this was the time to accept the Potsdam Declaration. The military side still however could not make up their minds to accept it., 127325=One cruiser, 1 destroyer, and several submarines moved to England from Holland and under construction may be added to strength in Far East by mid-1942., 18131=All this was not only educational as to Japan's true condition, but indirectly helped to build up political pressure for the fall of Tojo. Among important examples of the way this pressure worked were: (1) Tojo had to reconstruct his cabinet just before the Marianas campaign (Saipan was invaded on 15 June 1944), when Shinsuka Kishi, the Commerce and Agriculture Minister, and Mamoru Shigemitsu, the Foreign Minister, threatened to withdraw; (2) Yonai, supported by the Jushin, refused Tojo's request that he join the cabinet as minister-without-portfolio; and (3) the resignation of Shigetaro Shimada, the Navy Minister, which helped to force out Tojo 3 days afterward, had been actively assisted by the senior statesmen., 100032=Mobilization and distribution of manpower.--Workers available for various industries in December 1944 (between the ages of 16 to 60):, 1143=On 15 August 1945, President Truman requested that the Survey conduct a similar study of the effects of all types of air attack in the war against Japan. The officers of the Survey in Japan, who are all civilians were:, 114997=Main Strength of the Imperial Navy in December 1941, 65458=5. So long as Germany remained in the war that fact contributed to the core of Japanese resistance. Slight evidence exists that some hope was held for a long-promised German miracle weapon. A telegram received on 6 May in the German embassy at Tokyo revealed that Hitler was dead, the promised new weapon had failed to materialize and that Germany would surrender within a matter of hours. Kido believed, presumably on Japanese Army representations, that the Army would not countenance peace moves so long as Germany continued to fight. It is not clear whether this was a face-saving position, designed to avoid a prior Japanese surrender. In any case on 9 May 1945, immediately after the Nazi capitulation, General Anami, the War Minister, asked the Cabinet for an Imperial conference to reconsider the war situation. The significant fact, however, is that Japan was pursuing peace before the Nazis collapsed, and the impoverishment and fragmentation of the German people had already afforded a portent of similar consequences for an intransigent Japan., 61763=3. Fear of home island bombing was persuasive to the political leaders even before its direct effects could be felt. News of the B-29 and its intended, capabilities reached Japan in 1943. B-29 raids on Kyushu and southern Honshu targets began from China bases on 15 June 1944. With the loss of Saipan in early July 1944, many leaders became wholly convinced of Japan's eventual defeat, one factor being that from Marianas bases the homeland would be brought under the kind of intensive, shattering air assault even then being administered to their German partner. The timing of the strategic bombing attack affected its role in the surrender decision. After the Marianas were lost but before the first attacks were flown in November 1944, Tojo had been unseated and peacemakers introduced into the Government as prominent elements. The war economy had already passed its peak, fleet and air forces had been critically weakened, confidence of the \"intelligentsia\" in the Government and the military had been deflated, and confidence of the people in eventual victory was weakening. By mid-1944 shortages of food and civilian supplies were reflected in reduced living standards. Therefore the actual physical destruction wrought by strategic bombing assumed the role of an accelerator, to assist and, 100971=1940, 12.7; 1941, 15.2; 1942, 14.2; 1943, 13.8; 1944, figures unknown; it is estimated that since birth rate decreased and infant mortality increased, the figure is lower than that of the previous year., 17694=Hisatsune Sakomizu is another early example of a connecting link between the unpleasant facts of the war and the senior statesmen outside the Government. As a member of the Cabinet Planning Board in 1943-44, he had given information as to the unfavorable war situation to his father-in-law, Admiral Keisuka Okada, who retailed it to Kido among others. Okada also had word sent to Tojo that it would be best for him to resign., 72055=Based on a detailed investigation of all the facts and supported by the testimony of the surviving Japanese leaders involved, it is the Survey's opinion that certainly prior to 31 December 1945, and in all probability prior to 1 November 1945, Japan would have surrendered even if the atomic bombs had not been dropped, even if Russia had not entered the war, and even if no invasion had been planned or contemplated., 68619=(b) A series of conferences of the Supreme War Direction Council before Hirohito on the subject of continuing or terminating the war began on 8 June and continued through 14 August. At the 8 June meeting the war situation was reviewed. On 20 June the Emperor, supported by the Premier, Foreign Minister, and Navy Minister, declared for peace; the Army Minister and the two chiefs of staff did not concur. On 10 July the Emperor again urged haste in the moves to mediate through Russia, but Potsdam intervened. While the Government still awaited a Russian answer, the Hiroshima bomb was dropped on 6 August., 259392=YONAI is believed to have been responsible for making Hayashi dissolve the Cabinet on 31 May 1937. Grew [U.S. Ambassador to Japan], in Ten Years in Japan, tells how Yonai assured Dooman on 19 April 1`939 that Japan would not join the Axis and would cooperate with the Allies. Fleisher, in Volatile Isle, states that a reactionary plot attempted to assassinate Yonai and Imperial Household Minister Tsuneo Matsudaira, but was foiled by police with the arrest of 38 members of the troops. Reactionaries considered Yonai anti-Axis and against the New Structure. Col. Kingoro Hashimoto was believed to have been one leader behind the plot, but police failed to arrest him. Yonai's cabinet fell when War Minister Hata presented Army demands for strengthening the Nation internally and reorienting foreign policy. Yonai refused and Hata resigned as War Minister. The Army would not name a successor and the Yonai cabinet fell., 176959=Ideologically, Baron Hiranuma was an arch-fundamentalist. He did more than any other single individual to popularize nationalistic Shinto and the politico-religious concept of Kodo, or the Imperial way. His fundamentalism, however, did not keep pace with the more extreme forms of nationalism and reaction which developed under the guidance of the Tojo clique, and by 1941 Hiranuma found himself on the defensive. He was particularly concerned that the new totalitarian principles expressed by the Tojo group would tend toward a dictatorship in which the theoretically omnipotent position of the Emperor would be jeopardized. Hiranuma also strongly opposed the conclusion of the Axis alliance, partly out of fear that too close association with Germany would further encourage such totalitarian developments in Japan., 100817=Rate of population increase per 1,000.--After 1940, there is a yearly increase of approximately 1,000,000:, 33245=Almost immediately, Suzuki ordered his chief cabinet secretary, Sakomizu, to make a study of Japan's fighting capabilities and whether they were sufficient to continue the war. Sakomizu concluded in. May that Japan could not continue the war, basing his estimate on Japanese studies as to the inability to produce aircraft, losses and damage to shipping, the precarious food situation and the antiwar sentiments of the people. (A copy of this estimate came into Survey hands from Yonai in November 1945, and is appended in translation as \"Survey of National Resources as of 1-10 June 1945.\") Suzuki, who agreed with the estimate, presented it to the Emperor. Con- currently he asked ex-Premier Koki Hirota to sound out the Russian ambassador to Tokyo, Yakov A. Malik, privately as to the Russian attitude toward interceding with America., 195263=Strongly pro-Axis and anti-Russian. At the time of his appointment as overseas minister in 1939, his outspoken and positive views were expected to bring an immediate strengthening of Japan's continental policy. An intimation of his character may be obtained from his nickname \"the Tiger of Korea\" and the fact that he had claimed to be a staunch believer that all problems could be solved by the \"Imperial Way\". He was one of the most out-spoken of the politically minded in the Army; was closely associated with the single party movement; and had worked in the Kokuhonsha with Baron Hiranuma. Lieutenant General Kimura, Haruo, stated that Koiso gave the order to invade French Indochina. He was alleged also to have been a member of the Black Dragon Society. He was a member of the Japanese Imperial Headquarters while he was Premier in order to have status equal to that of the Army and Navy Chiefs of Staff, an unprecedented action sanctioned by Hirohito. Other evidence indicates that there was considerable personal friction between Koiso and Tojo., 236133=Quiet, amiable, energetic, and clever. A good administrator, very popular with subordinates. An authority on strategy and torpedo tactics. He has had duty in England and Germany; speaks good English and a little German. Upon his retirement in 1929, he became Grand Chamberlain and member of the Privy Council. In these two posts he became advisor to the Emperor. Later in 1929 he opposed the Tanaka Cabinet's efforts to saddle the Commander in Chief of the Kwantung Army with the entire responsibility for the mysterious death of Marshal Chang Tso-lin, the Manchurian war lord. Suzuki and other advisor of the Emperor insisted that the War Minister should also share the responsibility. This issue was partly responsible for the fall of the Tanaka Cabinet. In 1930, Suzuki was also responsible for securing the ratification of the London Naval Treaty against the strong opposition of the Naval General Staff, the Supreme War Council, and high military and naval leaders generally. These acts in opposition to the more militaristic policies of the armed services earned Suzuki the hatred of the rising young officer faction. In the military uprising of 26 February 1936, he was on the assassination list, and was severely wounded by three revolver shots., 41893=On 26 July the Potsdam Declaration was issued. In their deliberations on that statement, which began immediately, no member of the Inner Cabinet had any objections to ending the war. Suzuki, Togo, and Yonai felt that the declaration must be accepted as the final terms of peace at once, whether they liked it or not. The War Minister and the two chiefs of staff on the other hand felt that the terms were \"too dishonorable\". Discussion centered around first the future position of the Emperor, second the disposition of war criminals, and third the future form of Japan's \"national polity\"., 69863=(d) Indubitably the Hiroshima bomb and the rumor derived from interrogation of an American prisoner (B-29 pilot) who stated that an atom bomb attack on Tokyo was scheduled for 12 August introduced urgency in the minds of the Government and magnified the pressure behind its moves to end the war., 16211=Rear Adm. Soichi Takagi, who was attached to the ministerial secretariat of the Naval General Staff, made a study between 20 September 1943 and February 1944, of the war's battle lesson up to that time. He conclude that Japan could not win and verbally presented his findings in March 1944 to Admiral Mitsumasa Yonai and Vice Adm. Seibi Inouye. Takagi's study, interestingly enough, was undertaken at the end of the second year of the war--the time beyond which, the Japanese Navy's top command had estimated before hostilities, Japan could not fight a successful war. Takagi's estimate was based on an analysis of fleet, air, and merchant ship losses suffered to date, the serious difficulties in acquiring essential imported materials, the internal confusion in Japan, and a growing feeling among the \"intelligentsia\" that Tojo should be let out. It seemed clear to Takagi that potential long-range air at- tacks on the home islands and Japan's inability to import essential materials for production had created a situation which dictated that Japan should seek a compromise peace. In Takagi's view Japan at this time should have envisaged withdrawing from China and giving up both Korea and Formosa as part of the peace terms. His study in any case documented the fears Yonai and others held before the war and lent support to the increasing but still carefully guarded concern of their fellow Jushin that all was not well with Tojo's prosecution of the war., 201170=In 1942, he was active in the organization and work of Showa Kenyu Kai, an anti-Tojo organization, and in late 1944 he was reported to be one of a group secretly planning the overthrow of the present regime in favor of a new government headed by Prince Higashikuni, Naruhiko, should Japan proper be invaded by the United States. This move included the possibility of asking the United States for peace terms., 47616=Immediately thereafter the full Cabinet resumed its meeting and ratified unanimously a decision to accept the Potsdam terms provided they did not alter the Emperor's prerogatives. This was cabled to the United States through the Swiss around 0700 the 10th. The United States reply was received from the San Francisco broadcast about 0400 on the 12th and officially about 0700 the 13th. The broadcast reply was immediately studied by the Inner Cabinet and the official documents put before the full Cabinet meeting around 1300 on the 13th. Acceptance was favored by 13 ministers, but 3 were opposed. Early in the evening the Cabinet recessed. Toyoda, the Navy Chief of Staff, stated the objections as follows:, 181238=A liberal, broad-minded, and able diplomat. It is believed that the Army was behind his appointment in replacing Uchida in 1933 in order to avert hostilities with Russia. Hirota was a protégé of Tokama, Mitsuru; was also presiding officer at direction meeting of the Black Dragon Society. Stated that the war with the United States had best begin in December or February of 1941., 101684=The question of whether or not we can maintain communication with the continent will greatly depend upon the results of the Okinawa campaign. If the campaign turns to our disadvantage, we cannot hope to maintain planned communication after June. For the same reason, the cargo-, 74258=Amount stored as of 1 October 1941: 9,050,000 kiloliters., 35172=Thus during the forepart of May two separate but interrelated topics were before the Inner Cabinet, one dealing with Japan's inability to continue the war, the other initiating talks with Russia for intercession. Shortly after the end of the European war, 8 May, the War Minister. General Korechika Anami, asked the Cabinet for an Imperial conference to decide the \"fundamental principle of the war,\" that is whether to continue it. This action, while not indicating that the army was ready to quit (on the contrary the war minister and army chief of staff urged continuance of hostilities), did confirm Kido's belief that the Army would permit open consideration of the question within the Cabinet only after Germany's collapse. Perhaps even more important it was an affirmative test of the wisdom in selecting Anami as War Minister. For even though he held out to the last against unconditional surrender (Anami committed suicide on 15 August), at no time did he obstruct the positive peace steps which were being taken by Suzuki and the others, although by resigning he might have forced the Suzuki government out of office. This negative support of the peace moves by, 34104=Early in May (prior to the 18th according to a statement of Navy Chief of Staff, Admiral Soemu Toyoda) the Supreme War Direction Council began to discuss ways and means of ending the war. Concurrently other meetings of the Council were going on with the view of obtaining Russia's services at an opportune time. Foreign Minister Togo was leader of this. While Hirota was talking with Malik, Ambassador Sato had been instructed in Moscow to prepare the way for a Japanese emissary to discuss improvement of Soviet-Japanese relations and Russia's intercession to end the war. Specific terms for ending the war apparently did not come up at this time, but the Council was prepared that whatever the result they \"would be worse than prewar conditions\". The Potsdam Declaration had not been issued, but it was felt that the Cairo Declaration terms would not actually be applied; it was looked upon as a declaration only, whose terms could be reduced by negotiating and by being in a position to exact \"heavy sacrifices\" if the war continued., 1679=The Survey's complement provided for 300 civilians, 350 officers, and 500 enlisted men. The military segment of the organization was drawn from the Army to the extent of 60 percent, and from the Navy to the extent of 40 percent. Both the Army and the Navy gave the Survey all possible assistance in furnishing men, supplies, transport and information. The Survey operated from headquarters established in Tokyo early in September 1945, with subheadquarters in Nagoya, Osaka, Hiroshima, and Nagasaki, and with mobile teams operating in other parts of Japan, the islands of the Pacific, and the Asiatic mainland., 15267=The risks involved were understood and asserted by some leaders in the debates which preceded Pearl Harbor. Their original concern gave them a basis for recognizing as early as spring, 1944, that Japan was facing ultimate defeat. By that time United States determination to fight and her ability to mount successful thrusts in the Pacific even before opening the second European front, had already been demonstrated for all who knew the true situation to see. The political problem of those who saw the situation was to discover and circulate among other leaders in retirement or outside the government a true picture of the war, and then to unseat the Tojo government in favor of one which would bring the, 40087=After that the Government redoubled its talks with Russia and decided to send Prince Konoye to Moscow if he were persona grata. On 10 July the Emperor called Foreign Minister Shigenori Togo and said, \"As it is now early July should not our special ambassador be dispatched to Moscow without delay?\" Since Soviet Ambassador Malik was ill in Tokyo and the conversations there were not progressing, Sato was again instructed to put the matter directly to the Vice Commissar for Foreign Affairs in Moscow. Russia asked for more details concerning the mission and Sato was directed to explain the mission as follows: (1) to make an improvement in relations between Russia and Japan (in view of Russia's denunciation of the neutrality pact), and (2) to ask Russia to intercede with the United States in order to stop the war. The Soviets replied on 13 July that since Stalin and Molotov were just leaving for Potsdam no answer could be given until their return to Moscow. On 12 July meanwhile the Emperor had called in Konoye and secretly instructed him to accept any terms he could get and to wire these terms direct to the Emperor. Konoye also testified that when Sato was sounding out the Russians he reported the Russians would not consider a peace role unless the terms were unconditional surrender, and that this reply had a great influence on the Emperor., 43063=These differences continued to be examined and hope of favorable word from Russia had been all but abandoned when very early in the morning of 9 August the news arrived that Russia had declared war. Although considerable pessimism had prevailed regarding the outcome of the negotiations, the Government was not prepared for war with the Soviets, nor the military capable of any effective counter-plan. Suzuki calculated that he had a choice of resigning or taking immediate positive action, which could be either declaring war on Russia and continuing until the whole Nation was destroyed or accepting the Potsdam Declaration. He conferred with the Emperor around 0700 and after a couple of hours decided to accept the Potsdam terms, with which decision the Emperor agreed. A meeting of the six regular members of the Supreme War Direction Council was called for .1000. After two gloomy hours it remained deadlocked as before on the two opposing opinions: (1) To accept the Potsdam Declaration outright, with the understanding that it did not alter the Emperor's legal position; (2) to accept the declaration with the following conditions: (a) that the Allied forces would not occupy the homeland; (b) that the Japanese military and naval forces abroad would be withdrawn, disarmed and demobilized by Japan itself; (c) that all war crimes should be prosecuted by the Japanese Government., 55222=One further point should be developed and stressed here. The political objective which existed in Japan lay exposed and vulnerable to attack, which fact goes far toward explaining the true basis for unconditional surrender without invasion of the home islands. That vulnerability to air attack derived in part from the basic character of the war in its decisive phases. It turned out to be essentially a war to win air control over the Japanese homeland. This concept was not, merely central to much of the strategy guiding our operations, but was thoroughly understood and feared by an effective sector of Japanese leaders who sought and achieved political power to terminate the war. By the summer and fall of 1944, and throughout the remainder of the war, the validity of their fear was being persuasively demonstrated by the application of our air power in its several roles. Loss of fleet and air forces, without which, as the leaders knew, no effective defense could be mounted, was almost entirely the result of our air superiority. Vital perimeter bases were lost when our air forces neutralized them, sealed off both the air and sea reinforcement, and gave direct local support to our occupying operations. Japan's limited war production, already starved for materials through shipping lost to our submarines, was further depleted by air interdiction of sea communications as new bases eventually permitted almost complete blockade day and night. Heavy bomber and carrier raids against cities, military and industrial installations, further depleted her remaining resources, productivity and transport, lowered morale, and brought the true war situation home to the Japanese people. Thus the Japanese leaders lost both power and hope of resistance as our air weapons exploited air control over the home islands., 136636=3. New aircraft carriers became operational as follows: Antietam, end of June, Tarawa, end of July, and Boxer, end of August. The Saratoga and Ranger used in training, are not included., 37613=From June until the close of the war, the narrative of political events in Japan is clear and rather detailed from the testimony of Yonai, Toyoda, Suzuki, Umezu, and Sakomizu, corroborated by Kido, Konoye, Hiranuma, and others. After Anami's request for an Imperial conference Sakomizu prepared a statement for that occasion which opened by saying that the war should be \"accomplished\", and the Emperor's reign and the homeland kept intact. This was followed by the details of Sakomizu's estimate prepared shortly after Suzuki assumed office. On 6 June the six regular members of the Council discussed what steps should be taken to prosecute the war. Also at the meeting were the chief cabinet secretary, the chief of the Navy's military affairs bureau, the chief of the Army bureau of military affairs, the head of the Cabinet Research Bureau and the Minister of Agriculture and Commerce. The conclusion was that unless some radical measure could be adopted to arouse the people, the Nation's war power was bound to decline very rapidly. At this session, as Toyoda explained,, 157839=Early in February 1945 the Emperor initiated a number of private interviews with the elder statesmen and his intimates to solicit their views on Japan's war situation and advice concerning the immediate future of the Empire. On 14 February 1945 Prince Konoye had such an interview with the Emperor. In advance of that, Prince Konoye prepared a memorandum of his views which were verbally presented to the Emperor. An English translation of the memorandum, prepared by T. Ushiba, Konoye's long-time private secretary, is reproduced below. Copies of the translation and the original memorandum were given to the Survey at Karuizawa on 30 November 1945., 212329=Okada was reported in December 1944 to be one of a group secretly organizing a party to overthrow the regime, set up a new government headed by Prince Higashikuni, and ask the United States for peace terms. Hisatsune Sakomizu married Okada's second daughter, Manki. In April 1945 Sakomizu became chief cabinet secretary in the SUZUKI cabinet. As a retired premier, or Jushin, Okada wielded considerable political influence. Today he is unquestionably one of the Emperor's closest personal advisers., 67696=(a) The mission of the Suzuki government, appointed 7 April 1945, was to make peace. An appearance of negotiating for terms less onerous than unconditional surrender was maintained in order to contain the military and bureaucratic elements still determined on a final Bushido defense, and perhaps even more importantly to obtain freedom to create peace with a minimum of personal danger and internal obstruction. It seems clear however that in extremis the peacemakers, 66524=6. The Hiroshima and Nagasaki atomic bombs did not defeat Japan, nor by the testimony of the enemy leaders who ended the war did they persuade Japan to accept unconditional surrender. The Emperor, the Lord Privy Seal, the Prime Minister, the Foreign Minister, and the Navy Minister had decided as early as May of 1945 that the war should be ended even if it meant acceptance of defeat on allied terms. The War Minister and the two chiefs of staff opposed unconditional surrender. The impact of the Hiroshima attack was to bring further urgency and lubrication to the machinery of achieving peace, primarily by contributing to a situation which permitted the Prime Minister to bring the Emperor overtly and directly into a position where his decision for immediate acceptance of the Potsdam Declaration could be used to override the remaining objectors. Thus, although the atomic bombs changed no votes of the Supreme War Direction Council concerning the Potsdam terms, they did foreshorten the war and expedite the peace.Events and testimony which support these conclusions are blue-printed from the chronology established in the first sections of this report:, 149852=Since May, 2 divisions per month have been sent from the United States to participate in operations against Japan.}",
    "lastModified": "Wed, 28 Feb 2007 16:41:33 GMT",
    "textBeforeTable": "Air Forces (1945): --19-- 254/331 244/324 Destroyers 36/64 35/64 Cruisers 24/24 23/23 Battleships 74/89 70/85 Escort carriers 1. This table is based on figures published in the United States at the end of April, modified by the results achieved by the operation for defense of Okinawa. (The last figure represents total, the first represents the number assigned to operations against Japan.) 2. Of ships and vessels badly damaged in the operation for the defense of Okinawa, about half were made operational during the period from February to March, while the other half were rendered operational from March to April. 3. New aircraft carriers became operational as follows: Antietam, end of June, Tarawa, end of July, and Boxer, end of August. The Saratoga and Ranger used in training, are not included. 4. Escort carriers transferred to England and those lost prior to the Okinawa operation are included in figures for total escort carriers. 26/28 25/28 Aircraft carriers Notes End of August End of July Type of ship Main Naval Forces (1945): Estimated American Military Resources Near the End of the War",
    "textAfterTable": "NOTE.--It is anticipated that some of the forces now in the European Theater of Occupation will make their appearance in these theaters starting about the end of July. Supplementary Table (on Planes (1945)) Area End of July End of August End of September Marianas (Islands) area B-29s 850 No change. No change. Others   Total 1,000 Iwo Jima B-29s 50 No change. Not known whether B-29s are being replaced with B29s [sic]. No change. B-24s 150 P-51s 250 P-61s 30 Others 10 Total 500 Ryukyu Islands (Nansei Shoto) P-47s, P-51s, and P-61s 300 P-47s, P-51s, and P-61s 300 P-47s, P-51s, and P-61s 400 Carrier planes 100 Carrier planes 100 Carrier planes 100 B-24's 150 B-24s 200 B-24s 300 PVs 30 PVs 30 PVs 30 PBYs 40 PBYs 40 PBYs 40 Total 600 [sic] Total 650 [sic] Total 870 Philippines area Fighters 1,500 Fighters 2,000 Fighters",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}