{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Adventist University is very safe. There is always adequate security for all students.",
            "Adventist University is great for students that are willing to work hard and can be independent in studying.",
            "The University is nestled in a very unique are in Orlando which is partially surrounded by a lake with the most wonderful and peaceful view.",
            "The University always has very interesting activities to offer to the students.",
            "Listen to your academic advisors because they know how to direct you. Seek to make friends with students that are really interested in learning. Make very good use of all the resources that the school has to offer.",
            "I rate Adventist University at one of the top Universities in Florida. The faculty and staff is very helpful in helping students to choose the right study field. The classroom size is small enough for everyone and the Professors are very knowledgeable about the field in which they are teaching."
        ]
    ],
    "pageTitle": "Adventist University of Health Sciences (ADU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Adventist-University-of-Health-Sciences/reviews?_escaped_fragment_=/show/128983",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893422619,
    "recordOffset": 893392531,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94109=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/21/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 26 Nikita from Maitland, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Login to rate or flag the reviews Anonymous 12/31/2011 Reviewer is A past student here. 3 out of 4 people found this review useful. 2 of 26 Categories Comments Great for these types of students Self learning, Self taught learners Tips for prospective students If you are Seven Day Adventist then you might like this school, but if you are used to going to a public school all of your life then you might not like this school. Bang for the buck They are too expensive...$300 per credit hour. $900 for 1 class. Did enjoy being here I did not enjoy being there. My expectations about the school changed once I start attending there. Because they are a christian institution and one of there core principle is Nurture I expected a lot more from the college considering the fact that it is so expensive. I am not a hater just speaking the truth. I did",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}