{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Best time of my life...",
            "Deaf ones.",
            "Take walk in roads of DC.",
            "Expect the culture shock itself. Embrace the DC...",
            "This place is very deaf friendly. Well progressing academic after protest. Rapidly gain more attention for more students."
        ]
    ],
    "pageTitle": "Gallaudet University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Gallaudet-University/reviews?_escaped_fragment_=/show/97453",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910185071,
    "recordOffset": 910155010,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112884=© 2015, Cappex.com, LLC, 26138=I never experienced the dorm life. I will be starting in the Fall of 2012., 2422=Gallaudet University is a wonderful campus to use sign language...for a hearing person to be in a silent world where no one uses their voices like hearing people do, this is an awesome experience for those gaining more through usage of sign language. For the Deaf, this is a wonderful place to be, our own kind, our own language all over campus! Gallaudet University has grown since 1977 when I was last there! Amazing changes...this time ONLINE distance learning is available. I'm grabbing the bull by the horns with this awesome opportunity! p.s. I am Deaf!, 104311=THE BALD DAY. the freshmen traditionally dye the crazy colors until February, they will shave their heads together., 14357=There are three unique traditions that are solely Gallaudet's: Bald Day, Rat Funeral, and Class Flag. The freshmen will have a chance to go wild with their hair style and colors before going bald at the start of second semester (this is completely optional!). At the end of the freshman year, the students will dress up in black and pair up in a long line in a slow funeral march to the burial ground for their class stuffed rats (real rats were used but banned in 80's). This will be completed in junior year, where a tree and a stone slab with names of the rats and the class year is planted/placed at the gravesite. The class flag is designed and made during the freshman year, where the students must guard it diligently (since it is highly valued and prone to being stolen) until the senior trip when it is burned and a good copy placed at the Alumni Hall alongside with all previous class year' flag copies., 31718=I went on my college visit in September and I felt at home. Everyone made sure I was involved and I met some fantastic people! I definitely recommend going!!, 109970=Gallaudet University, the world's only university with programs and services specifically designed to accommodate deaf and hard of hearing students, was established in 1864 by an Act of Congress, and its charter was signed by President Abraham Lincoln. Gallaudet University, federally chartered in 1864, is a bilingual, diverse, multicultural institution of higher education that ensures the intellectual and professional advancement of deaf and hard of hearing individuals through American Sign Language and English. Gallaudet University is accredited by the Middle States Commission on Higher Education., 45486=One of the three major traditions here at Gallaudet University is the rat funeral. To quickly dismiss the underlying question, no it is not a funeral for rats. This tradition is for freshmen students and transfers as well. The first semester here all freshmen dye their hair in different neon colors and change it every two to three weeks. Come february during second semester, they all shave their hair off! This is known as bald day. At the end, a lock of hair from the participating freshman and transfer group is put in a jar and stored for the end of the year ceremony. Come the day for the ceremony, each transfer and freshman pair up all dress in black and walk in a long line and walk the course chosen by that certain class all while not smiling and no matter the weather! The second tradition is not necessarily for all students and not encouraged due to legality. Leave your mark is what it is called. A student must gain access by whatever means to the underlying structure of Gallaudet University and make their mark in the pipes or on the concrete walls underneath the university. Typically the structure is sealed off so good luck with that! The last and final tradition here at Gallaudet University is Graduation day! This is for both Graduate and Undergraduate students as well. Before the ceremony takes place, each student goes through the coffin door. It is rumored that if you go through it before your graduation day you will not graduate. The coffin door is about seven feet tall and four feet wide all in black.}",
    "textBeforeTable": "06/07/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 8 out of 9 people found this review useful. 1 of 29 Ilia from Alameda, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Great for these types of students Friendships, memories, and awareness spurns a fondness like no other! Tips for prospective students Gallaudet University is a wonderful campus to use sign language...for a hearing person to be in a silent world where no one uses their voices like hearing people do, this is an awesome experience for those gaining more through usage of sign language. For the Deaf, this is a wonderful place to be, our own kind, our own language all over campus! Gallaudet University has grown since 1977 when I was last there! Amazing changes...this time ONLINE distance learning is available. I'm grabbing the bull by the horns with this awesome opportunity! p.s. I am Deaf! Login to rate or flag the reviews Craigory from Cincinnati, OH 07/19/2011 Reviewer is Researching this school. Reviewer has been to campus. 7 out of 7 people found this review useful. 3 of 29 Categories Comments Great for these types of students This is a great school for deaf students who want a top",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}