{
    "relation": [
        [
            "Patent application number",
            "20080206294",
            "20140026468"
        ],
        [
            "Description",
            "Naphthalene Derivatives as Termite Repellents and Toxicants - Several derivatives of naphthalene, including 1′-acetonaphthone, 2′-acetonaphthone, 1-methoxynaphthalene, and 2-methoxynaphthalene, were discovered to be effective toxicants and repellents of termites, and resulted in significant reduction in termite feeding activity. For example, 2′-acetonaphthone was found to be an effective repellent and feeding deterrent of termites. Termites exposed to concentrations as low as 8 mg/kg sand exhibited a significant reduction in tunneling and feeding activity. Moreover, some of the dead termites had symptoms indicative of a failure to molt. At concentrations ≧20 μg/cm",
            "Control of Subterranean Termites - A biological control is disclosed for termites, including subterranean termites such as"
        ],
        [
            "Published",
            "08-28-2008",
            "01-30-2014"
        ]
    ],
    "pageTitle": "Henderson, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/henderson-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435730043,
    "recordOffset": 435694030,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gregg Henderson, St. Gabriel, LA US 08-28-2008 Software, methods and systems including soot loading metrics - One embodiment is a method including a unique soot loading metric. Further embodiments, forms, objects, features, advantages, aspects, and benefits shall become apparent from the following description and drawings. 20080202103 Published Description Patent application number Greg Henderson, Columbus, IN US 03-14-2013 Recombinant Prokaryotes and Use Thereof for Production of O-Glycosylated Proteins - The present invention embraces a recombinant prokaryotic host cell containing nucleic acids encoding an eukaryotic UDP-GaINAc:UDP-GaINAc polypeptide transferase and expressing an UDP-GIcNAc C-4 epimerase and methods for using the same to produce an O-glycosylated protein. 20130065274 Published Description Patent application number Grant E. Henderson, Upton, MA US 03-19-2009 SYSTEM AND METHOD FOR CREATING A SURFACE PATTERN - Some embodiments of the disclosed surface patterning systems and methods utilize a surface patterning tool coupled to a support and adapted to deposit material onto a substrate, a controller, and first, second, and third actuators electrically coupled to and controlled by the controller. In some embodiments, the first, second, and third actuators are operable to move the substrate in X, Y, and Z directions, respectively, with respect to the surface patterning tool, wherein the substrate is movable by the first, second, and third actuators to different positions with respect to the surface patterning tool, and wherein material is transferable",
    "textAfterTable": "Patent applications by Gregg Henderson, St. Gabriel, LA US Gregory Henderson, Sudbury, MA US Patent application number Description Published 20110194469 SYSTEM AND METHOD FOR EXTENDING COMMUNICATION COVERAGE IN A WIRELESS NETWORK - A wireless communication system may include a first base station having a first communication coverage area and operating in an HFDD mode using a first frequency and a second frequency in an alternating pattern. The system may also include a second base station having a second communication coverage area different than the first communication coverage area and also operating in an HFDD mode. The second base station may communicate using the first frequency and the second frequency in an opposite alternating pattern from the first base station. 08-11-2011 Gregory H. Henderson, Columbus, IN US Patent application number Description Published 20110232614 SYSTEM FOR MEASURING EGR FLOW AND METHOD FOR REDUCING ACOUSTIC RESONANCE IN EGR SYSTEM - An intake body, systems, and method for reducing acoustic resonance in pressure tap passages include determining and/or setting the length of the drilling tap passages to a value such that the natural frequency of each pressure tap passage is outside of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}