{
    "relation": [
        [
            "Part #",
            "LG01-2000A090",
            "LG01-2000A005",
            "WFD80",
            "R9R45741064",
            "KID10B0015PL21SY"
        ],
        [
            "Distributor",
            "Newark / element14",
            "Newark / element14",
            "Radwell",
            "Radwell",
            "Radwell"
        ],
        [
            "Manufacturer",
            "SENSIRION",
            "SENSIRION",
            "System Sensor",
            "Yamatake",
            "Honeywell"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Sensors & Switches, Flow Meter",
            "Sensors & Switches, Flow Meter",
            "Sensors & Switches, Flow Meter"
        ],
        [
            "Description",
            "SENSIRION - LG01-2000A090 - LIQUID FLOW SWITCH/BUBBLE DETECTOR; 3BAR",
            "SENSIRION - LG01-2000A005 - LIQUID FLOW SWITCH/BUBBLE DETECTOR; 3BAR",
            "WATERFLOW DETECTOR FOR 8INCH PIPE",
            "FLOW METER DETECTOR 292.5A",
            "FLOW METER DETECTOR 292.5A"
        ]
    ],
    "pageTitle": "Flow Detector | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/flow_detector",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470811767,
    "recordOffset": 470779211,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{101090=Description: M2000 Mag Meter For general purpose detection and field verification testing The M2000 mag meter combines a general purpose detector with an amplifier representing the next generation of electromagnetic flow meter signal processing. This recent addition to the M-Series family features, 93503=Description: FUH1010 products Easy installation; no need to cut pipe or stop flow Minimal maintenance; external sensors do not require periodic cleaning No moving parts to foul or wear No pressure drop or energy loss Wide turn-down ratio, 30:1 Choice of single, dual, or optional, three or four path versions, 111910=Description: The M2000 mag meter combines a general purpose detector with an amplifier representing the next generation of electromagnetic flow meter signal processing. This recent addition to the M-Series family features a user-friendly, advanced design and is built for field verification testing with the use, 68998=Description: Evaluation of Overhead and In-Ground Vehicle Detector Technologies for Traffic Flow Measurement Volume 25, Issue 2 (March 1997) As part of the U.S. FHWA-sponsored Detection Technology for IVHS program, ultrasonic, microwave radar, infrared laser radar, nonimaging passive infrared, video image, 118959=Description: The M1000 mag meter combines a general purpose detector with an amplifier representing the next generation of electromagnetic flow meter signal processing. This recent addition to the M-Series® family features a user-friendly, streamlined design with rugged electronics for truck-mounted, 36038=Description: Realize dramatic improvements in productivity with the GC-2010 Plus. Out of the box, it's ready to perform high-speed GC utilizing the latest in ultra narrow-bore capillary columns. The fourth generation Advanced Flow Controller delivers up to 1200 ml/min, 140 psi of pressure and supports split, 42879=Description: The M2000 mag meter combines a general purpose detector with an amplifier representing the next generation of electromagnetic flow meter signal processing. This recent addition to the M-Series® family features a user-friendly, advanced design and is built for field verification testing, 125702=Description: The M-2111 Series flow detector has non-contact transducers and a PFA flow tube design without dead pockets. Its advanced signal converter with DSP electronics offers unmatched flow measurement capabilities even in tough applications. The M-2111 is an ideal choice for use in the semiconductor}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Ultrasonic Leak Detectors Ultrasonic leak detectors also called sonic or choked flow detectors are the most widely recognized source of ultrasonic vibrations. The turbulent flow of a fluid across a pressure boundary creates acoustic waves that the ultrasonic leak detector picks up. These waves can be transmitted through Pyroelectric Detectors , the crystal is heated and causes the dipole moment to change. The changing of this dipole moment causes a current to flow. When using pyroelectrics, care must be taken not to exceed the maximum pulse width or the maximum repetition rate. Basic Principles of Silicon Detectors an electron from the valence to the conduction band, is incident upon the detector, the resulting accumulation of charge leads to a flow of current in an attached circuit. Since light is not the only source of energy that can excite an electron, detectors will produce some amount of current Detector Tube Measurements from Pressurized Systems can increase the flow rate through the tube dramatically over that of the factory calibration conditions. This can cause the tube to overstate or read high, due to the reduced contact time between the target gas",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}