{
    "relation": [
        [
            "Patent application number",
            "20090256619",
            "20110062907",
            "20110074322",
            "20110241588"
        ],
        [
            "Description",
            "HIGH-SIDE DRIVER - A high-side driving circuit is provided, where Q terminal and",
            "APPARATUS AND METHOD FOR DRIVING SENSORLESS MOTOR - An apparatus and a method for driving a sensorless motor are described and shown in the specification and drawings, where the method includes steps as follows. First, a control signal is acquired, where the control signal has information of a predetermined rotational speed. Next, energy is supplied and progressively increased to the sensorless motor, so as to rotate a rotor of the sensorless motor. Then, a position of the rotor is detected. Finally, the energy is gradually regulated so that the sensorless motor is maintained at the predetermined rotational speed.",
            "APPARATUS AND METHOD FOR DETECTING LOCK ERROR IN SENSORLESS MOTOR - An apparatus and a method for detecting a lock error in a sensorless motor are disclosed, where the apparatus includes a multiplexer, a negative booster, a comparator and a timer. The multiplexer can receive a coil voltage from the sensorless motor. The negative booster can receive a neutralizing voltage from the sensorless motor and drop the neutralizing voltage. The comparator can compare the coil voltage with the dropped neutralizing voltage for outputting a zero-crossing signal. The timer can count time duration during the zero-crossing signal maintained at the a logic level and determine the lock error in the sensorless motor when the time duration exceeds a predetermined period.",
            "SYSTEM AND METHOD FOR CONTROLLING SENSORLESS MOTOR - A system and a method for controlling a sensorless motor are disclosed, where the system includes a motor driver and a zero crossing detector. The motor driver can drive the sensorless motor. The zero crossing detector can detect a zero-crossing point when the voltage of one motor coil of the sensorless motor is in a blanking period."
        ],
        [
            "Published",
            "10-15-2009",
            "03-17-2011",
            "03-31-2011",
            "10-06-2011"
        ]
    ],
    "pageTitle": "Hsu, Hsinchu County - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hsu-hsinchu-county-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449103991,
    "recordOffset": 449061577,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hsien-Wen Hsu, Hsinchu County TW 12-24-2009 APPARATUS AND METHOD FOR SELECTIVELY OUTPUTTING HD/SD SIGNALS AS HIGH DEFINITION VIDEO ACCORDING TO COPY PROTECTION - An apparatus for outputting standard definition (SD) and high-definition (HD) analog signals as high-definition (HD) video according to copy protection is disclosed. The apparatus includes: a determination block, for receiving a specific signal and determining whether the received specific signal has copy protection; and a scaling block, coupled to the determination block, for selectively scaling the received specific signal according to at least a copy protection determination result generated by the determination block. 20090317057 Published Description Patent application number Hau-Jean Hsu, Hsinchu County TW //]]> BarDraw('2503220',['Patent applications by Hao Sheng Hsu, Hsinchu County TW'],[[1,1,1]],['2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2503220\" align=\"center\"></div> </div> <canvas id=\"bg2503220\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Hao Sheng Hsu, Hsinchu County TW</p> <div class=\"bar2503220\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>08-15-2013</td> <td><a href=\"/patents/app/20130210368\">Method and Wireless Communication Device for Antenna Deployment Determination</a> - A method of antenna deployment determination in a wireless communication device is disclosed. The method includes transceiving a radio signal via the a first antenna port of the wireless communication device, obtaining a first strength result corresponding to the radio signal transmitted or received via the first antenna port, and determining a connecting status of the first antenna port according to the first strength result.</td> <td>20130210368</td>",
    "textAfterTable": "Hsiu-Wen Hsu, Hsinchu County TW Patent application number Description Published 20090212355 Metal-Oxide-Semiconductor Transistor Device and Method for Making the Same - A metal-oxide-semiconductor transistor device includes a semiconductor substrate, an epitaxial layer formed on the semiconductor substrate, an oxide layer formed on the epitaxial layer, a gate structure formed on the oxide layer, and a shallow junction well formed on the two lateral sides of the gate structure including a source region and a heavy doping region. The gate structure includes a conductive layer having a gap on top of the sidewall of the conductive layer and a spacer formed on the gap. 08-27-2009 20090236636 Closed Cell Array Structure Capable of Decreasing Area of non-well Junction Regions - A closed cell array structure capable of decreasing area of non-well junction regions includes a plurality of closed cell units, arranged in a plane, each shaped as a polygon, and a plurality of gate windows, each formed in a corner of a closed cell unit in a gate layer without doped source ion material. 09-24-2009 20100176444 POWER MOSFET AND METHOD OF FABRICATING THE SAME - A power MOSFET including a substrate of first conductivity type, an epitaxial layer of first conductivity type on the substrate, a body layer of second conductivity type in the epitaxial layer, a first insulating layer, a second insulating layer, a first conductive layer and two source regions of first conductivity type is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}