{
    "relation": [
        [
            "Release",
            "Release 3.7.2",
            "Release 4.3.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "The command output was modified to display relevant wide metric information."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router Routing Command Reference, Release 4.3.x - EIGRP Commands [Cisco ASR 9000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-3/routing/command/reference/b_routing_cr43xasr9k/b_routing_cr43xasr9k_chapter_011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363094651,
    "recordOffset": 363030885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27131=The following example shows how to take redistributed Routing Information Protocol (RIP) metrics and translate them into EIGRP metrics with values as follows: bandwidth = 1000, delay = 100, reliability = 250, loading = 100, and MTU = 1500.}",
    "TableContextTimeStampAfterTable": "{97415=The following example shows how to configure the maximum prefix limit for a single peer. The maximum limit is set to 1000 prefixes, and the warning threshold is set to 80 percent. When the maximum prefix limit is exceeded, the session with this peer is torn down, all routes learned from this peer are removed from the topology and routing tables, and this peer is placed in a penalty state for 5 minutes (default penalty value)., 67223=Bandwidth is inverse minimum bandwidth of the path in BPS scaled by a factor of 2.56 * 1012. The range is from a 1200-bps line to 10 terabits per second., 70171=512000 (20,000 ms)}",
    "textBeforeTable": "Syntax Description no address-family { ipv4 | ipv6 } address-family { ipv4 | ipv6 } To enable an IPv4 address family under Enhanced Interior Gateway Routing Protocol (EIGRP), use the address-family command in the appropriate mode. To remove the address family from the EIGRP configuration, use the no form of this command. address-family (EIGRP) vrf (EIGRP) variance timers nsf route-hold (EIGRP) timers active-time summary-address (EIGRP) stub (EIGRP) split-horizon disable (EIGRP) site-of-origin (EIGRP) show protocols (EIGRP) show eigrp traffic show eigrp topology show eigrp neighbors show eigrp interfaces show eigrp accounting router-id (EIGRP) router eigrp route-policy (EIGRP) redistribute maximum-prefix redistribute (EIGRP) passive-interface (EIGRP) nsf disable (EIGRP) next-hop-self disable neighbor maximum-prefix neighbor (EIGRP) metric weights metric rib-scale metric maximum-hops metric (EIGRP) maximum-prefix (EIGRP) maximum-paths (EIGRP) log-neighbor-warnings log-neighbor-changes interface (EIGRP) hold-time (EIGRP) hello-interval (EIGRP) distance (EIGRP) default-metric (EIGRP)",
    "textAfterTable": "Command Modes Router configuration VRF configuration Command History Release Modification Release 3.7.2 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Use the address-family ipv4 command to configure IPv4 address family sessions in EIGRP. EIGRP Virtual Private Networks (VPNs) can be configured under IPv4 address family configuration modes after first entering VRF configuration mode. All commands in address family configuration mode can be configured in VRF address families except the autonomous-system and maximum-prefix commands. Task ID Task ID Operations eigrp read, write",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}