{
    "relation": [
        [
            "",
            "Albiglutide Process 2",
            "Albiglutide Process 3"
        ],
        [
            "Description",
            "During the BE Phase, participants received a single dose of albiglutide 30 milligrams (mg) from the Process 2 drug product, injected subcutaneously into the abdomen using a fixed-dose, prefilled, single-use injector pen.",
            "During the BE Phase, participants received a single dose of albiglutide 30 mg from the Process 3 drug product, injected subcutaneously into the abdomen using a fixed-dose, prefilled, single-use injector pen."
        ]
    ],
    "pageTitle": "Pharmacokinetics/Pharmacodynamics of Albiglutide - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01357889?sect=Xg0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866131139,
    "recordOffset": 866114174,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups This study was comprised of a Screening Period (up to 2 weeks), a Run-in Period (4 weeks), a Treatment Period (TP: 17 weeks), and a Follow-up (8 weeks) Period. The TP had a Single-dose Phase (Bioequivalence [BE] Phase: 28 days) and a 12-week Multiple-dose Phase. In the BE Phase, 186 participants were randomized; 167 received >=1 treatment dose. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details The enrollment number reflects the 283 participants starting the Multiple-dose Phase. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Biological: albiglutide (GSK716155) Intervention: Diabetes Mellitus, Type 2 Condition:",
    "textAfterTable": "Participant Flow for 3 periods Period 1:   Single-dose Phase (BE Phase: 28 Days)     Albiglutide Process 2     Albiglutide Process 3   STARTED     86     81   COMPLETED     82     79   NOT COMPLETED     4     2   Withdrawal by Subject                 2                 1   Persistent Hyperglycemia                 1                 1   Physician Decision      ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}