{
    "relation": [
        [
            "Fireplace:",
            "Pool:",
            "Hot Tub:",
            "View:"
        ],
        [
            "Wood",
            "Yes",
            "Complex",
            "Mountain & Town Views"
        ],
        [
            "TV in Master Bedroom:",
            "Washer/Dryer:",
            "High Speed Internet:",
            "Unit Code:"
        ],
        [
            "Yes",
            "Unit",
            "Yes",
            "Alpblick8"
        ]
    ],
    "pageTitle": "Alpenblick Unit 8",
    "title": "",
    "url": "http://www.friasproperties.com/store/p2details1225.php",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 458382603,
    "recordOffset": 458366209,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Additional Details: (Passes to the Aspen Club & Spa can be obtained from any Frias Properties front desk during regular business hours.) All Frias Properties of Aspen guests receive complimentary passes to the Aspen Club & Spa, the valley’s premier full-service spa and workout facility. Complex amenities at the Alpenblick include free Aspen airport transfers, on-site free parking, ski lockers and free wireless internet access. Other amenities include marble countertops, an open living area with a wood-burning fireplace, a formal dining area and a kitchen with a breakfast bar, and a laundry closet with washer/dryer. This three level 3-bedroom, 4-bath deluxe townhome features a den on the lower level with a sleeper sofa and flatscreen TV - and is only two blocks to the Silver Queen Gondola and even closer to downtown Aspen. Alpenblick Condo Complex: Contact Us View Video",
    "textAfterTable": "Property Location: Check-in Location: 747 S. Galena Street Reviews for Alpenblick Unit 8 Average Rating: 5 of 5 1 of 1 reviews \"Alpenblick\" 5 of 5 Our stay was really great! Thanks for making it a wonderful few days. -A FlipKey verified reviewer on 08/29/2012 Vacation Rentals Aspen Luxury Rentals Aspen Condominiums Galena Street Neighborhood Independence Square Silverglo Condominiums Homes Ritz | St. Regis | Hyatt | Innsbruck | Residences at the Little Nell Groups & Conferences Vacation Rental brochure Accommodation Ratings Rental Policies Interactive",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}