{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "believe me you feel safe with the cops on campus",
            "Theres a club for EVERYONE",
            "For ALL types of students",
            "its fun",
            "Its in Downtown zoo is like 5 min away beach is like 10 min possibilities are endless",
            "Cafeteria food is pretty cheap and good!! especially the grilled cheese sandwich and loaded fries =)",
            "You live at home",
            "The always have opportunities for you",
            "Focus focus focus",
            "I actually feel Appreciated here. School is very low key but awesome. The teachers care about your education not your outfit."
        ]
    ],
    "pageTitle": "San Diego City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Diego-City-College/reviews?_escaped_fragment_=/show/93703",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893024591,
    "recordOffset": 892972757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{88128=NA I start in Fall 2012, 285081=© 2015, Cappex.com, LLC, 88656=I feel they go above and beyond t reach out to the community to assist in educating, orffereing education, and resources. They make you feel at home in a sense I really dont feel like a number and they always have a suggestion or at least let me vent so I am not as frustrated. I hope they get more funding again because this Summer 2012 they could not offer any classes!, 211899=2014 will be 100 years of San Diego City College., 270299=I've attended Mira Costa, Palomar and this is my third community college. While busy, so far it seems as though City College has the best instructors. In terms of enrollment, it can be tough and confusing to get in, but once done everything runs smoothly., 11617=I graduated High School in 2007, and joined the Marine Corps for 4 years. Getting back into my previous education patterns from High School was hard. My math teacher showed no mercy for my troubles, and I had to study hard in order to pass.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 18 out of 21 people found this review useful. 1 of 73 Reuben from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "What to do for fun Join student clubs and awareness groups, it will help to get a feel for the campus as well as creating a network of fellow students so that you can stay involved an motivated in you courses. Food and Dining The cafeteria and student store offer a wide variety of food and snacks, stick the the fresh stuff though, the junk food is tempting but it will only slow you down and empty your wallet! Dorm Life I live off campus, there is a lot of street parking but you must work to find it, always leave enough time to find parking, even with a parking pass. Academic Rigor The professor's expect that we will transfer to a 4-year university and so they hold at the same standard, be vigilant about assignments and quality of work. Tips for prospective students Sign up for classes early! The budget cuts are hitting us hard, complete all necessary admissions and financial aid forms before the beginning of the semester to avoid long lines and over worked clerks. In three sentences I have attended San Diego",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}