{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Error-reached-base",
            "Out",
            "Error-reached-base",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Mitchell Boggs starts the inning for the Cardinals, batting 9th.",
            "Jim Edmonds reached second on Colby Rasmus's fielding error. Runner on second with none out and Alcides Escobar due up.",
            "Alcides Escobar bunt popped out to first. Runner on second with one out and George Kottaras due up.",
            "George Kottaras reached first on Aaron Miles's throwing error. Runners on first and second with one out and Carlos Gomez due up.",
            "Carlos Gomez popped out to second. Runners on first and second with two outs and Rickie Weeks due up.",
            "Rickie Weeks grounded out second to first to end the inning."
        ]
    ],
    "pageTitle": "Saturday, June 5, 2010 Milwaukee Brewers - St. Louis Cardinals Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/brewers_cardinals/2010/06/05",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 50670316,
    "recordOffset": 50653922,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2361=View all MLB box scores for 6/5/2010}",
    "textBeforeTable": "Top of the 1st Mike Everitt  3B Tim McClelland  2B Andy Fletcher  1B Todd Tichenor  H Umpires 3.28 10 16 0 0 0 0 1 1 Mitchell Boggs (W, 1-2) 1.78 10 12 3 0 0 0 0 1 Ryan Franklin  2.42 12 19 0 0 0 0 0 1.2 Jason Motte  3.21 14 24 2 1 0 0 0 1.1 Trever Miller  1.85 7 13 1 1 0 0 0 1 Kyle McClellan (BS, 1) 2.65 3 7 0 1 2 2 2 0 Dennys Reyes  5.06 53 75 2 1 2 2 5 5 Adam Ottavino  ERA Strikes Pitches SO BB ER R H IP Name 3.27 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Cardinals pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/cardinals_22t.png 17 27 1 1 1 1 3 1.1 John Axford (L, 1-1) 3.38 15 26 2 0 0 0 1 2 Carlos Villanueva  0.00 11 17 3 0 0 0 0 1 Kameron Loe  5.83 58 105 4 5 4 4 5 6 Chris Narveson  ERA Strikes Pitches SO BB ER R H IP Name \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Brewers pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/brewers_22t.png",
    "textAfterTable": "Substitution Pitchers confirmed. Double Felipe Lopez doubled to left. Runner on second with none out and Ryan Ludwick due up. Out Ryan Ludwick popped out to short. Runner on second with one out and Albert Pujols due up. Home-run Albert Pujols one-out, two-run Home Run (13) to left center scored Felipe Lopez. Matt Holliday due up. Walk Matt Holliday walked. Runner on first with one out and David Freese due up. Stolen-base Matt Holliday stole second. Runner on second with one out and David Freese at the plate. Out David Freese flied out to left. Runner on second with two outs and Yadier Molina due up. Walk Yadier Molina walked. Runners on first and second with two outs and Colby Rasmus due up. Double Colby Rasmus doubled to center scoring Matt Holliday and Yadier Molina with two out. Runner on second and Skip Schumaker due up. Out Skip Schumaker grounded out short to first to end the inning. Top of the 2nd Play Type Play Out Casey McGehee flied out to center. None on with one out and Jim Edmonds due up. Out Jim Edmonds lined out to right. None",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}