{
    "relation": [
        [
            "Parameter",
            "String jobInstanceID",
            "String bipSessionToken"
        ],
        [
            "Description",
            "The ID of the job for which to return job information.",
            "The proprietary token string generated for the user by the BI Publisher server. With the bipSessionToken string, the user no longer needs to provide user credentials. The BI Publisher server can validate this token string and restore the BI Publisher server session to perform needed operation."
        ]
    ],
    "pageTitle": "ScheduleService",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/bi.1111/e22259/scheduleservice.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75576606,
    "recordOffset": 75560657,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{48244=Use the getScheduledReportdeliveryInfo() method to retrieve information about the delivery of a scheduled job output. For each scheduled Job, it could have multiple outputIDs. For each outputID, there could be multiple delivery info. See Section 2.3.35, \"JobOutputDeliverysList.\", 25976=The JobFilterProperties object specifies the specific criteria for the report jobs you want to return information about. See Section 2.3.30, \"JobFilterProperties.\", 13192=The DeliveryRequest object. See Section 2.3.21, \"DeliveryRequest.\", 78776=Specifies the delivery channels through which the report will be delivered. See Section 2.3.20, \"DeliveryChannels.\", 76074=Specifies a ScheduleRequest object for the report that you want to run. See Section 2.3.48, \"ScheduleRequest.\", 78365=Specifies a ScheduleRequest object for the report that you want to run. See Section 2.3.48, \"ScheduleRequest.\".}",
    "lastModified": "Wed, 13 May 2015 05:21:42 GMT",
    "textBeforeTable": "Table 3-26 Parameters for getScheduledReportOutputInfoInSession() Method JobOutputsList getScheduledReportOutputInfoInSession(String jobInstanceID, String bipTokenSession); Signature For more information about in-session methods, see Section 1.2, \"About In-Session Methods.\" Use the getScheduledReportOutputInfo() method to return information about a specific scheduled report output based on its jobInstanceID and the bipSessionToken of a given user. 3.26 getScheduledReportOutputInfoInSession() Method Specifies the password for the user name. String password Specifies the BI Publisher user name. String userID The ID of the job for which to return job information. String jobInstanceID Description Parameter Table 3-25 Parameters for getScheduledReportOutputInfo() Method JobOutputsList getScheduledReportOutputInfo(String jobInstanceID, String userID, String password); Signature Use the getScheduledReportOutputInfo() method to return information about a specific scheduled report output. 3.25 getScheduledReportOutputInfo() Method The proprietary token string generated for the user by the BI Publisher server. With the",
    "textAfterTable": "3.27 getXMLData() Method Use the getXMLData() method to return, in XML format, the data document generated by a BI Publisher scheduled job. You can use the JobOutputID returned from the scheduleReport() method to retrieve the generated XML document. Note, the getXMLData() method returns the byte[] of a report document, while the downloadXMLData() Method saves the XML data on the BI Publisher server as a local file. The latter method returns the file ID, enabling the user to download the XML-based document later through the Delivery Service. This is for performance concerns in cases where a report document size is quite large. Signature byte[] getXMLData(String JobInstanceID, String userID, String password); Table 3-27 Parameters for getXMLData() Method Parameter Description String JobInstanceID The ID assigned to the instance of the job that generated the output. The JobInstanceID is a string of integers. String userID Specifies the BI Publisher user name. String password Specifies the password for the user name.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}