{
    "relation": [
        [
            "Program Activity Expected Results",
            "A secure aviation system",
            "Level of credibility of aviation security internationally",
            "Public confidence in the security of the aviation transportation system"
        ],
        [
            "Performance Indicators",
            "Composite index of level aviation security (to be developed by 2009-10)",
            "Number of adjustments made to the Canadian Aviation Security Regulatory Framework to achieve international acceptance",
            "% of respondents in a national survey reporting confidence in the security of Canada’s aviation system"
        ],
        [
            "Targets",
            "By 2015, Aviation Security is rated high to very high on the index (subject to change once composite index is developed in 2009-10)",
            "In 2010, two adjustments or less are made to the Canadian Aviation Security Regulatory Framework to achieve international acceptance",
            "In 2010, 90% of public has high or moderate confidence in the security of Canada’s aviation system"
        ]
    ],
    "pageTitle": "ARCHIVED - Transport Canada 2 / 3",
    "title": "",
    "url": "http://www.tbs-sct.gc.ca/rpp/2009-2010/inst/mot/mot02-eng.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 742380711,
    "recordOffset": 742356763,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8230=Home  > Expenditure Management  > Reports on Plans and Priorities  > 2009-10, 2110=Strong and modern infrastructure is vital to Canada’s competitiveness and long-term prosperity. The Infrastructure Stimulus Fund and the Green Infrastructure Fund announced in Budget 2009, as well as the federal Building Canada plan demonstrate commitment to sustained support for existing and new transportation infrastructure across provinces and territories. The initiatives create jobs, attract investment and promote innovative financing through public-private partnerships.}",
    "TableContextTimeStampAfterTable": "{53638=Description: The Marine Safety Program Activity protects the life and health of Canadians by providing a safe and efficient marine transportation system. This program derives its authority from a number of Acts – the Canada Shipping Act, 2001, the Navigable Waters Protection Act, the Safe Containers Act, the Pilotage Act, the Coasting Trade Act, and the Arctic Waters Pollution Prevention Act – to develop and enforce a marine safety regulatory framework for the domestic and foreign vessels, as well as pleasure craft; enforce international conventions signed by Canada; and protect the public right to navigation on Canada’s waterways., 59171=For example, safety benefits from 2007 data include record low numbers of Canadian vessel accidents and accidents on board ship for the fourth year in a row; and 50 per cent fewer marine fatalities than the average of the previous five years., 32934=Description: Guided by the Canada Shipping Act, 2001, the Arctic Waters Pollution Prevention Act, the Marine Liability Act and international conventions, the Clean Water from Transportation Program helps to protect the marine environment and the health of Canadians by reducing the pollution of water from transportation sources. The program regulates and monitors the impact of discharges from marine vessels into the marine environment; regulates ballast water; and contributes to setting domestic and international rules that govern limits to liability of marine pollution incidents., 71225=Description: Required by the Transportation of Dangerous Goods Act, 1992, the Transportation of Dangerous Goods Program Activity, based on risk, develops safety standards and regulations, provides oversight and gives expert advice (e.g. Canadian Transport Emergency Centre or canutec) on dangerous goods incidents to: promote public safety in the transportation of dangerous goods by all modes of transport in Canada; identify threats to public safety and enforce the Act and its regulations; guide emergency response and limit the impact of incidents involving the transportation of dangerous goods; and develop policy and conduct research to enhance safety., 70774=For example, the program will work to amend the Motor Vehicle Safety Act and continue to advance Road Safety Vision 2010 targets: to reduce road-related deaths and serious injuries 30 per cent by 2010, saving 900 lives and preventing 4,900 serious injuries each year., 24317=The transportation sector is responsible for about 26 per cent of Canada’s total greenhouse gas emissions. Rapid sector growth saw transportation emissions increase 50 per cent faster than overall greenhouse gas emissions between 1990 and 2006. If no action is taken, transportation emissions are expected to rise rapidly by 2020, with road vehicle emissions expected to increase by close to 32 per cent between 2005 and 2020. Achieving a cleaner environment requires a systemic approach, the engagement of all key stakeholders and a comprehensive set of policy choices., 64619=Canadians benefit from the program’s partnerships that work to reduce the loss of life, injuries and damages caused by highway/railway crossing collisions and train/pedestrian incidents. For example, in 2008, more than 100,000 elementary school children in more than 600 schools across Canada learned about safety at railway crossings from Operation Lifesaver, sponsored by Transport Canada and its partners., 83810=Several prominent reports and external reviews have focused on the security of Canada’s civil aviation system over the past few years. These included the Advisory Panel’s Review of the Canadian Air Transport Authority Act and the Auditor General’s Special Examination of the Canadian Air Transport Security Authority, both published in 2006. As a result, during the planning period the program will:}",
    "textBeforeTable": "8 62 9 66 9 66 Planned Spending FTEs Planned Spending FTEs Planned Spending FTEs 2011-12 2010-11 2009-10 Human Resources (FTEs) and Planned Spending ($ millions) Program Activity: Transportation Marketplace Frameworks Description: The Transportation Marketplace Frameworks Program Activity encourages transportation efficiency by fostering a competitive and viable transportation sector. Program activities include setting the regimes governing the economic behaviour of carriers in all modes of transportation; setting the rules of governance for all the transportation infrastructure providers falling under the authority of Parliament; monitoring the transportation system; and representing the interests of Canada in international transportation fora and other international bodies. 2.1.1 Program Activity: Transportation Marketplace Frameworks To deliver on this outcome, Transport Canada will work in collaboration with stakeholders involved in Canada’s transportation system. These include other federal departments, provinces, territories, municipal governments, transportation service",
    "textAfterTable": "Benefits for Canadians The program benefits Canadians because modern marketplace frameworks: provide efficient, competitive and viable transportation services at lower cost to Canadians; contribute to accessible and reliable transportation; and support national and international trade and travel, while balancing the relationships between carriers, shippers and consumers. 2.1.2 Program Activity: Gateways and Corridors Description: Guided by the National Policy Framework for Strategic Gateways and Trade Corridors, the Gateways and Corridors Program Activity aims at supporting Canada’s international trade and international supply chains by creating more efficient, reliable and seamless trade-related transport systems in Canada. The program sets strategies and frameworks for improving and integrating transportation networks in key regions; fosters partnerships between all levels of government and the private sector; supports and oversees projects that contribute to the increased capacity and efficiency of gateway and corridor infrastructure; develops and puts in place measures that remove impediments to the effective development of gateways and corridors; and promotes the use of gateways and corridors. Program Activity: Gateways and Corridors Human Resources (FTEs) and Planned Spending ($ millions)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}