{
    "relation": [
        [
            "Action",
            "NPRM",
            "NPRM Comment Period End",
            "NPRM Comment Period Extended",
            "NPRM Comment Period Extended End"
        ],
        [
            "Date",
            "01/16/13",
            "05/16/13",
            "04/26/13",
            "09/16/13"
        ],
        [
            "FR Cite",
            "78 FR 3503",
            "",
            "78 FR 24692",
            ""
        ]
    ],
    "pageTitle": "Federal Register | Regulatory Agenda",
    "title": "",
    "url": "https://www.federalregister.gov/articles/2013/07/23/2013-17060/regulatory-agenda",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899617959,
    "recordOffset": 899574982,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20353=Draft Recommended Aquatic Life Ambient Water Quality Chronic Criterion for Selenium-Freshwater 2015, 26664=A Proposed Rule by the Food and Drug Administration on 07/27/2015}",
    "TableContextTimeStampAfterTable": "{213283=Legal Authority: sec 502(c) of the Food Drug and Cosmetic Act (FD Act), 21 U.S.C. 352(c); sec 514(c) of FD Act, 21 U.S.C. 360d(c), enacted by the Food and Drug Modernization Act of 1997 (FDAMA), 53224=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 219106=Agency Contact: Felicia Billingslea, Director, Food Labeling and Standard Staff, Department of Health and Human Services, Food and Drug Administration, Room 4D045, HFS 820, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1803, Fax: 301 436-2636, Email: felicia.billingslea@fda.hhs.gov., 234713=Abstract: This proposed rule would revise payment polices under the Medicare physician fee schedule, and make other policy changes to payment under Medicare Part B. These changes would be applicable to services furnished on or after January 1 annually., 170241=Agency Contact: Annette L. Marthaler, Regulatory Counsel, Department of Health and Human Services, Food and Drug Administration, Center for Tobacco Products, Room 340K, 9200 Corporate Boulevard, Rockville, MD 20850, Phone: 877 287-1373, Fax: 240 276-3904, Email: annette.marthaler@fda.hhs.gov., 173488=Agency Contact: Mark Kantor, Nutritionist, Department of Health and Human Services, Food and Drug Administration, HFS-830, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1450, Fax: 301 436-1191, Email: mark.kantor@fda.hhs.gov., 111560=Agency Contact: Blakeley Fitzpatrick, Interdisciplinary Scientist, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-830), HFS-830, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1450, Email: blakeley.fitzpatrick@fda.hhs.gov., 69352=The Regulatory Flexibility Act of 1980 and Executive Order 12866 require the Department semiannually to issue an inventory of rulemaking actions under development to provide the public a summary of forthcoming regulatory actions. This information will help the public more effectively participate in the Department's regulatory activity, and the Department welcomes comments on any aspect of this agenda., 234588=Legal Authority: Social Security Act secs 1102, 1871, 1848, 246283=Agency Contact: Niall Brennan, Director, Policy and Data Analysis Group, Department of Health and Human Services, Centers for Medicare & Medicaid Services, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 202 690-6627, Email: niall.brennan@cms.hhs.gov., 167493=Paula Katz, Consumer Safety Officer, Department of Health and Human Services, Food and Drug Administration, Center for Drug Evaluation and Research, WO 51, Room 1320, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 796-6972, Email: paula.katz@fda.hhs.gov., 249558=[FR Doc. 2013-17060 Filed 7-22-13; 8:45 am], 155646=Agency Contact: Jenny Scott, Senior Advisor, Department of Health and Human Services, Food and Drug Administration, Office of Food Safety, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1488, Email: jenny.scott@fda.hhs.gov., 84115=Dated: April 22, 2013., 249032=Agency Contact: Twi Jackson, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-1159, Email: twi.jackson@cms.hhs.gov., 182964=Agency Contact: Gerie Voss, Regulatory Counsel, Department of Health and Human Services, Food and Drug Administration, Center for Tobacco Products, 9200 Corporate Boulevard, Rockville, MD 20850, Phone: 877 287-1373, Fax: 240 276-4193, Email: gerie.voss@fda.hhs.gov., 226601=Abstract: FDA is proposing to change its serving size regulations to provide updated Reference Amounts Customarily Consumed for candies. FDA is taking this action in response to comments received on an advance notice of proposed rulemaking published in 2005. This RIN is being withdrawn from the Unified Agenda and merged with RIN 0910-AG82., 206513=Agency Contact: John J. Crowley, Senior Advisor for Patient Safety, Department of Health and Human Services, Food and Drug Administration, Center for Devices and Radiological Health, WO 66, Room 2315, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 980-1936, Email: jay.crowley@fda.hhs.gov., 83431=The rulemaking abstracts included in this paper issue of the Federal Register only cover, as required by the Regulatory Flexibility Act of 1980, those prospective HHS rulemakings likely to have a significant economic impact on a substantial number of small entities. The Department's complete Regulatory Agenda is accessible online at http://www.RegInfo.gov., 243231=Agency Contact: Roechel Kujawa, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop C4-07-07, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-9111, Email: roechel.kujawa@cms.hhs.gov., 132439=Agency Contact: William Burkholder, Veterinary Medical Officer, Department of Health and Human Services, Food and Drug Administration, Center for Veterinary Medicine, Room 2642 (MPN-4, HFV-228), 7519 Standish Place, Rockville, MD 20855, Phone: 240 453-6865, Email: william.burkholder@fda.hhs.gov., 224668=Agency Contact: Sheila Anne Brown, Policy Analyst, Investigational Device Exemptions Staff, Department of Health and Human Services, Food and Drug Administration, WO 66, Room 1651, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 796-6563, Fax: 301 847-8120, Email: sheila.brown@fda.hhs.gov., 238983=Legal Authority: Pub. L. 111-48, secs 2501, 2503, 3301(d)(2); Pub. L. 111-152, sec 1206; Pub. L. 111-8, sec 221, 231423=Agency Contact: Janice Graham, Health Insurance Specialist, Clincal Standards Group, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Center for Clincial Standards and Quality, Mail Stop S3-02-01, 7500 Security Boulevard, Baltimore, MD 21244-1850, Phone: 410 786-8020, Email: janice.graham@cms.hhs.gov., 236790=Abstract: The Affordable Care Act amends the current Medicare FQHC payment policy by requiring the establishment of a new payment system, effective with cost reporting periods beginning on or after October 1, 2014. This rule proposes the establishment of the new prospective payment system., 127044=Agency Contact: David Eng, Regulatory Project Manager, Department of Health and Human Services, Food and Drug Administration, Center for Drug Evaluation and Research, WO 22, Room 5487, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 796-2773, Fax: 301 796-9899, Email: david.eng@fda.hhs.gov., 237746=Agency Contact: Sarah Harding, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop C4-01-26, 7500 Security Boulevard, Windsor Mill, MD 21244, Phone: 410 786-4001, Email: sarah.harding@cms.hhs.gov., 103851=Agency Contact: David Eng, Regulatory Project Manager, Department of Health and Human Services, Food and Drug Administration, Center for Drug Evaluation and Research, WO 22, Room 5487, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 796-2773, Fax: 301 796-9899, Email: david.eng@fda.hhs.gov., 171813=Abstract: FDA is proposing to change the nutrition label serving size for breath mints to one unit. FDA is taking this action in response to a citizen petition that requested a serving size for breath mints that more accurately reflects the amount customarily consumed per eating occasion and comments received on an advance notice of proposed rulemaking published in 2005., 53164=Posted by Ben Jordi on June 4, 2015, 53832=Posted by Ben Jordi on June 1, 2015, 215145=Agency Contact: Mary Follette Story, Human Factors and Accessible Medical Technology Specialist, Department of Health and Human Services, Food and Drug Administration, Center for Devices and Radiological Health, Room 2553, 10903 New Hampshire Avenue, Silver Spring, MD 20993, Phone: 301 796-1456, Email: molly.story@fda.hhs.gov., 158352=Agency Contact: May Nelson, Regulatory Counsel, Department of Health and Human Services, Food and Drug Administration, Center for Tobacco Products, 9200 Corporate Boulevard, Rockville, MD 20850, Phone: 877 287-1373, Fax: 240 276-3904, Email: may.nelson@fda.hhs.gov., 160832=Agency Contact: Carol Drew, Regulatory Counsel, Department of Health and Human Services, Food and Drug Administration, Center for Tobacco Products, 9200 Corporate Boulevard, Room 240 H, Rockville, MD 20850, Phone: 877 287-1373, Fax: 240 276-3904, Email: carol.drew@fda.hhs.gov., 228274=Agency Contact: Mark Kantor, Nutritionist, Department of Health and Human Services, Food and Drug Administration, HFS-830, 5100 Paint Branch Parkway, College Park, MD 20740, Phone:, 240 402-1450, Fax: 301 436-1191, Email: mark.kantor@fda.hhs.gov., 233688=Agency Contact: Marjorie Baldo, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Center for Medicare Management, Mail Stop C4-03-06, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-4617, Email: marjorie.baldo@cms.hhs.gov., 198549=Agency Contact: Benson Silverman, Staff Director, Infant Formula and Medical Foods, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-850), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1459, Email: benson.silverman@fda.hhs.gov., 232386=Legal Authority: sec 1833 of the Social Security Act, 106240=Abstract: FDA is currently reviewing regulations promulgated under the Prescription Drug Marketing Act (PDMA). FDA is undertaking this review to determine whether the regulations should be changed or rescinded to minimize adverse impacts on a substantial number of small entities. FDA has extended again the completion date by 1 year and will complete the review by November 2013., 187526=Abstract: FDA is proposing to amend its regulations governing mammography. The amendments would update the regulations issued under the Mammography Quality Standards Act of 1992 (MQSA). FDA is taking this action to address changes in mammography technology and mammography processes, such as breast density reporting, that have occurred since the regulations were published in 1997., 235631=Agency Contact: Kathy Bryant, Deputy Director, Division of Practitioner Services, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Mail Stop C4-01-27, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-3448, Email: kathy.bryant@cms.hhs.gov., 81905=The purpose of the agenda is to encourage more effective public participation in the regulatory process. HHS is currently furthering this goal by engaging in a Department-wide effort to identify ways to make the rulemaking process more accessible to the general public. This effort is in response to President Obama's January 18, 2011, Executive Order 13563, “Improving Regulation and Regulatory Review,” which requires ongoing retrospective review of current agency regulations and encourages federal agencies to develop balanced regulations through a process that “allows for public participation and an open exchange of ideas.” HHS's efforts include stakeholder outreach and continuing to update its main regulatory Web page (http://www.HHS.gov/Regulations) with information helpful to the public. For example, to encourage public participation, the Web page includes links to HHS rules currently open for public comment and provides a “regulations toolkit” with background information on regulations, the commenting process, and how the public can provide effective comments. HHS also actively encourages meaningful public participation in retrospective review and rulemaking through education and outreach (http://www.HHS.gov/RetrospectiveReview)., 184103=Abstract: The proposed rule would establish special controls for the computed tomography (CT) x-ray system, a class II device as defined in 21 CFR 892.1750. A CT x-ray system is a diagnostic x-ray imaging system intended to produce cross-sectional images of the body through use of a computer to reconstruct an image from the same axial plane taken at different angles. High doses of ionizing radiation can cause acute (deterministic) effects such as burns, reddening of the skin, cataracts, hair loss, sterility, or, in extremely high doses, radiation poisoning. Therefore, the design of a CT x-ray system needs to balance the benefits of the device (i.e., the ability of the device to produce a diagnostic quality image) with the known risks (e.g., exposure to ionizing radiation). FDA is establishing special controls, combined with the general controls, to provide reasonable assurance of the safety and effectiveness of a class II CT x-ray system., 168996=Abstract: FDA is proposing to require manufacturers and importers of tobacco products to submit certain market share data to FDA. USDA currently collects such data, but its program sunsets at the end of September 2014 and USDA will cease collection of this information. FDA is taking this action so that it may continue to calculate market share percentages needed to compute user fees., 52525=Posted by Ben Jordi on June 22, 2015, 209436=Agency Contact: Daniel Reese, Food Technologist, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-820), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-2126, Email: daniel.reese@fda.hhs.gov., 212479=Agency Contact: Daniel Reese, Food Technologist, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition (HFS-820), 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-2126, Email: daniel.reese@fda.hhs.gov., 153364=Legal Authority: 21 U.S.C. 342; 21 U.S.C. 371; 42 U.S.C. 264; Pub. L. 111-353 (signed on Jan. 4, 2011), 240965=Agency Contact: Wendy Tuttle, Health Insurance Specialist, Department of Health and Human Services, Centers for Medicare & Medicaid Services, Center for Medicaid and State Operations, Mail Stop S2-14-26, 7500 Security Boulevard, Baltimore, MD 21244, Phone: 410 786-8690, Email: wendy.tuttle@cms.hhs.gov., 229583=Legal Authority: 42 U.S.C. 1821; 42 U.S.C. 1861 (ff) (3)(B)(i)(ii); 42 U.S.C. 1913 (c)(1) et al, 114923=Agency Contact: Cherisa Henderson, Nutritionist, Department of Health and Human Services, Food and Drug Administration, HFS-830, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 202 402-1450, Fax: 301 436-1191, Email: cherisa.henderson@fda.hhs.gov., 152518=Agency Contact: Samir Assar, Supervisory Consumer Safety Officer, Department of Health and Human Services, Food and Drug Administration, Center for Food Safety and Applied Nutrition, Office of Food Safety, 5100 Paint Branch Parkway, College Park, MD 20740, Phone: 240 402-1636, Email: samir.assar@fda.hhs.gov., 180547=Agency Contact: Sharon Benz, Department of Health and Human Services, Food and Drug Administration, Center for Veterinary Medicine, MPN-4, Room 2648, HFV-220, 7529 Standish Place, Rockville, MD 20855, Phone: 240 453-6864, Email: sharon.benz@fda.hhs.gov., 145114=Agency Contact: Janet Norden, Consumer Safety Officer, Department of Health and Human Services, Food and Drug Administration, Center for Drug Evaluation and Research, WO 51, Room 6324, 10903 New Hampshire Avenue, Silver Spring, MD 20993-0002, Phone: 301 796-2500, Email: janet.norden@fda.hhs.gov., 149852=Legal Authority: 21 U.S.C. 342; 21 U.S.C. 350h; 21 U.S.C. 371; 42 U.S.C. 264; Pub. L. 111-353 (signed on Jan. 4, 2011)}",
    "textBeforeTable": "Executive Secretary to the Department. Jennifer M. Cannistra, Dated: April 22, 2013. The rulemaking abstracts included in this paper issue of the Federal Register only cover, as required by the Regulatory Flexibility Act of 1980, those prospective HHS rulemakings likely to have a significant economic impact on a substantial number of small entities. The Department's complete Regulatory Agenda is accessible online at http://www.RegInfo.gov. The purpose of the agenda is to encourage more effective public participation in the regulatory process. HHS is currently furthering this goal by engaging in a Department-wide effort to identify ways to make the rulemaking process more accessible to the general public. This effort is in response to President Obama's January 18, 2011, Executive Order 13563, “Improving Regulation and Regulatory Review,” which requires ongoing retrospective review of current agency regulations and encourages federal agencies to develop balanced regulations through a process that “allows for public participation and an open exchange of ideas.” HHS's efforts include stakeholder outreach and continuing to update its main regulatory Web page (http://www.HHS.gov/Regulations) with information helpful to the public. For example, to encourage public participation, the Web page includes links to HHS rules currently open for public comment and provides a “regulations toolkit” with background information on regulations, the commenting process, and how the public can provide effective comments. HHS also",
    "textAfterTable": "Food and Drug Administration—Proposed Rule Stage Back to Top Sequence No. Title Regulation Identifier No. 3 Food Labeling; Revision of the Nutrition and Supplement Facts Labels 0910-AF22 4 Serving Sizes of Foods That Can Reasonably Be Consumed in One Eating Occasion; Dual Column Labeling; Updating, Modifying and Establishing Certain Reference Amounts Customarily Consumed 0910-AF23 5 Over-the-Counter (OTC) Drug Review—Cough/Cold (Antihistamine) Products 0910-AF31 6 Over-the-Counter (OTC) Drug Review—Internal Analgesic Products 0910-AF36 7 Over-the-Counter (OTC) Drug Review—Topical Antimicrobial Drug Products 0910-AF69 8 Laser Products; Proposed Amendment to Performance Standard 0910-AF87 9 Updated Standards for Labeling of Pet Food 0910-AG09 10 Current Good Manufacturing Practice, Hazard Analysis, and Risk-Based Preventive Controls for Food for Animals 0910-AG10 11 Over-the-Counter (OTC) Drug Review—Pediatric Dosing for Cough/Cold Products 0910-AG12 12 Electronic Distribution of Prescribing Information for Human Prescription Drugs Including Biological Products 0910-AG18 13 Amendment to the Current Good Manufacturing Practice Regulations for Finished Pharmaceuticals—Second Phase 0910-AG20 14 Produce Safety Regulation 0910-AG35 15 Hazard Analysis and Risk-Based Preventive Controls 0910-AG36 16 “Tobacco Products” Subject to the Federal Food, Drug, and Cosmetic Act, as Amended by the Family Smoking Prevention and Tobacco Control Act",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}