{
    "relation": [
        [
            "Item",
            "Kitchen Cabinets, upper",
            "Kitchen Cabinets, lower",
            "Kitchen Table",
            "Dining Room Table",
            "Sofa",
            "Chairs (2)"
        ],
        [
            "Material",
            "Pine",
            "Pine",
            "Pine",
            "Pine",
            "Upholstered cushion",
            "Upholstered cushion"
        ],
        [
            "Size",
            "1.68 m wide, 0.4 m deep, 0.6 m high",
            "1.68 m wide, 0.6 m deep, 0.9 m high",
            "1.05 m deep, 0.2 m thick, 1.0 m high",
            "1.2 m deep, 0.2 m thick,0.8 m high",
            "1.6 m wide, 0.63 m deep, 0.8 m high",
            "0.84 m wide, 0.80 m deep, 1.20 m high"
        ]
    ],
    "pageTitle": "interFIRE, A site dedicated to improving fire investigation worldwide.",
    "title": "",
    "url": "http://www.interfire.org/features/nist_iowa_report.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 508108123,
    "recordOffset": 508086303,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31387=At approximately 8:48 AM, as a second fire crew made entry into the house and began to attack the fire with a hose line, a firefighter was discovered on the floor of the living room. Later the other two firefighters from the first crew were found on the second floor. One on the landing at the top of the stairs with a child victim and another in the doorway of the front bedroom. All three firefighters and the one child found in the house, and the two children taken to the hospital died from injuries caused by the fire., 40741=08:24, 73621=In Figure 18, a distinct two-layer environment can be seen in the living and the dining room at 485 s into the simulation or approximately 8:32 AM. In the living room the upper or hot gas layer temperatures are approximately 200 °C to 300 °C (390 °F to 570 °F). In the dining room the hot gas temperatures are approximately 300 °C to 450 °C (570 °F to 840 °F). In both rooms, temperatures near the floor are near ambient. Gas temperatures in excess of 600 °C (1110 °F) can be seen near the top of the kitchen doorway and at the top of the kitchen window., 46148=08:33, 45129=08:31, 47185=08:34, 79619=The critical event in this fire was the on-set of conditions consistent with flashover in the kitchen. At this point, approximately 8:32 AM, this fire started a transition from a single room and contents fire with smoke throughout the structure, to a fire that involved the majority of the structure within approximately 60 s. The hot gas layer temperatures in the living room increased from approximately 200 °C to 300 °C (390 °F to 570 °F) to more than 600 °C (1110 °F) in less than a minute. The hot gases and flames continued to spread rapidly from the living room through the stairway to the second floor. This quick change in thermal conditions and flame spread through the duplex led to the 3 firefighters being trapped inside and succumbing to the effects of the fire environment., 72681=The simulation results in Figures 18 through 20 have had the outer walls removed to provide a clear view. The results are shown as a \"slice\" or a \"plane\" with a color bar that represents the corresponding numerical quantities. These figures provide \"snapshots\" of the calculated fire environment conditions that the firefighters may have been exposed to between 8:32 AM and 8:34 AM., 49300=08:48, 74245=Figure 19 shows the same thermal planes, 55 s later at 540 s of the simulation. By this time, gases in excess of 600 °C (1110 °F) had spread across both the dining room and the living room, potentially igniting the combustible surfaces in the top portion of these rooms. Other gases, hotter than the ignition temperature of wood, are shown leaving the kitchen window and spreading up the outside of the house. This rapid change is consistent with a flashover occurring in the kitchen., 74767=Figure 20 displays the plane of temperatures aligned with the center of the stairs, 0.4 m (1.3 ft) into the house from the shared interior wall. Approximately 600 s or 10 min into the simulation, gases in excess of 600 °C (1110 °F) have filled the open stairwell., 44096=08:28, 41858=08:26, 28299=On the morning of December 22, 1999, a fire started in plastic materials on top of the stove in the kitchen on the first floor of the residence. An adult occupant, sleeping upstairs in the front bedroom, awoke to the cries of a child. The adult opened the front bedroom door to the hall and found hot smoky conditions. The adult returned to the front bedroom, opened a window on the front side of the house and called for help, alerting several neighbors. It is believed that the calls to 911 began shortly after this. The first call was received by the dispatcher's office at approximately 8:24 AM. The adult returned to the smoky upstairs hallway, found the crying child and exited the residence by the front bedroom window onto the roof of the front porch. Approximately two minutes later, 8:26 AM, firefighters and police began, 48258=08:35, 77932=Figures 21 through 24 show a series of views of the simulation that approximate the flame spread through the structure. The iso-surface simulation provides a three dimensional approximation of the flame surface area where fuel, heat and oxygen are present such that flames may exist. The flames can be seen covering the top of the stove at approximately 220 s or 8:28 AM, in figure 21. Approximately 4 minutes later, at 8:32 AM the fire has spread across the kitchen ceiling and has vented through the kitchen window as shown in figure 22. Figure 23 presents a side view of the house at approximately 8:33 AM. The flame front has extended through the dining room and into the living room. The final figure in the series, figure 24, shows the estimated flame sheet spreading up the stairway at 600 s of simulation time or 8:34 AM. This series of figures is another demonstration of how rapidly the fire grew and quickly the flames spread through the house, trapping the firefighters., 42978=08:27, 24337=This report describes the results of calculations using the NIST Fire Dynamics Simulator (FDS) that were performed to provide insight on the thermal conditions that may have occurred during a fire in a two-story duplex house on December 22, 1999 in Iowa. Input to the computer model was developed from 3 sources; investigators from the Bureau of Alcohol Tobacco and Firearms (ATF), investigators with the National Institute for Occupational Safety and Health (NIOSH) and from material properties taken from the FDS database., 26854=On December 22, 1999 a fire in a two story duplex house in Iowa claimed the lives of three children and three firefighters. The fire occurred in the right half of a two story duplex as shown in Figure 1. In this figure, the entry doors to the two units are located next to each other, under the porch roof on the left side of the photograph. The backside of the house is shown in Figure 2. The heavily damaged area on the 1st floor is the kitchen and the area above on the 2nd floor is the rear bedroom. Plan views of the first and second floor are shown in figures 3 and 4.}",
    "textBeforeTable": "In addition to wood dining furniture, a cut evergreen tree was located in the Dining Room. The tree's contribution to the fire was estimated by adding the heat release rate from a 2.5 m tall, 1.2 m wide Scotch Pine with a mass of 9.5 kg [6]. The peak heat release rate was approximately 1.6 MW. This was the smallest tree used in the referenced study and it appeared to be the best representation of the tree that was in the house. As a point of reference, the maximum peak heat release rate from a burning cut pine tree measured in the referenced study was 5.2 MW. In the model, the tree is represented by a rectangular box, 1.26 m by 0.8 m and 0.2 m above the floor. The box is the source of the energy emitted by the tree, much like a gas burner. In one of the simulations, the tree was assumed to have ignited based on the thermal conditions in the dining room at 400 s. This did not significantly change the fire conditions in the structure and therefore the additional heat release rate input was eliminated from the final model simulation presented here. Table 4. Furniture Materials and Size 1.2E-6 0.20 700 370 0.10 Upholstered Cushion 8.3E-8 0.14 200 390 0.008 Thin Pine 8.3E-8 0.14 200",
    "textAfterTable": "Ignition Fire The fire started in plastic material on top of the stove. This fire source was approximated as a rectangular object representing the stove with a specified heat release rate coming out of a opening on the top. The \"stove\" can be seen in figure 15. The opening, which represents the fire area on top of the stove, is 0.4 m wide by 0.84 m deep and 1.0 m above the floor. The heat release rate of the fire was assumed to grow slowly, reaching a peak of approximately 400 kW in 270 s. The actual fire may have taken longer to develop; the actual ignition time of the fire is unknown. The simulation was started with a flaming ignition that corresponded to the approximate time at which the adult occupant and the neighbors became aware of the fire. MODEL RESULTS Structure and Contents Simulation Figure 13 shows a front perspective view of the right side unit of the duplex from the Smokeview model. The outer box frame lines represent the volume modeled. The solid base is used to indicate the inert first floor material. The closed front door, the partially open front bedroom window and the porch roof can be seen on the front side of the house. Figure 14 provides a side view of the model. The figure shows the front of the duplex on the left, moving",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}