{
    "relation": [
        [
            "Release",
            "12.3(7)T",
            "12.4(2)T"
        ],
        [
            "Modification",
            "This command was introduced.",
            "The closed-loop, open-loop, and coarse keywords were added."
        ]
    ],
    "pageTitle": "Cisco IOS Interface and Hardware Component Command Reference - clock rate through cut-through [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/interface/command/ir-cr-book/ir-c2.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357767803,
    "recordOffset": 357701698,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9149=2400, 9307=1200, 14987=For the synchronous serial port adapters (PA-8T-V35, PA-8T-X21, PA-8T-232, and PA-4T+), a nonstandard clock rate can be used. You can enter any value from 300 to 8000000 bps. The clock rate you enter is rounded (adjusted), if necessary, to the nearest value that your hardware can support except for the following standard rates: 1200, 2400, 4800, 9600, 14400, 19200, 28800, 38400, 56000, 64000, 128000, or 2015232., 16169=Desired clock rate, in bits per second: 1200, 2400, 4800, 9600, 19200, 38400, 56000, 64000, 72000, 125000, 148000, 250000, 500000, 800000, 1000000, 1300000, 2000000, 4000000, or 8000000, 2084=For Cisco 2600 and Cisco 3600 series routers, the minimum value for ADSL and G.SHDSL is 1 Mbps. The maximum value is 7 Mbps for mainboard slots and 5.3 Mbps for network modules. The default value for ADSL and G.SHDSL is 2.6 Mbps for both mainboard slots and network modules ., 522=To make full use of the 2.3 Mbps bandwidth for Voice over ATM (VoATM) nonswitched trunk calls on G.SHDSL, you can change the 1 Mbps default value on Cisco 2600 and Cisco 3600 series routers and configure the AAL2 clock rate as 2.6 Mbps.}",
    "TableContextTimeStampAfterTable": "{312304=This command was implemented on Cisco 1800 series routers., 6500=The maximum data rate between an SCC and a DSL WIC depends primarily on the maximum clock rate that the SCC can support. For example, on the Cisco 2600 series mainboard, which supports two DSL WICs, the total SCC clock rate that can be configured for both WICs is 8 Mbps. Therefore, if only one DSL WIC is present on the mainboard, AAL5 and AAL2 clock rates can be configured to 7 Mbps and 1 Mbps, respectively. If two DSL WICs are supported on the mainboard, the total of 8 Mbps should be distributed among the four SCCs., 229672=To configure compression using the Microsoft Point-to-Point Compression (MPPC) algorithm on your data compression Advanced Interface Module (AIM) for the Cisco 2600 series router, use the compressmppccommand in interface configuration mode. To disable MPPC compression, use the no form of this command., 256787=On the Cisco 2900 series (Cisco 2901 ISRs do not support vlan connect in configuring the HIMI backplane feature.) and Cisco 3900 series routers, if your ISM or SM supports the HIMI backplane and VLAN connection, the module interconnection between the GE port (with the exception of onboard GE ports) on any slot is permitted at any given time., 40777=The command was introduced as an ATM interface configuration command for the Cisco 2600 and 3600 series routers., 7045=Network module SCCs also pose similar limitations. That is, on the Cisco 2600 series, the total clock rate for all four SCCs is 8 Mbps. The maximum AAL5 clock rate that may be configured on a network module is 5.3 Mbps. On the Cisco 1700 series, the maximum configurable SCC clock rate for both AAL5 and AAL2 is 8 Mbps., 247321=To create a connection between two Gigabit Ethernet (GE) enhanced network modules (ENMs) or between the GE port on an installed small-form-factor-pluggable (SFP) module and a GE ENM, or between the GE port on a switch module (SM) and another SM GE port, on a Cisco 2900 series (Cisco 2901 ISRs do not support the HIMI backplane feature.), 3800 series, or 3900 series Integrated Services Router (ISR), use the connect command in global configuration mode. To deactivate a connection between two GE modules on a Cisco 3800 series router, use the no form of this command., 951=For Cisco 2600 and Cisco 3600 series routers, the minimum value for ADSL and G.SHDSL is 1 Mbps. The maximum value is 7 Mbps for mainboard slots and 5.3 Mbps for network modules. The default value for ADSL and G.SHDSL is 2.6 Mbps for both mainboard slots and network modules., 311301=This command was introduced on Cisco 2600 series and Cisco 3700 series routers., 140889=This command was introduced in controller configuration mode for Cisco 2600 series and Cisco 3660 routers., 116885=The command was introduced as a J1 controller configuration command for the Cisco 2600 and Cisco 3600 series., 259687=To create a connection between two GE modules on a Cisco 2900 (Cisco 2901 ISRs do not support the HIMI backplane feature.), 3800, and 3900 series routers using the High-Speed Intrachassis Module Interconnect (HIMI) feature, use the connectconnection-namemodule module1 channel-id1 module module2 channel-id2 command in global configuration mode:, 160859=This command was introduced on the following platforms: Cisco 2650XM, Cisco 2651XM, Cisco 2691, Cisco 3660 series, Cisco 3725, and Cisco 3745 routers., 311626=This command was integrated into Cisco IOS Release 12.3(7)T on Cisco 2600 series and Cisco 3700 series routers., 155025=On a Cisco 2600 or Cisco 3600 series router, the following example specifies an internal clock source for the link:, 20906=1200, 2400, 4800, 9600, 19200, 38400, 56000, 64000, 311984=This command was implemented on Cisco 2800 and Cisco 3800 series routers., 141544=This command was implemented on the Cisco 2691 and the Cisco 3700 series., 3954=This command was integrated into Cisco IOS Release 12.3(2)T for the following platforms: Cisco 1721, Cisco 2610XM-2651XM, Cisco 2691, and Cisco 3660., 219162=Cisco 1000 Series, 38665=ATM interface configuration for the Cisco 2600 and 3600 series routers., 42860=On a Cisco 2600 or 3600 series router, the following example specifies an internal clock source for the link:, 29353=Network clock rate, in kbps per second. The range is from 56 to 2048. The value entered should be a multiple of the value set for the network-clockbase-rate command. There is no default rate., 299085=The j1keyword was added for the Cisco 2600 and Cisco 3600 series., 163=You should change the AAL2 default value on Cisco 2600 and Cisco 3600 series routers only if you are using G.SHDSL for VoATM nonswitched trunk calls using an NM-HDV. At all other times, the default for AAL2 should remain at 1 Mbps for ADSL and G.SHDSL., 259195=This command was modified to support the Cisco 3900 series and 2900 series (Cisco 2901 ISRs do not support the HIMI backplane feature.) ISR release., 7930=The following example shows how to set the clock rate to 2 Mbps for AAL5 and to 1.3 Mbps for AAL2 for a Cisco 2600 or Cisco 3600 series router:, 248853=To create a dedicated connection between two GE ENMs, or between the GE port on an SFP module and a GE ENM, or between the GE port on a SM and another SM GE port, for the purpose of sending data on a specified VLAN on a Cisco 3900 series or 2900 series (Cisco 2901 ISRs do not support vlan connect in configuring the HIMI backplane feature.), use the connect command in global configuration mode with the vlanvlan-id syntax. To deactivate a connection between two GE interfaces on a Cisco 3900 series router, 2900 series (Cisco 2901 ISRs do not support vlan connect in configuring the HIMI backplane feature.), use the no form of this command., 152936=The command was introduced as an ATM interface configuration command for the Cisco 2600 and Cisco 3600 series routers., 401968=The following example configures a CTunnel from one router to another and shows the CTunnel destination set to 49.0001.1111.1111.1111.00. The ctunnel mode is set to gre to transport IPv6 packets., 262501=To create a connection between two GE SMs, to send data on a specified VLAN, on a VLAN on a Cisco 2900 (Cisco 2901 ISRs do not support the HIMI backplane feature.), and 3900, use the connect command with the with the vlanvlan-id syntax., 13157=Desired clock rate, in bits per second (bps): 1200, 2400, 4800, 9600, 19200, 38400, 56000, 64000, 72000, 125000, 148000, 250000, 500000, 800000, 1000000, 1300000, 2000000, 4000000, or 8000000, 150810=Interface configuration ATM interface configuration for the Cisco 2600 and Cisco 3600 series routers, 328469=This command was integrated into Cisco IOS Release 12.2(11)YT and implemented on the following platforms: Cisco 2650XM, Cisco 2651XM, Cisco 2691, Cisco 3660 series, Cisco 3725, and Cisco 3745 routers., 21356=200, 300, 400, 600, 800, 1200, 1800, 2400, 3200, 3600, 4800, 6400, 7200, 8000, 9600, 12000, 12800, 14400, 16000, 16800, 19200, 24000, 28800, 32000, 38400, 48000, 56000, 57600, 64000, 76800, 84000, 96000, 112000, 115200, 128000, 144000, 168000, 192000, 224000, 230400, 256000, 288000, 336000, 384000, 448000, 512000, 672000, 768000, 772000, 896000, 1024000, 1152000, 1344000, 1536000, 1544000, 1792000, 1920000, 2048000, 721=aal5 --For Cisco 1700 series routers, the minimum value for ADSL and G.SHDSL is 4 Mbps. The default value for ADSL and G.SHDSL is 8 Mbps., 14345=For some synchronous serial port adapters a nonstandard clock rate can be used. Refer to the hardware documentation for specific supported Lvalues. You can enter any value from 300 to 8000000 bps. The clock rate you enter is rounded (adjusted), if necessary, to the nearest value that your hardware can support except for the following standard rates: 1200, 2400, 4800, 9600, 14400, 19200, 28800, 38400, 56000, 64000, 128000, or 2015232.}",
    "textBeforeTable": "Syntax Description rate clock no bps rate clock To configure the clock rate for the hardware connections on serial interfaces such as network interface modules (NIMs) and interface processors to an acceptable bit rate, use the clockrate command in interface configuration mode. To remove the clock rate if you change the interface from a DCE to a DTE device, use the no form of this command. Using the no form of this command on a DCE interface sets the clock rate to the hardware-dependent default value. clock rate cut-through ctunnel mode crc-threshold crc4 crc bits 5 crc copy tftp lex copy flash lex controller t3 controller sonet-acr controller sonet controller e3 controller dwdm controller dsl controller control-lead state control-lead sampling-rate connect (module) compress stac caim compress mppc compress cmt disconnect cmt connect clock-port clock switchover clock source (T3 E3 controller) clock source (T1 E1 interface)",
    "textAfterTable": "Command Modes Interface configuration Command History Release Modification 10.0 This command was introduced. 11.3 This command was modified to include nonstandard clock rates for the PA-8T-V35, PA-8T-X21, PA-8T-232, and PA-4T+ synchronous serial port adapters. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware. Usage Guidelines Cable Length Be aware that the fastest speeds might not work if your cable is too long, and that speeds faster than 148,000 bits per second are too fast for EIA/TIA-232 signaling. It is recommended that you only use the synchronous serial EIA/TIA-232 signal at speeds up to",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}