{
    "relation": [
        [
            "",
            "Lapatinib With Paclitaxel",
            "Placebo With Paclitaxel"
        ],
        [
            "Description",
            "Participants received lapatinib 1500 mg orally OD with paclitaxel 175 m^2 IV over the course of 3 hours, every 3 weeks. The treatment group was stratified by sites of metastatic disease and stage of disease. Participants were treated until disease progression, unacceptable toxicity, or consent withdrawal.",
            "Participants received matching placebo orally OD with paclitaxel (175 mg/m^2 IV) over the course of 3 hours, every 3 weeks. The treatment group was stratified by sites of metastatic disease and stage of disease. Participants were treated until disease progression, unacceptable toxicity, or consent withdrawal."
        ]
    ],
    "pageTitle": "Paclitaxel With / Without GW572016 (Lapatinib) As First Line Therapy For Women With Advanced Or Metastatic Breast Cancer - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00075270?sect=Xk0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00131-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 853773947,
    "recordOffset": 853759086,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups A total of 580 participants were enrolled and randomized to treatment; however one participant withdrew from the study before taking any medication. Thus, only 579 participants were included in the Intent-to-Treat Population (comprised of all randomized participants who had received at least one dose of randomized therapy [lapatinib or placebo]). Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Paclitaxel Drug: GW572016 (Lapatinib) Interventions: Neoplasms, Breast Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment",
    "textAfterTable": "Participant Flow:   Overall Study     Lapatinib With Paclitaxel     Placebo With Paclitaxel   STARTED     291     288   Missing     26 [1]   13 [1] COMPLETED     5     4   NOT COMPLETED     286     284   Withdrawal by Subject                 28                 21   Lost to Follow-up                 25                ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}