{
    "relation": [
        [
            "Talent",
            "Summon Felguard",
            "Demonic Knowledge",
            "Dark Arts",
            "Demonic Embrace",
            "Fel Synergy",
            "Demonic Aegis",
            "Demonic Rebirth",
            "Mana Feed",
            "Master Summoner",
            "Demonic Empowerment",
            "Impending Doom",
            "Improved Health Funnel",
            "Aura of Foreboding",
            "Hand of Gul'dan",
            "Molten Core",
            "Ancient Grimoire",
            "Decimation",
            "Inferno",
            "Cremation",
            "Demonic Pact",
            "Metamorphosis"
        ],
        [
            "Requirements",
            "None",
            "None",
            "None",
            "None",
            "None",
            "5 Demonology",
            "5 Demonology",
            "5 Demonology",
            "5 Demonology",
            "10 Demonology",
            "10 Demonology",
            "10 Demonology",
            "15 Demonology, Hand of Gul'dan",
            "15 Demonology",
            "15 Demonology",
            "20 Demonology",
            "20 Demonology",
            "20 Demonology, Hand of Gul'dan",
            "25 Demonology, Inferno",
            "25 Demonology",
            "30 Demonology"
        ],
        [
            "Effect",
            "Summons a Felguard under the command of the Warlock.",
            "Increases your Fire and Shadow spell damage by 15%.",
            "Reduces the cast time of your Imp's Firebolt spell by 0.25 sec, increases the damage done by your Felguard's Legion Strike by 5%, and increases the damage done by your Felhunter's Shadow Bite by 5%.",
            "Increases your total Stamina by 4%.",
            "You have a 50% chance to heal your pet for 15% of the amount of spell damage done by you.",
            "Increases the amount of health generated through spells and effects granted by your Demon Armor by an additional 5%, and increases the amount of health regenerated by your Fel Armor by 50%.",
            "If your summoned demon dies, you gain the Demonic Rebirth effect reducing the cast time of your next summon demon spell by 50%. Lasts for 10 sec. This effect has a 2 min cooldown.",
            "When your summoned demon critically hits with its Basic Attack, you instantly gain 2% total mana. When you gain mana from Drain Mana or Life Tap spells, your summoned demon gains 30% of the mana you gain.",
            "Reduces the casting time of your Imp, Voidwalker, Succubus, Felhunter and Felguard Summoning spells by 0.5 sec and the Mana cost by 50%.",
            "Grants the Warlock's summoned demon Empowerment. Imp - Instantly heals the Imp for 30% of its total health. Voidwalker - Increases the Voidwalker's health by 20%, and its threat generated from spells and attacks by 20% for 20 sec. Succubus - Instantly vanishes, causing the Succubus to go into an improved Invisibility state. The vanish effect removes all stuns, snares and movement impairing effects from the Succubus. Felhunter - Dispels all magical effects from the Felhunter. Felguard - Instantly removes all stun, snare and movement impairing effects from your Felguard and makes your Felguard immune to them for 15 sec.",
            "Increases the chance for your Bane of Doom to summon a demon by 10% when it deals damage. Also grants your Shadow Bolt, Hand of Gul'dan, and Incinerate spells a 5% chance to reduce the cooldown of your Demon Form by 15 sec.",
            "Increases the amount of Health transferred by your Health Funnel spell by 10% and reduces the health cost by 10%. In addition, your summoned Demon takes 15% less damage while under the effect of your Health Funnel.",
            "When your Hand of Gul'dan lands, all enemies within 4 yards will be rooted for 2 sec and stunned for the same duration if they are still within the Curse of Gul'dan aura 6 sec afterward.",
            "Summons a falling meteor down upon the enemy target, dealing 83 to 97 Shadow damage and erupts an aura of magic within 4 yards, causing all targets within it to have a 10% increased chance to be critically hit by any Warlock demons. The aura lasts for 15 sec.",
            "You have a 2% chance to gain the Molten Core effect when your Immolate deals damage. The Molten Core effect empowers your next 3 Incinerate spells cast within 15 sec, increasing damage done by 6% and reduces cast time by 10%.",
            "Increases the duration of your Infernal and Doomguard summons by 10 sec.",
            "When you Shadowbolt, Incinerate or Soul Fire a target that is at or below 25% health, the cast time of your Soul Fire spell is reduced by 20% for 10 sec.",
            "Increases the radius of your Hellfire by 10 yards, and you can now channel Hellfire while moving.",
            "Increases the damage done by your Hellfire by 15%, and your Hand of Gul'dan has a 50% chance to refresh the duration of your Immolate on the target.",
            "Increases your spell damage by 2%, and your summoned demon grants the Demonic Pact effect to all nearby friendly party and raid members.",
            "You transform into a Demon for 30 sec. This form increases your armor by 600%, damage by 20%, reduces the chance you'll be critically hit by melee attacks by 6% and reduces the duration of stun and snare effects by 50%. You gain some unique demon abilities in addition to your normal abilities. 3 minute cooldown."
        ]
    ],
    "pageTitle": "World of Warcraft: Cataclysm Primer - GameSpot",
    "title": "",
    "url": "http://www.gamespot.com/articles/world-of-warcraft-cataclysm-primer/1100-6285758/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456982711,
    "recordOffset": 456897169,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{239627=Goblins have two racial abilities that share the same timer. Rocket Jump will allow you to jump forward a short distance. The Rocket Barrage shoots the rockets forward and deals around 24-30 damage at level one. This damage increases as you level, up to a possible 2000 or more damage. The cooldown for bother racial abilities is 2 minutes., 237311=The Goblin starting area is Kezan, a tropical island and the site of a slave mining camp. The starting story and quests will showcase the Goblin's shady past and escape from potential slavery. Goblins will eventually meet with the Horde and will take refuge in Orgrimmar. They can continue along following the Orc storyline., 244205=Another ability for Goblins is Pack Hobgoblin, which will call in a Hobgoblin and grant bank access for 1 minute. This ability has a 30 minute cooldown. The Goblin mount is the Trike, which can be bought inside Orgrimmar., 253784=Archeology is the new secondary profession that can be learned at level 20 or above. Some trainers include Harrison Jones in Stormwind and Belloc Brightblade in Orgrimmar. The main ability of use is Survey, which will deploy a device that will measure the distance to an Archaeology Fragment. When the Survey flashes green, it means a Fragment is in 50 yards. If you Survey within 5 yards of a digsite, you will automatically receive the hidden Fragment. If you fail at finding a Fragment three times in a row, the digsite will despwn.}",
    "textBeforeTable": "Protection When you dual-wield one-handed weapons, you deal 15% additional damage and Slam hits with both weapons. 30 Fury Sing-Minded Fury Allows you to equip two-handed axes, maces and swords in one hand. 30 Fury Titan's Grip Reduces the cooldown of your Intercept and your Heroic Leap. 25 Fury Skirmisher Your Bloodthirst hits have a chance of making your next Slam instant and free for 10 sec. 25 Fury, Raging Blows Bloodsurge Reduces the cooldown of your Berserker Rage, Recklessness and Death Wish abilities. 20 Fury Intensify Rage Dealing damage with Cleave or Whirlwind increases the damage of Cleave and Whirlwind for 10 sec. This effect stacks up to 3 times. 20 Fury Meat Cleaver Your autoattacks have a chance to reduce all healing done to the target by 10% for 10 sec. 20 Fury Furious Attacks Removes any Immobilization effects and refreshes the cooldown of your Intercept ability. 15 Fury Heroic Fury Increases the critical strike chance of all party and raid members within 100 yards by 5%. In addition, improves your critical strike chance by an additional 2%. 15 Fury, Raging Blow Rampage A mighty blow that deals 110% weapon damage from both melee weapons. Can only be used while Enraged. 15 Fury, Death Wish Raging Blow Increases your parry chance by 100% whenever you are brought to 20% health or",
    "textAfterTable": "Sword and Board 25 Protection, Devastate Increases the critical strike chance of Devastate. In addition, when your Devastate or Revenge deal damage, they have a chance of refreshing the cooldown of your Shield Slam and reducing its cost by 100% for 5 sec. Shockwave 30 Protection Sends a wave of force in front of you, causing damage (based on attack power) and stunning all enemy targets within 10 yards in a frontal cone for 4 sec. Paladin New Race/Class Combos: Tauren Level 1 Bonus Attributes: 2 STR 2 STA 1 SPI Holy Talent Requirements Effect Holy Shock None Blasts the target with Holy energy, causing Holy damage to an enemy, or healing to an ally, and grants a charge of Holy Power. Walk in the Light None Increases the effectiveness of your healing spells by 15%. Meditation None Allows 50% of your mana regeneration from Spirit to continue while in combat. Arbiter of the Light None Increases the critical effect chance of your Judgment and Templar's Verdict. Protector of the Innocent None Casting a targeted heal on any target, except yourself, also heals you. Judgments of the Pure None Your Judgment increases your casting and melee haste for 1 min.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}