{
    "relation": [
        [
            "",
            "first set (left to right)",
            "second set (right to left)"
        ],
        [
            "first term in set",
            "2",
            "3"
        ],
        [
            "second term in set",
            "3",
            "4"
        ],
        [
            "",
            "Point of difference occurs at the beginning of the sets. 2 (first set) is less than 3 (second set)",
            "first set of locants is preferred"
        ]
    ],
    "pageTitle": "Chemistry Tutorial : Introduction to IUPAC Naming for Carbon Compounds",
    "title": "",
    "url": "http://www.ausetute.com.au/namctut1.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 298365547,
    "recordOffset": 298351871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66947=AUS-e-NEWS is emailed out in December, March, June, and September., 60688=3IUPAC is the abbreviation for the International Union of Pure and Applied Chemistry. IUPAC nomenclature began in 1892 when an international assembly of Chemists met in Geneva, Switzerland, to try to come up with a rational system for naming organic molecules. The rules for naming organic compounds are still being developed. The most recent document for referral is \"Preferred names in the nomenclature of organic compounds\" (Draft 7 October 2004). This document supercedes 'Nomenclature of Organic Chemistry, 1979 Edition' and 'A Guide to IUPAC Nomenclature of Organic Compounds, Recommendations 1993'. The current document recognises that there is more than one way to systematically name organic compounds, and develops rules for assigning \"preferred IUPAC names\", but any other name, as long as it is unambiguous and follows the principles of the IUPAC recommendations is acceptable as a \"general IUPAC name\". As a result, there are examples of \"preferred IUPAC\" names that are based on the tradition of use, rather than a system of naming. Examples of these traditional names that students may be expected to know are acetone, acetic acid and its derivatives such as ethyl acetate and acetic anhydride, formic acid and its derivatives such as ethyl formate.}",
    "lastModified": "Fri, 26 Dec 2014 22:10:24 GMT",
    "textBeforeTable": "Compare the two sets side by side Numbering from right to left produces the locant set 3,4 for the methyl groups   Numbering from left to right produces the locant set 2,3 for the methyl groups   | H   | H   | H   | H   | H   -H C1 - C2 - C3 - C4 - C5 H-   H |   H |   CH3 |   CH3 |   H |       | H   | H   | H   | H   | H   -H C5 - C4 - C3 - C2 - C1 H-   H |   H |   CH3 |   CH3 |   H |   If more than one of the same structural feature is present, then a",
    "textAfterTable": "Locants should always be included in the IUPAC name unless: the compound is an alkanoic acid or alkanedioc acid example: CH3-CH2-CH2-COOH is named as butanoic acid (not butan-1-oic acid) example: HOOC-CH2-CH2-COOH is named as butanedioc acid (not as butane-1,4-dioic acid) the compound is an alkanal example: CH3-CH2-CHO is propanal (not propan-1-al) the compound contains only one carbon atom example: CH3Cl is chloromethane (not 1-chloromethane) the compound contains only two carbon atoms and only one functional group is present example: CH3-CH2-OH is named ethanol (not ethan-1-ol) the compound results from the single substitution of a hydrogen atom on a benzene ring or cyclic alkane example: HBr     named as bromobenzene (not 1-bromobenzene) all substitutable positions are completely substituted example: CF3-CF2-CF2-COOH is named heptafluorobutanoic acid (not 2,2,3,3,4,4,4-heptafluorobutanoic acid) Construction of Substitutive Names: Multiplying Prefixes When more than one instance of the same structural feature is present in a molecule, a multiplying prefix is used which tells us how many there are.   multiplying Prefixes number (1) 2 3 4 5 6 7 8 9 10 prefix (hen) di tri tetra penta hexa hepta octa nona deca number 11 20 30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}