{
    "relation": [
        [
            "Time (ET)",
            "1:00am",
            "4:30am",
            "11:00pm"
        ],
        [
            "Program",
            "International Fellowship of Christians and Jews",
            "International Fellowship of Christians and Jews",
            "International Fellowship of Christians and Jews"
        ],
        [
            "Speaker",
            "Rabbi Yechiel Eckstein",
            "Rabbi Yechiel Eckstein",
            "Rabbi Yechiel Eckstein"
        ]
    ],
    "pageTitle": "International Fellowship of Christians and Jews | The Word Network",
    "title": "",
    "url": "http://www.thewordnetwork.org/programs/international-fellowship-of-christians-and-jews/2013-03-03",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 745886567,
    "recordOffset": 745870305,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2263=The International Fellowship of Christians and Jews, begun in 1983 as an effort to promote better understanding and cooperation between Christians and Jews, is today the largest and most trusted organization in the world supporting Israel and helping her people, and the largest charity in the Holy Land. .}",
    "lastModified": "Mon, 03 Aug 2015 21:17:10 GMT",
    "textBeforeTable": "Sunday, March 3, 2013 Next Week Week of Sunday, March 03, 2013 Last Week Broadcast Schedule The Fellowship has provided humanitarian aid to millions of people in more than 20 countries, and its robust communications network—including teaching, television and radio programs, and web contacts—reaches many millions more in some 100 countries each day, creating an enormous groundswell of aid and good will. The Fellowship now raises more than $110 million per year—mostly from Christians—and has nearly two million supporters and advocates. The Fellowship, with offices in Jerusalem, Chicago, Toronto, Seoul, and Queensland, Australia, has raised more than $800 million for this work. : Led by its founder and president Rabbi Yechiel Eckstein, The Fellowship provides humanitarian aid to the needy in Israel and in Jewish communities around the world, promotes prayer and security on behalf of the Jewish state, and builds bridges of understanding between Christians and Jews. The International Fellowship of Christians and Jews, begun in 1983 as an effort to promote better understanding and cooperation between Christians and Jews, is today the largest and most trusted organization in the world supporting Israel and helping her people, and the largest charity in the Holy Land. . International Fellowship of Christians",
    "textAfterTable": "Time (ET) Program Speaker 1:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Tuesday, March 5, 2013 Time (ET) Program Speaker 1:00am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Wednesday, March 6, 2013 Time (ET) Program Speaker 12:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein 4:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Thursday, March 7, 2013 Time (ET) Program Speaker 1:00am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein 4:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein 11:00pm International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Friday, March 8, 2013 Time (ET) Program Speaker 2:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Saturday, March 9, 2013 Time (ET) Program Speaker 1:30am International Fellowship of Christians and Jews Rabbi Yechiel Eckstein Last Week Week of Sunday, March 10, 2013 Next Week",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}