{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-17103",
            "1625-AA08",
            "USCG-2014-0540"
        ]
    ],
    "pageTitle": "33 CFR 100.1304 - Annual Seattle Yacht Club's | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/33/100.1304",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912235651,
    "recordOffset": 912191806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1016=Title 33 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{351275=The Coast Guard proposes to issue a special local regulation on the waters of Charleston Harbor in Charleston, SC during the Charleston Race Week on April 17, 2015 through April 19, 2015. This special local regulation is necessary to ensure the safety of participants, spectators, and the general public during the event. The special local regulation would temporarily restrict vessel traffic in a portion of Charleston Harbor, preventing non-participant vessels from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port Charleston or a designated representative., 97806=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2014 and September 2014, and that expired before they could be published in the Federal Register. This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible., 424567=The Coast Guard proposes to temporarily change the enforcement periods of special local regulations for a recurring marine event in the Fifth Coast Guard District. These regulations apply to the MRE Tug of War, a recurring marine event, and would be effective on November 8, 2014. Special local regulations are necessary to provide for the safety of life on navigable waters during the event. This action is intended to restrict vessel traffic in a portion of Spa Creek at Annapolis, MD during the event., 376316=The Coast Guard is proposing to establish a special local regulation on the waters of the Manatee River in Bradenton, Florida during the Bradenton Area Riverwalk Regatta. The race is scheduled to take place annually from 11:00 a.m. to 4:30 p.m. on the first Saturday of February. The proposed special local regulation is necessary to protect the safety of race participants, participant vessels, spectators, and the general public on the navigable waters of the United States during the event. The special local regulation would restrict vessel traffic in the waters of the Manatee River in the vicinity of Bradenton, Florida. It would establish the following two areas: Enforcement areas #1 and #2, where all persons and vessels, except those persons and vessels participating in the high speed boat races and those vessels enforcing the areas, are prohibited from entering, transiting through, anchoring in, or remaining within., 12602=The Coast Guard will enforce a Special Local Regulation for the “REV3 Triathlon” on the Tennessee River mile 646.0 to 649.0 from 7:00 a.m. until 9:30 a.m. on May 17, 2015. This action is necessary for the safeguard of participants and spectators, including all crews, vessels, and persons on navigable waters during the “REV3 Triathlon.” During the enforcement period, entry into, transiting or anchoring in the Regulated Area is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Ohio Valley or his designated representative., 67660=The Coast Guard is establishing a special local regulation on the waters of Charleston Harbor in Charleston, South Carolina during Charleston Race Week, a series of sailboat races. The races are scheduled to take place on April 17, 2015 through April 19, 2015. Approximately 300 sailboats are anticipated to participate in the races. The special local regulation is necessary to provide for the safety of life on the navigable waters of the United States during the races. The special local regulation consists of three race areas. Except for those persons and vessels participating in the sailboat races, persons and vessels are prohibited from entering, transiting through, anchoring in, or remaining within any of the race areas unless authorized by the Captain of the Port Charleston or a designated representative., 121900=The Coast Guard will enforce the U.S. Open Water Ski Racing Nationals special local regulations on October 11-12, 2014. This marine event occurs on the navigable waters of Mission Bay, in San Diego, California. This action is necessary to provide for safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 77618=The Coast Guard will enforce the special local regulations on the waters of Oceanside Harbor, California during the California Ironman Triathlon from 6:30 a.m. to 9:30 a.m. on March 28, 2015. These special local regulations are necessary to provide for the safety of the participants, crew, spectators, sponsor vessels of the triathlon, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 395750=The Coast Guard is proposing to establish a special local regulation during the Seminole Hard Rock Winterfest Boat Parade scheduled to occur on December 13, 2014, between the hours of 2 p.m. and 11:30 p.m. on the waters of the New River and Intracoastal Waterway in Fort Lauderdale, Florida. This special local regulation is necessary to protect the public from hazards associated with the boat parade. The special local regulation will consist of a moving zone around participant vessels as the parade transits the navigable waters of the United States during the event. Persons and vessels that are not participating in the boat parade are prohibited from entering, transiting through, anchoring in, or remaining within the regulated area unless authorized by the Captain of the Port Miami or a designated representative., 248290=Title 33 published on 2014-07-01, 158618=The Coast Guard will enforce Special Local Regulations for the Southern Professional Outboard Racing Tour (S.P.O.R.T.) boat races to be held on the Sabine River in Orange, TX from 3 p.m. on September 19, 2014, through 6 p.m. on September 21, 2014. This action is necessary to provide for the safety of the participants, crew, spectators, participating vessels, non-participating vessels and other users of the waterway. During the enforcement period, the Coast Guard Patrol Commander will enforce restrictions upon, and control the movement of, vessels in the zone established by the Special Local Regulation., 261440=The Coast Guard proposes to establish a special local regulation for all waters of the Ohio River, surface to bottom, extending from Ohio River mile 469.5 to 471.2 at Cincinnati, OH July 10, 2015 through July 14, 2015. This special local regulation is necessary to protect persons and property from potential damage and safety hazards during the “86th Major League Baseball (MLB) All-Star Week/Game”, an event which will likely involve a high density of boater traffic in the river miles specified. This proposed special local regulation is intended to temporarily restrict vessel traffic in a portion of the Ohio River during this event and implement a moving security zone for certain vessel traffic within the special local regulated zone., 40111=The Coast Guard will enforce “the Great Steam Boat Race” safety zone for all waters of the Ohio River, beginning at mile marker 596.8 and ending at 604.3, Louisville, KY. This rule is effective from 6 p.m. to 8 p.m. on April 29, 2015. This action is necessary to protect person, property, and infrastructure from potential damage and safety hazards associated with “the Great Steam Boat Race.” During the enforcement period, deviation from the safety zone is prohibited unless specifically authorized by the Captain of the Port (COTP) Ohio Valley or a designated representative., 107239=The Coast Guard will enforce the San Diego Bay Parade of Lights special local regulations on Sunday, December 14, 2014 and Sunday, December 21, 2014. This event occurs in north San Diego Bay in San Diego, CA. These special local regulations are necessary to provide for the safety of the participants, crew, spectators, sponsor safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 92429=The Coast Guard is establishing a special local regulation on the waters of the Gulf of Mexico in the vicinity of Clearwater Beach, Florida during the Clearwater Super Boat National Championship. The race is scheduled to take place annually on the last Saturday and Sunday of September from approximately 10 a.m. to 5 p.m. The special local regulation is necessary to protect the safety of race participants, participant vessels, spectators, and the general public on the navigable waters of the United States during the event. The special local regulation will restrict vessel traffic in the waters of the Gulf of Mexico in the vicinity of Clearwater, Florida. It will establish the following three areas: A race area, where all persons and vessels, except those persons and vessels participating in the high speed boat races, are prohibited from entering, transiting through, anchoring in, or remaining within; a spectator area, where all vessels must be anchored or operate at No Wake Speed; and an enforcement area where designated representatives may control vessel traffic as determined by the prevailing conditions., 236281=The Coast Guard will enforce various special local regulations for annual regattas and marine parades in the Captain of the Port Detroit zone from 9 a.m. on June 27, 2014 through 6 p.m. on August 10, 2014. Enforcement of these regulations is necessary and intended to ensure safety of life on the navigable waters immediately prior to, during, and immediately after these regattas or marine parades. During the aforementioned period, the Coast Guard will enforce restrictions upon, and control movement of vessels in a specified area immediately prior to, during, and immediately after regattas or marine parades., 112116=The Coast Guard is establishing a special local regulation in the navigable waters of Half Moon Bay, CA near Pillar Point in support of the Mavericks Invitational Surf Competition to be held one day between November 1 of each year and March 31 of the following year, from 6 a.m. until 6 p.m. This special local regulation will temporarily restrict vessel traffic in vicinity of Pillar Point and prohibit vessels not participating in the surfing event from entering the dedicated surfing area and a designated no-entry area. This regulation is necessary to provide for the safety of life on the navigable waters immediately prior to, during, and immediately after the surfing competition., 529217=The Coast Guard proposes to establish temporary regulations in certain waters of the Patapsco River. This action is necessary to provide for the safety of life on navigable waters before, during, and after the “Baltimore Air Show,” which consists of aerial practices, performance demonstrations and air shows. The event, scheduled as part of the Star-Spangled 200 activities at Baltimore, Maryland, will be held over certain waters of the Patapsco River from September 11, 2014, through September 14, 2014. This action will restrict vessel traffic in portions of the Patapsco River during the event., 284898=The Coast Guard proposes to establish a special local regulation on the Atlantic Intracoastal Waterway in Bucksport, South Carolina during the Southeast Drag Boat Championships, a series of high-speed boat races. The event is scheduled to take place from 10 a.m. on July 24, 2015, through 6 p.m. on July 26, 2015. Approximately 50 high-speed race boats are anticipated to participate in the races. This special local regulation is necessary to provide for the safety of life and property on navigable waters of the United States during the event. This special local regulation would temporarily restrict vessel traffic in a portion of the Atlantic Intracoastal Waterway. Persons and vessels that are not participating in the races would be prohibited from entering, transiting through, anchoring in, or remaining within the restricted area unless authorized by the Captain of the Port Charleston or a designated representative., 62951=The Coast Guard will enforce Special Local Regulations for the RiverFest Power Boat races on the Neches River in Port Neches, TX from 2 p.m. on May 1, 2015, through 6 p.m. on May 3, 2015. This action is necessary to provide for the safety of the participants, crew, spectators, participating vessels, non-participating vessels and other users of the waterway. During the enforcement periods no person or vessel may enter the zone established by the Special Local Regulation without permission of the Captain of the Port (COTP) Port Arthur or his designated on-scene Patrol Commander., 217754=This document provides required notice of substantive rules issued by the Coast Guard and that were made temporarily effective between July 2013 and June 2014, and that expired before they could be published in the Federal Register . This notice lists temporary safety zones, security zones, special local regulations, drawbridge operation regulations and regulated navigation areas, all of limited duration and for which timely publication in the Federal Register was not possible., 72832=The Coast Guard will enforce the 2015 Lake Havasu Desert Storm marine event special local regulations from 8 a.m. through 3 p.m. on April 25, 2015. This annual marine event occurs on the navigable waters of the Colorado River in Lake Havasu, Arizona. This action is necessary to provide for the safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 231432=The Coast Guard will enforce a Special Local Regulation for the “Music City Triathlon” on the Cumberland River mile marker 190.0 to mile marker 192.0 from 6:00 a.m. until 9:30 a.m. on July 27, 2014. This action is necessary for the safeguard of participants and spectators, including all crews, vessels, and persons on navigable waters during the “Music City Triathlon.” During the enforcement period, entry into, transiting or anchoring in the Regulated Area is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Ohio Valley or a designated representative., 31044=The Coast Guard will enforce the special local regulation for the “Annual Kennewick, Washington, Columbia Unlimited Hydroplane Races” from 8:30 a.m. to 7:30 p.m. each day, from July 24, 2015 through July 26, 2015. This action is necessary to assist in minimizing the inherent dangers associated with hydroplane races. During the enforcement period, no person or vessel may enter the regulated area without permission from the Sector Columbia River Captain of the Port., 245648=The Coast Guard will enforce the San Diego Maritime Museum Tall Ship Festival of Sail special local regulations during this year's event on August 29, 2014 through September 1, 2014. This event occurs on the navigable waters of the San Diego Bay in San Diego, CA. These special local regulations are necessary to provide for the safety of the participants, crew, spectators, sponsor vessels of the boat parade, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 163410=The Coast Guard will enforce a special local regulation for the Wheeling Vintage Raceboat Regatta on the Ohio River, from mile 90.2 to 90.8, extending the entire width of the river. This zone will be in effect on August 30-31, 2014 from 9:00 a.m. until 6:00 p.m. This regulated area is necessary to protect vessels participating in the event and event spectators from the hazards associated with a boat race on the waterway. During the enforcement period, entry into, transiting, or anchoring in the safety zone is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Pittsburgh or a designated representative., 488151=The Coast Guard proposes to temporarily change the enforcement periods of special local regulations for a recurring marine event in the Fifth Coast Guard District. These regulations apply to the Chesapeake Challenge power boat race, a recurring marine event, and would be effective from October 4, 2014, to October 5, 2014. Special local regulations are necessary to provide for the safety of life on navigable waters during the event. This action is intended to restrict vessel traffic in a portion of the Patuxent River at Solomons, MD during the event., 16977=The Coast Guard will enforce the Mayor's Hike, Bike and Paddle marine event for all waters of the Ohio River, beginning at mile marker 602.0 and ending at 603.5, Louisville, KY. This rule will be enforced from 9:00 a.m. to 12:30 p.m. on May 25, 2015. This action is necessary to protect persons, property, and infrastructure from potential damage and safety hazards associated with the Mayor's Hike, Bike and Paddle. During the enforcement period, deviation from the regulations is prohibited unless specifically authorized by the Captain of the Port (COTP) Ohio Valley or a designated representative., 195264=The Coast Guard will enforce the San Diego Bayfair special local regulations on Friday, September 12, 2014 through Sunday, September 14, 2014. This recurring marine event occurs on the navigable waters of Mission Bay in San Diego, California. This action is necessary to provide for the safety of the high speed boat race participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 26202=The Coast Guard will enforce the Great Western Parker Tube Float marine event and associated waterway special local regulations from 7 a.m. through 4 p.m. on June 6, 2015. This annual marine event occurs in the navigable waters of the Colorado River in Parker, Arizona, covering eight miles of the waterway from the La Paz County Park to the Headgate Dam. This action is necessary to provide for the safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 519933=The Coast Guard proposes to establish temporary regulations in certain waters of the Patapsco River. This action is necessary to provide for the safety of life on navigable waters before, during, and after the Star-Spangled Spectacular Fireworks scheduled as part of War of 1812 Bicentennial Commemorations activities at Baltimore, Maryland during September 6-16, 2014. This action will restrict vessel traffic in portions of the Patapsco River, including the Northwest Harbor and Baltimore's Inner Harbor., 247901=§ 1233 - Regulations as to regattas or marine parades, 116980=The Coast Guard will enforce a safety zone for the Three Rivers Towing Association Head of the Ohio Regatta on the Allegheny River, from mile 0.0 to 3.3, extending the entire width of the river. This zone will be in effect on October 4, 2014 from 6:00 a.m. until 6:00 p.m. This zone is needed to protect vessels transiting the area and event spectators from the hazards associated with the Three Rivers Towing Association Head of the Ohio Regatta. During the enforcement period, entry into, transiting, or anchoring in the safety zone is prohibited to all vessels not registered with the sponsor as participants or official patrol vessels, unless specifically authorized by the Captain of the Port (COTP) Pittsburgh or a designated representative., 102468=The Coast Guard will enforce the Hanohano Ocean Challenge special local regulations on January 24, 2015. This marine event occurs on the navigable waters of Mission Bay, in San Diego, California. This action is necessary to provide for safety of the participants, crew, spectators, safety vessels, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 213066=The Coast Guard is amending the permanent special local regulations for the Suncoast Offshore Challenge and the Suncoast Offshore Grand Prix in the Gulf of Mexico near Sarasota, Florida. Reflected in the existing permanent special local regulations, these two races have nearly identical course and time characteristics, however, one event used to be held annually on the first Saturday of July and the other event is held annually on the first Sunday of July. The sponsor has decided to combine the events into a single day, reduce the length of the racecourse, and modify the time of the event. Due to recent shoaling north of New Pass, it is necessary to amend the existing language to close New Pass and open Big Sarasota Pass to traffic. The changes are necessary to provide for the safety of life on navigable waters during the event., 131164=The Coast Guard will enforce the regulation pertaining to the Charleston Parade of Boats from 4:00 p.m. through 8:00 p.m. on December 13, 2014. This action is necessary to ensure safety of life on navigable waters of the United States during the Charleston Parade of Boats. During the enforcement period, the special local regulation establishes a regulated area which will prohibit all people and vessels from entering. Vessels may enter, transit through, anchor in, or remain within the area if authorized by the Captain of the Port Charleston or a designated representative., 87383=The Coast Guard is establishing a special local regulation on the waters of the Manatee River in Bradenton, Florida, during the Bradenton Area Riverwalk Regatta. The event is scheduled to take place annually from 11 a.m. to 7:30 p.m. on the first Saturday of February. The special local regulation is necessary to protect the safety of race participants, participant vessels, spectators, and the general public on the navigable waters of the United States during the event. The special local regulation will restrict vessel traffic in the waters of the Manatee River in the vicinity of Bradenton, Florida. It will establish the following two areas: Enforcement areas #1 and #2, where all persons and vessels, except those persons and vessels participating in the high speed boat races and those vessels enforcing the areas, are prohibited from entering, transiting through, anchoring in, or remaining within., 126319=The Coast Guard will enforce the annual Blue Water Resort and Casino (BWRC) Parker Enduro marine event and associated waterway restriction special local regulations on October 24-26, 2014. This event occurs in the navigable waters of the Colorado River in Parker, Arizona between river miles 179 and 185 (between the Roadrunner Resort and the Headgate Dam). These special local regulations are necessary to provide for the safety of the participants, crew, spectators, and general users of the waterway. During the enforcement period, persons and vessels are prohibited from entering into, transiting through, or anchoring within this regulated area unless authorized by the Captain of the Port, or his designated representative., 299025=The Coast Guard is proposing to amend a special local regulation on the waters of the Gulf of Mexico in the vicinity of Sarasota, Florida during the Suncoast Super Boat Grand Prix. The event is scheduled to take place annually on the first Friday, Saturday, and Sunday of July from 10 a.m. to 5 p.m. The proposed amendment to the special local regulation is necessary to protect the safety of race participants, participant vessels, spectators, and the general public on the navigable waters of the United States during the event. The special local regulation would restrict vessel traffic in the Gulf of Mexico near Sarasota, Florida. It would establish the following three areas: A race area, where all persons and vessels, except those persons and vessels participating in the high speed boat races, are prohibited from entering, transiting through, anchoring in, or remaining within; a spectator area, where all vessels must be anchored or operate at No Wake Speed; and an enforcement area where designated representatives may control vessel traffic as determined by prevailing conditions., 208435=The Coast Guard will enforce the Seattle Seafair Unlimited Hydroplane Race Special Local Regulation on Lake Washington, WA from 8:00 a.m. on August 1, 2014 through 11:59 p.m. on August 3, 2014 during hydroplane race times. This action is necessary to ensure public safety from the inherent dangers associated with high-speed races while allowing access for rescue personnel in the event of an emergency. During the enforcement period, no person or vessel will be allowed to enter the regulated area without the permission of the Captain of the Port, on-scene Patrol Commander or Designated Representative., 199652=The Coast Guard will enforce one special local regulation for a regatta in the Sector Long Island Sound area of responsibility on October 5, 2014. This action is necessary to provide for the safety of life on navigable waterways during the event. During the enforcement period, no person or vessel may enter the regulated area without permission of the Captain of the Port (COTP) Sector Long Island Sound or designated representative., 168229=The Coast Guard is establishing a special local regulation on the waters of Lake Dora in Tavares, Florida, during the Hydro-Drag Nationals, a series of high-speed personal watercraft races. The event is scheduled for August 30 and 31, 2014. Approximately 65 vessels are anticipated to participate in the races. This special local regulation is necessary to ensure the safety of life during the races.}",
    "lastModified": "Thu, 04 Jun 2015 04:00:19 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 30155 - Special Local Regulation, Annual Dragon Boat Races, Portland, Oregon 2015-05-27; vol. 80 # 101 - Wednesday, May 27, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 33. Title 33 published on 2014-07-01. [CGD13-89-02, 54 FR 19167, May 4, 1989] A succession of sharp, short signals by whistle or horn from vessels patrolling the area under the direction of the Patrol Commander shall serve as a signal to stop. Vessels signaled shall stop and shall comply with the orders of the patrol vessel. Failure to do so may result in expulsion from the area, citation for failure to comply, or both. (5) Due to the large number of craft confined within this small body of water, all vessels,",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Coast Guard Interim final rule. This rule is effective on May 27, 2015. Comments and related material must be received by the Coast Guard on or before June 26, 2015. Requests for public meetings must be received by the Coast Guard June 3, 2015. 33 CFR Part 100 Summary The Coast Guard is permanently amending the Annual Dragon Boat Races, Portland, Oregon special local regulation. This regulation is enforced annually during the Dragon Boat Races on the waters of the Willamette River between the Hawthorne and Marquam Bridges. This final rule will eliminate inconsistencies with the event dates and the published enforcement period. This will serve to better inform the public of the regulated race area. 2015-05-19; vol. 80 # 96 - Tuesday, May 19, 2015 80 FR 28556 - Safety Zones and Special Local Regulations; Recurring Marine Events in Captain of the Port Long Island Sound Zone GPO FDSys XML |",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}