{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2015-10464",
            "1205-AB70"
        ]
    ],
    "pageTitle": "20 CFR 655.1030 - Service and computation of time. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/20/655.1030",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913768643,
    "recordOffset": 913744786,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1017=Title 20 published on 2012-04-01.}",
    "TableContextTimeStampAfterTable": "{18421=This final rule rescinds the regulations which provided rules governing employers seeking to hire F-1 foreign students as part-time workers off-campus. These subparts became obsolete after the authorizing statute and its two-year extension expired in 1996. Accordingly, the Department of Labor (the Department) is taking this action to remove regulations that no longer have force and effect., 59965=Title 20 published on 2012-04-01, 41940=The Department of Labor is delaying the effective date of the Wage Methodology for the Temporary Non-agricultural Employment H-2B Program final rule (the Wage Rule), in order to address legislation that prohibits any funds from being used to implement the Wage Rule for the remainder of fiscal year (FY) 2013. The Wage Rule revised the methodology by which the Department calculates the prevailing wages to be paid to H-2B workers and United States (U.S.) workers recruited in connection with a temporary labor certification for use in petitioning the Department of Homeland Security to employ a nonimmigrant worker in H-2B status., 58261=§ 1182 note - Inadmissible aliens, 58355=§ 1184 - Admission of nonimmigrants, 112179=The Department of Labor (Department) is proposing to delay indefinitely the effective date of the Wage Methodology for the Temporary Non-agricultural Employment H-2B Program final rule (2011 Wage Rule), in order to comply with recurrent legislation that prohibits the Department from using any funds to implement it, and to permit time for consideration of public comments sought in conjunction with an interim final rule published April 24, 2013, 78 FR 24047. The 2011 Wage Rule revised the methodology by which the Department calculates the prevailing wages to be paid to H-2B workers and United States workers recruited in connection with a temporary labor certification for use in petitioning the Department of Homeland Security to employ a nonimmigrant worker in H-2B status. The 2011 Wage Rule was originally scheduled to become effective on January 1, 2012, and the effective date has been extended a number of times, most recently to October 1, 2013. 1 The Department is now proposing to delay the effective date of the 2011 Wage Rule until such time as Congress no longer prohibits the Department from implementing the 2011 Wage Rule. 1 The effective date of the 2011 Wage Rule was previously revised to September 30, 2011, 76 FR 45667 (Aug. 1, 2011); to November 30, 2011, 76 FR 59896 (Sept. 28, 2011); to January 1, 2012, 76 FR 73508 (Nov. 29, 2011); to October 1, 2012, 76 FR 82115 (Dec. 30, 2011); to March 27, 2013, 77 FR 60040 (Oct. 2, 2012); and to October 1, 2013, 78 FR 19098 (Mar. 29, 2013)., 58172=§ 1182 - Inadmissible aliens, 30840=The Department of Labor (Department or we/us) is delaying indefinitely the effective date of the Wage Methodology for the Temporary Non-agricultural Employment H-2B Program final rule (2011 Wage Rule), in order to comply with recurrent legislation that prohibits us from using any funds to implement it, and to permit time for consideration of public comments sought in conjunction with an interim final rule published April 24, 2013, 78 FR 24047. The 2011 Wage Rule revised the methodology by which the Department calculates the prevailing wages to be paid to H-2B workers and United States workers recruited in connection with a temporary labor certification for use in petitioning the Department of Homeland Security to employ a nonimmigrant worker in H-2B status. The 2011 Wage Rule was originally scheduled to become effective on January 1, 2012, and the effective date has been extended a number of times, most recently to October 1, 2013. We are now delaying the effective date of the 2011 Wage Rule indefinitely. This rule does not affect the Interim Final Rule, 78 FR 24047, published on April 24, 2013, establishing the current prevailing wage methodology for the H-2B program; that rule remains in effect., 59381=107 Stat. 2428, 58091=§ 1101 - Definitions, 58451=§ 1184 note - Admission of nonimmigrants, 59557=120 Stat. 2900, 55969=On February 21, 2012, the Department of Labor (the Department or DOL) published a Final Rule amending H-2B regulations governing the certification of temporary employment of nonimmigrant workers in temporary or seasonal non-agricultural employment. On March 20, 2012, the Department published guidance informing employers of the dates by which their H-2B application must be postmarked in order to be governed by the Final Rule. This guidance revises these dates so that the Final Rule will become operative 60 days after it was reported to Congress., 58552=§ 1188 - Admission of temporary H–2A workers, 46777=The Department of Labor (Department) is delaying the effective date of the Wage Methodology for the Temporary Non-agricultural Employment H-2B Program final rule, in response to recently enacted legislation that prohibits any funds from being used to implement the Wage Rule for the first 6 months of fiscal year (FY) 2013. The Wage Rule revised the methodology by which the Department calculates the prevailing wages to be paid to H-2B workers and United States (U.S.) workers recruited in connection with a temporary labor certification for use in petitioning the Department of Homeland Security to employ a nonimmigrant worker in H-2B status., 64044=The Department of Labor (Department) issued a proposed rule in the Federal Register of April 15, 2015 [FR Doc. 2015-08505], concerning proposed amendments to its regulations governing certification of the employment of nonimmigrant workers in temporary or seasonal agricultural employment under the H-2A program to codify certain procedures for employers seeking to hire foreign temporary agricultural workers for job opportunities in sheepherding, goat herding and production of livestock on the open range. This notice extends the comment period for 15 days, from May 15 to June 1, 2015. Multiple commenters requested additional time to develop their comments concerning the proposed rulemaking. The Department is therefore extending the comment period in order to give all interested persons the opportunity to comment fully., 58657=§ 1288 - Limitations on performance of longshore work by alien crewmen, 25955=This final rule rescinds the regulations for employers in the logging industry utilizing foreign workers. The regulations became obsolete after a rulemaking in 2010 reassigned them elsewhere in the Code of Federal Regulations. The Department of Labor (“Department”) is issuing this final rule to remove the obsolete regulations., 90548=The Department of Labor (DOL) is providing notice to the regulated community of the status of Wage Methodology for the Temporary Non-agricultural Employment H-2B Program, published January 19, 2011 in the Federal Register . DOL intends to publish a notice of proposed rulemaking on the proper wage methodology for the H-2B program, working off of the 2011 Wage Rule as a starting point., 51171=The Department of Labor (the Department) is providing notice of the judicial order enjoining the Department from implementing and enforcing the Temporary Non-agricultural Employment of H-2B Aliens in the United States, published February 21, 2012 (the 2012 H-2B Final Rule). The 2012 H-2B Final Rule revised the requirements by which employers seeking H-2B workers apply for a temporary labor certification for use in petitioning the Department of Homeland Security (DHS) to employ a nonimmigrant worker in H-2B status. The effective date of the 2012 H-2B Final Rule was April 23, 2012. The operative date of the 2012 H-2B Final Rule was April 27, 2012. This document provides guidance to the regulated community of the injunction, by judicial order, of the 2012 H-2B Final Rule and the continuing effectiveness of the 2008 H-2B Rule until such time as further judicial or other action suspends or otherwise nullifies the order in the Bayou II litigation.}",
    "lastModified": "Sun, 31 May 2015 08:57:27 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 24042 - Temporary Non-Agricultural Employment of H-2B Aliens in the United States 2015-04-29; vol. 80 # 82 - Wednesday, April 29, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 20. Title 20 published on 2012-04-01. Time under this subpart shall be computed beginning with the day following the action and includes the last day of the period unless it is a Saturday, Sunday, or federally-observed holiday, in which case the time period includes the next business day. (c) Two (2) copies of all pleadings and other documents in any administrative law judge proceeding shall be served on the attorneys for the Administrator. One copy shall be served on the Associate Solicitor, Division of Fair Labor Standards, Office of the Solicitor, U.S. Department of",
    "textAfterTable": "CIS No. 2563-15 DEPARTMENT OF LABOR, DEPARTMENT OF HOMELAND SECURITY, Employment and Training Administration, Wage and Hour Division Interim final rule; request for comments. This interim final rule is effective April 29, 2015. Interested persons are invited to submit written comments on this interim final rule on or before June 29, 2015. 8 CFR Part 214 Summary The Department of Homeland Security (DHS) and the Department of Labor (DOL) are jointly issuing regulations governing the certification of the employment of nonimmigrant workers in temporary or seasonal non-agricultural employment and the enforcement of the obligations applicable to employers of such nonimmigrant workers. This interim final rule establishes the process by which employers obtain a temporary labor certification from DOL for use in petitioning DHS to employ a nonimmigrant worker in H-2B status. We are also issuing regulations to provide for increased worker protections for both United States (U.S.) and foreign workers. DHS and DOL are issuing simultaneously with this rule a companion rule governing the methodology to set the prevailing wage in the H-2B program. 80 FR 24146 - Wage Methodology for the Temporary Non-Agricultural Employment H-2B Program GPO FDSys",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}