{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They make an effort.",
            "Not for me, so I can't really comment.",
            "Work hard, play hard.",
            "Mardi Gras, Crawfest, Voodoo Fest, Jazzfest, you name it.",
            "It is ungodly expensive, but they're pretty generous.",
            "Anything! There are so many venues for music around, Audubon Park is directly across the street, City Park does kayak rentals, there are bars walking distance, and a cute shopping district neighboring the university.",
            "Could be better, could be a lot worse. They do incorporate a lot of traditional New Orleans fare which is fantastic, and they make an effort to provide for students that are lactose intolerant, vegan, or have a gluten allergy.",
            "Tulane is really into volunteerism and community service, so highlight that on your application.",
            "Best for work hard, play hard students. Faculty is great. Make sure you take the initiative to take advantage of the city or you'll miss out."
        ]
    ],
    "pageTitle": "Tulane University of Louisiana Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tulane-University-of-Louisiana/reviews?_escaped_fragment_=/show/83731",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894087179,
    "recordOffset": 894007711,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132564=Of course, depending on your major, the classes can be more challenging. There are a handful of teachers that make 1000 level courses a breeze but for the most, professors challenge their students. The sciences here are especially known to be challenging and many teachers are deemed not that great of teachers. For the most part, just showing that you care by going to office hours and really making sure you don't cram and study way in advances will guarantee success., 299972=I pledged Phi Beta Sigma in the Spring of 1988, 33798=Like others have said, Tulane gives out a lot of scholarships. I got the Dean's Honor Scholarship, which covers all of tuition. It's due in December, so apply for that if you think it's an option. My sister is having almost all of her tuition covered by grants and merit scholarships. Now, that's not to say the other costs aren't high. On-campus housing and food plans are required the first two years, and they are expensive, but I figure they are expensive everywhere. Bottom line, the school is seemingly expensive, but if you have the grades, they will throw scholarships at you (I think I only met one person who was paying full tuition). The school keeps getting rated more and more highly (due to gaming the system, I think, but whatever), so the impact of a degree from Tulane is only going to get better., 310060=The past year that I have attended Tulane, I have never felt unsafe. As a volleyball player I walk to practice in the dark at 5:30 in the morning, and I always see at least two police cars patrolling the area just in case. There are also busses and shuttles to take students places at night and on the weekends just to convenience students and keep them safe., 359563=© 2015, Cappex.com, LLC, 127656=Greek life is becoming a large part of the campus. At least half of the students rush in January., 141154=I visited this campus in the summer of 2010, and fell in love with the city of New Orleans, and the campus of Tulane. The buildings are gorgeous, and the people that live in the city are amazing. Its like one huge family, everyone looks out for each other, even if you've never met before., 241282=For Freshman and Sophs, you eat in Bruff Commons which pretty much has everything you could ever want. Some people get bored of it, but honestly I am kinda sad I won't have all-you-can-eat already prepared food without having to grocery shop or do my dishes. Plenty of variety and right on campus; perfect for a quick lunch break. You also get Wavebucks to spend in the LBC at Einstein, Quiznos, Panda, Sushi, Baja Fresh...etc. There's Le Gormet for the more organic/healthier types. Lots of dining options. There are also lots of delicious off campus venues that will accept NOLA bucks. We even have The Rat which serves lots of fried drunk food and is open until the wee hours of the morning.... Food in NOLA is amazing. You're parents (and roommates parents) can take you to the nice restaurants. Cajun food is pretty popular (I'm not the biggest fan), but between po-boys, mufalletas,craw fish, and jumbalaya- there's lots to try., 135515=On Mondays and Thursdays, the wellness center provides free massages to all students to release some stress. There are free STD tests on Fridays and free flu shots for a whole week in October. Wednesdays in October are free breast cancer awareness cookie days if students wear pink shirts into Bruff Dining Hall. Also, around mid-terms, TUCP (campus programming) brings in baby animals that students can pet to relieve stress.}",
    "textBeforeTable": "08/03/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 76 Scott from Stillwater, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Tulane University of Louisiana Reviews Tulane University of Louisiana › Louisiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Students who are laid back, studious, fun, and quirky are the best kinds of people around here! Tulane isn't full of stressed out kids competing with one another, everyone helps one another. If that fits your personality, you should definitely come see what it's like! Tips for prospective students Keep track of time! Seriously, time management is key when there are so many things you want to do! Bang for the buck Tulane is expensive, but if you work hard in high school, they give out generous scholarships because this campus really needs good students, not just the rich ones. Am enjoying being here New Orleans is the one place I feel that you can walk down the street wearing ANYTHING, and no one questions it. It's the place where you can act the way you want, when you want, and everyone is ok with that. Tulane embraces that quality of New Orleans nicely, and I love being a part of that. There are so many things that you can do and actually have a good time,that do not cost any money and are on campus. Am learning a lot My professors at Tulane are the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}