{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Woman that are open to broadening their mind. Also woman that like taking advantage of opportunities because Spelman creates alot of them for you. They flood your email with so many internships and scholarship opportunities.",
            "Make sure when writing your application essay you let the college know that you really want to be there. Also if you get accepted dont be scared. Spelman is a place where women from all over the country, the world even come to experience the Spelman way. Making friends is easier than most would think because your freshman year is going to be the best.",
            "Yes the tuition is alot but it is worth every penny. The relationships and knowledge you gain from being a Spelman woman are priceless. You receiving top of the line teaching from some of the most passionate and experienced professors many of which love the the subjects they teach and go the extra mile to study and live what they believe in.",
            "I love being on campus everyone is different and everyone is special in their own way. Spelman takes the extra effort to make sure the students have a great time on campus. They even have an organization that is designed to do just that, plan fun stuff on campus for the students. Whether is a movie night or even free mani and pedi's during homecoming for all the students.",
            "The advanced education that you get at Spelman is beyond extraordinary. They motivate you to strive for the best and they also not only educate you on college curricular but on the knowledge of how to grow as a woman. Spelman Colleges moto is A Choice to Change the World. They enrich their students on the importance of making this world a better place by going above and beyond for the greater good."
        ]
    ],
    "pageTitle": "Spelman College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Spelman-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896717683,
    "recordOffset": 896607958,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{212317=Make sure you send in your SAT and ACT scores as soon as you receive them. Also, after April scholarships here are nearly impossible to acquire., 256617=Spelman College's motto should be we stand for exclusive Traditions. In fact one of the most prompt traditions to conquer, the Spelman Hymn, defines tradition in its lyrics. Honestly you should learn it now if you plan on joining this institution. The Spelman Hymn (Words and music by Mrs. Eddye Money Shivery, C'34) Spelman, thy name we praise Standards and honor raise, we'll ever faithful be Throughout eternity. May peace with thee abide And God forever guide Thy heights supreme and true. Blessings to you. Through years of toil and pain May thy dear walls remain Beacons of heavenly light, Undaunted by the fight; And when life's race is won, Thy noble work is done, Oh God, forever bind Our hearts to thine. Spelman has so many unusual traditions that I have become immune to them. But do not worry all of them are worthy of consideration and most are optional., 539213=© 2015, Cappex.com, LLC, 150878=Since I've came to visit in April of 2010, I have fallen in love with Spelman. The experiences I receive here I will not receive anywhere else. I am proud to say I am a Spelmanite. The young ladies I met in my dorm will be my life-long friends as I grow. Spelman is right for me. During NSO, you receive a Morehouse Brother and they are suppose to be there for you as a male role in your life while your here. I love mine too death. They are there for me all the time. We spend time together having fun. There is always something to do off or on campus., 259508=There is one cafeteria for underclassmen; Albert E. Manley College Center houses the Alma Upshaw Dining Room. In the lower level of Albert E. Manley College Center there are other options at The Grill. They both have substantial edible food. Spelman College is currently going to renovate the cafeteria and the grill for spring 2013. I am excited to see the changes. I am sure the four stars I gave food and dining it will become five. Right outside of the gates, where Spelman College and Morehouse College meet, there are dining options you yourself can pay for. Jazzman's Cafe is great for coffee, a nice meeting or much needed socialization., 456842=One of my family friends visited my dorm and mentioned that it looked like a summer camp. My dorm did not have air conditioning or Wi-fi. It was 2012-2013., 189590=The illustrious Spelman College is a dynamic, diverse, and authentic institution. A traditional, and prestigious school that started in 1881, Spelman provides the foundation needed to be successful at any time place or situation. Focused on developing the global woman from adolescence into womanhood, Spelman is a stepping stone, and a much needed environment for the next generation., 436483=usually,during the first week of freshman orientation,in the middle of the morning,students will awake to the sounds of yelling ra's (resident assistants)asking them to wake up,and come to sister's chapel (campus church)to sing the spelman sisterhood song while holding hands in candlelight.spelman also celebrates founders day in april,where the graduating seniors are allowed to wear their caps and gowns for the first time,and the freshman must wear all white., 211875=I received a 1160 on my SAT (CR+M), acquired a 4.1 G.P.A, and was accepted. I later received a 1320 on my SAT however scholarships were all gone and most required SAT scores of 1200 or higher. Therefore the school is quite academically competitive., 5095=I work for the work study, the job I did I did not the time schedule. I was given Friday, Saturday and Sunday from 9:00 pm to 11:00 pm 4 day a week. That gave me no time for myself or to go out if I want to go some where. I do not stay out late at night., 131315=The week long new student orientation program where you learn all of the Spelman traditions and are inducted in the sisterhood. Founder's Day in April where we celebrate the college. Just remember to invest in a nice white dress, black shoes, and nude stockings for both events!! That is your official uniform.}",
    "textBeforeTable": "07/15/2009 Reviewer is A current student here. 81 out of 83 people found this review useful. 1 of 119 Chastity from College Grove, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Comments Great for these types of students Spelman is an all girl school, but the the others college around is not, so their are boys around Moorehouse is next door. You will be given a big brother to help you. their are alot of fun things to do. The stores are in walking distant, and the martar or train in right there. Tips for prospective students Listen to that you are told to do get along with people alway ask for help when need, and enjoy school. College is not like High School, Make your class where you come control the time. If you have work study make sure you be there or no who to report to so you will not got the bad schedule. Bang for the buck I work for the work study, the job I did I did not the time schedule. I was given Friday, Saturday and Sunday from 9:00 pm to 11:00 pm 4 day a week. That gave me no time for myself or to go out if I want to go some where. I do not stay out late at night. Am enjoying being here not only did I enjoy my teachers, I enjoyed meet the students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}