{
    "relation": [
        [
            "SQL Server component",
            "SQL Server Setup Control",
            "SQL Server Setup Control",
            "SQL Server Setup Control",
            "SQL Server Setup Control",
            "SQL Server Setup Control",
            "SQL Server Setup Control",
            "SQL Server Setup Control"
        ],
        [
            "Parameter",
            "/ACTION Required",
            "/CONFIGURATIONFILE Optional",
            "/HELP, H, ? Optional",
            "/INDICATEPROGRESS Optional",
            "/INSTANCENAME Required",
            "/Q Optional",
            "/HIDECONSOLE Optional"
        ],
        [
            "Description",
            "Required to indicate RemoveNode work flow. Supported value: RemoveNode",
            "Specifies the ConfigurationFile to use.",
            "Displays the usage options for the parameters.",
            "Specifies that the verbose Setup log file will be piped to the console.",
            "Specifies a SQL Server instance name. For more information, see Instance Configuration.Instance Configuration.",
            "Specifies that Setup runs in a quiet mode without any user interface. This is used for unattended installations.",
            "Specifies that the console window is hidden or closed."
        ]
    ],
    "pageTitle": "How to: Install SQL Server 2008 from the Command Prompt",
    "title": "",
    "url": "https://msdn.microsoft.com/en-us/library/ms144259(v=sql.100).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879846735,
    "recordOffset": 879820006,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167821=SQL Server 2008 cluster setup does not support remote deployment., 64453=To upgrade an existing instance of SQL Server 2008 to a different edition of SQL Server 2008., 145214=Use the parameters in the following table to develop command-line scripts for failover cluster upgrade. cluster upgrade. For more information, see How to: Upgrade a SQL Server Failover Cluster Instance (Setup) and Getting Started with SQL Server 2008 Failover Clustering., 80449=Getting Started with SQL Server 2008 Failover Clustering, 173904=To remove a node from SQL Server 2008 cluster, run Setup on the node to be removed and specify the RemoveNode action., 188855=To upgrade a SQL Server failover cluster to SQL Server 2008, you must run the Setup on one failover cluster node at a time, starting with the passive nodes. Setup determines when to fail over to the upgraded node, depending on the total number of nodes in the failover cluster instance, and the number of nodes that have already been upgraded. When half of the nodes or more have already been upgraded, Setup by default will cause a failover to an upgraded node., 121147=1This parameter is required on Windows Server 2003 and in-place upgrade from SQL Server 2000 or SQL Server 2005 Failover Cluster to SQL Server 2008 Failover Cluster. It is optional for installations on Windows 2008., 101504=This parameter is ignored in Windows Server 2008 and Windows Vista operating systems. ServiceSID will be used to help secure the communication between SQL Server and Full-text Filter Daemon. , 49288=This parameter is ignored in Windows Server 2008 and Windows Vista operating systems., 170065=FTS changes to IFTS for SQL Server 2008 as part of SQL Server Database Engine. You do not have to have a separate IFTS group., 23657=Installing an instance of SQL Server 2008 on a local computer by using syntax and parameters specified in a configuration file. You can use this method to copy an installation configuration to multiple computers, or to install multiple nodes of a failover cluster installation., 166746=Replacement Parameter in SQL Server 2008, 57801=Required when you upgrade from SQL Server 2008, 104802=Do not use domain groups on Windows Server 2008 for new installations. We recommend that you use ServiceSID on Windows Server 2008., 79934=Hardware and Software Requirements for Installing SQL Server 2008, 81727=For more information about Integrated Installation, see Getting Started with SQL Server 2008 Failover Clustering., 58738=Specifies the product key for the edition of If this parameter is not specified, SQL Server 2008 Enterprise Evaluation is used., 160992=Use the parameters in the following table to develop command-line scripts for RemoveNode. To uninstall a failover cluster, you must run RemoveNode on each failover cluster node. For more information, see Getting Started with SQL Server 2008 Failover Clustering., 55745=The value EditionUpgrade is used to upgrade an existing edition of SQL Server 2008 to a different edition. For more information about the supported version and edition upgrades, see Supported Version and Edition Upgrades., 166643=SQL Server 2005, 57871=Optional when you upgrade from SQL Server 2000 and SQL Server 2005, 104461=1This parameter is required on Windows Server 2003 and in-place upgrade from SQL Server 2000 Failover Cluster to SQL Server 2008 Failover Cluster. It is optional for installations on Windows Server 2008., 33903=Specifies the product key for the edition of  If this parameter is not specified, SQL Server 2008 Enterprise Evaluation is used., 166688=Supported in SQL Server 2008, 62683=To upgrade an existing instance or failover cluster node from SQL Server 2000 or SQL Server 2005., 23550=Upgrading from one SQL Server 2008 edition to another edition of SQL Server 2008., 108100=Use the parameters in the following table to develop command-line scripts for Failover Cluster prepare. This is the first step in advanced cluster installation, where you have to prepare the failover cluster instances on all the nodes of the failover cluster. For more information, see Getting Started with SQL Server 2008 Failover Clustering., 167530=To add a node to SQL Server 2008 cluster, run setup on the node to be added and specify \"new\" AddNode action., 48530=This parameter is ignored in Windows Server 2008 and Windows Vista operating systems. ServiceSID is used to help secure the communication between SQL Server and Full-text Filter Daemon. If the values are not provided, the Full-text Filter Launcher Service is disabled. You have to use SQL Server Control Manager to change the service account and enable full-text functionality., 23264=Installing, upgrading, or removing an instance and shared components of SQL Server 2008 on a local computer by using syntax and parameters specified at the command prompt., 125421=Use the parameters in the following table to develop command-line scripts Failover Cluster complete. This is the second step in the advanced failover cluster install option. After you have run prepare on all the failover cluster nodes, you run this command on the node that owns the shared disk(s). For more information, see Getting Started with SQL Server 2008 Failover Clustering.}",
    "textBeforeTable": "Installing a new instance of SQL Server at the command prompt enables you to specify the features to install and how they should be configured. You can also specify silent, basic, or full interaction with the Setup user interface. Before you run SQL Server Setup, review Planning a SQL Server Installation. SQL Server 2016 SQL Server 2005 SQL Server 2008 R2 SQL Server 2012 SQL Server 2014 Other Versions SQL Server 2008 How to: Install SQL Server 2008 from the Command Prompt Failover Clustering How-to Topics Upgrade How-to Topics How to: Repair a Failed SQL Server 2008 Installation How",
    "textAfterTable": "/PARAMETER=true/false /PARAMETER=1/0 for Boolean types /PARAMETER=\"value\" for all single-value parameters. Using double quotation marks is recommended, but required if the value contains a space Note /PID, the value for this parameter should be enclosed in double quotation marks /PARAMETER=\"value1\" \"value2\" \"value3\" for all multiple-value parameters. Using double quotation marks is recommended, but required if the value contains a space Exceptions: /FEATURES, which is a multivalued parameter, but its format is /FEATURES=AS,RS,IS without a space, comma-delimited See the following examples to specify the installation directory paths: /INSTANCEDIR=c:\\Path is supported. /INSTANCEDIR=”c:\\Path” is supported Note The relational server values support the additional terminating backslash formats (backslash or two backslash characters) for the path. SQL Server 2008 Parameters The following sections provide parameters to develop command line installation scripts for install, update, and repair scenarios. Parameters that are listed for a SQL Server component are specific to that component. SQL Server Agent and Browser parameters are applicable when you install the SQL Server Database Engine. Installation Parameters Upgrade Parameters Repair Parameters Rebuild System Database Parameters Uninstall Parameters Failover Cluster Parameters Parameters from Previous",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}