{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The materials used at the College of Lake County are the same materials that are used in state universites. You're given the same education for a lower price on books and tuition.",
            "There are activities for students through out the year. Many student led groups hold fundraisers, bake sales, and other activities for all students to participate in.",
            "There are two cafeterias available for students. The Prairie is led by culinary managers at the College of Lake County. Reservations must be made to dine here, but it is worth the wait and effort to get in because the food is delicious. The Lancer is a standard cafeteria. It accepts cash or credit. Pizza from a local pizza parlor, a salad bar, and many other snacks are available for students through out the day. There are local places such as Jimmy Johns, McDonald's, Subway, and Burger King that are within a few miles of the school as wel.",
            "Students at the College of Lake County are expected to work at the same level at those who attend a four-year university. Do not expect the work load to be easier or the teachers to be more lenient because it is a community college. Work hard and your grades will reflect your efforts.",
            "I believe that the College of Lake County provides an excellent transition for students looking to transfer to a university, but because of financial or other complications are staying at a community college. The technological resources that are available make completing assignments efficient. The professors are also fantastic! Unlike most professors, the ones at the College of Lake County want you to succeed and will help you in the process. The College of Lake County is an great two-year college for anyone of any age."
        ]
    ],
    "pageTitle": "College of Lake County Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-Lake-County/reviews?_escaped_fragment_=/show/47881",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890465615,
    "recordOffset": 890397351,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24226=A school you can be a full time student for under $1500 a semester and your classes are highly transferable. This is the #1 reason to come to CLC., 114229=Just started this summer 2012, 226116=I've been a course taker at CLC since the beginning of 2011, and now I finally applied for a major in 2013. I admire their organization, their seriousness and sources available for studying that they offer. Definitely, it's an excellent college., 358455=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/18/2012 Reviewer is A past student here. 3 out of 3 people found this review useful. 1 of 85 Kristen from Mundelein, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Food and Dining Lots of great sushi and Thai places right outside the campus. Downtown Grayslake has a strip full of various places to eat and dine. Dorm Life No dorms available at CLC Academic Rigor Some of the best teachers are here in Grayslake, they always have office hours on the syllabus, as well as outside their office. All professors are mandatory to have office hours, and most go beyond to try and make time for your schedule. A lot of professors take attendance to get you ready for your future university. Tips for prospective students If you know your 4-yr school make sure you go off their requirements and not so much CLC's. The problem most students have is that their credits transfer however they don't fit in to the curriculum of their proceeding college. The credits then become electives instead of going towards their degree. Another important rule of thumb is going to class and communicating with professors. Now that you're out of high school some teachers don't make attendance mandatory, however if you don't show up, you will miss out on a lot, and usually there is no make-up. In three sentences",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}