{
    "relation": [
        [
            "Team v t e",
            "Uruguay",
            "Bolivia",
            "Peru"
        ],
        [
            "Pld",
            "4",
            "4",
            "4"
        ],
        [
            "Pts",
            "6",
            "6",
            "0"
        ]
    ],
    "pageTitle": "1990 FIFA World Cup qualification - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1990_FIFA_World_Cup_qualification",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 856124015,
    "recordOffset": 856094018,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{62665=The European qualification games started in May 1988 and ended in November 1989. Seven groups were drawn in total: Four of five teams and three groups of four contested the European qualifying competition. As a result, the seven group-winners qualified, while the runners-up in the groups containing five teams also qualified directly. The runners-up in the three groups containing only four teams were ranked, with the two teams with the best records also qualifying. The weakest runner-up missed out (Denmark)., 100099=The 1989 CONCACAF Championship also served as the qualifying process for the 1990 FIFA World Cup. The Championship consisted of a two-round qualification process, with the ten lowest-ranked CONCACAF teams beginning in the first round. The five teams successfully winning their two-legged ties were joined by the five highest ranked CONCACAF teams in the second round, which again consisted of teams being drawn into two-legged ties. The five victorious teams contested the final tournament of the 1989 Championship, which took the form of a group with teams playing each other on a home-and-away basis. The eventual CONCACAF champions and runners-up qualified for the World Cup finals., 122736=There was one inter-confederation play-off to determine the final qualification spot for the 1990 FIFA World Cup finals. The play-off was contested by the CONMEBOL group winners with the weakest record and the winner of the OFC zone., 105478=The qualification process began in November 1988 with the strongest two OFC teams facing the two other OFC entrants in two-legged ties. The two winners advanced to a final group where they were joined by non-OFC members Israel who were allocated to this zone for the qualification process. The three teams played each other on a home-and-away basis with the team finishing top of the group advancing to a final play-off against the third best South American team for a World Cup berth., 132382=Colombia won 1–0 on aggregate and qualified for the 1990 FIFA World Cup., 109560=The CONMEBOL qualification process featured three groups of three teams being drawn to play on a home and away basis, with matches played from July to September 1989. The records of the three group winners were ranked, with the two best teams qualifying directly for the World Cup finals; the group winner with the weakest record advanced to a play–off against the winner of the OFC zone., 6953=Seven teams withdrew during the qualifying process without playing a match: Bahrain, India, Lesotho, Maldives, Rwanda, South Yemen and Togo. Mexico were disqualified from the CONCACAF qualifying tournament before playing a game for fielding overage players in the qualifying stages for the 1988 Olympic Games. Libya withdrew during the CAF group stage, but had already (successfully) played in the first round. Therefore the total number of teams playing at least one fixture during the 1990 World Cup competition was 105 (103 during qualifying)., 2458=The first qualification match was played on 17 April 1988 and qualification concluded on 19 November 1989. A total of 735 goals were scored in the 314 qualifying matches (an average of 2.34 per match)., 47264=The qualification process commenced in April 1988 and was completed in November 1989. The draw for all qualifying groups and opening round ties in the six confederations was held in Zürich, Switzerland on 12 December 1987., 51673=These eight nations were joined in the second round by the eight highest-ranked African nations, which had received a bye in the first round. These sixteen teams were placed in four groups of four teams, with the group winners advancing to the final round. The four group winners of these groups were paired together into two knockout ties played during October and November 1989. The winners of these two-legged ties qualified for the World Cup finals., 13879=The following 24 teams qualified for the 1990 FIFA World Cup:, 51536=The CAF qualification process began with a preliminary round between June and November 1988, which eliminated eight nations., 5750=At the close of entries on 30 September 1987, a total of 116 football associations had entered the 1990 World Cup. This entry figure was five lower than those who originally entered the previous tournament, a then-World Cup record of 121 entries., 1138=The qualification competition for the 1990 FIFA World Cup was a series of tournaments organised by the six FIFA confederations. Each confederation — the AFC (Asia), CAF (Africa), CONCACAF (North America), CONMEBOL (South America), OFC (Oceania), and UEFA (Europe) — was allocated a certain number of the 24 places at the tournament. A total of 116 teams entered the competition, with Italy, as the host, and Argentina, as the holders, qualifying for the final tournament automatically., 56635=The group stage draw divided the teams into six groups, which were played from January to July 1989, from which the six group winners advanced to the final group stage. The final group stage saw the six remaining teams play each other once during a sixteen day tournament based in Singapore in October 1989. The two top teams qualified for the World Cup finals., 47608=The distribution by confederation for the 1990 World Cup was:}",
    "lastModified": "Sat, 25 Jul 2015 19:20:04 GMT",
    "textBeforeTable": "Final standings The group stage draw divided the teams into six groups, which were played from January to July 1989, from which the six group winners advanced to the final group stage. The final group stage saw the six remaining teams play each other once during a sixteen day tournament based in Singapore in October 1989. The two top teams qualified for the World Cup finals. (26 teams competing for 2 berths)1990 FIFA World Cup qualification (AFC) Asia (AFC)[edit] Main article: 1–0 2–0  Tunisia 3–0 Cameroon  0–1 0–0  Egypt 0–1 Algeria  2nd leg 1st",
    "textAfterTable": " North Korea 5 3 Europe (UEFA)[edit] Main article: 1990 FIFA World Cup qualification (UEFA) (32 teams competing for 13 berths, host Italy occupying a 14th berth) The European qualification games started in May 1988 and ended in November 1989. Seven groups were drawn in total: Four of five teams and three groups of four contested the European qualifying competition. As a result, the seven group-winners qualified, while the runners-up in the groups containing five teams also qualified directly. The runners-up in the three groups containing only four teams were ranked, with the two teams with the best records also qualifying. The weakest runner-up missed out (Denmark). Group 1 Team v t e",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}