{
    "relation": [
        [
            "Map (# of )",
            "1,7",
            "1,7",
            "1,7",
            "1,7"
        ],
        [
            "Occupants",
            "Mary Wadding",
            "Unoccupied",
            "Patrick Reid",
            "Daniel Murphy"
        ],
        [
            "Immediate Lessor",
            "Matthew Tracy",
            "Matthew Tracy",
            "Matthew Tracy",
            "Matthew Tracy"
        ],
        [
            "Description",
            "???",
            "???",
            "???",
            "???"
        ],
        [
            "Area",
            "",
            "",
            "",
            ""
        ],
        [
            "Valuation (land/buildings)",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Wexford - Tracey Family Name & variants",
    "title": "",
    "url": "http://www.traceyclann.com/files/Wexford.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 785580519,
    "recordOffset": 785449350,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=15 June 1861 Wexford Independent}",
    "TableContextTimeStampAfterTable": "{795296=In 1761, Thomas Tracey was the Guardians of the Franciscan Convent of New Ross, 562002=To be sold by auction on the premises by directions of the Misses Tracey, Faythe, Wexford, on Wednesday February 22nd 1871., 578981=Family: Annie Morris, Spinster, married at Wexford 7/9/1889[?], lives at 12 high Street Wexford, Child: Catherine Tracy, b. 7/12/1903 at Wexford, 555172=June 8th after a lingering illness borne with Christian fortitude and entire resignation, Eliza, third sister of the late? Mr Mathew Tracey, Maudlintown, sincerely regretted. - May she rest in peace., 172815=There is a reference that an Arthur Tracy (s. of John & Julia Tracy, both dead), Roman Catholic, stone mason and bricklayer, aged 27 years of Enniscorthy, Wexford, Ireland & Julia Tracy (d. of Patrick & Julia Tierney, both dead) Roman Catholic, domestic servant, aged 26 years of Dublin, Ireland, arrived in New South Wales, Australia on the ‘Alfred’ on the 29 Jan 1842. Their child, Jane Tracy was born on board 28 January 1842. Also on board ship and who may be relatives, were the children of Patrick and Mary Tracy of Dublin, Ann Tracey aged 19 and John Tracy, bricklayer, aged 23 who was married to Anne Lachlan of Wicklow. They were bounty immigrants, whose passage was paid by the colonial government, in order to have suitable skilled labour and tradespeople. There are church records from St. Nicholas Parish, Dublin for Arthur’s marriage in 1839 and the baptism of a son William in 1840., 568664=Administration of the estate of James Tunstead late of Poulpeasty County Wexford farmer who died 9 May 1906 at The Infirmary Enniscorthy said County granted at Dublin to Susan Treacy [Castlecomer  Kilkenny] married woman. Effects £372., 863250=On the 14th June 1900, Mary Tracey of Clonsharragh Mersheen & Duncannon, purchased  29a/0r/12p from the landlord Baron Templemore, which she had been renting for £21/1/6, for £380, advanced from the Land Commission and she had a £76 cash deposit., 550351=The Church of the Immaculate Conception, Rowe Steet, Wexford Town, was opened in 1858. One of the Stations of the Cross has the following dedication:, 869384=Admistration (with the will) of the estate of Mary Treacy late of Clonsharragh County Wexford farmer who died 27 December 1913 granted at Waterford to William Foley farmer Effects £264.4s.4d, 146437=In 1838, in a chancery advertisement of John Flood and Sons [or others], Plaintiffs, and William Sutton and Sons [or others], Defendants, there is the following reference:, 565009=Sale at one o'clock. John Hinton, Auctioneer, Wexford and Enniscorthy. Red House, Wexford, April 22nd 1871., 868837=In March 1903, at the monthly petty sessions held in Arthurstown, Mary Treacy was fined for a road nuisance offence., 105127=Frances Amelia b. 16 July 1867 Fethard Tipperary (LDS), 153010=There is also a record of a letter from Barry in 1783, regarding the money that he owed to him (Griffin)., 562849=Sale at twelve o'clock. John Hinton, Auctioneer, Red House, Wexford and Enniscorthy, Wexford Feb 10 1871., 558518=Adjourned Road Sessions...Forth...15. To keep in repair for five years, 1342 perches of post road from Wexford to Broadway, between the end of Paul quay and Mathew Tracey's house in the Faythe, and between Hayes's house in the Faythe and the 3rd milestone on Kilmacree, not to exceed 3s per perch. Half off county., 105875=James b. 4 May 1880 Armagh (LDS), 581005=Tracy (Derry) December 9 1934, at his residence, Ardkill, Derry, John Tracy formerly of High St., Wexford. RIP. Funeral took place to family burial ground, Ardmore, Derry, yesterday (Tuesday). Queen of the Most Holy Rossary, pray for him. Sacred Heart of Jesus, have mercy on his soul. [He was from Derry], 577181=Probate of the will of Mary Walsh late of Corramacorra Murrintown County Wexford widow who died 23 February 1913 granted at Dublin to Maria S. Tracey spinster. Effects £21.19.4, 862512=28 April 1887 Freeman's Journal, 563678=To be sold by auction on Friday the 5th May 1871 at the Red House Quay, Wexford., 105380=John b. 24 January 1869 Fethard Tipperary (LDS), 105626=Lilly Mary b. 9 September 1878 Armagh Armagh (LDS), 864003=On the 16 February 1901, a sad drowning fatality occurred at Waterford on Sunday Night, when a young woman named Bridget Tracey [Bridget Tracy b. 1873], a native of New Ross, was drowned in attempting to rescue her sweetheart, who had fallen into the Suir. Five months later, her body was recovered floating in the Suir at Grace Dieu., 580194=...Patrick Treacy, 11 High Street, Wexford... [he also applied for a similar job in 1916 and 1923], 577794=1915 Army Application - Not approved., 578340=39 years 280 days, b. 1876, Shoeing Smith?, married, RC, 5'4.25\", 40\" chest, mark on inside of right thigh, fit for service at home or abroad, Annie Tracy 12 high street Wexford wife 1895? next of kin, 776967=I am researching the Wheelocks. You mentioned a marriage settlement document 1764, between Christopher Jeffares (another relative ) and Mary Berry, with James Tracey, alehouse owner as witness.  Matthew Tracey m. Mary Bennett nee Wheelock 1850 Killinick , her first husband was Thomas Bennett., 543300=13 July 1855, 163331=Sir - As to the manners and customs of our ancestors are sinking into oblivion, may I tresspass on your columns for the following account of a singular, and picturesque custom of burying their dead, observed by some families, of a respectable class of peasantry in this immediate neighbourhood, which custom here was confined solely, for at least a century back, to some families named Tracy, with their connections, Doyles, &c., and a family named Daly, in no way connected with the Tracy family. The grave being dug deep, stones were placed within the grave at each end, about 2½ feet in height, the grave was then neatly lined with soil or grass scrolls of about 2½ feet in width, and of sufficient length to extend from the surface to, and on the bottom of the grave, fastened to the bank with skewers of wood, next a bed of dry grass and moss was laid in the grave, raised at the head like a pillow - the corpse wrapped closely in a sheet, was carried on a broad plank to the grave, where being deposited on the bed of grass, the plank was laid over it, being supported at each end by the stones before mentioned, which kept it about 1½ feet above the corpse; next, the upper part of the scrolls were unfastened from the side and carefully laid over the plank, the end scrolls in like manner. The grave was then filled up with earth, and covered with a scroll in the ordinary way. The last so buried thus was John Doyle, of craan, about the year 1818, in St. John's church yard, adjoining this town, the burying place of those families. The grave was prepared and the funeral conducted by the Tracys. Since then the younger branches of the family, having the conducting of funerals, have fallen into the habits of their neighbours. Caoineing, or keening, was not customary at those funerals. Having been at funerals in remote districts of the south and west of Ireland, where the corpse was attended to the grave by caoiners (keeners), I never knew or heard then, of any family voluntarily burying their dead without coffins. Now, as we are a mixed race in this county, - the descendants of old Irish, Danes, Welsh, Anglo-Normans, &c., you, or any of your numerous readers, giving information, of the origin of the above custom will much oblige., 579324=8/12/1915 Discharged - Not being likely to become an efficient soldier., 653338=June 8th after a lingering illness borne with Christian fortitude and entire resignation, Eliza, third sister of the late? Mr Mathew Tracey, Maudlintown, sincerely regretted. - May she rest in peace., 560914=In the 1870 Slater's Directory of Ireland, it would appear that Margaret Tracy now ran the Public House in the Faythe., 483522=Wexford Poor Law Union...Fever Hospital...Dr Crean, on the same day [7th instant], remarks - Nurse Tracey left the hospital yesterday immediately after my visit, without my permission, and did not return until after 3 o'clock. I wrote to the Committee to suspend or dismiss her, and let Mrs M'Guirke act for the present in her place...Nurse Tracey should be discharged, we do so, and discharge her from further service in the Hospital subject to the Board on Saturday next..., 153350=One of the Tracys of Newburyport, Captain Thomas Tracy who left Ireland around 1766, did travel to Ireland in 1783 and visited his parents, but it is not completely certain that he was from Wexford.}",
    "lastModified": "Wed, 01 Jul 2015 09:46:54 GMT",
    "textBeforeTable": "mso-fareast-font-family:\"Times New Roman\";mso-ansi-language:EN-GB\"> townland of the Parish of Kilgorman (Ord. S. 3 & 7)  342 acres mso-fareast-font-family:\"Times New Roman\";mso-ansi-language:EN-GB\">Cloneranny The record for Martha Tray is also included, as it may be a spelling error, but she may be related to the Trays of Arklow. John Treacy and lessor Michael Treacy of Cloneranny; William Tracey of Kilmichael; William Tracey, Bridget Tracey and Rose Tracey of Kilpatrick; all of the Civil Parish of Kilgorman. In the Griffiths Valuation of 1853 the following were recorded:   EN-IE\">First went to sea as Fishm in the year 1835. When unemployed resides at Arklow. Fish[erman], 5'7.5\", brown hair, blue eyes, fresh complexion. Michael Tracey, born Cloneraney Wexford in 1815. Issued at Dublin 12th Feb 1845. Seaman Ticket. No.260,480",
    "textAfterTable": "height:12.75pt\"> House - £0.5.0 Kilmichael townland of the Parish of  Kilgorman (Ord. S. 3 & 7)  342 acres Map (# of 10) Occupants Immediate Lessor Description Area Valuation (land/buildings) 1a William Tracey",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}