{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17"
        ],
        [
            "Car Number",
            "72",
            "55",
            "0z",
            "88",
            "1H",
            "M1",
            "6",
            "50",
            "24",
            "27",
            "10",
            "31D",
            "25",
            "6.",
            "880.",
            "36",
            "13"
        ],
        [
            "Name",
            "Dan Loughan",
            "Larry Wallace",
            "Chris Ozanich",
            "Richard LaPratt",
            "Brian Heeney",
            "Bill Butler",
            "Matthew Schindewolf",
            "Leroy Ellis",
            "Dusty Carl",
            "Nyle Weiler",
            "Bud Perry",
            "Trei Deubel",
            "Nick Fleury",
            "Perry Davenport",
            "Michael Olcott",
            "Tom Williams",
            "Ken Buchner"
        ],
        [
            "Behind Leader",
            "",
            "0.303",
            "2.131",
            "3.664",
            "5.295",
            "6.074",
            "6.498",
            "7.081",
            "7.168",
            "7.695",
            "7.937",
            "8.832",
            "8.931",
            "9.007",
            "9.691",
            "--23 Laps--",
            "--32 Laps--"
        ],
        [
            "Gap",
            "",
            "0.303",
            "1.828",
            "1.533",
            "1.631",
            "0.779",
            "0.424",
            "0.583",
            "0.087",
            "0.527",
            "0.242",
            "0.895",
            "0.099",
            "0.076",
            "0.684",
            "--23 Laps--",
            "--9 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap June 30, 2006",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/archives/2006/recap0630.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 708543109,
    "recordOffset": 708527474,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1291=Mid-Season Championship Night saw many of the regular drivers hit their stride, while others struggled to stay up front. There were some new faces in the Winner?s Circle in a couple of divisions, while in other divisions, familiar faces posed for their victory photos. Autograph Night is always a crowd pleaser with the fans, and Friday night was no exception, featuring cars, drivers, autograph cards and candy. What could be better? Thirteen Andrews Chevrolet Super Late Models timed in for their 40-lap feature, with Jeff Hackworth setting fast time at a 12.876, putting him mid-pack for the start of the feature. Stan Perry charged to the lead at the drop of the green, with Chris Place in hot pursuit. Jack Landis wanted nothing more than to pass Perry, his father-in-law, and after running side by side on lap 11, took over the lead on lap 13. Place continued to run in third, as Jimmy Gallagher went to work on his rear bumper. Hackworth and Gallagher jumped up to the second groove to challenge for position. Hackworth made it stick, opening the door for Doug Finley and himself to make their way around Jon McNett by lap 22. Place and Gallagher continued to vie for the third spot, as Landis drove away from Perry, sitting in second. Caution waved on lap 33, wiping out Landis? lead, which set up a seven-lap shoot-out. Caution would wave two more times before completion of the 40-laps. At the checker, it was Landis, Perry, Gallagher, Hackworth and Finley. Heat wins went to McNett and Perry. Leroy Ellis, or ?Lightning?, set fast time again for the WMMQ Classic Rock 94.9 MI Modified division, proving ?Lightning? does indeed strike twice. He raises the bar nearly every week and has set fast time at both Spartan and Springport. Fast time for Ellis was a 13.799 and he was shown starting in the ninth position behind the invert. Tim Easey dropped out of the line-up on the warm-up laps, moving Ellis up to the seventh position, which made him a threat early on in the feature. Bud Perry grabbed the lead at the start of their 35-lap feature, with Dan Loughan hot on his heels. Perry and Loughan put a little real estate between themselves and the rest of the field, while Bill Butler, Larry Wallace, and Chris Ozanich tried to run them down, but with their own battle for position, the leaders continued to pull away. Ellis used the high side to his advantage, making his way around Ozanich on lap 11, next picking off Wallace and Butler by lap 12. Caution on lap 12 closed up the field, and on the restart, Perry, Loughan and Ellis broke away from the pack, with Ellis looking to the outside of Loughan on lap 14. Ellis grabbed the second spot and zeroed in on Perry on lap 18. Ellis got into Perry on lap 21 and was sent to the rear to try to work his way back to the front in 15 laps. On the lap 21 restart, Loughan, Wallace and Ozanich drove around Perry, as he suffered a flat tire and made the hard right turn into the pit. Caution once again flew, and on the restart, it was Loughan sitting up front followed by Wallace, Ozanich, Butler and Dick LaPratt. At the line, it was Loughan, Wallace, Ozanich, LaPratt and Brian Heeney (who worked his way up from 15th.) Trei Deubel and Perry won their heats. The Performance Automotive NW Street Stocks were sparse, but the racing was anything but dull, as Ron Heeney drove into the early lead around lap one leader, Chuck Wilkinson, and never looked back. The battle for second on back really shaped up to be a good one, as Jack Koone Jr. attempted to fend off Scott Sigman, and later, Dane Long. Long worked his way up through the pack to sit in fifth by lap 12, while Heeney ran away to hide. Koone held the preferred line, as he and Sigman fought tooth and nail for the second position. Long began to reel them in and caught them on lap 20. Sigman and Long ran side by side, with Damon Place looking on in the fifth position. Sigman and Long made their way around Koone and at the stripe, it was Heeney, Sigman, Long, Koone and Place. Jamie Feguer and Koone scored heat wins. The Holiday Powersports Pony Stocks start of their 20-lap feature was sheer chaos, as a spin coming down for the green, started a chain reaction that should have resulted in about seven wrecks. When the dust cleared, everyone got themselves settled back in their original start position to take the green again. Keith Holden led lap one, with Wayne Beckner Jr. and Randy Kretzinger Jr. in tow. Beckner grabbed the lead on lap four as John Ward and Jimmy Scavarda marched up into the top five behind John Conroy and Tina Anderson. Ward and Scavarda reeled in Beckner as Mark Garland jumped into the mix. Ward grabbed the lead on lap 10, with Garland and Scavarda coming fast. Ward drifted high and Garland scooted under him for the lead on lap 12. Scavarda caught Garland, and then got into him. Garland recovered, but not until he was back in the fourth position. Bryan Passick Jr. watched this all unfold in front of him but continued on in the fifth position. After 20 laps, it was Scavarda, Ward, Conroy, Garland, and Passick Jr. Heat wins were tallied by George Wyers and Garland. The Pure Stocks put on a two car dash for the cash, with Russ Potter, who is no stranger to the track, grabbing the 10-lap feature win over Wayne Parkhurst II, on Potter\\'s first night out at the Spartan Speedway in a Pure Stock. Congrats Russ! Please join us each and every Friday night, as the Super Late Models have returned to the 2006 schedule as a regular division. July 7th is Schram Auto and Truck Parts Night with SLMs, MI Modifieds, Street Stocks, Pony Stocks, MCR Dwarfs, and Spectator Drags. July 14th is the ?Chargin? Charlie Ryan? Memorial Race featuring a complete invert. SLMs, MI Modifieds, Street Stocks and Pony Stocks will be in competition. Help us celebrate the 50th Anniversary of the Spartan Speedway on July 21st. It will be Old Timers Night sponsored by Auto Value Bumper to Bumper, Beacon Sales and Snethkamp Dodge and Saab. All five divisions will be in action that evening. We?ll see you at the races!}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Mid-Season Championship Night saw many of the regular drivers hit their stride, while others struggled to stay up front. There were some new faces in the Winner?s Circle in a couple of divisions, while in other divisions, familiar faces posed for their victory photos. Autograph Night is always a crowd pleaser with the fans, and Friday night was no exception, featuring cars, drivers, autograph cards and candy. What could be better? Thirteen Andrews Chevrolet Super Late Models timed in for their 40-lap feature, with Jeff Hackworth setting fast time at a 12.876, putting him mid-pack for the start of the feature. Stan Perry charged to the lead at the drop of the green, with Chris Place in hot pursuit. Jack Landis wanted nothing more than to pass Perry, his father-in-law, and after running side by side on lap 11, took over the lead on lap 13. Place continued to run in third, as Jimmy Gallagher went to work on his rear bumper. Hackworth and Gallagher jumped up to the second groove to challenge for position. Hackworth made it stick, opening the door for Doug Finley and himself to make their way around Jon McNett by lap 22. Place and Gallagher continued to vie for the third spot, as Landis drove away",
    "textAfterTable": "Pos Car Number Name Best Time Behind Leader 2nd Best Time 1 50 Leroy Ellis 13.799 -.--- 13.958 2 6. Perry Davenport 13.904 0.105 13.920 3 88 Richard LaPratt 13.936 0.137 14.049 4 55 Larry Wallace 13.948 0.149 13.953 5 72 Dan Loughan 13.963 0.164 13.974 6 0z Chris Ozanich 13.983 0.184 14.034 7 10 Bud Perry 13.985 0.186 14.147 8 M1 Bill Butler 13.992 0.193 14.033 9 63 Tim Easey 14.016 0.217 14.028 10",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}