{
    "relation": [
        [
            "Patent application number",
            "20140156623",
            "20140172853"
        ],
        [
            "Description",
            "GENERATING AND DISPLAYING TASKS - Methods, systems, and apparatus, including computer programs encoded on computer storage media, for generating tasks from user observations. One of the methods includes segmenting a plurality of observations associated with a user of a user device into a plurality of tasks previously engaged in by the user; and generating a respective task presentation for each of the plurality of tasks for presentation to the user.",
            "GENERATING AND DISPLAYING TASKS - Methods, systems, and apparatus, including computer programs encoded on computer storage media, for generating tasks from user observations. One of the methods includes segmenting a plurality of observations associated with a user of a user device into a plurality of tasks previously engaged in by the user; and generating a respective task presentation for each of the plurality of tasks for presentation to the user."
        ],
        [
            "Published",
            "06-05-2014",
            "06-19-2014"
        ]
    ],
    "pageTitle": "David Martin - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/david-martin-2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434291571,
    "recordOffset": 434272528,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "David Martin, Milpitas, CA US 01-03-2013 EDGE FILTER HAVING MULTIPLE FILTERING OPENINGS - The filter is made of a flat wire with a generally rectangular cross section that has two long sides and two short sides. The flat wire is formed into a generally cylindrical helix defined by successive loops of wire stacked adjacent to one another. For any two successive wire loops, the long sides of the wire loop are set at a predetermined distance from the long side of an adjacent wire loop. Additionally, the short sides of successive wire loops are substantially aligned. 20130000603 Published Description Patent application number David Martin, Dunlap, IL US 08-29-2013 High Resolution Pulse Width Modulator - A pulse width modulator has a first clock source providing a clock signal to a set input of an output controller configured to set a pulse width output signal and having a reset input to reset the pulse width output signal. A duty cycle control unit is coupled with the reset input of the output controller, wherein the duty cycle control unit has a numerical controlled oscillator (NCO) being coupled with a register and configured to provide for a direct digital synthesis to produce a specified frequency according to a value set in the register. Furthermore, logic is provided for receiving a signal from a second clock source and the pulse width output signal to trigger the numerical controlled oscillator. 20130223508",
    "textAfterTable": "David Martin, Toronto CA Patent application number Description Published 20140143215 ASSURED FEDERATED RECORDS MANAGEMENT - A record is managed by obtaining from an external system on which a stored object comprising the record is stored a property of the stored object as stored on the external system. A stored property associated with the record is compared with the obtained property of the stored object. In the event the comparison does not match, responsive action is taken. 05-22-2014 David Martin, Oakland, CA US Patent application number Description Published 20140266873 ACCOUNTING FOR ATMOSPHERIC AND TERRESTRIAL OBSTACLES IN GEOGRAPHIC POSITIONING - A position fix identifying a geographic location of a receiver is received. The position fix was generated using signals received at the receiver from respective high-altitude signal sources (such as satellites). Imagery of a geographic area that includes the geographic location is also received. The imagery is automatically processed to determine whether one or more of the high-altitude signal sources were occluded from the geographic location when the position fix was generated. In response to determining that one or more of the high-altitude signal sources were occluded from the geographic location when the position fix was generated, the position fix is identified as being potentially erroneous. 09-18-2014 20150073711 Landmark Identification from Point Cloud Generated from Geographic Imagery Data - Systems and methods for identifying prominent landmarks in a geographic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}