{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is generally very safe. I have only heard of two real incidents in the 6 years I have been living around the area. There are no call boxes for security, as at some of the bigger schools, but security does answer their phone and can be anywhere on campus pretty quickly.",
            "There isn't a whole lot of greek life. Those that are on campus are generally talked of well, but there isn't any special privileges for them that I am aware of.",
            "There are quite a few clubs to get involved in and campus activities to take part in. Chowan makes sure everyone has something they will like to get involved with and do a lot with the surrounding communities.",
            "Liberal arts students do very well here. It's not big for technical or the hard sciences and there is no real computer science major. Business majors do very well here, too.",
            "Get involved in the clubs. Virginia Beach is only about an hour and a half drive away. Busch Gardens is about two hours away. There are a lot of options if you have a car or can hitch a ride with someone.",
            "I did not have a meal plan but ate in the cafeteria and at Murf's (the on campus little cafe type place) and the food was always good for me. It's not the best, but you can't expect a ton from college food. I liked Murf's better than the cafeteria, but the cafeteria had a lot more options.",
            "I stayed off campus and did not live in the dorms, so I can't really comment. I do know that new apartments are being built for this fall and they look really great.",
            "Some classes are very easy and some are notoriously hard, but overall, most classes are challenging but not overwhelming. Keep up with homework and don't be afraid to ask questions. Most professors will work with you after hours if you need help.",
            "Make sure you get all your paperwork done early. You really want to get express check in. Check back often to insure that everything is filled and checked. Go to the earliest orientation (SOAR) possible to have a chance to get a good class schedule.",
            "Chowan University has a great atmosphere for students. It's a small town school, which makes for a great interaction between faculty and students. The small area, however, makes social events outside of school small and not often."
        ]
    ],
    "pageTitle": "Chowan University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Chowan-University/reviews?_escaped_fragment_=/show/40274",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903637175,
    "recordOffset": 903596713,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{137900=You have a class on Wednesdays call Perspectives at 11:00, at this time no other classes are offered. Perspectives is a participation grade for the entire campus where you have to attend at least 8 events. The events range from everything to Sports events to Greek life and Historical Events. Also the class isn't transferable., 170993=The food is pretty good, I'm not the type who changes up my diet, so I'm content with eating pizza all the time. That's the only issue, that the food is a bit repetitive, but I've only been here for a couple of days. Lets see how I feel at the end of May..., 188351=© 2015, Cappex.com, LLC, 74060=This school is great for those students whose GPA ranges from a 2.25 and 3.25, with a 1300 the SAT., 74375=Chowan was founded in 1848 by Baptist families and the name means “people of the south” , to honor the Native American Algonquin Chowanook tribe.}",
    "textBeforeTable": "12/30/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 46 Michael from Norfolk, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Bang for the buck A lot of kids here complain about the price, as long as you apply for scholarships, and do your financial aid, then you are okay. Am enjoying being here I love Chowan! When I came for orientation, they welcomed my mother and I with open arms! I knew this was the school for me! Am learning a lot As a freshman I am learning the real definition of time management. This is an important factor because you chose what time you want your classes to start and what time you want them to end. You don't want to pick a class and you over sleep and miss it. Login to rate or flag the reviews Santina from Garysburg, NC 07/06/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 46 Categories Comments Tips for prospective students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}