{
    "relation": [
        [
            "Fields",
            "SAWLocale locale",
            "String userAgent",
            "String syndicate",
            "LogonParameter logonParams",
            "boolean asyncLogon",
            "String sessionID"
        ],
        [
            "Description",
            "Specifies the locale to be used, supplied in the SAWLocale structure. For information about the SAWLocale structure, see Section 3.8, \"SAWSessionService Service\".",
            "Specifies whether the HTMLView service will be used with current session. It specifies the userAgent string of the browser, where Oracle Business Intelligence Presentation Services HTML content is displayed. Oracle Business Intelligence Presentation Services uses this information to produce browser-specific HTML.",
            "Internal use only.",
            "Specifies the parameters used for authentication.",
            "If set to TRUE, then asynchronous login is enabled. If set to FALSE (default), then asynchronous login is not enabled.",
            "Specifies the unique ID of the session. This field is used in Section 3.8.9, \"logonex() Method\" and Section 3.8.5, \"impersonateex() Method\"."
        ]
    ],
    "pageTitle": "Description of Structures in Oracle BI EE Web Services",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/bi.1111/e16364/structures.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72651375,
    "recordOffset": 72632668,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79727=Use this structure to provide additional parameters in Section 3.10.18, \"updateCatalogItemACL() Method\". This structure is used inSection 3.10, \"WebCatalogService Service\"., 1235=2048 = Permission to run an Oracle BI Publisher report live}",
    "lastModified": "Wed, 13 May 2015 05:21:46 GMT",
    "textBeforeTable": "Table 2-26 SAWSessionParameters Structure Fields Table 2-26 lists the fields in this structure. Use this structure to define optional parameters for the current session. This structure is used in Section 3.8, \"SAWSessionService Service\". 2.23 SAWSessionParameters Structure Specifies the country code. Values for country should conform to the ones used in Java, in the java.util.Locale class (ISO-639, ISO-3166). String country Specifies the language code. Values for language should conform to the ones used in Java, in the java.util.Locale class (ISO-639, ISO-3166). String language Description Fields Table 2-25 SAWLocale Structure Fields Table 2-25 lists the fields in this structure. Use this structure to define the locale for the current session. This structure is used in Section 3.8, \"SAWSessionService Service\". 2.22 SAWLocale Structure Specifies an array of the table's columns. For information about the SAColumn structure, see Section",
    "textAfterTable": "2.24 SegmentationOptions Structure Use this structure to define the segment or segment tree to override the defaults specified in the Oracle Marketing Analytics user interface. This structure is used in the Section 3.5, \"MetadataService Service\". Table 2-27 lists the fields in this structure. Table 2-27 SegmentationOptions Structure Fields Fields Description OverrideType cacheOverride Specifies how you want to override the Oracle Marketing Analytics' \"Cache the block for future update counts requests\" user interface option. If set to Default, then the cache override is not specified in the structure or the structure is not specified. The Default value specifies to use what is defined in the user interface option for each criteria block. If set to None, the system overrides the user interface-defined values and sets all criteria blocks to disable the \"Cache the block for future update counts requests\" user interface option. If set to All, the system overrides the user interface-defined values and sets all criteria blocks to enable the \"Cache the block for future update counts requests\" user interface option. OverrideType",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}