{
    "relation": [
        [
            "Condition:",
            "Gender:",
            "Sport:",
            "Country of Manufacture:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Unisex",
            "Diving & Snorkeling",
            "Thailand"
        ],
        [
            "Brand:",
            "Model:",
            "MPN:",
            ""
        ],
        [
            "Promate",
            "SCS0068",
            "SCS0068",
            ""
        ]
    ],
    "pageTitle": "Panoramic Purge Dive Mask DRY Snorkel Fins Gear BAG SET | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Panoramic-Purge-Dive-Mask-Dry-Snorkel-Fins-Gear-Bag-Set-/370447045208?pt=LH_DefaultDomain_0&hash=item56405d5258",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417543299,
    "recordOffset": 417491692,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Jun 17, 2015 15:16:14 EDT  Seller assumes all responsibility for this listing. 370447045208 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "GetWetStore Visit my eBay store   Sign up for newsletter Search Store Scuba Dive Regulators Computers Scuba Dive Masks Dive Snorkels Scuba Dive Accessories Items On Sale Store Categories Store home Scuba Dive Regulators Gauge Consoles / Compasses Computers Scuba Dive Masks Dive Snorkels Snorkeling Gear Sets Dive Fins Dive Knifes Dive Bags Dive Gloves Dive Boots Scuba Dive Accessories Scuba Packages Prescription Dive Masks Dive Mask Snorkel Combo Kid's",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}