{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "TD"
        ],
        [
            "regulations.gov",
            "2015-08746",
            "1545-BL46",
            "9713"
        ]
    ],
    "pageTitle": "26 CFR 301.6229(c)(2)-1T - Substantial omission of income (temporary). | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/301.6229(c)(2)-1T",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912462815,
    "recordOffset": 912428430,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1156=Title 26 published on 2013-04-01.}",
    "TableContextTimeStampAfterTable": "{321195=This document contains corrections to a notice of proposed rulemaking by cross-reference to temporary regulations (REG-143040-14) that was published in the Federal Register on Friday, March 13, 2015 (80 FR 13292). The IRS is issuing temporary regulations relating to information reporting by brokers for transactions involving debt instruments and options., 137137=This document contains final regulations that provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010. The regulations will affect charitable hospital organizations., 159560=This document contains final regulations relating to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173 (collectively, the Affordable Care Act). These final regulations provide individual taxpayers with guidance under section 5000A of the Internal Revenue Code on the requirement to maintain minimum essential coverage and rules governing certain types of exemptions from that requirement., 290362=This document contains corrections to notice of proposed rulemaking by cross-reference to temporary and notice of public hearing (REG-133489-13) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18171). The notice of proposed rulemaking by cross-reference to temporary and notice of public hearing are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 413641=The Department of the Treasury invites public comments with regard to future guidance required to implement provisions of the Multiemployer Pension Reform Act of 2014, Division O of the Consolidated and Further Continuing Appropriations Act, 2015, Public Law 113-235 (MPRA). MPRA generally permits a sponsor of a multiemployer defined benefit plan that is in critical and declining status to suspend certain benefits following the provision of specified notice, consideration of public comments, approval of an application for suspension, and satisfaction of other specified conditions (including a participant vote)., 229806=This document contains proposed regulations that provide guidance regarding the application of the modified carryover basis rules of section 1022 of the Internal Revenue Code (Code). Specifically, the proposed regulations will modify provisions of the Treasury Regulations involving basis rules by including a reference to section 1022 where appropriate. The regulations will affect property transferred from certain decedents who died in 2010. The regulations reflect changes to the law made by the Economic Growth and Tax Relief Reconciliation Act of 2001 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010., 37514=This document contains corrections to final regulations (TD 9715) that were published in the Federal Register on April 1, 2015 (80 FR 17314). The final regulations are regarding the agent for an affiliated group of corporations that files a consolidated return (consolidated group)., 395090=This document contains proposed regulations that provide the method to be used to adjust the applicable Federal rates (AFRs) under section 1288 of the Internal Revenue Code (Code) (adjusted AFRs) for tax-exempt obligations and the method to be used to determine the long-term tax-exempt rate and the adjusted Federal long-term rate under section 382. For tax-exempt obligations, the proposed regulations affect the determination of original issue discount under section 1273 and of total unstated interest under section 483. In addition, the proposed regulations affect the determination of the limitations under sections 382 and 383 on the use of certain operating loss carryforwards, tax credits, and other attributes of corporations following ownership changes. This document also contains a request for comments and provides notice of a public hearing on these proposed regulations., 192343=This document contains corrections to final regulations (TD 9696) that were published in the Federal Register on October 1, 2014 (79 FR 59112). The final regulations are relating to the deductibility of expenses for lodging when an individual is not travelling away from home (local lodging)., 119228=This document contains final Income Tax Regulations with respect to a provision of the Internal Revenue Code (Code) that addresses situations in which foreign income taxes have been separated from the related income. These regulations are necessary to provide guidance on applying the statutory provision, which was enacted as part of legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA) on August 10, 2010. These regulations affect taxpayers claiming foreign tax credits or deducting foreign income taxes., 154495=This document contains final regulations providing guidance relating to the provisions of the Hiring Incentives to Restore Employment (HIRE) Act that require specified foreign financial assets to be reported to the Internal Revenue Service for taxable years beginning after March 18, 2010. In particular, the final regulations provide guidance relating to the requirement that individuals attach a statement to their income tax return to provide required information regarding specified foreign financial assets in which they have an interest. The final regulations affect individuals required to file Form 1040, “U.S. Individual Income Tax Return,” or Form 1040-EZ, “Income Tax Return for Single and Joint Filers With No Dependents,” and certain individuals required to file Form 1040-NR, “Nonresident Alien Income Tax Return,” or Form 1040NR-EZ, “U.S. Income Tax Return for Certain Nonresident Aliens with No Dependents.”, 132930=This document contains corrections to final regulations (TD 9689) that were published in the Federal Register on Monday, August 18, 2014 (79 FR 48661). The final regulations are regarding dispositions of property subject to depreciation under section 168 of the Internal Revenue Code., 49780=This document contains a correction to final and temporary regulations (TD 9674) that were published in the Federal Register on Wednesday, July 2, 2014 (79 FR 37630). The final and temporary regulations provide guidance to eligible organizations seeking recognition of tax-exempt status under section 501(c)(3) of the Internal Revenue Code., 214733=This document contains final regulations that amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code (the Code), and the Public Health Service Act. Excepted benefits are generally exempt from the health reform requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Patient Protection and Affordable Care Act. In addition, eligibility for excepted benefits does not preclude an individual from eligibility for a premium tax credit under section 36B of the Code if an individual chooses to enroll in coverage under a Qualified Health Plan through an Affordable Insurance Exchange. These regulations finalize some but not all of the proposed rules with minor modifications; additional guidance on limited wraparound coverage is forthcoming., 128435=This document contains corrections to final regulations (TD 9704) that were published in the Federal Register on Wednesday, November 19, 2014 (79 FR 68763) relating to the consequences to U.S. and foreign persons for failing to file gain recognition agreements (GRAs) or related documents, or to satisfy other reporting obligations, associated with certain transfers of property to foreign corporations in nonrecognition exchanges., 427790=This document contains corrections to a notice of proposed rulemaking(REG-151416-06) that was published in the Federal Register on Monday, November 3, 2014 (79 FR 65151), that prescribe how a partner should measure its interest in a partnership's unrealized receivables and inventory items, and that provide guidance regarding the tax consequences of a distribution that causes a reduction in that interest., 8340=This document contains corrections to final regulations (TD 9708) that were published in the Federal Register on December 31, 2014 (79 FR 78954). The final regulations provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010., 432427=This document contains proposed regulations concerning the application of section 41 of the Internal Revenue Code (Code), which provides a credit for increasing research activities. The proposed regulations provide guidance on computer software that is developed by (or for the benefit of) the taxpayer primarily for internal use by the taxpayer (internal use software) under section 41(d)(4)(E). These proposed regulations also include examples to illustrate the application of the process of experimentation requirement to computer software under section 41(d)(1)(C). The regulations will affect taxpayers engaged in research activities involving computer software. This document also provides notice of a public hearing on these proposed regulations and withdraws the advance notice of proposed rulemaking published on January 2, 2004., 54256=This document contains corrections to final and temporary regulations (TD 9713) that were published in the Federal Register on March 13, 2015 (80 FR 13233). The final regulations are relating to information reporting by brokers for bond premium and acquisition premium., 201541=This document contains final regulations that will remove regulations relating to information reporting and backup withholding for the Qualified Payment Card Agent (QPCA) Program. This document also amends regulations to remove references to the QPCA Program. Enactment of the payment card and third party network reporting requirements in the Housing Assistance Tax Act of 2008 made the QPCA Program obsolete. Because no payors have applied to be designated as a QPCA (and no payors have been designated as a QPCA), no taxpayers will be affected by these final regulations., 220947=Title 26 published on 2013-04-01, 25102=This document contains corrections to final regulations (TD 9718) that were published in the Federal Register on Tuesday, March 31, 2015 (80 FR 16973). The final regulations relating to the exception to the general three-year period of limitations on assessment under section 6501(c)(10) of the Internal Revenue Code (Code) for listed transactions that taxpayer failed to disclosed as required under section 6011., 80575=This document contains final regulations that amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code, and the Public Health Service Act to specify requirements for limited wraparound coverage to qualify as an excepted benefit. Excepted benefits are generally exempt from the requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Affordable Care Act., 169316=This document contains a correction to final and temporary regulations (TD 9657), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12812). The regulations relate to information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities., 85119=This document contains corrections to final regulations (TD 9709) that were published in the Federal Register on January 29, 2015 (79 FR 4791). The final regulations authorize the IRS to prescribe the procedure by which certain entities may apply to the IRS for recognition of exemption from Federal income tax., 29536=This document contains corrections to final regulations (TD 9717) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18096). The final regulations are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 196888=This document contains final regulations that provide guidance on the mandatory electronic filing of Form 2290, “Heavy Highway Vehicle Use Tax Return,” for 25 or more vehicles; credits or refunds for sold, destroyed, or stolen vehicles; and the tax liability and computation of tax on the use of certain second-hand vehicles. The regulations affect owners and operators of highway motor vehicles with a taxable gross weight of 55,000 pounds or more. These final regulations also remove the temporary regulations that provide guidance on the filing of Form 2290 and payment of the associated highway use tax for the taxable period beginning July 1, 2011., 239603=In the Rules and Regulations section of this issue of the Federal Register, the IRS is issuing final and temporary regulations that amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. The regulations provide an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of these proposed regulations. This document withdraws the notice of proposed rulemaking (REG-107548-11; RIN 1545-BK10) published in the Federal Register on May 11, 2012 (77 FR 27669)., 3169=This document contains final and temporary regulations amending the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. This document also contains temporary regulations regarding an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking (REG-102656-15) on this subject in the Proposed Rules section in this issue of the Federal Register .}",
    "lastModified": "Wed, 03 Jun 2015 07:37:07 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 26437 - Notional Principal Contracts; Swaps With Nonperiodic Payments 2015-05-08; vol. 80 # 89 - Friday, May 8, 2015 * Only displaying the most recent 50 entries for Title 26. Please, view a Part for the full list of changes within that Part. For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on 2013-04-01. [T.D. 9466, 74 FR 49322, Sept. 28, 2009] The applicability of this section expires on or before September 24, 2012. Expiration date. (c) The rules of this section apply to taxable years with respect to which the applicable period for assessing tax did not expire before September 24, 2009. Effective/applicability date. (b)",
    "textAfterTable": "DEPARTMENT OF THE TREASURY, Internal Revenue Service Final and temporary regulations. Effective Date. These regulations are effective on May 8, 2015. Applicability Date. For the dates of applicability, see §§ 1.446-3T(j)(2) and 1.956-2T(f). 26 CFR Part 1 Summary This document contains final and temporary regulations amending the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. This document also contains temporary regulations regarding an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking (REG-102656-15) on this subject in the Proposed Rules section in this issue of the Federal Register . 2015-05-04; vol. 80 # 85 - Monday, May 4, 2015 80 FR",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}