{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "GN Docket No.",
            "Report No."
        ],
        [
            "regulations.gov",
            "2014-25456",
            "",
            "12-268",
            "3011"
        ]
    ],
    "pageTitle": "47 CFR 74.1290 - FM translator and booster station information available on the Internet. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/74.1290",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906241647,
    "recordOffset": 906226486,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1065=Title 47 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{3892=In this document, the Commission announces that the Office of Management and Budget (OMB) approved on December 5, 2014, for a period for three years, a revision to an information collection for the FCC Application for Radio Service Authorization for the Wireless Telecommunications Bureau and the Public Safety and Homeland Security Bureau, FCC Form 601. With this document, the Commission is announcing OMB approval and the effective date of the revised requirements for FCC Form 601., 8663=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 59696=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition.}",
    "lastModified": "Thu, 26 Feb 2015 02:55:31 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 77915 - Information Collection Approval for the Rules Regarding Low Power Auxiliary Stations, Including Wireless Microphones 2014-12-29; vol. 79 # 248 - Monday, December 29, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01 67 FR 13234, Mar. 21, 2002] [ http://www.fcc.gov/mb/audio. The Media Bureau's Audio Division provides information on the Internet regarding FM translator and booster stations, rules, and policies at § 74.1290 FM translator and booster station information available on the Internet. prev | next Rulemaking",
    "textAfterTable": "ET Docket No. 10-24 FCC 14-62 FEDERAL COMMUNICATIONS COMMISSION Announcement of approval date for information collection. FCC Form 601 was approved by OMB on December 5, 2014 and is effective on December 29, 2014. 47 CFR Part 74 Summary In this document, the Commission announces that the Office of Management and Budget (OMB) approved on December 5, 2014, for a period for three years, a revision to an information collection for the FCC Application for Radio Service Authorization for the Wireless Telecommunications Bureau and the Public Safety and Homeland Security Bureau, FCC Form 601. With this document, the Commission is announcing OMB approval and the effective date of the revised requirements for FCC Form 601. 2014-12-23; vol. 79 # 246 - Tuesday, December 23, 2014 79 FR 76902 - Expanding the Economic and Innovation Opportunities of Spectrum Through Incentive Auctions GPO FDSys XML | Text",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}