{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus police, security cameras, small size, late night safe rides, emergency buttons, all around a very safe campus.",
            "it is small, but that makes up strong. i am in the alpha xi delta sorority at uni, and we are the largest one on campus at 60 girls. there are four fraternities, and four sororities.",
            "there is a club for anyone and everyone.",
            "it is t he iowa teaching college, great for students who like to be able to go home on weekends, but also fun for students who like to stay and have fun. there is a huge list of different majors to choose from.",
            "uni has the traditions challenge that lists all of the traditions on campus, many people strive to do all of them before graduation. some of these traditions include kissing under the campanile on homecoming, doing the interlude at a sports event and many more fun things.",
            "it is one of the best priced schools in iowa. with tuition you get into the wrc (wellness center) for free, the health center is free, all sports games/meets for free, also many of the shows and concerts are free for students.",
            "there are plenty of clubs, intramural and campus activities too keep you busy. there is the hill the bar and business strip for the weekends. cab and cats always has something for entertainment, movies, shows artists speakers and little parties.",
            "there are only two dining halls, but lots of carts and grab and go places scattered around campus.",
            "i live in an all girls dorm and absolutely love it. it is a great way to stay close to classes, and meet new people.",
            "professors keep you busy in any major.",
            "there are so many activities, find one to do to meet new people and make some fantastic friends.",
            "i love it here it is the perfect size, not too big but not too small. the campus has a home-like feeling to it. i love that nothing is more than a 15 min walk."
        ]
    ],
    "pageTitle": "University of Northern Iowa (UNI) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Northern-Iowa/reviews?_escaped_fragment_=/show/78101",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896802947,
    "recordOffset": 896727797,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{352409=The University of Northern Iowa has a renowned Business Program; In 2013, the CPA exam pass percentage for students sitting was 100% on all four sections. The college offers hundreds of organizations to get involved in, and the community of the college is almost like a family. UNI is a great choice for a student looking to pursue an education in everything from business to philosophy., 71897=I love it here. Even though I don't live on campus, I am generally on campus from morning until like 10:00 PM because there are so many events/activities that go on throughout the week. It isn't too big and it isn't too small and all of my professors for my classes have done a great job teaching. I have also been able to connect with other Christians on campus through Intervarsity, Fellowship of Christian Athletes, BASIC Plus, BASIC, and Navigators. There are so many ministries and campus clubs/organizations that one can get involved in., 240390=Apply early, scholarship deadlines are early January., 393998=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 88 Greg from Alton, IA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Northern Iowa Reviews University of Northern Iowa › Iowa › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot There are tons of different classes and majors to choose from. The Liberal arts core helps you decided what you actual want to be and makes you a well rounded student. Login to rate or flag the reviews Katelyn from Ames, IA 01/05/2011 Reviewer is Researching this school. Reviewer has been to campus. 2 out of 2 people found this review useful. 3 of 88 Categories Comments Great for these types of students Great for students looking to go into a career in education. Tips for prospective students I would recommend to keep up on the readings for every class. Get the readings done before class so you can use the class discussions as a review. Also, get involved in extracurricular activities from the very beginning. Take advantage of opportunities that arise. Use the activities to meet new friends. Make the most out of your college experience, and most of all, have fun! Bang for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}