{
    "relation": [
        [
            "Account",
            "Income Offset",
            "Retained Earnings"
        ],
        [
            "Entered DR",
            "4,000",
            ""
        ],
        [
            "Entered CR",
            "",
            "4,000"
        ]
    ],
    "pageTitle": "Oracle General Ledger User's Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E18727_01/doc.121/e13627/T312864T451269.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74592435,
    "recordOffset": 74478912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{203635=When you generate this journal batch with a journal effective date of 05-Jan-2004, the following journal is generated for the US Ledger: Journal Entry:, 201467=You also have the following daily rate defined for the Corporate rate type for the Jan-2004 period: CAD to USD: 0.755., 204791=2000 CAD x 0.755 = 1510 USD, 538845=When the rent allocation set is automatically resubmitted on March 1, 1999, General Ledger sets the Journal Period to February 1999. Each subsequent submission has a journal date of the prior month., 278876=Suppose you have a ledger set, US Ledger Set, comprised of two ledgers: East US Ledger and West US Ledger. You want to distribute the 600 US dollars to each ledger in the ledger set based on the fraction of the amount they comprise for account 1200., 201309=Assume that you have access to the USD ledger and that for this ledger, you have a balance of 1000 Canadian dollars entered for account 01.110.1110., 282431=If both the ledgers in the ledger set have $200 USD total for account 1120, when you run this MassAllocation formula, you produce a journal batch with the following journal entries for the US Ledger Set as shown in the table below:, 213983=Review the Recurring Journals Execution Report. General Ledger names the resulting journal batch as follows: <Recurring Batch Name>: <Date> <Time>. For example, Project Expense: 15-JAN-95 16:36., 470616=From: starting effective date of the range, entered as the number of days before the AutoPost submission date. This must be a number from 0 to 1000., 493122=General Ledger names the reversal journal batch as follows: Reverses [Original Journal Entry Name] [Date] [Time]. For example, Reverse Accruals 01-JAN-95 12:00:00 55379., 540503=Suppose you want to schedule month end closing entries for the 1999 calendar year. For example, you choose to submit a recurring journal on the 1st of every month from January 1, 1999 to December 31, 1999. You submit your recurring journal on February 1, 1999 and enter January 15, 1999 as the journal effective date, and January 20, 1999 as the calculation effective date., 540886=When General Ledger automatically submits your scheduled recurring journal on March 1, 1999, the journal period is set to February 1999 and the calculation and journal effective dates are set to February 1, 1999., 470780=To: ending effective date of the range, entered as the number of days after the AutoPost submission date. This must be a number from 0 to 1000., 608748=Copyright © 1988, 2010, Oracle and/or its affiliates. All rights reserved., 279135=Your account is composed of three segments: Company, Department, and Account. Department 110 is the department that stores cash for all the ledgers. Account 1120 is the miscellaneous cash account., 538447=Suppose you want to establish a monthly schedule to book month end rent allocation entries for calendar year 1999. You schedule General Ledger to run a rent allocation on the 1st of every month from January 1999 to December 1999. You submit your rent allocation on the start date of February 1, 1999 and enter January 1999 as the Journal Period. The period offset is calculated to be -1.}",
    "lastModified": "Tue, 23 Jun 2015 15:22:36 GMT",
    "textBeforeTable": "The table that follows provides additional information on values you should use when creating custom layouts for various journal types. Note: Once the layout is saved, you can select this layout when creating Journal Entries with the Journal Wizard. Choose the placement for required and optional fields in your document. All these fields match up with the fields in the GL Interface table. Note that you can place these fields in the Header, Line, Or Context sections of the Layout. Optional Fields - Select the optional fields to include in your document and their placement. These include all other fields that can be entered in a journal entry like Conversion Type/ Date/ Rate, Batch Name/ Description, Journal Name/ Description, Descriptive Flexfield Information fields, Tax Code, etc. Depending on the type of layout being modified, other fields may be required. For example, Budget, Budget Period, and Organization are usually optional during journal entry. However, they are mandatory when creating Budget Journals. Required Fields - These fields include the Balance Type, Database, Ledger, Category, Source, Currency, Accounting Date, Debit, and Credit. Required vs. Optional Fields For example, if you decide on two Headers, then you can place some fields in the header under \"Header 1,\" and some items in the header under \"Header 2.\" While customizing a layout, you can opt to have multiple header blocks or sections. Each of these sections appear as a separate cluster of header fields and you select which fields are displayed in each of",
    "textAfterTable": "Add Conversion Type, Conversion Rate, and Conversion Date to the layout. (Conversion Rate and Conversion Date must both be in the lines or header region.) In addition, the Reverse Journal and Reversal Period fields are necessary for a reversing foreign journal. The VAT information fields can also be added as listed against Functional Actuals Journals. Optionally you can add converted debit and converted credit columns. Budget Journals Add Balance Type to the context region and enter ’Constant’ for default type Enter ’Budget’ Add Organization, Budget Name, and Period to the layout. The Organization field must be added to the header region. Reversal fields can also be added as appropriate. Encumbrance Journals Add Balance Type to the context region and enter ’Constant’ for default type. Enter ’Encumbrance’ Add Encumbrance Type to the layout. Reversal fields can also be added as appropriate. Uploading Data Upload your spreadsheet to Oracle General Ledger by selecting Oracle > Upload. The following table describes select parameters in the Upload window: Upload Parameter Description All Rows vs. Flagged Rows You can upload all rows in your worksheet, regardless of whether changes have been made. You can upload only those rows that are marked with a flag character in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}