{
    "relation": [
        [
            "Semester",
            "Fall 2014",
            "Spring 2015"
        ],
        [
            "Instructor",
            "M. Vilhauer",
            "B. Adkins"
        ],
        [
            "Time",
            "",
            ""
        ]
    ],
    "pageTitle": "Roanoke College | Campus Directory",
    "title": "",
    "url": "https://directory.roanoke.edu/course/phil/all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860926945,
    "recordOffset": 860911360,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16070=An examination of contemporary French t hinkers, such as Michel Foucault, Gilles Deleuze, and Jacques Derrida. Each of t hese thinkers represents an important as pect in the development of what has been variously called post-structuralist and postmodernist discourse as it has devel oped in France since the May 1968 studen t riots. The purpose of this course is t o introduce the student to some importan t trends in French thought since 1968. L ecture: 3 hrs/wk. 1 Unit, 18501=A detailed examination of a topic in the philosophy of religion. Topics for any given semester will be chosen from among such issues as the problem of suffering, the epistemology of religious belief, religious language, and philosophical theology. May be repeated for credit. 1 Unit, 21512=A detailed examination of a topic or single thinker in 20th and 21st Century European Philosophy. Depending on the focus of the professor, topics or thinkers might include (but are not limited to): Hermeneutics; Critical Theory; Deconstruction; Gadamer; Habermas; Derrida. May be repeated for credit. Lecture: 3 hrs/wk. 1 Unit}",
    "textBeforeTable": "Offerings This course seeks to develop skills in formulating and evaluating arguments. To pics covered include the nature and type s of arguments, patterns of fallacious r easoning, inductive logic, and systems o f deductive logic. Lecture: 3 hrs/wk. 1 Unit PHIL 122 Logic } margin-top:0px !important; p{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; h4{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; }h3{ color:#1894e5 !important; padding-bottom: 0px !important; margin-top:0px !important; margin-bottom: 2px !important; h2{",
    "textAfterTable": "Spring 2015 B. Adkins M/W/F 10:50AM-11:50AM Spring 2016 B. Adkins M/W/F 9:40AM-10:40AM PHIL 208 Buddhism This course will encounter the varieties of one of the oldest and most diverse religions as it developed in India, China, Japan, Tibet, and the United States. The course will examine Buddhism?s history, philosophy, ethics, Art, literature, and ritual practices. First, we will study the life and awakening of the Buddha, how the Buddha?s perception of reality transforms our relationships to ourselves and to each other, and how it directs us to live a life of compassion for others. Second, we will see how the Buddha?s core teachings changed as they spread to other countries. The course is divided into three parts: Foundations, which provides an introduction to the Buddhist world view; Development, which charts the changes and elaborations made to that world view under the Mahayana philosophers; and Literature, which explores how Buddhist ideas have been expressed in poetry, the novel, and film. (1) 1 Unit Offerings Semester Instructor Time Spring 2014 M. Larson-Harris M/W/F 12:00PM-1:00PM Spring 2016 M. Larson-Harris M/W/F 1:10PM-2:10PM PHIL 212 Top in Envi Phil: Ethics An introduction to environmental philoso phy. It will focus on philosophical ques tions germane to the relationship betwee",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}