{
    "relation": [
        [
            "Name",
            "Ivasevyi kit",
            "Ivasevyi polosatik",
            "Kiit",
            "Saidianoi kit",
            "Seival",
            "сейвал"
        ],
        [
            "Sources",
            "World Register of Marine Species (WoRMS), uBio",
            "World Register of Marine Species (WoRMS), uBio",
            "uBio",
            "World Register of Marine Species (WoRMS), uBio",
            "World Register of Marine Species (WoRMS), uBio",
            "World Register of Marine Species (WoRMS)"
        ],
        [
            "Status",
            "Trusted",
            "Trusted",
            "Unknown",
            "Trusted",
            "Trusted",
            "Trusted"
        ]
    ],
    "pageTitle": "Common Names for Sei Whale (Balaenoptera borealis) - Encyclopedia of Life",
    "title": "",
    "url": "http://www.eol.org/pages/328572/names/common_names",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433371087,
    "recordOffset": 433357605,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "English marks the preferred name for each language. Common names listed by language 1 synonym 94 common names 7 related names 7 classifications Many people know organisms only by the common names, or \"vernacular\" names. Unlike scientific names, common names are almost always different for speakers of different languages. They may also vary regionally within a language. This tab shows all the common names provided to EOL for this organism from a variety of providers, including EOL curators. Currently we can only set one preferred common name per language on a given EOL page, but all the names should be searchable. Updates Literature Resources Community Names 6 Maps 157 Media Data Detail Overview Add to a collection Sei Whale learn more about names for this taxon Balaenoptera borealis &mdash; Common names",
    "textAfterTable": "northern rorqual South African Vertebrates, World Register of Marine Species (WoRMS) Trusted Pollack whale BibAlex LifeDesk, IUCN Red List, South African Vertebrates, World Register of Marine Species (WoRMS), uBio Trusted Rudolph's rorqual South African Vertebrates, World Register of Marine Species (WoRMS), uBio Trusted Rudolph’s rorqual uBio Unknown Rudophi's rorqual BibAlex LifeDesk, IUCN Red List, uBio Trusted Sardine whale South African Vertebrates, World Register of Marine Species (WoRMS), uBio Trusted Sei uBio Unknown sei whale Robert Hole, Jr, Anage Data, Animal Diversity Web Descriptions, BibAlex LifeDesk, Conabio, IUCN Red List, Integrated Taxonomic Information System (ITIS), MarLIN resource, Monthly ARKive text import , NCBI Taxonomy, NatureServe resource, South African Vertebrates, Species 2000 & ITIS Catalogue of Life: April 2013, Taxonomic Hierarchy of COL-China 2012, Taxonomic Hierarchy of COL-China 2012 Mammalia, World Register of Marine Species (WoRMS), uBio Trusted Afrikaans Name Sources Status Seiwalvis South African Vertebrates, World Register of Marine Species (WoRMS) Trusted Arabic Name Sources Status",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}