{
    "relation": [
        [
            "LOCATION",
            "1",
            "2 - 5",
            "6 - 14",
            "15 - 23",
            "24 - 73",
            "74 - 113",
            "114 - 138",
            "139 - 140",
            "141 - 148",
            "149 - 153",
            "154 - 158",
            "159",
            "160",
            "161 - 162",
            "163 - 166",
            "167 - 170",
            "171 - 172",
            "173 - 187",
            "188 - 189",
            "190",
            "191",
            "192 - 196",
            "197 - 203",
            "204 - 208",
            "209 - 210",
            "211 - 255",
            "256",
            "257",
            "258 - 266",
            "267 - 275"
        ],
        [
            "FIELD NAME",
            "Record Identifier",
            "Payment Year",
            "Federal Employer Identification Number (FEIN)",
            "Blanks",
            "Employer Name",
            "Employer Street Address",
            "Employer City",
            "Employer State",
            "Blanks",
            "ZIP Code Extension",
            "ZIP Code",
            "Blank",
            "Type of Employment",
            "Blocking Factor",
            "Establishment Number Coverage Group/PRU",
            "Taxing Entity Code",
            "State Identifier Code",
            "State Unemployment Insurance Account Number",
            "Reporting Period",
            "No Workers/No Wages",
            "Tax Type Code",
            "Tax Entity Code",
            "State Control Number",
            "Unit Number",
            "Plant Number",
            "Blank",
            "Foreign Indicator",
            "Blank",
            "Other EIN",
            "Blank"
        ],
        [
            "FIELD LENGTH",
            "1",
            "4",
            "9",
            "9",
            "50",
            "40",
            "25",
            "2",
            "8",
            "5",
            "5",
            "1",
            "1",
            "2",
            "4",
            "4",
            "2",
            "15",
            "2",
            "1",
            "1",
            "5",
            "7",
            "5",
            "2",
            "45",
            "1",
            "1",
            "9",
            "9"
        ],
        [
            "TYPE",
            "A/N",
            "A/N",
            "N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N",
            "A/N"
        ],
        [
            "DESCRIPTION AND REMARKS",
            "Constant \"E\"",
            "Enter the year for which the report is being prepared.",
            "Enter the employer's FEIN. Enter only numeric characters. Omit hyphens, prefixes and suffixes.",
            "Enter blanks.",
            "Enter the first 50 positions of the employer's name, exactly as the employer is registered with the state unemployment insurance agency.",
            "Enter the street of employer's mailing address.",
            "Enter the city of employer's mailing address.",
            "Enter the standard two character FIPS postal abbreviation of the employer's address. See Appendix A.",
            "Enter blanks.",
            "Enter four-digit extension of the ZIP code. Include hyphen in position 149. If unknown, fill with blanks.",
            "Enter the ZIP code of the employer's mailing address.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Constant \"UTAX\"",
            "Enter the state FIPS postal numeric code for the state to which wages are being reported. See Appendix A.",
            "Enter the UC employer account number without spaces or hyphens. Left-justify and right-fill with spaces.",
            "Enter the last month of the calendar quarter to which the report applies. \"03\" = First quarter \"06\" = Second quarter \"09\" = Third quarter \"12\" = Fourth quarter",
            "0: Indicates that the E record will not be followed by S employee records. 1: Indicates that the E record will be followed by S employee records.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks.",
            "Enter blanks."
        ]
    ],
    "pageTitle": "UC Management System",
    "title": "",
    "url": "http://www.portal.state.pa.us/portal/server.pt?open=514&objID=754310&mode=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 678427995,
    "recordOffset": 678389217,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "1438637250650",
    "textBeforeTable": "  Note: If you wish to open and view your file before submitting it, right-click on the file, select \"open with\" and select notepad. If you double click to open the file, the text formatting will be lost. Pre-file Match naming convention: FTP_PREFILE_TPAID_OUTPUT.CSV End file naming convention: FTP_PREFILE_TPAID.END TPAID = TPA Identifier Pre-file naming convention: FTP_PREFILE_TPAID.CSV File Naming: Each pre-file should be accompanied by a second blank file (.END) to indicate all data has been transmitted.   Do not use a header row with column names. Row one should contain the information relevant to the first employer.   Format the cells of the spreadsheet as text. It is recommended that you use a spreadsheet program such as Microsoft Excel to create your file. This will allow you to create your file in a spreadsheet environment and save the results in a comma separated values (.CSV) format. Creating a Comma Separated Values File (CSV) Following are the pre-file and pre-file match file specifications and record layouts.   www.paucemployers.state.pa.us to obtain a TPA Identifier. In order to submit a pre-file and file quarterly reports via FTP, TPAs must log in at   If this inbound file is corrupted, or the process abends due to incorrect file length or any other reason, then",
    "textAfterTable": "Data Length Data Type 1 Date and Time Stamp 20 Timestamp 2 Pipe 1 Alphanumeric 3 Descriptive Message 300 Alphanumeric   The message will describe the condition(s) that caused the file to be rejected. If all rejection conditions are not corrected, the file will be rejected again upon resubmission. File Rejection Based on the following possible conditions, the Unemployment Compensation Management System (UCMS) will reject the file and create a file rejection acknowledgement file. Employer Account Number is missing throughout the file. Employer Legal Name is missing throughout the file. Quarter is incorrect or missing throughout the file. Year is incorrect or missing throughout the file. II. ICESA Formats for Quarterly Wage Reporting (Original and Amend) via FTP or Upload Overview The following describes the data and record layouts that are used to create files for reporting or amending quarterly UC wages via FTP or file upload, using the ICESA format.   Note:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}