{
    "relation": [
        [
            "Loss Category",
            "No Losses",
            "< 25% Losses",
            "≥ 25% Losses"
        ],
        [
            "SBICs Under 75% CIP (n=39)",
            "90%",
            "10%",
            "0%"
        ],
        [
            "SBICs Over 75% CIP (n=18)",
            "39%",
            "39%",
            "22%"
        ]
    ],
    "pageTitle": "SBIC Program FY 2012 Annual Report | The U.S. Small Business Administration | SBA.gov",
    "title": "Ex. 27 - SBIC Leverage Losses by CIP CIPs after Year 6; As of 12/31/2010 (n=57)",
    "url": "https://www.sba.gov/content/sbic-program-annual-report-fy-2012",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920259111,
    "recordOffset": 920201955,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{184269=The implementation process began in October 2012, with the transition to the online submission of Forms 1031 (Portfolio Financing Report) and 468 (Quarterly Financial Statement). Further enhancements will follow as the remaining elements of the new system are deployed in the coming months and years., 224960=6 These metrics are only available for SBICs licensed since fiscal year 1998 as data for funds of prior vintage years are not available. Please refer to Appendix IV for information on the data, methodology and assumptions underlying the analyses in this section. (back), 105311=FY 2012 was the third consecutive record year for the program and this Annual Report reflects our commitment to the continued growth of the SBIC Program. We are investing heavily in improved data management systems, both to enhance our own underwriting processes, but also to provide current and future program participants additional data for more informed investment decisions., 181961=Also as part of President Obama’s “Start-Up America Initiative,” SBA announced the launch of the Early Stage SBIC Initiative and a new commitment of up to $1 billion in SBA-guaranteed leverage for venture capital SBICs targeting promising start-ups. Using the Debenture program’s existing authorization, the Early Stage Initiative will channel capital to funds investing in high-growth companies seeking financing in the range of $1 to $4 million and which are located in regions of the country underserved by the venture capital markets. Since 2008, less than 6% of all U.S. venture capital dollars went to seed funds investing at those levels and approximately 70% of those dollars went to just three states:  California, Massachusetts and New York. , 165445=The growth in the number of Debenture and Other SBIC Licensees, the amount of private capital raised and the issuance of commitments for SBA-guaranteed leverage has translated into increased financing for small businesses. From FY 2009 through FY 2012, the amount of capital Debenture and Other SBICs have used to finance small businesses has more than doubled, reaching record financing levels., 102517=A key factor driving the success of the program has been ongoing efforts to streamline its operations. In 2009, it took 14.6 months to get an SBIC fund licensed.  Today, it takes only 5.4 months, a 60 percent improvement in licensing times., 136802=Despite the surge in applications, a concerted effort to streamline Phase III of the investment process has kept processing times down. In FY 2009 it took an average of 14.6 months to process an applicant through Phase III.  By FY 2012 SBA reduced the timeline to just 5.4 months, well below the target processing time of 6 months., 104081=The Investment Division of the U.S. Small Business Administration is proud to present the results of the Small Business Investment Company Program for Fiscal Year 2012. We have achieved record success this year, providing  the capital small businesses need to fuel their growth and create jobs., 229972=As shown, the overall outstanding leverage has steadily decreased since FY 2008, with the total amount remaining in Liquidation remaining fairly constant. The chart below shows Liquidation activities for Participating Securities SBICs during this timeframe., 134395=Over the last 3 years, the number of fund proposals received in Phase I has hit historical highs. In FY 2008, SBA received 27 fund proposals. Over the last three fiscal years, that number has jumped to an average of nearly 70., 226030=The Participating Securities (PS) Program ended at fiscal year end 2004 and no further SBA-guaranteed PS leverage was funded after fiscal year end 2008. Overall, SBICs issued $10.3 billion in SBA-guaranteed PS leverage for fiscal years 1994 through 2008., 108758=The Small Business Investment Company (SBIC) Program, administered by the Small Business Administration (SBA), is a multi-billion dollar investment program created in 1958 to bridge the gap between entrepreneurs’ need for capital and traditional sources of financing.  The program, which operates as a public-private partnership, does not invest directly in small businesses, but provides SBA-guaranteed leverage to privately owned and managed investment funds that in turn make loans and investments into qualifying small businesses.  These funds are licensed by the SBA as Small Business Investment Companies (SBICs) and are subject to the legal authority of the SBA to ensure they operate in compliance with program rules and regulations., 157733=The bulk of the transfers to liquidations over the last five years were funds licensed prior to 1985., 197114=Since 1998, SBIC performance compares favorably on a pooled basis to the rest of the industry in terms of multiples, IRRs, and distributions., 160555=In fact, no Debenture or Other SBIC licensed since 2002 has been transferred to Liquidations, a year in which SBA made significant improvements to its licensing process. , 144113=The increasingly attractive economics of the SBIC Program may help explain the success new SBIC licensees are having raising private capital. The rate on SBA-guaranteed “Trust Certificates,” which determines the interest rate SBICs pay on SBA-guaranteed leverage, has followed the yield on the U.S. 10-year Treasury Note to historic lows.  Poolings of SBA-guaranteed Trust Certificates are done semi-annually. The most recent pooling closed in September 2012 at just 2.25% (Trust Certificate Rates: SBIC Debenture Pools), 113474=The growth of the SBIC Program over the past several fiscal years masks the divergent paths of two of its constituent parts.  The core “Debenture” program, which now finances the bulk of SBICs, has been on a growth trajectory since FY 2008.  By contrast, the “Participating Securities” (PS) program has been gradually winding down.  Whereas the two programs were roughly equal in size as recently as FY 2009, SBICs licensed through the Debenture program now manage approximately 4 times the capital of PS funds.  The “Debenture Program & Other SBICs” section goes into further detail on the Debenture program, while the “Participating Securities” section discusses the current status of the PS program., 186220=Outstanding debenture leverage issued by Debenture and Other SBICs has grown from $2.7 billion in FY 2008 to $5.2 billion in FY 2012. “Non-compliant capital,” which includes the leverage of operating SBICs that have exceeded maximum Capital Impairment Percentage (CIP)5 and the leverage of SBICs in Liquidations, increased from $156 million in FY 2008 to $298 million in FY 2012. As a percentage of debentures outstanding, the amount of non-compliant capital has fallen from 9% to 6% over the last five fiscal years., 226311=Table 8 in the Federal Credit Supplement Spreadsheet to the Fiscal Year 2013 budget estimates approximately $2.4 billion in losses to the program.8 As of September 30, 2012, SBA had transferred 136 SBICs with almost $4 billion in SBA-guaranteed PS leverage to Liquidations. Appendix II provides detailed leverage statistics by FY for SBICs licensed since fiscal year 1994., 233944= 9 SBA estimates jobs created or sustained using the results of two studies on the impact of venture capital on employment.  These studies estimate that one job is created or sustained for every $36,000 invested (adjusted for inflation). Studies: 1) DRI-WEFA, “Measuring the Importance of Venture Capital and Its Benefits to the United States Economy,” June 19, 2002. 2) Cook & Nevins. The Zermatt Group. “The 1999 Arizona Venture Capital Impact Study,” March, 1999. (back), 116720=At fiscal year-end, the portfolio of operating SBICs were managing over $18 billion in capital, combining $8.8 billion of SBA-guaranteed leverage commitments and $9.4 billion of commitments from private investors. The impact of the SBIC program extends beyond those funds that receive SBA-guaranteed leverage.  Among the 301 licensees at FYE 2012 were 44 investment funds that do not receive SBA-guaranteed leverage.  These “non-leveraged” funds nonetheless play an important role in both attracting private capital and investing in small businesses in need of financing.  These non-leveraged funds have typically been attractive to bank investors, for whom investments in SBICs presumptively qualify towards Community Reinvestment Act Credit.  Bank interest in SBICs is likely to grow, with the implementation of the Volcker rule part of the Dodd-Frank legislation, which limits banks from investing in private equity vehicles, with a few targeted exceptions, which includes SBICs., 104878=In FY 2012, the SBIC Program channeled more than $3 billion to over 1,000 small businesses. We achieved these results at zero cost to the taxpayers, thanks to the public-private partnership at the program’s core. Even in an era of tightening budgets, SBA is able to efficiently harness the talent of professional investment managers to expand the pool of capital available at the smaller-end of the market., 106793=FY 2012 Program Highlights, 101957=In Fiscal Year 2012, the SBIC program had its third consecutive record-breaking year. Investment funds licensed as SBICs provided more than $3 billion in growth capital to over 1,000 small businesses, a 17 percent increase from FY 2011 and an 83 percent increase from FY 2010.  In FY 2012, the SBA also licensed 30 new funds, including a record 27 Debenture SBICs.  And it’s important to note that based on recent historical performance the program continues to operate at zero subsidy and no cost to the American taxpayer., 142248=This trend has important implications for SBA’s SBIC portfolio as a whole. An analysis of SBIC leverage loss rates among Debenture SBICs active between 1997 and 2009 shows that funds with private capital greater than $17.5 million have experienced significantly lower loss rates than their peers.2, 233654=8Available at: http://www.whitehouse.gov/sites/default/files/omb/budget/fy2013/assets/c... (back), 129152=In addition, the SBIC Program licensed 30 new funds in FY 2012, a five-fold increase over 2008 levels., 98484=The Investment Division of the U.S. Small Business Administration is pleased to present the SBIC Program Annual Report for Fiscal Year 2012.  Working in partnership with top-tier investment fund managers and their private investors, the SBIC Program helps channel much-needed, long-term capital to small businesses located across the United States.  The FY 2012 Annual Report report offers SBIC Program stakeholders, members of Congress and the general public important information about the performance, economic impact and future direction of this 54-year old public-private partnership., 124325=In FY 2012, Debenture and Other SBICs provided over $3.1 billion of financing to small businesses, a record for the SBIC Program., 99143=Select the link below to download the SBIC Program FY 2012 Annual Report:, 178773=4 SBA estimates jobs created or sustained using the results of two studies on the impact of venture capital on employment.  These studies estimate that one job is created or sustained for every $36,000 invested (adjusted for inflation). Studies: 1) DRI-WEFA, “Measuring the Importance of Venture Capital and Its Benefits to the United States Economy,” June 19, 2002. 2) Cook & Nevins. The Zermatt Group. “The 1999 Arizona Venture Capital Impact Study,” March, 1999. (back), 127111=SBA-guaranteed leverage commitments issued to SBICs has reached a 3-year high, topping out at nearly $2 billion for FY 2012., 227576=The chart below shows the wind-down of the Participating Securities Program since the last issuance of SBA-guaranteed PS leverage in FY 2008., 180125=In 2011, as part of President Obama’s “Start-Up America Initiative,” SBA announced that it would commit $1 billion in SBA-guaranteed leverage to investment funds licensed as “Impact Investment SBICs.” These funds invest for financial return, but also seek to generate social return., 131393=At the time of licensing, the 30 funds licensed in FY 2012 had together raised nearly $1 billion of private capital, another record for the program. This capital came from institutional investors, fund-of-funds, high net-worth individuals and other private investors., 211375=An analysis of a sample of 71 SBICs with positive unleveraged IRRs and licensed from 1998 through 2006, shows that their \"break-even\" rate, where leverage had no impact on private investor returns, was an unleveraged IRR between 5% and 6%. Not surprisingly, this figure roughly matches the sum of the interest rate and annual fee charged for debentures issued in the years consistent with this data set. Given the decline of the interest rate on SBA-guaranteed Trust Certificates over the past decade, one would expect the break-even point to decline in coming years., 111621=To accommodate the surge of interest in the SBIC Program, the SBA’s Investment Division continues to streamline its processes, all while maintaining high credit standards and transparency. Division staff now process SBIC License Applications within an average of 5.4 months, down from an average of nearly 15 months in FY 2009.  This streamlining helped the SBIC program get out a record of more than $1.9 billion in SBA-guaranteed leverage commitments to its funds in FY 2012.  Current SBICs have seen a similar improvement in performance from the Office of Operations, which has reduced turnaround times on key decisions by over 50%., 112293=The program licensed 30 new funds in FY 2012 (including a record 27 Debenture SBICs), welcoming another cohort of experienced fund managers pursuing a diverse array of investment strategies.  The mix includes traditional mezzanine investors, senior lenders, leasing firms, and buyout funds. The funds are split evenly between returning SBIC fund managers and teams launching their first SBIC., 185886=As of September 30, 2012, SBA capital at risk with Debenture and Other SBICs was $7.6 billion, including $2.4 billion in outstanding commitments for SBA-guaranteed debenture leverage, $4.9 billion of outstanding SBA-guaranteed leverage, and $0.3 billion of debenture and other leverage held in Liquidations., 182750=The first call for Early Stage SBIC proposals was announced in May 2012 and attracted 33 applications. After interviews with the applicants and a thorough review of the applications, six funds were issued “green light” letters., 110415=In Fiscal Year 2012 (FY 2012), the SBIC debenture program and its stakeholders had their third consecutive record-breaking year.  The program reached record levels in terms of number of SBICs licensed, the amount of commitments of both private capital and SBA-guaranteed leverage and, most importantly, the amount of financing provided to America’s small businesses. In total, investment funds licensed in the SBIC debenture program provided more than $3 billion in growth capital to over 1,000 businesses, a 17% increase from FY 2011 and an 83% increase from FY 2010.}",
    "textBeforeTable": "The analysis confirmed that CIP is a critical metric to monitor. An analysis of historical Debenture and Other SBIC financial performance indicates that SBA is far more likely to sustain losses when CIP is higher.  SBA suffered losses with 61% of SBICs whose CIP exceeded 75% after year 6. As the SBIC Program has grown, SBA has strengthened its analytical and risk management capabilities. In particular, the Investment Division has analyzed which specific variables correlate to SBICs successfully paying back their SBA-guaranteed leverage. The following charts demonstrate examples of the findings (for information on the data, fund population and methodology underlying these charts, please refer to Appendix III).   6% 5% 8% 8% 9% % Out of Compliance             $5,184 $4,484 $3,724 $3,143 $2,758 Total Leverage $4,854 $4,249 $3,411 $2,893 $2,510 Under Max CIP $33 $22 $23 $31 $92 Over Max CIP $298 $213 $290 $219 $156 In Liquidations FY 2012 *",
    "textAfterTable": "  This analysis also provides useful data in evaluating track records of funds applying to the program. SBA found that funds that achieve total value to paid-in capital (TVPI) of at least 1.25x almost uniformly have no losses. Similarly, even for funds with significantly unrealized portfolios, their distributions to paid in capital (DPI) can be a leading indicator of whether or not they will repay their leverage.  Relative performance mattered as well.  SBA experienced no losses from SBIC Debenture and Other SBICs that ranked in the top half of private equity performance based on multiples. SBA suffered losses from 50% of the SBICs that ranked in the bottom half of private equity funds. Ex. 29 - Percentage of SBICs that Repaid Leverage by Private Equity Rank As of 12/31/2010; Preqin Benchmark (n=33)   % Repaid SBICs in Top-Half of Private Equity (n=13) 100% SBICs in Bottom-Half of Private Equity (n=20) 50%   Separate analysis shows that “second-time” SBICs outperform “first-time” SBICs.  Yet, contrary to conventional wisdom, SBICs managed by “first time” teams performed as well as “experienced” teams, although the performance did not catch up until the end of the fund. For the SBICs in the sample that were between three and nine years old, the TVPI and DPI",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}