{
    "relation": [
        [
            "Date",
            "Jan 13, 2006",
            "Apr 17, 2006",
            "Jul 28, 2006",
            "Nov 22, 2010",
            "Jan 23, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed"
        ],
        [
            "Description",
            "Owner name: NINTENDO OF AMERICA INC., WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:A/N SOFTWARE, INC., SOMETIMES KNOWN AS A/N INC.;REEL/FRAME:017468/0087 Effective date: 20051212",
            "Owner name: NINTENDO OF AMERICA INC., WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:A/N SOFTWARE, INC., SOMETIMES KNOWN AS A/N INC.;REEL/FRAME:017794/0183 Effective date: 20051212",
            "Owner name: NINTENDO CO., LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NINTENDO OF AMERICA INC.;REEL/FRAME:018087/0662 Effective date: 20060522",
            "Year of fee payment: 4",
            ""
        ]
    ],
    "pageTitle": "Patent US7229355 - External memory system having programmable graphics processor for use in a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7229355?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470710787,
    "recordOffset": 470633918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6501=For example, in FIG. 1, instead of using ROM 10, a CD ROM (not shown) may be used to store character data, program instructions, video, graphic, and sound data. A conventional-type CD player (also not shown) suitably connected to the Mario chip 2 to receive memory address signals over address bus P2–P26 for accessing data and/or instructions over data bus P28–P35. The specific structural and operational details of CD players and CD ROM storage systems are well known to those skilled in the art. One advantage provided by CD ROM storage is a significant reduction in the cost of storage per byte of information. Data may be stored at a cost between 100 to 1000 percent less than storage on semiconductor ROM. Unfortunately, the memory access/read time for CD ROM is even slower than that for semiconductor ROM.}",
    "TableContextTimeStampAfterTable": "{68076=In accordance with the present exemplary embodiment, the graphics coprocessor of the present invention interacts with a 16-bit video game system commercially sold by Nintendo of America, Inc. as the Super Nintendo Entertainment System (Super NES). The Super Nintendo Entertainment System is described in part in U.S. application Ser. No. 07/651,265, now U.S. Pat. No. 5,327,158, entitled “Video Processing Apparatus” which was filed on Apr. 10, 1991 and U.S. application Ser. No. 07/749,530, now U.S. Pat. No. 5,291,189, filed on Aug. 26, 1991, entitled “Direct Memory Access Apparatus and External Storage Device Used Therein”. These applications are expressly incorporated herein by reference. It should be understood that the present invention is not limited to Super NES related applications and may be used with other video game systems or other, non-video game, information processing apparatus., 44719=This application is related to the concurrently filed application Ser. No. 08/337,142, filed Nov. 10, 1994, now U.S. Pat. No. 5,724,497, by San et al, entitled “Programmable Graphics Processor Having Pixel To Character Conversion Hardware For Use In A Video Game System Or The Like”, and concurrently filed application Ser. No. 07/224,411, filed Apr. 8, 1994, now U.S. Pat. No. 5,357,604, by San et al, entitled “Graphics Processor with Enhanced Memory Control Circuitry For Use In A Video Game System Or The Like”., 43465=This is a continuation of application Ser. No. 09/789,574, filed Feb. 22, 2001, now U.S. Pat. No. 6,895,470 which is a continuation of application Ser. No. 08/920,871, filed Aug. 29, 1997 (now abandoned) the entire content of which is hereby incorporated by reference in this application, which is in turn a divisional of application Ser. No. 08/385,160, filed Feb. 7, 1995 (now U.S. Pat. No. 5,850,230), which in turn is a divisional of application Ser. No. 07/827,098 filed Jan. 30, 1992 (now U.S. Pat. No. 5,388,841)., 109792=The multiplier 64 utilized in the present exemplary embodiment may be, for example, of the type described in Digital Computer Arithmetic, by Cavanaugh, published by McGraw-Hill, 1984.}",
    "textBeforeTable": "Patent Citations While the invention has been described and illustrated in detail, it should be understood that the detailed disclosure is for purposes of illustration and example only. While the foregoing embodiment is considered to be an preferred embodiment, it should be understood that numerous variations and modifications may be made therein by those skilled in art and is intended that the following claims cover such variations and modifications within the spirit and scope of the present invention. . The graphics coprocessor of the present invention may be used to generate 3D type (and other) special effects including those involving rotated and scaled polygon-based objects at high speed, while only minimally burdening the host video game processing system. FIG. 19 show enlarged and rotated views of the helicopter set forth in FIGS. 20 and 21 , the side view of an object ie., a helicopter, is portrayed. This figure is not intended to accurately reflect the high quality display that can be generated by using the Mario chip. FIG. 19 , 20, and 21 exemplify some of the special effects which may be generated while using the programmable graphics coprocessor of the present invention in combination with the host computer system e.g., the Super NES. As shown in FIGS. 19",
    "textAfterTable": "US4462076 Jun 4, 1982 Jul 24, 1984 Smith Engineering Video game cartridge recognition and security system US4471216 Oct 27, 1980 Sep 11, 1984 Compagnie Internationale Pour L'informatique Cii-Honeywell Bull (Societe Anonyme System and process for identification of persons requesting access to particular facilities US4471465 May 16, 1983 Sep 11, 1984 Atari, Inc. Video display system with multicolor graphics selection US4492582 Jan 6, 1981 Jan 8, 1985 Mattel, Inc. Teaching and entertainment device US4523297 Sep 7, 1984 Jun 11, 1985 Compagnie Internationale Pour L'informatique Cii-Honeywell Bull Hand-held processor with two-way dialog between microprocessor in case and microprocessor on carrier insertable into casing slot US4644495 Jan 4, 1984 Feb 17, 1987 Activision, Inc. Video memory system US4658247 Jul 30, 1984 Apr 14, 1987 Cornell Research Foundation, Inc. Pipelined, line buffered real-time color graphics display system US4725831 Apr 27, 1984 Feb 16, 1988 Xtar Corporation High-speed video graphics system and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}