{
    "relation": [
        [
            "TEAM",
            "GCL Nats",
            "Lg. Avg."
        ],
        [
            "AB",
            "1895",
            "1887"
        ],
        [
            "R",
            "292",
            "253"
        ],
        [
            "H",
            "505",
            "466"
        ],
        [
            "HR",
            "18",
            "23"
        ],
        [
            "BB",
            "194",
            "174"
        ],
        [
            "SO",
            "404",
            "432"
        ],
        [
            "AVG",
            ".266",
            ".247"
        ],
        [
            "OBP",
            ".343",
            ".321"
        ],
        [
            "SLG",
            ".370",
            ".349"
        ],
        [
            "GPA",
            ".247",
            ".232"
        ],
        [
            "SB",
            "76",
            "64"
        ]
    ],
    "pageTitle": "Christian Meza » NationalsProspects.com",
    "title": "",
    "url": "http://nationalsprospects.com/tag/christian-meza/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 175138795,
    "recordOffset": 175112280,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21061=Our final 2012 look at the leaders, trailers, and outliers in the Washington Nationals minor leagues. Repeats from 2011 are in italics., 67255=Bold = 2010 Draftee (Notables not included above = Rick Hague, Rick Hughes, Rashad Hatcher) Italics = 2010 IFA, 53535=As before, I’m listing the Top 12 hitters and pitchers in terms of plate appearances and innings pitched and using defensive games played for the listing of position. The full statistics for the team can be found here. (* = 2010 Draft Pick   ** = DSL Graduate   Italics = 2009 or earlier Draft Pick), 33598=A reminder: This is just for fun, a pithy look at who’s hot and who’s not. I do make an effort to not name folks in consecutive editions unless they’re on a run like Tyler Moore in 2010. The “Curse of the GBI,” is more attributable to a hot streak ending (or beginning) than anything else, though I may attribute any twinges of pain in my back to voodoo instead of scar tissue from a microdiskectomy 😉, 9837=On the field, the Hagerstown Suns improved upon a successful 2011 campaign with an 82-55 overall record. They missed the first half by three games with a 42-27 mark, but won the second with slightly worse record of 40-28, only to get swept in the playoffs with a pair of 2-run losses (3-1, 7-5). Some may blame the late promotion of Matt Skole at the very late date of August 15 — two months too late, if you ask some folks — for the quick playoff exit, the more objective take is that the pitching just wasn’t there, much like Auburn., 50799=After wading through the worst affiliate last week, it’s time to look at and reflect on what was — on won-loss basis anyways — the best. It’s also a yardstick of sorts for the 2011 draft*, which was decidedly tilted towards college players in general (36 of 51 drafted, 26 of 30 signed) and seniors in particular (13 of those 26). Consequently, the Auburn team was the second-oldest in the league and that does in part explain some of their success., 11112=Back to the review… Let’s take a look at how the Suns compared to the rest of the South Atlantic League: HITTING PITCHING Like 2011, the Suns were among the league leaders in runs and homers (2nd), hits and stolen bases (3rd), and walks (1st). I’ll go out on a limb and say this will probably be true for 2013, too. Unfortunately, some of the reason for this is that the team was among the oldest in the league, with multiple players repeating the level., 10389=Off the field, the Suns entered the 2012 season with the spectre of the team leaving for Winchester and the rumblings of a new stadium being built in Hagerstown, culminating in a rather bold move of the team opening the kimono by giving a tour of Municipal Stadium, ostensibly to demonstrate that renovation is a not an option. The move may have prevented the team from losing its PDC through 2014, but it’s hard not to infer that threat of the team leaving is to blame for the huge drop in attendance from 2011 to 2012 (1,931 per game to 1,366 — a 29.3% decrease)., 60013=With the decided shift towards college players in the Rule 4 draft (a.k.a. First-Year Players), it’s no surprise that the 2010 GCL Nationals were among the oldest in the league (batters, 20.4; pitchers, 21.5). Unfortunately, like the proverbial trailer park, if they weren’t putting a hurt a somebody (league-leading 5.21 R/G scored), they were getting hammered (third-worst 5.27 R/G allowed). Hence, a losing record at 24-32 that was four games under the 28-28 pythagorean projection., 13765=The only beacon of hope is that maybe, just maybe, one or two of the position players that were promoted from here to Potomac will be challenged with Harrisburg rather than resuming 2013 in Woodbridge. I know that sounds harsh, but perhaps an offseason “leapfrog” might serve as both an incentive to the Low-A guys and reminder to the High-A guys that moving up to the next level isn’t a foregone conclusion. The large number of six-year FA pitchers that were brought in at AA and AAA this year is an example of that line of thinking., 67741=As the parenthetical indicates, there were three 2010 draftees that got playing time in the GCL but were not in the Top 12. Hague obviously impressed in his limited playing time to get the bump to Hagerstown, posting a .275/.380/.300 line in 50PA but Hughes was actually a little better with a .293/.359/.448 in 65 PA. Rashad Hatcher posted just a .200/241/.218 line in 59 PA., 54563=Five of these twelve hitters were assigned to the FIL (Skole, Burns, Ramsey, Ortega, Nieto). Last year, I was fooled into thinking that at least one of them might skip over Hagerstown, and even though three of them will turn 23 this fall, I will make no such assertion for 2012. But I will repeat the guess that the Suns offense should be decent again., 12655=Turning back to the bats, we now look at the Top 12 hitters in terms of plate appearances. As always, full statistics for the team can be found here, and the key for the asterisks is one * for the 2011 draft picks and two ** for the DSL graduates. Like Auburn, there is really little to complain about in terms of overall offensive production. Just three of the top 12 produced below the league average, and three produced Nintendo-like numbers for both Gross Production Average and Isolated Power. The problem, of course, is that quite a few of these players were playing a level behind where they should have, as my Hagerstown guy put it in his review., 14316=Speaking of pitchers… For all the bitching and moaning discontent over the lack of promotions in the system, Hagerstown was interesting case when it came to pitchers. Four pitchers were promoted from Hagerstown to Potomac, and four pitchers were promoted to the Hub City — but two of those came not from Auburn but from the GCL. And three were 2012 picks.}",
    "textBeforeTable": "SYRACUSE CHIEFS 9-17, 6th place I.L. North, 8½ games behind Our weekly look at the leaders, trailers, and outliers in the Washington Nationals minor leagues.   2013 03 May  6 Responses »  Bad, Good, Interesting Good, Bad, Interesting – Vol. 3 Road Trips Watchlist and Player Reports Too Old For The Level? About",
    "textAfterTable": "Interesting Blake Schwartz 2-0, 0.00 ERA, 11K in 11IP over first two High-A starts HAGERSTOWN SUNS 15-11, T1st place Sally North, 2½ games ahead Good Pedro Encarnacion 1.93 ERA, 1.20 WHIP, .207 OBA Bad Hunter Bailey .528 OPS Interesting Wes Schill 18BB in 18G, team-best .455 OBP  Posted by Luke Erickson at 9:58 am  Tagged with: Blake Schwartz, Brian Goodwin, Chris Marrero, Christian Meza, Danny Rosenbaum, Hunter Bailey, Justin Bloxom, Michael Taylor, Nathan Karns, Pedro Encarnacion, Wes Schill, Yunesky Maya Season Review: 2012 Hagerstown Suns  News and Notes  7 Responses » Oct 22 2012   On the field, the Hagerstown Suns improved",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}