{
    "relation": [
        [
            "N",
            "1",
            "4",
            "6",
            "9",
            "12",
            "14",
            "22",
            "27",
            "33",
            "35",
            "51",
            "56",
            "64",
            "74",
            "80",
            "88",
            "90"
        ],
        [
            "Fib rep of N",
            "1",
            "101",
            "1001",
            "10001",
            "10101",
            "100001",
            "1000001",
            "1001001",
            "1010101",
            "10000001",
            "10100101",
            "100000001",
            "100010001",
            "100101001",
            "101000101",
            "101010101",
            "1000000001"
        ]
    ],
    "pageTitle": "Fibonacci bases and Other Ways of Representing Numbers",
    "title": "",
    "url": "http://www.maths.surrey.ac.uk/hosted-sites/R.Knott/Fibonacci/fibrep.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 583828431,
    "recordOffset": 583801543,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33707=The real figure is more like 1.6093.. kilometres in 1 mile. This comes from the precise definition of 1 inch equals 2.54 centimetres exactly, and 100,000 centimetres make 1 kilometre. In the imperial system, 36 inches are 1 yard and 1760 yards are 1 mile.}",
    "lastModified": "Fri, 27 Jun 2014 10:53:21 GMT",
    "textBeforeTable": "Here is the start of the list of numbers which are palindromes in the Fibonacci representation: 1001. radar or palindrome is a word or list that is the same when reversed, e.g. Palindromic Fibonacci Representations A infinite sequence. Since each sequence in the list above starts off the following one, it defines a unique The next sequence is the preceding one followed by adding one to the sequence before the preceding one. Start with 1 and 1. Can you see any patterns in these sequences? It seems that each sequence starts off the following sequence. Can you discover how the remainder of each is formed, that is, the part that follows (the copy of) the previous sequence? It is not quite the sequence before, but, one added to all the items of the sequence before: It is quite easy to see where this pattern comes from: Each time we put a 1 at the start of our Fibonacci representations and then copy the earlier patterns. For example, 8, 9, 10, 11 and 12 are 8+0, 8+1, 8+2, 8+3 and 8+4. ... ... 1,2,2,2,3,2,3,3,2,3,3,3,4,2,3,3,3,4,3,4,4 34 to 54 1,2,2,2,3,2,3,3,2,3,3,3,4 21 to 33 1,2,2,2,3,2,3,3 13 to 20 1,2,2,2,3 8, 9, 10, 11 and 12",
    "textAfterTable": "Is there a formula for the series 1,4,6,9,12,14,... A094202? A more general Fibonacci System using Partitions Suppose that, instead of finding just a set of Fibonacci numbers that sum to N, that is each Fibonacci number is included at most once in the representation, we allow multiples of any Fibonacci number. We will then have a multi-set or bag of Fibonacci numbers whose sum is N, also called a partition of n. It is the same as using the Fibonacci Base system above but removing the restriction that entries in the columns must be only 0 and 1. We could call the system above the Binary Fibonacci Representation to distinguish it and, if there are no two consecutive 1s in the representation then it is a Zeckendorf Representation. We can now use 0 and any positive whole number in any column. The table below illustrates this for the values 1 to 6. Notice that each of these representations is just a partition on n using only the Fibonacci numbers. A partition is a sum of whole numbers with a given total where the order of the components in the partition does not matter: for example 1+1+2 is the same partition of 4 as 1+2+1 N Fib numbers whose sum is N allowing repeats Count 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}