{
    "relation": [
        [
            "Patent application number",
            "20140305595",
            "20150090971",
            "20150115254",
            "20150123085"
        ],
        [
            "Description",
            "APPARATUS FOR PREVENTING CURL IN BOTTOM PROTECTING FILM FOR DISPLAY DEVICE - Disclosed is an apparatus for preventing a curl in a bottom protecting film for a display device. The apparatus includes a working table on which the bottom protecting film is mounted, and a plurality of pressing apparatuses which is spaced apart from the working table and presses an edge part of the bottom protecting film. The plurality of pressing apparatuses includes a corner pressing apparatus which presses a corner part of the edge part of the bottom protecting film and a side pressing apparatus which presses a longitudinal side part of the edge part of the bottom protecting film.",
            "DISPLAY APPARATUS - A display apparatus includes a substrate, a display unit, a first metal oxide layer on the display unit, and a second metal oxide layer. The display unit may include an emission region and a non-emission region. The second metal oxide layer may be on the first metal oxide layer in the non-emission region. The first metal oxide layer and the second metal oxide layer may each include a metal oxide, the transparency of which varies according to a degree of oxidization of the metal oxide.",
            "DISPLAY DEVICE INTEGRATED WITH TOUCH SCREEN PANEL - A display device integrated with a touch screen panel may include a display device and an anti-reflection layer. The display device may include a plurality pixels arranged therein. The anti-reflection layer may include a plurality of metal layers and a plurality of dielectric layers that are sequentially laminated on an upper surface of the display device. In the display device, one or more metal layers among the plurality of metal layers constituting the anti-reflection layer may be operated as sensing electrodes of the touch screen panel.",
            "DISPLAY APPARATUS AND METHOD OF MANUFACTURING THE SAME - A display apparatus includes a substrate, a display unit on the substrate and including an emission area and a non-emission area, a first blocking layer at the non-emission area on the display unit, the first blocking layer having a thickness that tapers toward an edge of the first blocking layer, and a second blocking layer on the first blocking layer and configured to block external light reflection."
        ],
        [
            "Published",
            "10-16-2014",
            "04-02-2015",
            "04-30-2015",
            "05-07-2015"
        ]
    ],
    "pageTitle": "Kang, Yongin-City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kang-yongin-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446882507,
    "recordOffset": 446857448,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jin-Koo Kang, Yongin-City KR //]]> BarDraw('2538393',['Patent applications by Jin-Gyu Kang, Yongin-City KR'],[[2,1,1,1]],['2010','2011','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2538393\" align=\"center\"></div> </div> <canvas id=\"bg2538393\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jin-Gyu Kang, Yongin-City KR</p> <div class=\"bar2538393\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-07-2015</td> <td><a href=\"/patents/app/20150123098\">FLEXIBLE DISPLAY AND MANUFACTURING METHOD THEREOF</a> - A method of manufacturing a flexible display includes: forming a first barrier layer on a flexible substrate; forming a second barrier layer including silicon nitride on the first barrier layer; releasing stress of the second barrier layer; forming a first buffer layer including silicon nitride on the second barrier layer; forming a second buffer layer on the first buffer layer; and forming a thin film transistor on the second buffer layer.</td> <td>20150123098</td> <tr> </tr> <td>10-30-2014</td> <td><a href=\"/patents/app/20140319493\">SUBSTRATE FOR DISPLAY APPARATUS, AND DISPLAY APPARATUS USING THE SAME</a> - A substrate for a display apparatus includes a barrier layer disposed on a base substrate. The barrier layer includes a silicon oxide layer, and the silicon oxide layer includes a first part and a second part along a thickness direction of the barrier layer. The amount of silicon in the first part is different from the amount of silicon in the second part.</td> <td>20140319493</td> <tr> </tr> <td>04-14-2011</td> <td><a href=\"/patents/app/20110084279\">Organic light emitting diode display</a> - An organic light emitting diode display that includes a first electrode arranged on a substrate, an organic emission layer arranged on the first electrode and a",
    "textAfterTable": "Jin-Kyu Kang, Yongin-City KR Patent application number Description Published 20100270538 Organic light emitting display device and method of manufacturing the same - Provided are an organic light emitting display device and a method of manufacturing the same. The organic light emitting display device includes a substrate; at least one thin film transistor including a gate electrode including a metal oxide layer and a metal layer, a semiconductor layer including source/drain regions and a channel layer; at least one capacitor including a first electrode formed on a layer on which the gate electrode is formed by using a material forming the gate electrode, and a second electrode formed on a layer on which the source/drain electrodes are formed by using a material used to form the source/drain electrodes; and at least one organic light emitting device including a pixel electrode formed on a layer on which the gate electrode is formed by using a material used to form the gate electrode and connected to the source/drain electrodes via a contact hole. 10-28-2010 20140339517 ORGANIC LIGHT-EMITTING DIODE DISPLAY, AN ELECTRONIC DEVICE INCLUDING THE SAME, AND METHOD OF MANUFACTURING SAID ORGANIC LIGHT-EMITTING DIODE DISPLAY - Provided is an organic light-emitting diode (OLED) display including: a first plastic layer; a first barrier layer formed on the first plastic layer; a first intermediate layer formed on the first barrier layer; a second plastic layer formed on the intermediate layer; an OLED layer formed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}