{
    "relation": [
        [
            "Sector.",
            "Verdun",
            "Chateau-Thierry",
            "Soissons",
            "Marbache sector",
            "St. Mihiel",
            "Blanc Mont",
            "Meuse-Argonne",
            "Total"
        ],
        [
            "Heavy artillery.",
            "",
            "",
            "9",
            "",
            "60",
            "5",
            "",
            "74"
        ],
        [
            "Light artillery.",
            "",
            "112",
            "66",
            "",
            "61",
            "37",
            "2105",
            "269"
        ],
        [
            "Trench mortars.",
            "",
            "119",
            "2",
            "",
            "",
            "27",
            "17",
            "1,350"
        ],
        [
            "Machine guns.",
            "",
            "",
            "200",
            "",
            "122",
            "409",
            "500",
            "1,350"
        ],
        [
            "Antitank guns.",
            "",
            "",
            "",
            "",
            "",
            "8",
            "",
            "8"
        ]
    ],
    "pageTitle": "HyperWar: The United States Marine Corps in the World War",
    "title": "",
    "url": "http://www.ibiblio.org/hyperwar/AMH/XX/WWI/USMC/USMC-WWI.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 516189819,
    "recordOffset": 516093715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11003=The French Army recognized the splendid work of the Fifth and Sixth Regiments of Marines by citing them no less than three times in Army orders for achievements in the Chateau-Thierry sector, in the Aisne-Marne (Soissons) offensive, and in the Meuse-Argonne (Champagne). The Sixth Machine Gun Battalion was similarly cited for its work in the Chateau-Thierry sector and Aisne-Marne (Soissons) offensive. The Fourth Brigade received a similar citation for its work in the Chateau-Thierry sector. Since two French Army citations are sufficient to make an organization eligible for the award of the French fourragére, the high standard of the Marine units is evident. Information was received in January, 1920, that the War Department had accepted the award of the French fourragére in the colors of the ribbon of the Croix de Guerre for several Army organizations and the three units of the Fourth Brigade., 341833=This depot was established soon after the declaration of war for the purpose of supplying all posts south of Norfolk, including the West Indies. The storage facilities consist of 7 warehouses and a total floor space of 124,778 square feet. A total of about 14,287 tons of stores were shipped from this depot during the fiscal year 1919, these stores being valued at approximately $12,000,000; during the same period approximately 18,000 tons of stores were received, at an estimated value of $15,000,000. Practically all shipments of supplies of every description for troops in the West Indies are made from this depot., 85608=At the beginning of the war the course of recruit instruction at the recruit depot, Parris Island, was of 8 weeks duration, and with but very few exceptions every recruit passing through this depot received 8 weeks instruction. At the Mare Island recruit depot, the recruits received 12 weeks training from April 6 to 28, 1917, 9 weeks from April 29, 1917, to June 21, 1918, and 8 weeks from June 22 to November 11, 1918., 251909=In March, 1918, the Marine flying field, Miami, Fla., was established and on March 31, 1918, the First Aviation Squadron was transferred to that field from Lake Charles, La., 113352=Maj. Edward B. Cole was in command of the Sixth Machine Gun Battalion of Marines from the date of its organization until June 10, 1918, when he received a mortal wound., 186934=The following citation in Fifth Army Corps General Orders No. 26, dated November 20, 1918, gives a further description of these operations:, 171214=On September 28, 1918, the Fourth Brigade moved by bus and marching to the Souain-Suippes area, with brigade headquarters at Suippes., 249669=On April 6, 1917, the Marine section of naval aviation consisting of five officers and 30 enlisted men, was stationed at the naval air station, Pensacola, Fla., as part of the complement of that station., 259214=The number of planes operated by Marine aviators at Pensacola, Fla., on April 6, 1917, was four, and the type, AH Curtiss., 176761=The Second Infantry Division, United States, brilliantly commanded by Gen. Lejeune * * * played a glorious part in the operations of the Fourth Army in the Champagne in October, 1918. On the 3d of October this division drove forward and seized in a single assault the strongly entrenched German positions between Blanc Mont and Medeah Ferme, and again pressing forward to the outskirts of Saint Etienne-a-Arnes it made in the course of the day an advance of about 6 kilometers., 113852=On September 23, 1917, the First Battalion of the Sixth Regiment sailed on the Henderson from New York and landed at St. Nazaire, France, on October 5, 1917. On October 17, 1917, the Seventy-third Machine Gun Company, Headquarters, and Supply Companies, and Col. Albertus W. Catlin, commanding officer of the Sixth Regiment, with his Staff, sailed from Philadelphia, Pa., on the De Kalb, and from New York on October 18, 1917, arriving at St. Nazaire, France, on November 1, 1917. On October 31 1917, the Third Battalion of the Sixth Regiment sailed from New York on board the VON STEUBEN and anchored at Brest, France, on November 1 2,1917. On January 24, 1918, the Second Battalion of the Sixth Regiment sailed on the Henderson from New York and arrived at St. Nazaire, France, February 6, 1918, and with the arrival of this last battalion, the entire Sixth Regiment of Marines was in France., 268799=The following table shows strength of Marine Corps Reserve on active duty on November 11, 1918:, 291722=NAVY DEPARTMENT, August 13, 1919., 133768=Active operations were conducted in Haiti and Santo Doiningo against bandits during the period of the war by Marine forces, the Haitian Gendarmerie and the Guardia Nacional Dominicana, the two latter organizations being composed of natives and administered and officered by the Marine and Navy personnel. Casualties were suffered by Marines in the operations in Santo Domingo, 4 Marines being killed, 13 wounded, and 1 officer wounded, between April 6, 1917, and November 11, 1918., 141541=Then late in May, 1918, with startling success, which brought a corresponding depression to the morale of the Allies, the Germans launched their third offensive, west of Rheims, crossed the Chemin-des-Dames, captured Soissons, and the last day of May found them marching in the direction of Paris down the Marne Valley. Again the American commander in chief placed every available man at the disposal of Marshal Foch. It was at this critical time, when the Allies were facing a grave crisis, that the Second Division, including the Marine Brigade, together with elements of the Third and Twenty-eighth Divisions, were thrown into the line and, in blocking the German advance in the Chateau-Thierry sector, rendered great assistance in stopping the most dangerous of the German drives., 137623=The Fourth Brigade remained in the Bourmont training area, with headquarters at Damblain, until March 14, 1918, when it commenced movement into subsectors of the Verdun front, the first units of the brigade entering the front line during the night of March 16-17, 1918, with headquarters at Toulon. On April 1, 1918, brigade headquarters was changed to Moscou. The brigade remained on the Verdun front until May 14, 1918, when it proceeded to an area around Vitry-le-Francois for open warfare training, with headquarters at Venault-les-Dames. In the meantime, on May 6, 1918, Brig. Gen. James G. Harbord assumed command of the brigade relieving Big. Gen. Doyen who has been ordered to the United States on account of his physical condition. Brig. Gen. Doven relinquished command of the brigade most unwillingly, and the reasons for his relief are best set forth in the words of the citation of a Navy distinguished service medal posthumously awarded to him, reading as follows., 167976=On August 7, 1918, information was received of the promotion of Bri. Gen. Lejeune to the grade of major general, and of Col. Neville to the grade of brigadier general, both to date from July 1, 1918., 148672=VI° ARMEE, ETAT-MAJOR, au Q. G. A., le 30 Juin, 1918., 118610=On January 21, 1918, the First Marine Aeronautic Company arrived at naval base No. 13, Ponta Delgada, Azores., 75290=The officers appointed from civil life, as soon as enrolled, were ordered to the Marine barracks, Mare Island, Calif.; San Diego, Calif.; Parris Island, S.C.; and the Marine Corps rifle range, Winthrop, Md., for instruction, pending the completion of the buildings for their use at the Marine barracks, Quantico, Va. Early in July, 1917, the buildings being in readiness, the newly appointed officers, about 345 in number, were assembled at Quantico, where an officers' camp of instruction was held, and the course completed in October, 1917., 140291=In order to appreciate understandingly the importance of the early operations participated in by the Marine Brigade as a unit of the Second Division it is necessary to remember that in 1918, prior to the middle of July, the offensive was in the hands of the Imperial German Staff, and that between March 21, 1918, and July 15, 1918, the Germans directed no less than five major offensives against the Allied lines in efforts to bring the war to a successful conclusion for the Central Powers. American troops assisted in breaking up every one of these drives, but the Second Division, including the Marines, opposed only one, that in the Chateau-Thierry sector. It should also be noted that on March 28, 1918, the American commander in chief placed all of the American forces at the disposal of Marshal Foch, who had been agreed upon as commander in chief of the Allied Armies, to be used as he might decide., 203176=The division took the northern passage and was 13 days en route, 4 days of which were spent in holding its own against a 90-mile gale off the Newfoundland coast. On December 7, 1917, the American battleship anchored with the British Grand Fleet in Scapa Flow, Orkney Islands, after a rousing reception, and on December 26 were designated the Sixth Battle Squadron of the British Grand Fleet., 117512=The Thirteenth Regiment left the Overseas Depot at Quantico, Va., on Friday, September 13, 1918, and on September 15, 1918, sailed from Hoboken, N. J., on board the Henderson and Von Steuben, arriving at Brest, France, on September 25, 1918., 100183=The Fourth Brigade continued its training in the Bourmont training area until the middle of March, 1918, when it entered the front line trenches in the Verdun sector., 175510=That the plan was as brilliantly executed as it was daringly conceived is shown by this extract from an order of the Second Division, dated November 11, 1918, reading in part as follows:, 188878=1. On the night of November 10, heroic deeds were done by heroic men. In the face of a heavy artillery and withering machine gun fire, the Second Engineers threw two foot bridges across the Meuse and the first and second battalions of the Fifth Marines crossed resolutely and unflinchingly to the east bank and carried out their mission., 105152=Gen. Pershing and his staff, accompanied by two Marine officers, proceded the first expedition to France, sailing late in May, 1917, from the United States., 147427=The achievements of the Fourth Brigade of Marines in the Chateau-Thierry sector was twice recognized by the French. The first, which changed the name of the Bois de Belleau, was a beautiful tribute spontaneously made to the successes and to the losses of the Fourth Brigade of Marines, and shows the deep effect that the retaking of Belleau Wood and other near-by positions from the Germans had on the feelings of the French and the morale of the Allies. Official maps were immediately modified to conform with the provisions of the order, the plan directeur used in later operations bearing the name \"Bois de la Brigade de Marine.\" The French also used this new name in their orders, as illustrated by an ordre general dated August 9, 1918, signed by the commanding general of the Sixth French Army, reading in part as follows:, 232895=During the period between April 6, 1917, and November 11, 1918, one officer was wounded in action, four enlisted men were killed in action, and thirteen wounded in action, in the Dominican Republic in operations against bandits., 199849=Aisne defensive, in the Chateau-Thierry sector: From May 31 to June 5, 1918., 194274=On November 17, 1918, the Second Division commenced its march to the Rhine, passing through Belgium and Luxembourg. The German frontier was reached November 25, 1918, crossed on December 1, 1918, the Rhine reached December 10, 1918, and crossed on December 13, 1918. During this march and up to the time the Fourth Brigade settled down to its occupation duty in Germany, brigade headquarters were successively established at Margut, Bellefontaine, Arlon, Usseldange, Berg, Eppeldorf, Neuerburgh, Waxweiler, Prum, Budesheim, Wiesbaum, Antweiler, Neuenahr, Burgbrohl, Rheinbrohl, and Honningen., 163681=Au Grand Quartier Général, le 25 Octobre 1918. (Ordre No. 10.886 \"D.\"), 105636=On June 14, 1917, the first expedition of American troops left the United States for France and the Fifth Regiment of Marines embarked on the naval transports Henderson and Hancock, and the auxiliary cruiser De Kalb (former Printz Eitel Friedrich ), formed approximately one-fifth of it. The fourth group, including the Hancock, did not sail until June 17, 1917., 209717=In June, 1918, Vladivostok, and practically all of Siberia, was under the control of the Bolsheviki. The Bolsheviki, assisted by German and Austrian prisoners of war, were resisting the advance of the Czecho-Slovaks, who were trying to reach Vladivostok. In that city on June 29, 1918, there were approximately 12,000 well-organized Czecho-Slovaks, only about 2,500 of whom were armed or equipped. On the foregoing date the Czecho-Slovaks in the city took it over from the Bolsheviki after a three hour battle near its center, and on the afternoon of that day Rear Admiral Austin M. Knight, commander in chief of the Asiatic Fleet, ordered a detachment of American Marines ashore to guard the American consulate and to act as part of an Allied force composed of British, Japanese, Chinese, and Czecho-Slovaks, to patrol the city., 170183=On September 20, 1918, the brigade moved to an area south of Toul, with headquarters at Chaudenay. The brigade remained in this area until September 25, 1918, when it moved by rail to an area south of Chalons-sur-Marne, with headquarters at Sarry., 31028=On December 2, 1918, the President, by proclamation, directed that voluntary enlistments of registrants into the Navy and Marine, 247706=(c ) The twenty-sixth annual Sea Girt interstate tournament held at Sea Girt N.J. in 1919. The Marines won 14 of the 18 matches in which they were entered, winning the following matches: Hayes, Meany, Spencer, two-man team (New Jersey), Wingate, Libbey, all-comers expert, Cruikshank trophy, Rogers trophy, Sadler trophy, Dryden trophy, McAlpin trophy, Rogers all-comers long range, and Sea Girt championship., 235040=A Marine Corps unit arrived in France with the first expedition of of American troops. From June 26, 1917, to November 11, 1918, Marines were in Europe with the American Expeditionary Forces a total of 504 days, of which 66 days were in active sectors and 71 in quiet sectors., 279224=The Fifth Brigade Headquarters, the Thirteenth Regiment (less Company B), and the Fifth Brigade Machine Gun Battalion arrived in the United States on board the Siboney on August 8, 1919. Company B of the Thirteenth Regiment arrived on the Mercury on August 12, 1919. The Eleventh Regiment arrived in the United States on board the Orizaba on August 9, 1919., 156319=Having been blocked in the Marne salient, the Germans attacked for the fifth time in 1918 on July 15, and as events turned out it was the last, for from the time of its failure they were on the defensive. The Allied troops including many Americans held this attack, called by the Americans the Champagne-Marne defensive, which was on a large scale, and the grand initiative passed from the Germans to the Allies on July 18, 1918, when Marshal Foch launched his initial major offensive, termed by the Americans the Aisne-Marne. In this magnificent and gigantic operation the Marine Brigade and other elements of the second Division played leading parts in the vicinity of Soissons., 119017=On January 21, 1918, and on July 20, 1918, detachments for the naval base No. 13, arrived at Ponta Delgada, Azores., 256294=The strength of Marine aviation on April 6, 1917, and on November 11, 1918 was as follows:, 170733=Marshal Foch, having asked for an American division to assist in breaking through the powerful German defenses in the Champagne, the Second Division, including the Marine Brigade, was temporarily placed at the disposal of the Fourth French Army under Gen. Gouraud from September 27, 1918, to October 10, 1918. At first it was directly subject to the orders of Marshal Petain, but before the actual fighting began it was placed directly under the orders of Gen. Gouraud., 78140=The majority of the members of the first officers' training camp were graduated in July, 1918. Three hundred of this camp were commissioned on July 15, 1918, and 91 on August 15, 1918., 283035=On August 8, 1919, the Fourth Brigade of Marines was transferred to the naval service upon its arrival at Quantico, Va., 200359=Meuse-Argonne(Champagne) including the capture of Blanc Mont Ridge and St. Etienne: From October 1 to October 10, 1918., 139808=On May 27, 1918, Brig. Gen. John A. Lejeune and Maj. Earl H. Ellis sailed from New York on board the Henderson and arrived at Brest, France, on June 8, 1918., 242197=In recent years the Marine Corps has devoted a great deal of time and energy to rifle practice, believing that one of the first requirements of a soldier is to know how to shoot. During the period of the war target practice was given special attention, and in 1918 it was announced that no enlisted men would be sent overseas who had not qualified as marksman or better. This announcement created even greater interest than before in target practice among the enlisted personnel and gratifying results were obtained on all rifle ranges. Marines that arrived in France were educated riflemen, but despite that fact rifle ranges of some character were established and used in every spot of France and Germany where the Marines remained long enough to make it feasible and practicable to do so., 250585=On October 14, 1917, the First Marine Aeronautic Company was transferred to Cape May, N.J., and took over the naval air station at that place., 251541=On October 17, 1917, the First Aviation Squadron was transferred from the Marine flying field, navy yard, Philadelphia, Pa., to the Army training field at Mineola, Long Island, where instruction and training were carried on in land flying. On December 31, 1917, this organization was transferred to Gerstner Field, Lake Charles, La., for advanced training., 216632=Col. Smedley D. Butler commanded the Thirteenth Regiment from the date of its organization until November 19, 1918, on which date Lieut. Col. Douglas C. McDougal assumed command and remained its commanding officer until it was demobilized., 169494=The brigade started to move from this area on the night of September 2, 1918, and after a series of night marches, during which time headquarters were established at Pont St. Vincent, Velaine-en-Haye, and Bouvron, the brigade arrived just outside of Manonville, headquarters being established in Manonville. From September 12 to 16, 1918 the brigade was engaged in the St. Mihiel offensive in the vicinity of Remenauville, Thiaucourt, Xammes, and Jaulny as a unit of the Second Division of the First Corps of the First Army. Headquarters during these operations were successively at 1 kilometer north of Lironville, Thiaucourt, and finally at Manonville, on September 16, 1918., 169012=On August 8, 1918, Lieut. Col. Earl H. Ellis was appointed adjutant of the Fourth Brigade, relieving Lieut. Col. Harry R. Lay, who had been detailed as inspector general of the Second Division., 179431=The Second Division completed its advance on this front by the assault of the wooded heights of Mont Blanc, the key point of the German position, which was captured with consummate dash and skill. The division then repulsed violent counterattacks and then carried our lines into the village of St. Etienne, thus forcing the Germans to fall back before Rheims and yield positions which they had held since September, 1914., 248134=(d ) The American Expeditionary Forces rifle, pistol, and musketry competition, held on the d'Avours range at Le Mans, France, in May, 1919. The first three places in the individual rifle competition were won by Marines; a Marine won the individual pistol match; the Fifth Regiment of Marines stood first in the regimental standing, followed by the Thirteenth, Sixth, and Eleventh Regiments in seventh, eighth, and eleventh places in the order mentioned; a Marine won first place in the individual automatic rifle competition. The Second Division led all other divisions., 71619=The appointment of officers subsequent to the declaration of war up to October, 1917, both for the permanent service and for the temporary increase authorized for the duration of the war, were drawn from the following sources:, 249884=During April, May and June, 1917, the Marine aviation section was transferred to a combination land and water station for Marine fliers at the navy yard, Philadelphia, Pa., and the training of personnel for land flying began. The official designation of this organization was the Marine Aeronautic Company. Training in observation balloons was done in addition to the heavier-than-air-work., 75844=In carrying out the policy of obtaining officers from the ranks, orders were issued to commanding officers of every post and station of the Marine Corps, both at home and abroad, as well as those on board ship, to the effect that all commissioned officers would be taken from the ranks, and that the number of men to be designated from each post to attend the training camp would be a certain percentage of the number of men stationed at such post or station. Each commanding officer was ordered to convene a board of three officers to examine into the qualifications of the men at his post, and to report in the order of merit the names of the men considered qualified for entry to the officers' training camp at Quantico, Va. These reports were all forwarded to headquarters, where a board was convened to examine them and to select, in accordance with their standing as reported by the various boards, the number of men who it had been decided could be quartered and properly instructed at Quantico. It was found that about 600 was the limit that could be accommodated, and approximately this number was selected for the first camp, which was established at Quantico, Va., in April, 1918., 201101=General Headquarters, American Expeditionary Forces, ruled that the Second Division, including the Fourth Brigade of Marines, participated in only four major operations, the Aisne defensive (May 31 to June 5, 1918); the Aisne-Marne offensive (July 18 and 19, 1918); the St. Mihiel offensive (Sept. 12 to 16, 1918); and the Meuse-Argonne offensive (Oct. 1 to 10, 1918, and Nov. 1 to 10, 1918). The operations which resulted in the capture of Blanc Mont and St. Etienne were construed to be included in the Meuse-Argonne offensive despite the fact that the operations were a part of the operations of the Fourth French Army, far to the west of the western limit of the American Meuse-Argonne sector and further that the work of the Second Division was continued by another American division. The operation which resulted in the capture of Hill 142, Bouresches, Bois de la Brigade de Marine, by the Marine brigade, assisted by Artillery, Engineers, etc., of the Second Division, and the capture of Vaux by the Third Brigade, Engineers and Artillery of the Second Division, were held to be local engagements rather than a major operation. The Second Division suffered about 9,000 casualties in the Chateau-Thierry sector., 248724=(e ) The Inter-Allied championships held on the d'Avours range at Le Mans, France, in July, 1919. The American Expeditionary Forces team, on which were four Marines, defeated all nations. A Marine took second place in the individual rifle match., 199783=Toulon sector, Verdun: From March 15 to May 13, 1918., 203579=From the time of its arrival to November 29, 1918, this squadron with the addition of the Texas, in February, 1918, and the substitution of the Arkansas for the Delaware in July, 1918, operated with the British Grand Fleet, basing most of the time in Scapa Flow and the remainder of the time in the Firth of Forth (Rosyth). The squadron took its regular turn at convoy duty, patrol duty, target practice, and fleet exercises with all the other squadrons of the British Grand Fleet., 253664=In order to prevent the personnel, who were completely trained and ready for action when they reached the front, August 2, 1918, from getting badly out of practice, the commanding officer, Day Wing, requested permission from the British aviation forces in the vicinity to be allowed to assign certain Marine pilots to operate with their squadrons until the Marine planes were delivered. As many Marine pilots as could be accommodated were operating with British squadrons until the end of the war, and were highly complimented by the British officers. The Day Wing, carried out 14 independent raids far behind the enemy lines, did considerable damage, and brought back valuable information. The organization participated actively and creditably in both offensives on the Flanders front. It was learned after the armistice that one raid resulted in the death of 60 enemy officers and 300 enlisted men. A feat worthy of mention was performed by Marine Corps pilots. A French regiment was cut off by the enemy near Stadenburg. It was decided to attempt to feed them by aeroplane. Marine Corps pilots loaded up with food and flew low over this isolated regiment and successfully dropped 2,600 pounds of food to them in the face of heavy fire from artillery, machine guns, and rifles. This process was continued for two days until the regiment was extricate. The number of enemy planes brought down by Marine pilots, bombs dropped, food dropped, and other facts of a statistical nature are given elsewhere. Three pilots were killed or died of wounds received in action, two of them being shot down over the enemy's lines., 52699=Marine detachments served on board all the overseas battleships and on the battleships of Battleship Force Two throughout the war. The Marines of Battleship Force One of which the MINNESOTA was flagship were temporarily withdrawn in April, 1918., 108879=On July 15, 1917, the Fifth Regiment, less the Third Battalion, which remained behind to perform guard duty and other detached units and officers, proceeded to the Gondrecourt training area, and was stationed in Menaucourt and Naix., 90182=The first troops arrived at the Marine barracks, Quantico, Va., on May 18, 1917. The maximum enlisted strength was 9,849 on September 1 2,1918. The maximum number of officers present at one time was 484, on August 16, 1918. The strength on November 11, 1918, was 329 officers and 8,798 enlisted men. From May, 1917, to November 11, 1918, approximately 1,000 officers and 40,000 enlisted men passed through Quantico, Va., 109421=On August 19, 1917, Gen. Pershing and Gen. Petain, commander-in-chief of all the French forces, inspected the Marines, as a unit of the First Division. Gen. Petain congratulated the colonel of the regiment on the splendid appearance of its officers and men, as well as the cleanliness of the towns., 27776=The maximum enlisted strength of the regular Marine Corps, not including reserves, during the period between the outbreak of war and the date the armistice became operative was 63,714 on November 9, 1918., 255292=Maj. Alfred A. Cunningham commanded the Day Wing from the date of its organization to December 7, 1918, except the period August 1 to 7, 1918, during which time Maj. Roy D. Geiger was in command., 329384=The duties of the paymaster's department during the war were greatly enlarged and made more complicated and difficult. (1) By reason of the enactment of the war risk insurance act of October 6, 1917. The work connected with family allotments and war risk insurance created by this act was of such magnitude as to require the establishment of a separate administrative section under a commissioned officer to handle the voluminous correspondence, keep the records, and make proper audit of these items in the accounts involved. It was also found necessary in order to facilitate the work of this section, that a liaison group of clerks be kept in the War Risk Bureau. (2) By reason of the taking over of the payment of all Marine Corps allotments, as the deputy of the Navy allotment officer. (3) By reason of the necessity of having to pay many men on affidavits without proper records; service record books and other papers pertaining to their accounts having been lost or destroyed by operation of war or other accidental circumstances. (4) By reason of the large number of wounded men, some of whom were scattered in various hospitals throughout France, and others of whom were returned to the United States without due notice to military authorities, and sent to both naval, military, and civil hospitals at widely scattered points throughout the States. In but a few of these cases were there any records on which full and accurate payments could be made. Hence a system of emergency, or casual payments, as they were called, was established both in France and in the United States. The absence of records in these cases was not the worst feature however, but the absence of any information whatever, as to the whereabouts of the men made it at first impossible to locate some of them and effect regular payments. However, after the first few months' experience with the handling of payments to the wounded, a system was devised by which most of those returning to the States were immediately reported and prompt payments were thereafter made. A similar system of emergency or casual payments to wounded men was adopted by the department in France, but wounded men in France were evacuated so frequently from one hospital to another, that no system of reporting was practicable. Each hospital there had to be visited in person by a paymaster at least once a month and such wounded Marines as were found, had to be paid on their own representations a sum sufficient to meet their immediate needs. Under such a system some necessarily went without pay for some time, while others more fortunate in meeting a paymaster at frequent intervals, received at times more money than was properly due them. (5) By reason of the enactment of February 24, 1919, providing a gratuity of $60 to all persons in the military and naval forces of the United States, who were discharged under honorable conditions at any time subsequent to April 6, 1917. This law necessitated the establishment at headquarters of a claims section, whose sole duty was to settle the twenty or thirty thousand supplementary claims created by this act and the act of February 28, 1919, increasing the amount of travel allowance to 5 cents per mile to all enlisted men discharged subsequent to November 11, 1918., 112753=The Sixth Machine Gun Battalion of Marines was organized at the Marine barracks, Quantico, Va., by order of the Major General Commandant on August 17, 1917. The battalion was designated the First Machine Gun Battalion, but on January 20, 1918, after arrival in France, was renamed the Sixth Machine Gun Battalion. On December 14, 1917, the battalion sailed from New York on the De Kalb, arriving at St. Nazaire, France, December 28, 1917. On January 3, 1918, the battalion arrived at Damblain in the Bourmont training area and began training with headquarters at Germain-villiers., 278619=The commanding general of the Second Division and his staff, headquarters of the Fourth Brigade, the Fifth Regiment, and the Second Battalion of the Sixth Regiment arrived in the United States early in August 1919, on board the George Washington on August 3, 1919; the remainder of the Sixth Regiment arrived in the United States early in August, 1919, on board the Rinjdam and the Wilhelmina; the Sixth Machine Gun Battalion arrived in the United States on board the Santa Paula on August 5, 1914)., 166674=On Jul 25, 1918, Brig. Gen. John A. Lejeune arrived, and assumed command of the Fourth Brigade on July 26, 1918, General Orders, No. 16, reading as follows:, 281778=The Battalion rendered honors to Gen. Pershing on September 1, 1919, upon his departure from France at Brest and on the same day was inspected by Marshal Foch, who commended the Battalion on its splendid appearance., 168583=On August 5, 1918, movement of units of the brigade was started for the occupation of the Marbache subsector, near Pont-a-Mousson, on the Moselle River. By August 8, 1918, the movement was completed, with Headquarters established at Scarponne just across the Moselle River from Dieulouard. The sector was quiet and occupation uneventful except for an enemy raid which was successfully repulsed and prisoners captured., 285135=On May 1, 1919, it became necessary, owing to the demands of the service and the reduction of the enlisted personnel, temporarily to limit the privilege of discharge to men whose release was necessary for urgent financial dependency reasons., 178777=The Second Division conquered the complicated defense works on their front against a persistent defense worthy of the grimmest period of trench warfare and attacked the strongly held wooded hill of Blanc Mont, which they captured in a second assault, sweeping over it with consummate dash and skill. This division then repulsed strong counterattacks before the village and cemetery of St. Etienne and took the town, forcing the Germans to fail back from before Rheims and yield positions they had held since September, 1914., 73595=In order to expedite the training of the new officers, advantage was taken of the law providing for a Marine Corps Reserve, and successful candidates were immediately enrolled as second lieutenants in the reserve and ordered to Marine Corps posts for instruction pending the issuance of their commissions in the regular service. Candidates designated for the examination held July 10, 1917, were authorized upon designation to enroll as privates in the Marine Corps Reserve, with the understanding that upon the completion of their examination they would be ordered to the Recruit Depot at Parris Island, S.C., for training pending the receipt of the report of the examining board. This policy was carried out, and the successful candidates were commissioned second lieutenants in the Marine Corps, while the unsuccessful candidates were given the option of continuing in the service as enlisted men or of being discharged therefrom., 131753=The First Marine Aeronautic Company, naval base No. 13, Ponta Delgada, Azores, equipped for water flying only, performed patrol duty from January, 1918, until November 11, 1918., 289435=WAR DEPARTMENT, August 12, 1919., 173050=On September 27, 1918, Maj. Gen. John A. Lejeune called on Gen. Gouraud at the headquarters of the Fourth French Army, who explained the situation at the front to him. Facing a large relief map of the battlefield, Gen. Gouraud placed his hand on the Blanc Mont Ridge and said: \"General, this position is the key of all the German defenses of this sector including the whole Rheims Massif. If this ridge can be taken the Germans will be obliged to retreat along the whole front 30 kilometers to the river Aisne. Do you think your division could effect its capture?\" Maj. Gen. Lejeune responded that he felt certain the Second Division could take the stronghold pointed out, whereupon he was informed that he would be ordered to make the attack within a few days and was directed to prepare a plan for the assault., 246019=(a ) The National Rifle Association and the national matches held at Camp Perry, Ohio, in 1918. Marines won the following National, 287843=Acting Secretary Roosevelt August 11, 1919, sent to all ships and stations of the United States Navy the following special order:, 78820=The second officers' training camp was opened at Quantico, Va., on August 20, 1918, the enlisted men forming its personnel having been selected in exactly the same manner as those attending the first camp and this procedure was also followed with regard to the Marines of the American Expeditionary Forces in France. Of the 570 men enrolled 432 were graduated from the second officers' training camp, December 16, 1918, and 172 from the Army candidate school in France, who, immediately upon graduating, were enrolled as second lieutenants (provisional) in class 4, Marine Corps Reserve, and subsequently appointed temporary second lieutenants in the Marine Corps. An extension of three weeks to this course in America was necessitated by the epidemic of influenza., 280093=The colonel commanding the Composite Regiment in a letter dated September 21, 1919, commended the battalion commander and staff the commanding officer of the company, and \"the lieutenants for their loyalty and attention to details, and noncommissioned officers and men for their soldierly appearance, high standard of morale, and discipline,\" concluding with these words:, 118731=On July 30, 1918, the First Marine Aviation Force (less Squadron D) disembarked at Brest, France, and formed the Day Wing of the Northern Bombing Group. Squadron D joined the Day Wing in October, 1918., 294355=On September 29, 1918, Maj. Gen. Commandant George Barnett, accompanied by Brig. Gen. Charles L. McCawley, sailed from New York on board the Leviathan, arriving at Brest, France, October 7, 1918. The object of the visit of the Major General Commandant to France was an inspection of all the Marines serving with the American Expeditionary Forces, but he fell a victim to the influenza epidemic which prevented him from carrying out his plans. He departed from Paris, December 7, 1918, sailed from Brest, December 9, 1918, on board the Leviathan, and arrived in the United States, December 16, 1918., 136074=On October 26, 1917, Brig. Gen. Charles A. Doyen, United States Marine Corps, assumed command of the Second Division as its first commanding general and announced his staff in General Orders, No. 1, with station at Bourmont, Haute-Marne, France. Lieut. Col. Logan Feland, United States Marine Corps, was the first chief of staff. On November 8, 1917, Maj. Gen. Omar Bundy, United States Army, assumed command, published such fact in General Orders, No. 4,. November 8, 1917, and was in command of it during the operations in the Verdun and Chateau-Thierry sectors. Maj. Gen. James G. Harbord, United States Army, commanded the division in the Aisne-Marne (Soissons) offensive in July, 1918. Maj. Gen. John A. Lejeune assumed command of the division on July 28, 1918, and retained command until its demobilization in August, 1919. Many Marine officers occupied positions of importance and responsibility, 166174=The Fourth Brigade was relieved about midnight July 19, 1918, and after remaining in a reserve position until July 22, 1918, marched to an area farther in the rear, but still in a reserve position, brigade headquarters being established at Taillefontaine. After final relief from this active sector the brigade was billeted July 24-25, 1918, in an area around Nanteuil-le-Haudouin, brigade headquarters being established at Nanteuil. The brigade remained in this area until July 31, 1918., 29957=Owing to the cessation of hostilities there were but few inductions and none of the inductees ever reached France prior to the armistice becoming effective. Regular voluntary inductions into the Marine Corps (through Provost Marshal General) commenced October 1, 1918, and the last man was voluntarily inducted on December 13, 1918. Inductions occurred as follows:, 107481=The De Kalb arrived at St. Nazaire, France, on June 26, 1917, the Henderson on June 27, 1917, and the Hancock on July 2, 1917. On June 27, 1917, the commanding officer of the Fifth Regiment reported to the commanding general, First Division, American Expeditionary Forces, and from that date the Fifth Regiment was considered as being detached for service with the Army by direction of the President., 211304=Col. Carl Gamborg-Andresen was fleet Marine officer of the Asiatic Fleet from August 25, 1915 to July 17, 1917; Col. Louis McC. Little from July 18, 1917 to April 25, 1918; and Col. Eli T. Fryer from that date until after the armistice., 268636=On November 16, 1918, the Marine Corps Reserve attained its highest strength, 6,773., 184396=In recommending that the Second Division be cited in General Headquarters Orders for its excellent work in the attack of November 1-11, 1918, the commanding general, First Army, wrote on January 16, 1919, in part, as follows:, 163269=\"Engagés a l'improviste dans l'offensive du 18 juillet 1918, en pleine nuit, dans un terrain inconnu et trés difficile, ont déployé pendant deux jours, sans se laisser arrêter une ténacité remarquables, refoulant l'ennemi sur 11 kilométres de profondeur, capturant 2,700 prisonniers, 12 canons et plusiers centaines de mitrailleuses,\", 155011=When Maj. Edward B. Cole was mortally wounded on June 10, 1918, he was relieved in command of the Sixth Machine, Gun Battalion of Marines by Capt. Harlan E. Major. On June 11, 1918, Captain Major was relieved by Capt.George H. Osterhout, who retained command until relieved by Maj. Littleton W. T. Waller, Jr., on June 21, 1918., 143763=Without minimizing in any way the splendid actions of the Twenty-sixth Division at Seicheprey and Xivray in April 1918, or the brilliant exploit of the First Division at Cantigny on May 28, 1918, the fact remains that the Second Division, including the Marine Brigade, was the first American division to get a chance to play an important part on the western front, and how well it repelled this dangerous thrust of the Germans along the Paris-Metz highway is too well known to be dwelt upon at length in this brief history., 164346=\"Quoique trés fatigué par un long trajet en camion et une marche de nuit sur des routes difficiles, ce batillon s'est précipité á l'attaque le 18 juillet 1918, prés de Vierzy et a puissamment contribué á consolider et á maintenir la position atteinte ce jour-lá., 182770=On October 24, 1918, Maj. Matthew W. Kingman relieved Maj. Littleton W. T. Waller, jr., in command of the Sixth Machine Gun Battalion of Marines, Maj. Waller joining the Second Division staff as division machine gun officer., 181069=Au Grand Quartier Général, le 21 March 1919., 174395=On October 1, 1918, the brigade with the rest of the Second Division marched to the front line near Somme-Py on the night of October 1-2, 1918, and relieved elements of a French division. The brigade headquarters was located in the trenches about 21/2 kilometers south of Somme-Py. The relief was effected before daylight without incident., 152420=Au Grand Quartier Général, le 22 octobre 1918., 106898=At 10.15 p. m., June 22, 1917, the first group, including the De Kalb was attacked by enemy submarines. The wake of a submarine was sighted crossing 50 yards ahead of the Seattle's bow from starboard to port. A few seconds later the De Kalb and Havana sighted torpedoes and opened fire. Two torpedoes passed close to the Havana, and one passed ahead and one astern of the De Kalb . The second group encountered two submarines, the first at 11.50 a. m., June 26, 1918, about 100 miles off the French coast and the second two hours later., 144298=The fighting of the Second Division in the Chateau-Thierry sector was divided into two parts, one a magnificently stubborn defensive lasting a week and the other a vicious offensive. The defensive fighting of the Second Division between May 31 and June 5, 1918, was part of the major operation called by the Americans the Aisne defensive. Without discussing at this time the tactical or strategical significance of the work of the second Division in the Aisne defensive, suffice to say that its psychological effect upon the morale of the Allies was tremendous and has been recognized in practically every writing worthy of consideration up to the present date., 209309=Col. Richard M. Cutts was fleet Marine officer of the Pacific Fleet from November 1, 1916 to October 14, 1918; and Lieut. Col. Charles B. Taylor from October 15, 1918 until after the armistice., 165767=Col. Logan Feland was in command of the Fifth Regiment during the Aisne-Marne offensive, near Soissons, and continued in command of it with the exception of two days in July, 1918 (when Brig. Gen. Lejeune commanded the Fourth Brigade and Col. Neville the Fifth Regiment), until March 21, 1919, when he was relieved by Col. Harold C. Snyder, who retained command until the date of demobilization., 165281=Au Grand Quartier Général, le 4 Mars 1919. (Ordre No. 13.978 \"D.\"), 15733=The act of Congress of August 29, 1916, increased the authorized strength of the Marine Corps from 344 officers and 9,921 enlisted men to 597 officers and 14,981 enlisted men, and the President was authorized in an emergency to further increase the corps to 693 officers and 17,400 enlisted men, which he did by Executive order on March 26, 1917., 183256=On October 25, 1918, the brigade moved to the Les Islettes area with brigade headquarters at Camp Cabaud. On the evening of October 26, 1918, it arrived in the area south of Exermont and bivouacked in the woods there that night with brigade headquarters at Exermont. The brigade remained in bivouac in this area until the night of October 30-31, 1918, when it moved forward into line to participate in the immense Meuse-Argonne offensive which had started on September 26, 1918, the Second Division being assigned as a unit of the Fifth Corps., 123153=In addition to the above the Twelfth Replacement Battalion sailed from the United States on board the Hancock in June, 1919, arrived in France in June, 1919, and joined the American Expeditionary Forces., 9981=Despite the fact that on the outbreak of war, 187 officers and 4,546 enlisted men were on duty beyond the continental limits of the United States, and 49 officers, and 2,187 enlisted men were serving on board the cruising vessels of the Navy, only five weeks later, on June 14,1917, the Fifth Regiment of Marines, consisting of 70 officers and 2,689 enlisted men, approximately one-sixth of the enlisted strength of the Marine Corps, competently organized and ready for active service, sailed on the Henderson, De Kalb, and Hancock from the United States, forming one-fifth of the first expedition of American troops for service in France., 284485=The problem before the Marine Corps was serious, as a wholesale reduction at that time would have seriously crippled its efficiency. Therefore, on November 20, 1918, in Marine Corps Orders No. 56, orders were issued to the service stating that it was the desire of headquarters to release those members of the Marine Corps Reserve and those men of the Regular Service, who enlisted for the duration of the war, who wished to complete their education, or who had urgent family and business interests demanding immediate and personal attention. Thus demobilization to a limited extent was begun nine days after the signing of the armistice., 182031=Accordingly on October 20, 1918, the brigade was temporarily detached from the Second Division and marched to the area Suippes-Nantivet-Somme-Suippes, with headquarters at Suippes. On October 21, 1918, in obedience to orders, the Marines hiked to the vicinity, 167714=During the last two days of July, 1918, the units of the brigade entrained for a 24-hour railroad journey which took them to an area around Nancy, with headquarters at Villers-les-Nancy, where they remained resting and refitting until August 9, 1918., 334099=Brig. Gen. Charles L. McCawley, was the Quartermaster of the United States Marine Corps, with station at Headquarters, during the entire war. Brig. Gen. McCawley, in company with the Major General Commandant, sailed from the United States on board the Leviathan September 29, 1818, arriving at Brest, France, October 7, 1918. After an extended visit to the Marines as an observer Brig. Gen. McCawley sailed from Brest on board the De Kalb December 9, 1918, arriving in the United States, December 16, 1918., 200233=St. Mihiel offensive, in the vicinity of Thiaucourt, Xammes, and Jaulny: From September 12 to September 16, 1918., 104520=On May 29, 1917, in accordance with directions issued by the President, the Secretary of the Navy directed the Major General, 167173=Brig. General Lejeune retained command until July 29, 1918, when he became commanding general of the Second Division, relieving Maj. Gen. Harbord, who left to assume command of the Services of Supply. Col. Neville, on this latter date, resumed command of the Fourth Brigade., 171539=1. The greatest battles in the world's history are now being fought. The Allies are attacking successfully on all fronts. The valiant Belgian Army has surprised and defeated the enemy in Flanders; the English, who have been attacking the enemy without ceasing since August 8, have advanced beyond the Hindenburg Line, between Cambria and St. Quentin, capturing thousands of prisoners and hundreds of cannon; the heroic Allied Army of the Orient has decisively defeated the Bulgars; the British have captured over 50,000 prisoners in Palestine and have inflicted a mortal blow on the Turk; and our own First Army and the Fourth French Army have already gained much success in the preliminary stages of their attack between the Meuse and Suippes Rivers., 208482=Col. John F. McGill was force Marine officer of the Battleship Force and later force Marine officer of Battleship Force Two until August 14, 1918, when he was relieved by Maj. Harold C. Wirgman, who continued as such until the force was suspended in September, 1918., 340418=During the period of the war the depot outfitted and equipped 36 expeditionary units for service in France and the West Indies, and over 31,000,000 pounds of various kinds of supplies were shipped on Government bills of lading. The depot departments were so organized that it was only necessary to expand each division of the office forces and increase the number of employees and machines in the manufacturing departments in order to meet the increased demands during the war. The personnel of the depot on June 30, 1919, was as follows: Thirteen commissioned officers, 7 warrant officers, 2 civilians, 102 enlisted men of the regular service, 21 reservists, and 1,095 other employees of all classes, making a total personnel of 1,240., 158391=On July 17, 1918, the First Moroccan Division and the First and Second Divisions of American Regulars were hurriedly and secretly concentrated, by terribly fatiguing, forced night marches over roads jammed with troops, artillery, and tanks, through rain and mud, in the Bois de Retz, near Soissons. Headquarters of the Fourth Brigade was established at Vivieres., 295332=Activities directly under the office of the Major General Commandant such as personnel, target practice, and aviation, were carried on efficiently during the war. The Planning section was established on December 24, 1918., 142959=On reaching the Marne that river was used as a defensive flank and the German advance was directed toward Paris. During the first days of June something akin to a panic seized the city and it was estimated that 1,000,000 people left during the spring of 1918. * * *, 267183=Early in December, 1918, the Day Wing received orders to return to the United States, and embarked on December 6, 1918, on board the Mercury at St. Nazaire, France, arriving at Newport News, Va., December 21, 1918., 191415=HEADQUARTERS 4TH BRIGADE, MARINES, AMERICAN E. F., 11th November '18--8.40 a.m., 118181=On October 28, 1918, the Fifth Brigade Machine Gun Battalion sailed from South Brooklyn, N.Y., on board the Henderson and arrived at Brest, France, on November 9, 1918. With the arrival of this unit the entire Fifth Brigade was in France., 145353=On June 6, 1918, the Second Division snatched the initiative from the Germans and started an offensive on its front which did not end until July 1, 1918. The Marine Brigade captured Hill 142 and Bouresches on June 6, 1918, and in the words of Gen. Pershing, \"sturdily held its ground against the enemy's best guard divisions,\" and completely cleared Bois de Belleau of the enemy on June 26, 1918, a major of Marines sending in his famous message: \"Woods now U.S. Marine Corps' entirely.\" The American commander in chief in his first report calls this fighting \"the battle of Belleau Wood\" and states, \"our men proved their superiority, and gained a strong tactical position with far greater loss to the enemy than to ourselves.\" In his final report he states: \"The enemy having been halted, the Second Division commenced a series of vigorous attacks on June 4, which resulted in the capture of Belleau Woods [on June 26] after very severe fighting. The village of Bouresches was taken soon after [on June 6] and on July 1 Vaux was captured. In these operations the Second Division met with most desperate resistance by Germany's best troops.\" On July 1, 1918, the Third Brigade captured Vaux. The Artillery, Engineers, and the other elements of the Second Division assisted materially in these successes, while the Seventh regiment of the Third Division was in Belleau Wood for a few day about the middle of June., 168187=Col. Albertus W. Catlin arrived in the United States on board the America on August 3, 1918. Col. Catlin, having been wounded on June 6, 1918, during the first attack on Bois de Belleau, was admitted to Hospital No. 2, Paris, France, on the next day, was discharged on July 22, 1918, granted two months' sick leave, and sailed for New York from Brest, France, on July 25, 1918., 158926=Early on the morning of July 18, 1918, Marshal Foch threw these three picked divisions at the unsuspecting Germans with overwhelming success, and again on the following day. The American commander in chief in his first report stated:, 267785=On April 6, 1917, the strength of the Marine Corps Reserve, all classes, was 36; the enlisted strength of the Naval Militia, Marine Corps Branch, of the various States, was 928., 137373=Neither the Marine Brigade nor any other element of the Second Division was the first American unit to enter the front line's since the First Division enjoyed that honor in October, 1917, when it entered the line in the quiet Toul sector., 294979=Brig. Gen. John A. Lejeune was the Assistant to the Major General Commandant from December 14, 1914 to September 26, 1917, when he was transferred to Quantico, Va., to command the Marine barracks. Brig. Gen. Charles G. Long relieved Brig. Gen. Lejeune and has acted as Assistant to the Major General Commandant from that date to the present., 180398=\"A pris une part glorieuse aux opérations engagées pas la 4éme Armée en Champagne en Octobre 1918. Le 3 Octobre 1918, a participé à l'attaque des positions allemandes l'avant jussqu'aux abords de Saint-Etienne à Arnes, a réalisé une avance de 6 kilométres. A fait plusieurs milliers de prisonniers, capturé des canons, des mitrailleuses et un important matériel de guerre. Cette attaque, combinée avec celle des Divisions Françaises, a eu pour conséquence l'évacuation des deux rives de la Suippe et du Massif de Notre-Dame-des-Champs.\", 213439=One of the most prominent and outstanding features of the American Expeditionary Forces was the administration of Pontanezen Camp at Brest, France, by Brig. Gen. Smedley D. Butler, United States Marine Corps, from October 6, 1918, to the latter part of July, 1919. The words of the citation conferring upon him the Army distinguished service medal describes in general terms the important work accomplished by Brig. Gen. Butler:, 12214=During the month of June, 1918, when the battle deaths around Hill 142, Bouresches, Belleau Wood, and Vaux, of Americans attached to the Second Division amounted to 1,811 (of which at least 1,062 were Marines) and the nonfatal casualties to 7,252 more (of which 3,615 were Marines), the legislative strength of the Marine Corps was but 1,323 officers and 30,000 enlisted men; the actual strength on June 30, 1918, including reserves, was 1,424 officers and 57,298 enlisted men, and of this total about 300 officers and 14,000 enlisted men were in France. These latter figures include those Marines who suffered casualties in the battles of June, 1918., 20667=On November 11, 1918, the strength of the Marine Corps on active duty was as follows:, 214516=Brig. Gen. Butler returned to the United States in command of the Fifth Brigade, on the Siboney, arriving at Hampton Roads, Va., on August 8, 1919., 67981=Other places. --Headquarters, Washington, D.C.; Office of the Judge Advocate General; assistant paymasters' offices at New York, Atlanta, Ga., and San Francisco, Calif.; depots of supplies at Philadelphia, Pa., San Francisco, Calif., and Charleston, S.C.; naval experimental station, New London, Conn.; naval district base, New London, Conn.; advanced base force, Philadelphia, Pa.; mobilization bureau, New York City; third naval district base, New York; New Navy Building guard, Washington, D.C.; naval mine station, Yorktown, Va.; naval base, Hampton Roads, Va.; Navy rifle range, Wakefield, Mass.; rifle range, Winthrop, Md.; naval proving grounds, Indian Head Md. Wissahickon Barracks, N.J.; Navy fuel depot, Curtis, Md.; Navy ordnance plant, Charleston, W. Va.; camp of instruction, bayonet team, Lansdowne, Pa.; signal battalion, Paoli, Pa.; staff office, San Francisco Calif.; Marine barracks, Quantico, Va.; Fort Crockett, Galveston, Tex.; Gerstner Field, Lake Charles, La.; naval air station, Cape May, N.J.; naval air station, San Diego, Calif.; naval school for mechanics, Great Lakes, Ill.; naval air station, Pensacola, Fla.; Army training field, Mineola, Long island, N.Y.; Marine Corps School of Machine Gun Instruction at Utica, N.Y., and Massachusetts Institute of Technology, Boston, Mass., 207811=On December 14, 1918, our battleships sailed from Brest for the United States, arrived off Ambrose Lightship the afternoon of Christmas Day, and the next morning steamed into New York Harbor where they were accorded a great demonstration. The naval review was followed by a land parade of all the returning officers, Bluejackets, and Marines., 154688=MEAUX, June 25, 1918., 188670=An order of the Second Division, dated November 12, 1918, describing the historic crossing of the Meuse River on the night before the armistice became operative, reads as follows:, 205665=The American battleships occupied a prominent position in the north column of the Grand Fleet on the occasion of the surrender of the German High Seas Fleet, on November 21, 1918, off the mouth, 154745=During the first attack on Belleau Wood on June 6, 1918, Col. Albertus W. Catlin was severely wounded and was relieved in command of the Sixth Regiment by Lieut. Col. Harry Lee, who continued in command until the regiment was demobilized in August, 1919., 218355=Maj. Ernest A. Perkins commanded the Fifth Brigade Machine Gun Battalion from the date of its organization until November 4, 1918; Capt. Franklin A. Hart from that date until November 1918; and from November 12, 1918, to date of demobilization Maj. Allen H. Turnage was the commanding officer., 281414=This battalion, under command of Maj. Charles F. B. Price, was organized at Pontanezen Cain, Brest, in July, 1919, from personnel of the Fourth and Fifth Brigades and the Twelfth Separate Battalion. The battalion designation was changed on August 15 from \"Provisional Battalion, U.S. Marines,\" to the \"Fifteenth Separate Battalion.\", 250286=On October 12, 1917, this Marine Aeronautic Company, then consisting of 34 officers and 330 enlisted men, was divided into the First Aviation Squadron, consisting of 24 officers and 237 enlisted men, and the First Marine Aeronautic Company, consisting of 10 officers and 93 enlisted men., 109731=Every opportunity was taken advantage of to perfect the regiment for combat duty, but this work was handicapped by the fact that many units of the regiment were scattered along the Line of Communications performing duty of a necessary but of a nontraining nature. One company and one battalion commander left the regiment until March 11, 1918. Many other officers and men were placed on detached duty., 2469=ADJUTANT AND INSPECTOR'S DEPARTMENT, HEADQUARTERSUNITEDSTATES MARINECORPS,               Washington, D.C., November 26, 1919., 232670=From April 6, 1917, to September 10, 1919, 131 officers and 3,489 enlisted men died, a total of 3,620 Marine Corps deaths from all causes., 134613=The first unit which ultimately formed a part of the Second Division arriving in France was the Fifth Regiment of Marines which landed in France with the first expedition of American troops in June, 1917. One Marine lieutenant colonel, who afterwards was the first chief of staff of the Second Division, and another Marine lieutenant colonel, who later commanded the Seventeenth Field Artillery of the Second Division, accompanied Gen. Pershing and his staff when they sailed from the United States late in May, 1917., 190136=On the night of November 10, the Fifth Corps forced a crossing of the Meuse against heavy enemy resistance between Mouzon and Pouilly, and advanced to the Inor-Mouzon road with two battalions holding the high ground northwest of Inor., 200128=Marbache sector, near Pont-a-Mousson on the Moselle River: From August 9 to August 16, 1918., 117276=Brig. Gen. Eli K. Cole was designated as the brigade commander and on September 15, 1918, he and the Brigade Staff sailed from Hoboken, N.J., on board the Von Steuben, arriving at Brest, France, on September 24, 1918., 158039=Of the six Allied offensives taking place in 1918 on the Western Front, designated by the Americans as major operations, the Fourth Brigade of Marines, with the other units of the Second Division, participated in three, the first being the vast offensive known as the Aisne-Marne, in which the Marine Brigade entered the line near Soissons., 282842=On August 8, 1919, the Fourth Brigade, as a part of the Second Division, paraded in New York City. Maj. Gen. John A. Lejeune, with many Marine officers on his staff, was in command., 176490=Because of the brilliant part played by this \"Grand Unit\" in the offensive of the Fourth Army during the autumn of 1918, I propose the Second American Division for a citation in \"The Order of the Army\" upon the following specific grounds:, 90613=In addition to giving the enlisted men general training at Quantico in preparation for overseas and other duty, the Overseas Depot was established on May 19, 1918, for the double purpose of organizing and training units of the Marine Corps for service with the American Expeditionary Forces., 210558=In July, 1918, Marines from the Brooklyn acted as guards over German and Austrian prisoners of war on Russian Island, about 5 miles from Vladivostok, while Marines from the same vessel constituted part of an Allied military force of American and British marines, Japanese and Chinese bluejackets, and Czecho-Slovak soldiers, which was organized to prevent a threatened strike and disorder among the workmen in the Russian navy yard at Vladivostok., 16091=On April 6, 1917, Congress declared \"that a state of war exists between the United States and the Imperial German Government\" and one and one-half months later, on May 22, 1917, temporarily increased the authorized strength to 1,197 commissioned officers, 126 warrant officers, and 30,000 enlisted men. Finally, the act of July 1, 1918, temporarily increased the Marine Corps to 3,017 commissioned officers, 324 warrant officers, and 75,500 enlisted men, which is the maximum strength ever authorized for the Marine Corps. Of this number 17,400 were permanent and 57,650 temporary. In addition to the above, the act of August 29, 1916, which established the Marine Corps Reserve, permits the enrollment of reserves without limit as to number, and on April 6, 1917, there were enrolled, subject to call to active duty, three Reserve commissioned officers, 24 National Naval Volunteer officers, 36 Reserve enlisted men, and 928 enlisted National Naval Volunteers. There were also available for recall to active duty 65 regular retired commissioned officers, one regular retired warrant officer, and 210 regular retired enlisted men., 66817=Radio stations, etc. --Greenbury, Md.; Point Isabell, Tex.; Radio, Va.; Key West, Fla.; Chatham, Mass.; Portland, Me.; Rye Beach, Me.; Otter Cliffs, Me.; naval radio station, Wellfleet, Mass.; French Cable Co., Orleans, Mass.; Postal Telegraph and Cable Co., Rockport, Mass.; Commercial Telegraph & Cable Co., Boston; Marconi Wireless Co., Boston; Western Union Co., Boston; Cape Cod, Mass.; Sayville, N.Y.; New Brunswick, N.J.; Belmar, N.J.; Tuckerton, N.J.; Beaufort, S.C.; Charleston, S.C.; Annapolis, Md.; Washington, D.C.; San Diego, Calif.; Chollas Heights, Calif.; Point Arguello, Calif.; Inglewood, Calif.; East San Pedro, Calif.; Eureka, Calf.; Bolinas, Calif.; Marshall, Calif.; Farallones Islands, Calif.; Marshfield, Oreg.; Astoria, Oreg.; Lents, Oreg.; Tatoosh, Wash.; North Head, Wash., 206177=The American vessels did not accompany the surrendered German war vessels to Scapa, but were detached from the British Grand Fleet on December 1, 1918; and sailed from Rosyth for Portland (Weymouth). The day after the surrender of the German Fleet the Nevada, which had been serving with Division 6 of the Atlantic Fleet in Bantry Bay, Ireland, joined Division 9, at Rosyth and proceeded with it to Portland., 246962=(b ) The National Rifle Association and the national matches held at Caldwell, N.J., in 1919. The members of the 1919 Marine Corps rifle team squad made a splendid showing in the rifle matches, outclassing their military and civilian competitors in almost every match held. The Marines won 13 matches out of the 16 in which they were entered; civilian riflemen took 2 events; and the Cavalry 1. Marines won the following matches: Company team, enlisted men's team, member's, Marine Corps cup, rapid fire, regimental team, veteran team, two-man team, President's, grand aggregate, national individual, United Service, and the national team. Four Marines were on the American Expeditionary Forces team, which took second Place., 169217=The relief from the Marbache sector was completed on August 18, 1918, and the brigade moved to an area about 20 kilometers southeast of Toul, headquarters being established at Favieres. Intensive training for the impending St. Mihiel offensive was indulged in here., 183811=Relieving elements of the Forty-Second Division, just south of Landres-et-St.-Georges, the Marine Brigade early on the morning of November 1, 1918, jumped-off, following a terrific barrage, for its final operation of the war, the conclusion of which at 11 o'clock on the morning of November 11, 1918, found the Marines firmly established on the heights of the far bank of the Meuse River, after an advance of 30 kilometers., 109236=On August 15, 1917, the First Division, including the Fifth Regiment of Marines, was reviewed by its commanding general on a plateau 12 miles distant from the training area., 286286=In August, 1919, the Fourth and Fifth Brigades of Marines, which had been serving with the Army in France, were returned to the Marine barracks, Quantico, Va., and the naval operating base, Hampton Roads, Va., respectively, at which places the demobilization of these two organizations was effected. This undertaking was by far the largest and most important of its kind that had ever confronted he Marine Corps, but due to the coordination of the various departments, 178022=Up to October 4, at which date the present bulletin is written, the Fourth Army has pushed its advance up to objectives of the very highest importance. A splendid American division, full of dash and ardor, the Second Division, United States, placed at the disposition of the Twenty-first Corps on October 3, made itself master of Massif du Blanc Mont, which dominates the valley of the Arnes and gives us excellent outlook on the valley of the Suippe in rear of the region of Monts. This conquest rapidly brought the downfall of Notre-Dame-des Champs and the Grand Bois de Saint Souplet., 117779=On September 29, 1918, Eleventh Regiment Headquarters and the First Battalion sailed on the De Kalb from Philadelphia, Pa., and arrived at Brest, France, on October 13, 1918. On October 16, 1918, the Second and Third Battalions of the Eleventh Regiment sailed from Brooklyn, N.Y., on board the Agamemnon and Von Steuben and arrived at Brest, France on October 25, 1918., 110322=The following letter dated November 10, 1917, addressed by Gen. Pershing to the Major General Commandant is both complimentary and explanatory as to why the Marines were used along the Line of Communications:, 143389=The Second Division, then in reserve northwest of Paris and preparing to relieve the First Division, was hastily diverted to the vicinity of Meaux on May 31, and, early on the morning of June 1, was deployed across the Chateau-Thierry Paris road near Montreuil-aux-Lions in a gap in the French line, where it stopped the German advance on Paris., 153219=MEAUX, June 26, 1918., 144971=The close of the Aisne defensive on June 5, 1918, found the line of the Second Division well established at that point of the Marne salient nearest Paris, but not including Hill 14 2,Bois de Belleau, Bouresches, or Vaux, and the Germans were in possession of Chateau-Thierry on the right of the Second Division, and continued to hold that town until about July 17, 1918., 283840=Immediately upon the armistice becoming operative on November 11, 1918, the question of demobilization became one of paramount importance. It was necessary that plans be at once put into effect providing for the release from service at the earliest possible date of duration-of-war men and reservists. While authority existed to hold such men for several months after the ratification of the peace treaty, the popular demand for the return and discharge of all who could be spared was only natural. Parents, relatives, and friends could see no necessity for the keeping of their loved ones in the service after actual fighting eased., 39360=The following table shows the number of men enlisted in the Marine Corps, not including reserves enrolled but including inductees, between April 1, 1917, and November 11, 1918. These figures do not include the 13,214 enlisted men already in the Marine Corps on April 6, 1917:, 119243=On December 29, 1918, the detachment for the naval forces in France, staff office, Paris, France, landed at St. Nazaire, France., 116835=On September 5, 1918, the Major General Commandant directed the post commander, Marine barracks, Quantico, Va., to organize brigade headquarters of the Fifth Brigade, United States Marine Corps., 174780=The Battle of Blanc Mont Ridge was fought and won by the Second Division, as a unit of the Fourth French Army, between October 3 and 9, 1918, over the desolated white chalky ground of the Champagne, which was scarred and shell pocked by years of artillery fire, marked with huge mine craters, gridironed with an intricate maze of deep trenches and concrete fortifications, and covered with tangled masses of wire., 17364=On April 6, 1917, the strength of the Marine Corps on active duty was as follows:, 333427=In obedience to orders dated October 2, 1917, and in compliance with provisions of G.H.Q. General Orders No. 38(2), September 17, 1917, the \"Office of the Chief Paymaster, U.S. Marines, France,\" was established in Paris, France, on October 5, 1917. Maj. Davis B. Wills was Chief Paymaster, U.S. Marines, France, from that date until the office was abolished in August, 1919., 192121=On \"the eleventh hour, the eleventh day of the eleventh month, of the year 1918,\" Brig. Gen. Wendell C. Neville, commanding general of the Fourth Brigade of Marines, published the following tribute to the officers and men of the Fourth Brigade:, 153727=forget that the beginning of this month of June, when their homes were, 139523=On May 14, 1918, the brigade left the area around Vitry-le-Francois as it was unsuitable and proceeded to an area around Gisors-Chaumont-en-Vixen, with headquarters at Bou-des-Bois. The brigade was in this area when sudden orders came to move to the Chateau-Thierry sector., 187699=An order of the Second Division, dated November 5, 1918, reading in part as follows, tells what occurred subsequent to the first day's attack:, 115796=Like the Fifth Regiment, the Sixth Regiment spent several months performing the necessary but undesired duties along the Line of Communications. On January 12, 1918, Col. Albertus W. Catlin established headquarters for the Sixth Regiment at Blevaincourt in the Bourmont training area. The Third Battalion arrived in this area on January 12, 1918, the headquarters units the same date, the First Battalion during January, 1918, and the Second Battalion on February 10, 1918., 342535=The expenditures of the quartermaster's department for the fiscal years ending June 30ths, 1917, 1918, and 1919, were as shown below, exclusive of appropriations for public works, under the Navy Department, from which figures the enormous increase in the activities and responsibilities of this department, caused by the war and by the increase in strength, is evident:, 156026=During the time the above-described fighting was going on the Germans were frustrated in their fourth 1918 drive (Noyon-Montdidier defensive) between June 9 and 15, 1918, and of course being busy in the vicinity of Bois de Belleau, the Marines had no opportunity of engaging in it., 288630=Beginning with the first expeditionary forces which left the United States in June, 1917, over 30,000 officers and men of the Marine Corps have been sent to France. The Fourth Brigade, as a part of the immortal Second Division, has been engaged in all of the principal operations of the war. Their record speaks for itself. The Fifth Brigade, going to France later, furnished many splendidly trained replacements for the Fourth Brigade and performed arduous tasks according to tradition., 200051=Aisne-Marne (Soissons) offensive: From July 18 to July 19, 1918., 141211=The first offensive (Somme) of the Germans was stopped within a few miles of Amiens, and the second (Lys) overran Armentieres. In this second German offensive, which lasted from April 9 to 27, 1918, and which has been designated by the Americans as a major operation, there were approximate 500 American troops engage., 99532=Until February, 1918, the training of the Marines in France was handicapped by the fact that units of the Brigade were engaged in duties along the Line of Communications (Services of Supply), one company and a battalion commander being absent in England until March, 1918. It was not until the middle of February, 1918, that the Fourth Brigade of Marines (less the company in England) was conducting its training as a brigade with any degree of satisfaction. Owing to the well-trained condition of the individual Marine this condition did not vitally affect his professional ability as was so distinctly shown by his later accomplishments., 259348=On November 11, 1918, the following planes were operated by the personnel of Marine Aviation:, 29269=This plan in part provided that the Marine Corps was accorded the privilege of individual inductions to the amount of 5,000 men, for the months of October, November, and December, 1918, and January, 1919, and 1,500 thereafter., 285388=Following the approval of the act of July 11, 1919, which act provided sufficient funds to sustain the corps only at an average enlisted strength of 27,400 men, with corresponding officers, Marine Corps Orders No. 42, July 12, 1919, were published, establishing demobilization centers and promulgating detailed instructions for the complete demobilization. Under this plan duration-of-war men were discharged as rapidly as the exigencies of the service permitted. Those men who were serving in the Tropics who were eligible for discharge and desired their release were returned to the United States as rapidly as practicable, and orders were issued for their discharge and awaited them at the time of joining a Marine barracks, thus minimizing delay in allowing them to go home. By the latter part of December, 1919, practically all of the duration-of-war personnel had been discharged., 211024=The Albany was at Vladivostok from April 2, 1919, until relieved by the New Orleans on July 25, 1919. Each of these ships, while they were anchored off Vladivostok, kept a small guard of Marines at the United States Naval radio station on Russian Island., 279821=The company of Marines and battalion commander (major) and staff, forming a part of the Composite Regiment, Third Army, returned to the United States on board the Leviathan on September 8, 1919, and were returned to the naval service in September, 1919., 282005=Leaving Brest on the Mercury, September 3, 1919, the Battalion six days later arrived at Bordeaux to take part in the ceremony of laying a foundation for a monument commemorating the entrance of the United States into the World War, at Pointe de Grave, near Bordeaux, France. It then returned to Brest and in December went on board the Henderson, then at that port. The Henderson, with the Battalion on board, sailed from Brest, arriving at Philadelphia on December 23, 1919, after a 16-day trip. On December 30, 1919, the battalion arrived at Quantico, Va., 187870=During the night of November 2-3 the Second Division moved forward overcoming the resistance of the enemy's advanced elements, and at 6 a. m., it attacked and seized the enemy's line of defense on the ridge southeast of Vaux-en-Dieulet., 181370=On October 10, 1918, having been relieved from the line in the Blanc Mont sector, the brigade took station in the Suippes-Somme Suippes-Nantivet area and the adjacent camps with headquarters at Suippes, being assigned as Fourth French Army reserve. The brigade remained in this area resting and refitting until October 14, 1918, when, in accordance with orders, it marched to the Vadenay-Bouy-la-Veuve-Dampierre area, north of Chalons-sur-Marne, with headquarters at Bouy. While here orders were received placing the Fourth Brigade provisionally at the disposal of the Ninth French Army Corps to hold a sector in the region Attigny-Voncq-Aisne River, 171359=On October 1, 1918, in an order of the Second Division, the commanding general of the Second Division encouraged his division with the following words:, 231108=The following table shows the casualties sustained by the Marine Aviation forces between April 6, 1917, and November 11, 1918:, 323877=The amount of money expended for pay and allowances for each month from April, 1917, to December, 1918, follows:, 155351=During the fighting in the Chateau-Thierry sector the headquarters of the Fourth Brigade was successively at Montreuil-aux-Lions, (in an automobile for one-half hour on the way to the front lines), Issonge farmhouse, and La Loge farmhouse. After being relieved by elements of the Twenty-sixth Division during the night of July 5-6, 1918, the brigade moved to an area in rear of the lines and occupied what was known as the Line of Defense or Army Line, with, 264083=In December, 1917, 2 Marine officers and 10 enlisted men were sent to the Army balloon school at St., Louis, Mo., and later to Omaha, Nebr., for training., 188491=During the night of November 4-5, the division again pressed forward, occupied Beaumont and Letanne and threw the enemy on its front across the Meuse., 80484=In the act approved August 31, 1918, provision was made for a Student Army Training Corps, and under date of September 12, 1918, the Secretary of War directed the Provost Marshal General to allot 1,500 of the registrants authorized for induction into the Student Army Training Corps to the Marine sections under that organization. On September 23, 1918, with the approval of the Navy Department, Marine Corps headquarters designated the following institutions for the organization of Marine sections of the Student Army Training Corps and allotted quotas to each ranging from 100 to 190:, 152684=In addition to the above-described instances, French civilian sentiment expressed itself in the following letter from the mayor of Meaux and Resolution from the assembled mayors of the Meaux District (Arrondissement). This letter and the resolutions were published on July 10, 1918, in General Orders No. 43, of the Second Division \"as indicating the appreciation of the efforts of the Second Division by the French inhabitants for our share in stemming the recent German advance in this sector.\", 113532=On August 4, 1917, in accordance with directions issued by the President, the Secretary of the Navy directed the Major General Commandant \"to organize a force of Marines, to be known as the Sixth Regiment of Marines, for service with the Army in France,\" and the regiment was organized as directed., 109123=On August 1, 1917, Gen. Pershing inspected the battalions at the two towns where they were billetted., 185723=With reference to the first day's attack, the commanding general, Fifth Army Corps, wrote officially on November 2, 1918, in part as follows:, 213256=Brig. Gen. Smedley D. Butler relieved Brig. Gen. Cole as commanding general of the brigade on April 9, 1919, and retained command until it was demobilized in August, 1919., 267409=The First Marine Aeronautic Company returned from the Azores in March, 1919, arriving at the Marine flying field, Miami, Fla., on March 15, 1919., 127325=In addition to the above the Twelfth Replacement Battalion, consisting of 9 officers and 500 enlisted men, joined the American Expeditionary Forces in June, 1919., 294081=Maj. Gen. Commandant George Barnett was the Major General Commandant of the United States Marine Corps during the entire period of the World War. Originally appointed on February 25, 1914, he was reappointed on February 25, 1918, for a second term of four years., 98956=On June 27, 1917, the First Battalion of the Fifth Regiment actually landed in France and on July 3, 1917, the entire Fifth Regiment was under canvas on French soil. From that date every effort was made to train the men and officers. Elements of the Fifth Regiment trained as a part of the First Division of Regulars from July 15, 1917, to September, 1917, in the Gondrecourt training area. From September, 1917, on, the training of the available units of the Fourth Brigade as a unit of the Second Division of Regulars was conducted in the Bourmont training area., 129480=The commanding general of the Second Division from early in August, 1918, to the date of demobilization, and several officers on his staff were Marine officers. Officers of the Marine Corps were at various times attached to the First, Second, Third, Fourth Sixth Twenty-sixth, Thirty-second, Thirty-fifth, Ninetieth, and Ninety-second Divisions, and in some cases engaged in operations with them. Brig. Gen. John A. Lejeune assumed command of the Sixty-fourth Infantry Brigade of the Thirty-second Division, then in the front line on the Swiss border in the Suarce sector, on July 5, 1918. He was in command of this brigade on July 22, 1918, when it was withdrawn from the above-mentioned sector and continued in command until July 25, 1918, when he left to command the Fourth Brigade of Marines. Between July 5, 1918, and July 22, 1918, Brig. Gen. Lejeune, in addition to the Sixty-fourth Brigade, commanded three French infantry regiments. Col. Robert H. Dunlap was in command of the Seventeenth Field Artillery Regiment of the Second Field Artillery Brigade, Second Division, from October 30, 1918, to February, 1919. Col. Hiram I. Bearss commanded the One hundred and second Regiment of the Fifty-first Infantry Brigade, Twenty-sixth Division, in the St. Mihiel offensive. Col. Frederic M. Wise commanded the Fifty-ninth Regiment of the Eighth Infantry Brigade, Fourth Division, from September 5, 1918, to January 4, 1919, during which period he participated in the St. Mihiel and Meuse-Argonne major operations. From January 1, 1919, to February 9, 1919, Col. Wise commanded the Eighth Infantry Brigade of the Fourth Division., 157473=On July 11, 1918, Brig. Gen. James G. Harbord, commanding general of the Marine Brigade, received notification of his appointment as a major general, and two days later left on a five days' leave of absence. As Col. Neville had been evacuated to a base hospital after leaving the Chateau-Thierry sector, Lieut. Col. Harry Lee assumed temporary command of the brigade. Maj. Gen. Harbord and Col. Neville both returned in time to enter the Aisne-Marne offensive, the former in command of the Second Division and the latter in command of the Fourth Brigade., 31456=On December 4, 1918, recruiting on a very limited scale was resumed by order of the Secretary of the Navy. On that date also, enrollments in the Marine Corps Reserve were stopped., 159869=Gen. Petain's initial plan for the counterattack involved the entire western face of the Marne salient. The First and Second American Divisions, with the First French Moroccan Division between them, were employed as the spearhead of the main attack, driving directly eastward, through the most sensitive portion of the German lines to the heights south of Soissons. The advance began on July 18, without the usual brief warning of a preliminary bombardment, and these three divisions at a single bound broke through the enemy's infantry defenses and overran his artillery, cutting or interrupting the German communications leading into the salient. A general withdrawal from the Marne was immediately begun by the enemy, who still fought stubbornly to prevent disaster. * * *, 119144=On September 30, 1918, the detachment for naval base No. 29, arrived at Cardiff, Wales., 267974=On April 1, 1917, the Naval Militia, Marine Corps Branch, attained its highest strength, 1,046. There was no recruiting for the Naval Militia, Marine Corps Branch, after April 1, 1917, and in consequence, the enlisted personnel of that branch showed a steady decrease subsequent to that date, owing to discharges and rejections., 114779=On October 23, 1917, the Fourth Brigade of Marines was organized, with Brig. Gen. Charles A. Doyen in command. Brig. Gen. Doyen continued in command until May 7, 1918, when he published in General Orders No. 5, that he had relinquished command. Maj. Harry R. Lay was the first brigade adjutant, and performed the duties of that office from October 24, 1917, to August 9, 1918, except during the period February 7 to May 9, 1918, when Maj. Holland M. Smith was brigade adjutant., 1431=November 26, 1919., 194944=The duties of the Fourth Brigade with the Army of Occupation in Germany were uneventful, the outstanding features being the establishment of a Rhine River patrol, manned and commanded by Marines; an extended visit, inspection, and review by the Secretary of the Navy; and the operation of the Second Division, including the Marines, made about the middle of June, 1919, in which an advanced position was taken as a part of the concentration of the Third Army immediately preceding the signing of the treaty of peace by the Germans., 335434=It was necessary to make large increases in the personnel at headquarters to handle the question of supply, transportation, construction, and finance. The table below shows the strength in the office of the quartermaster on January 1, 1917, and June 30, 1918:, 28655=On August 8, 1918, by Executive order, volunteer enlistments in the Marine Corps and enrollments in the reserve were stopped, and from that time until October 1, 1918, no men were enlisted in the corps with the exception of those whose cases were pending when the Executive order above mentioned was issued and some whose enlistments expired and were reenlisted. On September 16, 1918, the Secretary of War approved the terms of a tentative plan proposed in an informal conference by representatives of the Navy Department, the Marine Corps, the General Staff, and the Provost Marshal General's Office., 116281=Therefore, on February 10, 1918, the Fourth Brigade of Marines was in the Bourmont training area intact, with the exception of one company on duty in England, training industriously as an infantry brigade of the Second Division. While the brigade had been organized on October 23, 1917, and had actually functioned as a brigade with elements of all three of its units present from January 12, 1918, it was not until February 10, 1918, that the Brigade organization was perfected., 184650=4. In the First Army attack of November 1, 1918, the Second Division was selected and so placed in the battle line that its known ability might be used to overcome the critical part of the enemy's defense. The salient feature of the plan of attack was to drive a wedge through Landres-et-St. Georges to the vicinity of Fosse. It was realized that if the foregoing could be accomplished the backbone of the hostile resistance west of the Meuse would be broken and the enemy would have to retreat to the east of the Meuse. Success in this plan would immediately loosen the flanks of the First Army. The Second Division was selected to carry out this main blow., 212053=Brig. Gen. Eli Cole, the first commanding general of the Fifth Brigade, arrived in France on September 24, 1918, and proceeded to headquarters, Forty-first Division (First Depot Division), St. Aignan, France, reporting there October 1 to 4, 1918; on October 6, 1918, he joined the Second Division at Souain, France, as an observer and remained with the Second Division until October 26, 1918, when he left to report at St. Aignan. On October 28, 1918, Brig. Gen. Cole arrived at St. Aignan and assumed command of the Forty-first Division (First Depot Division). From December 27, 1918, to January 10, 1919, be commanded the First Replacement Depot. From January 12 to February 3, 1919, he commanded the American Embarkation Center at Le Mans, France. From February 23, 1919, to March 4, 1919, he commanded the Forwarding Camp at Le Mans, France. During the period March 5 to 21, 1919, Brig. Gen. Cole was occupied in inspecting the units of the Fifth Brigade. He left Tours, France, on March 31, arrived at Brest, France, same day, was detached from the American Expeditionary Forces on March 31, and sailed for the United States on the Mauretania, arriving at New York April 7, 1919., 283166=On August 12, 1919, the Fourth Brigade of Marines, then a part of the naval service, was reviewed by the President of the United States in a parade at Washington, D.C. Brig. Gen. Wendell C. Neville was in command., 250739=On December 7, 1917, the First Marine Aeronautic Company, then consisting of 12 officers and 133 enlisted men, was ordered to Naval Base 13, Ponta Delgada, Azores, arriving there on January 21, 1918. This company was the first completely equipped American aviation unit to leave the United States for service in the war. This organization operated an antisubmarine patrol station of 10 R-6 seaplanes, 2 N-9 seaplanes, and later 6 HS-2-L flying boats until the station was ordered abandoned on January 24, 1919, when it was ordered to return to the United States, arriving at the Marine flying field, Miami, Fla., March 15, 1919. Maj. Francis T. Evans was in command from January 9 to July 18, 1918, and Maj. David L. S. Brewster from July 19, 1918, to January 20, 1919., 209570=The Marines of the Brooklyn, flagship of the Asiatic Fleet, participated in the activities around Vladivostok, Siberia, In 1918., 208760=Lieut. Col. James McE. Huey was force Marine officer of Battleship Force One from September 3, 1917 to December 29, 1917, when he was relieved by Maj. Edwin N. McClellan who continued, 208222=Col. (Brig. Gen.) John T. Myers was the fleet Marine officer of the Atlantic Fleet from before the outbreak of the war to August 23, 1918, being relieved on that date by Col. Frederic L. Bradman who continued on that duty until after the armistice., 235404=The commanding general, Second Division, under date of December 30, 1918, reported to General Headquarters, American Expeditionary Forces, the following data with reference to artillery and machine guns captured:, 110144=On September 24, 25, 1917, that part of the Fifth Regiment available for training arrived in the Bourmont training areas and was stationed at Damblain and Breuvannes., 220807=The following is a summary of the casualties sustained by the Fourth Brigade of Marines from March 15 to November 11, 19 18, as published in General Orders, No. 66, Second Division, American Expeditionary Forces, dated July 2, 1919:, 219361=Marine Corps deaths in the American Expeditionary Forces, as obtained from Marine Corps records on January 14, 1920, are divided as follows:, 157011=General headquarters, American Expeditionary Forces, on May 28, 1919, credited the Second Division units with participation in the major operation of Champagne-Marne defensive, but on June 2,1919, rescinded this credit., 30870=Owing to the signing of the armistice, no more requests were made to the Provost Marshal General for the induction of men after November 18, 1918., 295565=Brig. Gen. Charles H. Lauchheimer was the Adjutant and Inspector of the United States Marine Corps, with station at Headquarters, during the World War. He became seriously ill, was admitted to the hospital on July 10, 1919, where he died on January 14, 1920. Col. Henry C. Haines assumed the duties of Acting Adjutant and Inspector on August 3, 1919, and upon the death of Brigadier-General Lauhheimer was appointed the Adjutant and Inspector., 198029=When in October, 1918, the Allied High Command desired to reinforce the French Army by American troops of great offensive worth, by real \"shock troops,\" you were loaned to Gen. Gouraud's Fourth French Army arid delivered your famous assault on Blanc Mont Ridge, releasing from German menace the historic city of Rheims., 268314=On July 1, 1918, the Naval Militia Marine Corps Branch, then the National Naval Volunteers, Marine Corps Branch, consolidated with the Marine Corps Reserve in pursuance with the provisions of an act of Congress, approved July 1, 1918, and in consequence thereof became members of class 2, Marine Corps Reserve., 202859=Division 9 of the Atlantic Fleet, composed of the New York (flagship), Wyoming, Florida, and Delaware, was detailed for service with the British Grand Fleet, rendezvoused on November 24, 1917, in Lynnhaven Roads, Chesapeake Bay and sailed for its destination the following day., 234449=Information was received in January, 1920, that the War Department had accepted the award of the French fourragére in the colors of the ribbon of the Croix de Guerre for several Army organizations and the three units of the Fourth Brigade., 248988=(f ) Third Army championship (Amaroc shoot) held on the rifle range at Wehr, Germany, under the auspices of the Third Division in June, 1919. The Marines and the Second Division won most of the honor in this competition., 200491=Meuse-Argonne (including crossing of the Meuse River): From November 1 to November 11, 1918., 199524=The Fourth Brigade of Marines as a unit of the Second Division participated in actual battle in France in the following sectors between the inclusive dates set down (as published in General Orders No. 37, Second Division, April 25, 1919):, 177636=The further opinion of the French as to the results and effect of the Second Division's operations in Champagne is set forth in the following-quoted extract from Information Bulletin No. 12 of the Fourth French Army dated October 7, 1918:, 115268=On October 26, 1917, Brig. Gen. Charles A. Doyen, United States Marine Corps, assumed command of the Second Division as its first commanding general, and announced his staff in General Orders No. 1, with station at Bourmont, Haute-Marne, serving as such until relieved by Maj. Gen. Omar Bundy, United States Army, who announced, 103824=From June 27, 1917, to the middle of September, 1917, the Fifth Regiment was a unit of the First Division of Regulars. Although the Fifth Regiment was the only organization of Marines in France at the time, the Fourth Brigade of Marines was formed on October 23, 1917, when Col. Charles A. Doyen cabled acceptance of his appointment as Brigadier General. From October 26, 1917, to August 8, 1919, the Fourth Brigade was a part of the Second Division of Regulars, except from October 20-23, 1918, when the Brigade was provisionally at the disposal of the Ninth French Army Corps, in the vicinity of Leffincourt. On August 8, 1919, the brigade was transferred back to the naval service., 199938=Chateau-Thierry sector (capture of Hill 142, Bouresches, Belleau Wood): From dune 6 to July 9, 1918., 79597=There were 235 graduated in July, 1919, from the third officers' training camp who were enrolled as second lieutenants (provisional) in class 4, Marine Corps Reserve, and immediately assigned to inactive duty., 196087=Maj. Charles D. Barrett relieved Lieut. Col. Earl H. Ellis as brigade adjutant in April, 1919, and held that position until the brigade was demobilized. Lieut. Col. Ellis was assigned to duty as second in command of the Fifth Regiment. On March 12, 1919, Col. Logan Feland was temporarily appointed brigadier general to rank from March 9, 1919, and accepted appointment and executed oath on March 17, 1919. On March 21, 1919, Col. Harold C. Snyder assumed command of the Fifth Regiment, relieving Brig. Gen. Logan Feland, who, after acting as aide for the Secretary of the Navy, arrived in the United States on the Von Steuben on May 13, 1919., 175725=In the Champagne district, October 2 to 10, it fought beside the Fourth French Army. On October 3 it seized Blanc Mont Ridge, the keystone of the arch of the main German position, advanced beyond the ridge and, although both flanks were unsupported, it held all its gains with the utmost tenacity, inflicting tremendous losses on the enemy. This victory freed Rheims and forced the entire German Army between that city and the Argonne Forest to retreat to the Aisne, a distance of 30 kilometers.}",
    "lastModified": "Sat, 15 Mar 2008 14:34:24 GMT",
    "textBeforeTable": "Applicants, rejections, enlistments, etc., regular Marine Corps, not including reserves but including inductees, April, 1917, to November, 1918. On December 4, 1918, recruiting on a very limited scale was resumed by order of the Secretary of the Navy. On that date also, enrollments in the Marine Corps Reserve were stopped. Corps would be permitted without notice to local boards, and the provisions of the selective service law became inoperative so far as the Marine Corps was concerned. --14-- On December 2, 1918, the President, by proclamation, directed that voluntary enlistments of registrants into the Navy and Marine Owing to the signing of the armistice, no more requests were made to the Provost Marshal General for the induction of men after November 18, 1918. 7,088       Total     421 December, 1918 3, 880 November, 1918 2,787 October, 1918 Owing to the cessation of hostilities there were but few inductions and none of the inductees ever reached France prior to the armistice becoming effective. Regular voluntary inductions into the Marine Corps (through Provost Marshal General) commenced October 1, 1918, and the last man was voluntarily inducted on December 13, 1918. Inductions occurred as follows: As the",
    "textAfterTable": "29 3,996 5 5 811 30,322 Oct. 31 4,335 33 3,661 5 1 635 30,576 Nov. 30 5,577 14 4,942 2 2 617 30,855 Dec. 31 6,788 22 5,305 4 5 1,452 32,016 Jan. 31 5,472 29 3,981 5 3 1,454 33,184 Feb. 28 5,915 31 5,772 4 3 105 33,045 Mar. 31 5,037 18 4,734 2 4 279 33,093 Apr. 30 15,958 44 12,996 3 5 2,010 35,690 May 31 18,336 73 12,956 7 22 5,278 40,722 June 30 23,864 79 18,609 17 36 5,132 45,384 July 31 20,162 224 11,767 9 10 8,152 52,712 Aug. 31 17,286 115 11,528 5 40 5,598 57,628 Sept.30 16,175 190 13,484 5 83 2,404",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}