{
    "relation": [
        [
            "Argument",
            "appName",
            "server",
            "applicationVersion"
        ],
        [
            "Definition",
            "Name of the application in which to perform this operation. For WebCenter Portal, the application name is always webcenter. For Portal Framework applications, specify the appropriate name.",
            "Optional. Name of the managed server where the application is deployed. For example, WC_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.",
            "Optional. Version number of the deployed application. Required if more than one version of the application is deployed."
        ]
    ],
    "pageTitle": "WebCenter Portal Custom WLST Commands",
    "title": "",
    "url": "https://docs.oracle.com/cd/E29542_01/web.1111/e13813/custom_webcenter_admin.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 867017847,
    "recordOffset": 866920655,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{726717=Personal events supports connections to Microsoft Exchange Server 2003 and Microsoft Exchange Server 2007.While you can register multiple personal events connections for WebCenter Portal and Portal Framework applications, only one connection is used for personal events services - the default (or active) connection., 512994=Choose OCS2007 for Microsoft Office Communications Server 2007 and Microsoft Lync., 166373=The following example archives activity stream data that is older than October 1, 2009 for WebCenter Portal (webcenter):, 183170=The following example restores activity stream data archived since October 1, 2009:, 164339=Year before which to archive activity stream data. For example, 2009., 710034=LDAP batch read size. Any value between 1 and 1000., 233308=Defaults is 102400 bytes (100K)., 544318=Lists which types of instant messaging and presence servers Oracle WebCenter Portal supports. Out-of-the-box, WebCenter Portal and Portal Framework applications support Microsoft Live Communications Server 2005 R2 (LCS), Microsoft Office Communications Server 2007 SP1 (OCS) and Microsoft Lync 2010., 298439=Creates a connection to a Microsoft SharePoint 2007 repository for a named application., 196791=Number of user activities you want to keep in the production table. For example, 2000., 693663=Any value between 1 and 1,000. The default value is 1000., 522785=Choose OCS2007 for Microsoft Office Communications Server and Microsoft Lync Server., 732384=The following example creates a connection named MyPEConnection for WebCenter Portal (webcenter). The connection points to a Microsoft Exchange Server 2007 and is designated as the default connection for personal event services:, 217152=Create a Microsoft SharePoint 2007 repository connection., 176393=Year the portal became inactive. For example, 2009., 178374=The following example archives activity stream data associated with portals that have been inactive (no activities have occurred, regardless of open or closed status) since October 1, 2009:, 510315=Use the listIMPAdapters command to find out which types of instant messaging and presence servers are supported. Out-of-the-box, WebCenter Portal and Portal Framework applications support Microsoft Office Live Communications Server 2005 R2 (LCS), and Microsoft Office Communications Server 2007 SP1 (OCS), and Microsoft Lync 2010., 181184=For example, 2009., 201860=The following example keeps the last 2000 activities for user in production tables and archives the remaining activity stream data:, 711397=The following example increases the batch size to 2000 LDAP profiles:, 710093=The default value is 1000., 164676=Month before which to archive activity stream data. For example, enter 1 for January, 2 for February, and so on., 736467=Optional. Specify the adapter that matches the personal events server. Valid values are MSEx2003 and MSEx2007. Choose MSEx2003 for Microsoft Exchange Server 2003 and MSEx2007 for Microsoft Exchange Server 2007., 194109=The following example keeps the last 2000 activities for each portal in production tables and archives the remaining activity stream data:, 176712=Month the portal became inactive. For example, enter 1 for January, 2 for February, and so on., 217992=List all Microsoft SharePoint 2007 connections that are configured for a named application., 190393=The following example keeps the last 2000 activities associated with the portal MySalesPortal and archives the rest:, 181527=For example, enter 1 for January, 2 for February, and so on., 189035=Number of portal activities you want to keep in the production table. For example, 2000., 41006=Optional. Port on which the analytics collector listens for events. The default value is 31314., 252273=Optional. Maximum cacheable size (in bytes) for Content Server binary documents. Documents larger than this size are not cached by WebCenter Portal or the Portal Framework application. Defaults is 102400 bytes (100K)., 692722=Any value between 1 and 10, 000. The default value is 1000., 638701=The frequency, in seconds, that portal distribution lists are checked for new incoming emails. The default is 1800 seconds (30 minutes)., 217572=Edit a Microsoft SharePoint 2007 repository connection., 512916=Choose LCS for Microsoft Live Communications Server 2005., 306212=Edits an existing Microsoft SharePoint 2007 repository connection. This command requires that you specify values for appName and name, plus at least one additional argument., 49872=The default value is 31314., 198097=The following example keeps the last 2000 activities associated with the user Monty and archives the rest:, 693199=Any value between 1 and 1440. The default value is 60., 729493=Specify the adapter that matches the personal events server. Valid values are MSEx2003 and MSEx2007. Choose MSEx2003 for Microsoft Exchange Server 2003 and MSEx2007 for Microsoft Exchange Server 2007., 522543=Optional. Adapter name. Specify the adapter that matches your instant messaging and presence server. Valid values are LCS, and OCS2007., 951926=The default value is 1500.}",
    "lastModified": "Fri, 28 Nov 2014 10:31:22 GMT",
    "textBeforeTable": "setWebCenterServiceFrameworkConfig(appName, [resourceActionHandlerClassName, resourceActionHandlerDisplayInPopup, server, applicationVersion])  Syntax       Sets configuration properties for Oracle WebCenter Portal's services framework, such as the Resource Action Handler class and display as popup properties. Description     Use with WLST: Online Module: Oracle WebCenter Portal setWebCenterServiceFrameworkConfig     wls:/weblogic/serverConfig> deleteConnection(appName='webcenter', name='MyConnection')  The following example deletes a connection configured for WebCenter Portal (webcenter): Example        Optional. Version number of the deployed application. Required if more than one version of the application is deployed. applicationVersion     Optional. Name of the managed server where the application is deployed. For example, WC_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  server     Connection name.  name     Name of the application in which to perform this operation. For WebCenter Portal, the application name is",
    "textAfterTable": "Optional. Name of the managed server where the application is deployed. For example, WC_Spaces. Required when applications with the same name are deployed to different servers and also when you have a cluster.  applicationVersion Optional. Version number of the deployed application. Required if more than one version of the application is deployed. Example The following example sets the WebCenter Portal Service Framework Resource Action Handler class to my.company.ResourceActionHandler:  wls:/wc_domain/domainRuntime> setWebCenterServiceFrameworkConfig(appName='webcenter', resourceActionHandlerClassName='my.company.ResourceActionHandler') Successfully set the WebCenter Portal service framework configuration. Resource Action Handler class: my.company.ResourceActionHandler To effect connection changes, you must restart the managed server on which the application is deployed. The following example sets only the WebCenter Portal Service Framework Resource Action Handler display as popup value to 1 (true):  wls:/wc_domain/domainRuntime> setWebCenterServiceFrameworkConfig(appName='webcenter', resourceActionHandlerDisplayInPopup=1) Successfully set the WebCenter Portal service framework configuration. Resource Action Handler Display In Popup: true To effect connection changes, you must restart the managed server on which the application is deployed. getWebCenterServiceFrameworkConfig Module: Oracle WebCenter Portal Use with WLST: Online Description Returns WebCenter Portal Service",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}