{
    "relation": [
        [
            "Command",
            "crypto ikev2 cookie-challenge",
            "crypto ikev2 diagnose error",
            "crypto ikev2 dpd",
            "crypto ikev2 http-url cert",
            "crypto ikev2 limit",
            "crypto ikev2 nat",
            "crypto ikev2 window",
            "crypto logging ikev2"
        ],
        [
            "Description",
            "Enables IKEv2 cookie challenge.",
            "Enables IKEv2 error diagnosis.",
            "Defines DPD globally for all peers.",
            "Enables HTTP CERT support.",
            "Defines call admission control for all peers.",
            "Defines NAT keepalive globally for all peers.",
            "Specifies the IKEv2 window size.",
            "Enables IKEv2 syslog messages on a server."
        ]
    ],
    "pageTitle": "Cisco IOS Security Command Reference: Commands A to C - crypto aaa attribute list through crypto ipsec transform-set [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/a1/sec-a1-cr-book/sec-cr-c3.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357423667,
    "recordOffset": 357302283,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{731486=(Optional) Size of the window. Values can be 64, 128, 256, 512, or 1024. This value becomes the default value., 574808=For example, on Cisco uBR905 and Cisco uBR925 cable access routers, the outside interface is always the cable interface. On Cisco 1700 series routers, the FastEthernet interface defaults to being the inside interface, so attempting to use the crypto ipsec client ezvpn command on the FastEthernet interface displays an error message., 645905=drop --Supports up to 1000 deny entries in an ACL., 645702=clear --Supports up to 1000 deny entries in an ACL., 592005=This command was introduced on Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 187210=When cTCP encapsulation is enabled on the router, only packets less than or equal to 1407 in size can pass through the IPsec tunnel with the Don’t Fragment (DF) bit set. If an attempt is made to send a larger size packet, the following syslog message is generated:, 677475=This command was introduced on Cisco ASR 1000 Series Routers., 567725=This command was introduced on Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 592425=This command was enhanced to specify an IPSec VPN tunnel for Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 601735=This command was implemented on the Cisco ASR 1000 series routers., 702609=With Cisco IOS Release 12.2(33)SRA or 12.2(33)SXH or later releases, the configured value of 750 seconds will be rounded up to 1200 seconds (the next multiple of 600), which becomes the idle polling interval. The SA will be deleted after two successive idle pollings, resulting in an inactivity period of between 1200 and 2400 seconds before deletion., 11112=If you receive an error message similar to this one, check the expiration date of your CA certificate. If the expiration date of your CA certificate is set after the year 2038, you must reduce the expiration date by a year or more., 534123=This command was enhanced to enable you to manually establish and terminate an IPsec VPN tunnel on demand for Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 358506=Enables the IKEv2 cookie challenge when the number of half-open security associations (SAs) crosses the configured number. The range is 1 to 1000., 10304=If the CA does not respond by a timeout period after this command is issued, the terminal control will be returned so it will not be tied up. If this happens, you must re-enter the command. Cisco IOS software will not recognize CA certificate expiration dates set for beyond the year 2038. If the validity period of the CA certificate is set to expire after the year 2038, the following error message will be displayed when authentication with the CA server is attempted:, 720071=The following example shortens both lifetimes, because the administrator feels there is a higher risk that the keys could be compromised. The timed lifetime is shortened to 2700 seconds (45 minutes), and the traffic-volume lifetime is shortened to 2,304,000 kilobytes (10 megabits per second for one half hour)., 568453=This command was enhanced to enable you to configure multiple outside and inside interfaces for Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 565510=(Optional) Specifies the inside interface of the IPsec client router. The Cisco 1700 series has no default inside interface, and any inside interface must be configured. The Cisco 800 series routers and Cisco uBR905 and Cisco uBR925 cable access routers have default inside interfaces. However, you can configure any inside interface and add up to three inside interfaces for all platforms., 533390=This command was introduced for Cisco 806, Cisco 826, Cisco 827, and Cisco 828 routers; Cisco 1700 series routers; and Cisco uBR905 and Cisco uBR925 cable access routers., 39459=The time portion is optional in both the expires-on date and valid-start field and defaults to 00:00:00 if not specified. The time is interpreted according to the time zone offset configured for the router. The string utc can be appended to the date and time when they are configured as Universal Time, Coordinated (UTC) rather than local time., 399006=Specifies the maximum transmission unit in bytes. The range is from 68 to 1500 bytes., 378477=Specifies the maximum number of errors allowed in the exit path entry. The range is 1 to 1000., 222195=This command was integrated into Cisco IOS Release 12.2(13)T and implemented for the AIM-VPN/EPII and AIM-VPN/HPII on the following platforms: Cisco 2691, Cisco 3660, Cisco 3725, and Cisco 3745., 221194=This command was introduced for the Cisco 1700 series router and other Cisco routers that support hardware accelerators for IPsec encryption.}",
    "textBeforeTable": "Syntax Description list-name list attribute aaa crypto no list-name list attribute aaa crypto To define an authentication, authorization, and accounting (AAA) attribute list of per-user attributes on a local Easy VPN server, use the crypto aaa attribute listcommand in crypto isakmp group configuration mode. To remove the AAA attribute list, use the no form of this command. crypto aaa attribute list crypto ipsec transform-set crypto ipsec server send-update crypto ipsec security-association replay window-size crypto ipsec security-association replay disable crypto ipsec security-association lifetime crypto ipsec security-association idle-time crypto ipsec security-association dummy crypto ipsec profile crypto ipsec optional retry crypto ipsec optional crypto ipsec nat-transparency crypto ipsec ipv4-deny crypto ipsec fragmentation (interface) crypto ipsec fragmentation (global) crypto ipsec df-bit (interface) crypto ipsec df-bit (global) crypto ipsec transform-set default crypto ipsec client ezvpn xauth crypto ipsec client ezvpn connect crypto ipsec client ezvpn (interface) crypto ipsec client ezvpn (global) crypto ikev2 window",
    "textAfterTable": "Usage Guidelines Note Security threats, as well as the cryptographic technologies to help protect against them, are constantly changing. For more information about the latest Cisco cryptographic recommendations, see the Next Generation Encryption (NGE) white paper. There is no limit to the number of lists that can be defined (except for NVRAM storage limits). Examples The following example shows that per-user attributes have been defined on a local Easy VPN AAA server:  ! aaa new-model ! ! aaa authentication login default local aaa authentication login noAAA none aaa authorization network default local ! aaa attribute list per-group attribute type inacl \"per-group-acl\" service ike protocol ip mandatory ! aaa session-id common ! resource policy ! ip subnet-zero ! ! ip cef ! ! username example password 0 example ! ! crypto isakmp policy 3 encr aes authentication pre-share group 14 crypto isakmp xauth timeout 90 ! crypto isakmp client configuration group PerUserAAA key cisco pool dpool crypto aaa attribute list per-group ! crypto isakmp profile vi match identity group PerUserAAA isakmp authorization list default client configuration address respond client configuration group PerUserAAA virtual-template 1 ! ! crypto ipsec transform-set set esp-aes esp-sha-hmac ! crypto ipsec profile vi set",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}