{
    "relation": [
        [
            "Hybridization section",
            "Hybridization",
            "Hyb1",
            "Hyb1",
            "Hyb2",
            "Hyb2"
        ],
        [
            "",
            "Scan",
            "Scan1a",
            "Scan1b",
            "Scan2a",
            "Scan2b"
        ],
        [
            "",
            "File[raw]",
            "Data1a.txt",
            "Data1b.txt",
            "Data2a.txt",
            "Data2b.txt"
        ],
        [
            "",
            "File[normalized]",
            "NormData1a.txt",
            "NormData1b.txt",
            "NormData2a.txt",
            "NormData2b.txt"
        ]
    ],
    "pageTitle": "Supported data files",
    "title": "",
    "url": "http://tab2mage.sourceforge.net/docs/datafiles.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 232279092,
    "recordOffset": 232270890,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 10 Jun 2008 14:15:05 GMT",
    "textBeforeTable": "(Tab2MAGE only) Often it is desirable to store the normalized data from all your hybridizations in a single file. This file must then contain information on the quantitation types measured (log ratio, RMA values etc.) and the hybridizations to which these values apply. This information must be encoded in the data file column headings, for example: Final data matrix files [ Back ][ Top of page ] Again, <QT1>, <QT2> etc. are the names of your quantitation types (see the usage notes for more information on including novel quantitation types). <QT3> <QT2> <QT1> ProbeSet Name <QT3> <QT2> <QT1> ProbeSet ID Affymetrix normalized data Tab2MAGE recognizes and parses CHP files using both the old GDAC formats and the newer GCOS/XDA formats. In addition, Affymetrix data normalized by non-Affymetrix methods (e.g. RMA normalization) can be parsed. Either CompositeSequence identifiers (above) or either of the following sets of column headers may be used: where <QT1>, <QT2> etc. are the names of your quantitation types (see the usage notes for more information on including novel quantitation types). <QT3> <QT2> <QT1> CompositeSequence Identifier <QT3> <QT2> <QT1> Reporter Identifier Generic normalized data If you have normalized data mapped",
    "textAfterTable": "Hybridization section       File[raw] File[transformed] Array[accession] Hybridization Data1.txt FinalDataMatrix.txt A-EXML-1 Hyb1 Data2.txt FinalDataMatrix.txt A-EXML-1 Hyb2 Data3.txt FinalDataMatrix.txt A-EXML-1 Hyb3 Data4.txt FinalDataMatrix.txt A-EXML-1 Hyb4 Please note: There are currently some limitations imposed by Tab2MAGE when parsing final data matrix files. Firstly, each file must correspond to a single array design. In experiments where multiple array designs have been used, separate final data matrix files should be included for each. For example: Hybridization section       File[raw] File[transformed] Array[accession] Hybridization Data1.txt FinalDataMatrix1.txt A-EXML-1 Hyb1 Data2.txt FinalDataMatrix1.txt A-EXML-1 Hyb2 Data3.txt FinalDataMatrix2.txt A-EXML-2 Hyb3 Data4.txt FinalDataMatrix2.txt A-EXML-2 Hyb4 Secondly, the columns in the final data matrix are currently mapped to hybridizations, rather than scanning events. As a result, this system does not readily support experiment designs where hybridizations are scanned multiple times, e.g., for quality control purposes. To accurately reflect such treatments, please include your normalized data as one file per scan, and add a \"Scan\" column to explicitly specify which scan events belong to which hybridization, as in the following example: Hybridization section       Hybridization Scan File[raw] File[normalized]",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}