{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always feel safe on campus.",
            "I don't know much about greek life, but they are very inviting.",
            "There are plenty of different things to get involved with.",
            "The UC is a great place to figure out what is going on.",
            "There is a fence where everyone sticks there gum on it. It's disgusting but it's history.",
            "Go to events on campus. You already paid for them.",
            "There are plenty things to do on campus and most of them are free. For example bowling, play pool or other arcade games. There are also movies and live music.",
            "Food is okay. Of course if you eat the same thing all the time, you'll get sick of it. So make sure you try new things.",
            "Your dorm is your family on campus. You do everything with them so don't be shy when they reach out to you. Everyone has fun in the dorms.",
            "Academics are a big deal but as long as you listen in lectures and pay attention to your syllabus, you'll be fine.",
            "Make sure you get involved on campus.",
            "This college is exactly what every student should experience. It is welcoming and easy-going. No one feels out of place here."
        ]
    ],
    "pageTitle": "University of Wisconsin-Whitewater (UW-Whitewater) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Whitewater/reviews?_escaped_fragment_=/show/123048",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901872591,
    "recordOffset": 901799179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{319664=© 2015, Cappex.com, LLC, 143934=Avoid Esker Hall dining. It is all you can eat buffet, however, severely over or under cooked food, particularly chicken, is a daily occurrence. Food in the University Center is very good, however, it is expensive. Drumlin Hall and P-Street Cafe have similar food which is OK but selection is either a burger or sub, everyday. Drumlin Hall is closed for the 2012-2013 school year. Only eat at Esker Hall on their occasional steak and shrimp nights as it is cooked right., 208029=UW-Whitewater is in the process of re-opening one of the main dining halls; the tenative date of opening is February 28th. The quality of the other dining halls on campus is good. We have a lot of options that range from pasta to pizza! We have a couple well known restaurants on campus such as Unos and Erberts & Gerberts. We also have a few sandwich shops and a buffet as well., 312411=Dorm food is nice because it's easy to not have to try to figure out dinner on your own, but it can be a little gross sometimes. Drumlin was just renovated in 2013, so it's pretty nice and tastes okay from what I've had. Esker is low-quality food, but you get a lot of it. Erbs and Gerbs is always busy and frequently runs out of ingredients. P-Street is pretty good depending on what you get. The UC has a lot of good food but doesn't cover it in the meal plans for the most part.}",
    "textBeforeTable": "08/21/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 69 Ryan from Sheboygan Falls, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin-Whitewater Reviews University of Wisconsin-Whitewater › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Bang for the buck Whitewater is one of the cheapest all around university schools in Wisconsin. You get the most for your money and it is very well spent. The meal plans are one of the cheapest and you get so many choices to choose from. The tuition is one of the lowest as well. Whitewater provides so many opportunities for the students like complex parties, comedians, or live bands which are all under $5 if not free. Am enjoying being here I thoroughly enjoy being here. My fellow peers are always around for help with my homework or just to be there as a friend. Everyone is very friendly and welcoming. I've always found something to do with my time, whether it be bowling, pool, air hockey, or just hanging out with my friends. There's no place I'd rather be. Am learning a lot At Whitewater, I have learned many things in each of my classes that I truly believe I can actually carry with me for the rest of my life. The classes I've taken for my major have helped me to learn what I need to learn in order to be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}