{
    "relation": [
        [
            "Year",
            "2007",
            "2008",
            "2009",
            "2010"
        ],
        [
            "# of listed items",
            "597",
            "734",
            "798",
            "955"
        ],
        [
            "% Change",
            "---",
            "22.95%",
            "8.72%",
            "19.67%"
        ],
        [
            "Total Unit Sold",
            "413,022",
            "552,815",
            "455,924",
            "445,248"
        ],
        [
            "% Change",
            "---",
            "33.85%",
            "-17.53%",
            "-2.34%"
        ],
        [
            "Total $ Sold",
            "$7,607,264",
            "$9,329,828",
            "$7,757,240",
            "$7,852,063"
        ],
        [
            "% Change",
            "---",
            "22.64%",
            "-16.86%",
            "1.22%"
        ],
        [
            "Av. Sale per title",
            "692",
            "753",
            "571",
            "466"
        ],
        [
            "Av. $ per title",
            "$14,744.90",
            "$12,710.94",
            "$9,720.85",
            "$8,222.06"
        ]
    ],
    "pageTitle": "Tilting at Windmills: 1297292289 - Comic Book Resources",
    "title": "",
    "url": "http://www.comicbookresources.com/?page=article&id=30752",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 377709179,
    "recordOffset": 377644202,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{223600=Marvel's second best-selling book is the HC of Stephen King's \"The Dark Tower: The Fall of Gilead,\" which comes in at about 16k copies. In 2009, \"Treachery\" sold about 19k copies, and \"Gunslinger Born\" sold about 30k in 2008, and 52k in 2007. There's a level of diminishing returns on display here for the \"Dark Tower\" comics. Still and all, Stephen King-related comics are five of Marvel's thirty-three placing titles -- \"Dark Tower\" books \"The Battle of Jericho\" at #4 (9k copies), and \"Treachery\" at #8 (6k), while v1 of \"The Stand\" is #10 (5,498) and v2 is #11 (5,245). \"Gunslinger Born\" drops down to about 3k in HC (and, as such, is not in the Top 750), while the newly released TP manages only to sell 2360 copies. It might be worth noting that the HC is $24.99, while the TP is $19.99, probably not enough of a difference to really drive softcover sales., 76930=I've done the best I can to try and root out any items \"of significance\" that should be on the chart that I'm given -- for example, I have to have \"The Complete Persepolis\" and \"Maus\" manually pulled for me because they are actually classified as (I believe) \"Memoir\" rather than comics. Because this relies on me thinking of things to get them on to the list -- each item apparently only has one classification -- there's almost certainly comics material missing that I didn't catch. The apparently biggest 2010 release that I found not on the chart was \"How to Understand Israel in 60 Days or Less,\" but that didn't even make the top 750. There's certainly many titles that never make it onto BookScan's list, but, as near as I can tell in my due diligence, the largest bulk of them have \"insignificant\" BookScan sales -- at least among comics aimed at adults!, 134873=Tokyopop is losing marketshare at a fairly dire pace -- they've lost nearly 75% of their sales volumes over the last three years. One imagines that this is one of the reasons they've decided to move to Diamond Book Distributors for 2011. Of course, Diamond just cut off Borders, so it's unclear how much this move might actually help them in the short run., 279556=The largest one is Robert Crumb's \"Book of Genesis\" adaptation which tracks in with nearly 25k copies sold in 2010. This looks to be a lasting, and strong, addition to Top Selling Graphic Novels., 101451=Coming in at both #10 and 11 is Masashi Kishimoto's \"Naruto,\" with v47 selling 53k copies. Having caught up with Japan's release schedule, there are only three new \"Naruto\" volumes this year. Volume 49 was released in October, and, with only two months of sales sold ~27k, placing at #24. Taken together, the 49 volumes of \"Naruto\" sold ~403k copies, with each and every volume placing on the Top 750 list (if only just -- \"Naruto\" v21 is item #750!), 188897=The other thing to note is that, by and large, their success is almost entirely driven by comics aimed at kids. The imprint Blue Sky is the one bringing you \"The Adventures of Ook and Gluk, Kung-Fu Cavemen\" by Dav Pilkey, the #3 book for the overall year. The Arthur A. Levine imprint places two Shaun Tan books, \"The Arrival\" (just over 10k copies) and \"Tales From Outer Surburbia\" (about 3500), and Graphix places twenty-three titles, most prominently Jeff Smith's \"Bone\" (twelve entries). The twelve \"Bone\" volumes charting have a combined 2010 sales of 258k copies (plus another 8651 copies of the Cartoon Book's \"Bone One Edition\") -- this is down from the about 356k copies in '09, but that's still just a metric ton of copies sold., 218732=Marvel still dominates in the Direct Market, but they're a somewhat minor player in the Top 750 of the bookstore market, running into their fourth down year in a row. Marvel pulled their book distribution from Diamond over to Hachette, effective September 1, but there's no visible benefit from this as of yet. Perhaps next year? When DC switched bookstore distribution to Random House in 2007, there was a fairly immediate visible impact from that., 175758=DC is way down in 2010, though, given the overwhelming and insane sales of \"Watchmen\" for the last two years, anything else would be pretty surprising., 95057=We're now tracking nearly 22k items through the BookScan charts, about a 12% increase from 2009 -- but unit sales are off by nearly fourteen percent, and dollars by nearly nine percent, hardly glowing results., 97699=\"Dork Diaries\" also sold about 100k more copies in 2010 than it did in 2009 -- it was #2 last year, with 68,657 copies sold., 161341=2010 Western Publishers, 136414=Surging forward to become the #3 manga publisher in pieces sold, via the BookScan Top 750 charts, is Yen Press, with 42 titles charting within the Top 750, for about 345k pieces, and a bit under $4.2 million retail dollars. This actually makes the #2 publisher in terms of dollars, handily beating TokyoPop. This is a huge move forward for Yen, as they only placed three titles in the Top 750 back in 2008. It is incredibly likely that they will take the #2-in-pieces spot from Tpop next year, being only about 1000 copies short in 2010., 195032=Presumably this is a fairly one-shot occurrence, boosted by the film version, though I suppose one never really knows what will happen in the future. Still, I'd expect \"Scott Pilgrim\" to return to \"normal\" sales levels in 2011 -- probably in the sub-10k range., 235835=They also did an extension of Janet Evanovich's \"Barnaby\" stories, with \"Troublemaker\" v1 pulling in almost 21k in sales. However, the word is that Dark Horse printed 100k copies. Did the balance get sold outside of the retail book channels? \"Troublemaker\" v2, which was only published in November, comes in with 3385 in sales., 160599=Looking at things more generally, manga as a whole represents One title in the overall Top 10, three of the Top 20, fourteen of the Top 50, and forty-four of the Top 100 for 2010 -- substantial placing drops from 2009. There is only one manga title (from all publishers) that sell 50k or more copies in 2010 (none beat 100k), six beat 25k, and just seventy-six beat 10k -- again, substantially down from 2009., 172651=The largest publisher of Western comics is DC Comics. In 2010 they placed 96 titles in the Top 750, for 648k units, and nearly $12.5m in retail dollars., 177457=We continue with DC superheroes in the next five slots -- \"Batman: The Killing Joke\" (17k), \"Batman: The Dark Knight Returns\" (16k), \"Blackest Night: Green Lantern\" (14k), \"Batman: Hush\" (13k) and \"Batman: Arkham Asylum\" (12k). The post Christopher Nolan \"The Dark Knight\" film bounce seems to have evaporated at this stage, but may come back in 2012., 49195=Aug 03, 13:15pm, 72093=Also of major note is that for 2007 to 2010, I have the full and entire BookScan listing, down to books that have only one copy sold YTD. However, I'm not going to provide that entire list because that's too much data, even for a data-junkie like myself. I've cut the list off at 750 items because that's what we've reported in the previous seven years. Still, I have the deeper data, and I'll summarize it as we go along. As long as I continue to get that much data going forward, I should be able to tell you a few things about \" The Long Tail.\" In 2010, I possess data on more than 22,000 items! We'll talk more about this later., 73850=That's still a fair number of places that sell our product that aren't represented -- beyond traditional book retailers who don't report to BookScan (Say, a number of indie bookstores), and mass market retailers like Wal-Mart. This also doesn't track any number of other channels -- like library sales, book clubs or other specialty markets like, say, LGBT stores, etc. This Publisher's Weekly article [from 2003, I wish they'd check in on this story for the 2010 reality!] (you'll have to subscribe to read it, sorry) says the following:, 163243=Anyway, the newly revised \"western\" overview now looks like this, but, like I said, especially because of the loss of most of the \"humor\" titles to re-categorization, I wouldn't read much into the pre-2008 numbers, plus I've just tripled my chances of a math error of some kind! Here's the overview:, 69208=If you click here, you can find a copy of the 2010 BookScan Top 750 year end report for the comics category., 130022=With an increase of almost 11% in the number of SKUs, while at the same time losing more than 25% volume in sales, I'd say Viz is still wildly overproducing, and that they'd be best served by consolidating their line down in 2011., 101969=\"Naruto\" is down from its peaks. In 2009, the then 46 volumes sold a combined ~971k copies, and the highest placing volume (v43) sold ~61k copies. In 2008, v28 alone sold nearly 104k copies., 51845=Aug 03, 12:56pm, 194309=The number three western publisher, by units, in the Top 750, as reported by BookScan in 2010 would be, and here's a surprise, Oni Press. Hurray for the gang from Portland!, 85358=The sum of the Top 750 in 2010 is down by nearly 16% in unit sales, pushing things back to about what they looked like in 2004. This is the largest of the accelerating drops over the last three years, and hopefully the place where the drops stop happening., 95912=Let's take a look at the Top 20 best-selling items on the 2010 chart, it looks like this:, 79804=2010 Overview, 103353=#15 is art spiegelman's \"Maus\" v1 with just over 34k sold. That's up a bit from 2009 where it sold about 32k copies. As usual, the second half of the story in v2, sells significantly less -- only about 19k copies. Who are these people only buying half a story? I wonder if they think that was the end? The complete hardcover of both books musters just 4105 copies sold., 49578=Aug 03, 13:13pm, 175938=\"Watchmen\" continues to be DC's single best-performing title in 2010, with just over 29k in sales, which makes it the 19th best-selling title overall in BookScan., 90675=I don't think anyone expected that Watchmen would keep more than a small percentage of its growth, though I certainly was hoping for more like 60k this year, and the book dropped back below 2006 sales), 104329=One interesting side note here is that the Direct Market sold more copies of v1 -- almost 44k in 2010., 199987=Ballantine has two Peanuts-related titles: \"It's a Dog's Life, Snoopy\" and \"Peanuts 2000.\" Again, I think this is mis-categorization, as this is nearly the only \"Humor\" books to be found on my BookScan list. Both sell right around 3800 copies., 176130=As noted at the top, \"Watchmen\" sold 425k copies in 2009, largely due to the film version. With it crashing down to the ground in our current frame, that's the largest majority of DC's weaker 2010 performance, but even with removing that, DC is down by some 180k pieces in the Top 750., 86143=Certainly, we're still fighting the general American economy here, as well as the ongoing impact of the Borders' chain slow-motion collapse, and, depending on how things work out in 2011, Borders' fate could have a large additional negative impact on next year's charts., 178438=Looking forward to 2011, one would expect that the release of the Green Lantern film might give some bounce to those books. Putting aside the \"Blackest Night\" tie-ins, the best-selling \"Green Lantern\" book in 2010 is \"Secret Origin,\" which does a modest 6531 copies. While this is the logical place to expect the GL film to have the greatest impact (from the title alone), it's probably worth noting that that volume is actually v6 of Geoff John's run (v7 if you want to count \"Green Lantern: Rebirth\"), even though it isn't numbered as such on the spine. There's a real open question if GL could gain the kind of \"big bounce\" that a \"Scott Pilgrim\" or \"Kick-Ass\" delivers, or if the potential gains would be spread out over the large backlist, in the way that it occurs with a Batman movie or Iron Man. Given history, I'll tend to suspect the latter, and I'll take a predictive stab that no individual GL book will rack over 25k in 2011., 48853=Aug 03, 13:23pm, 105049=At #17 we get Yana Toboso's \"Black Butler\" v1, at almost 30k. That's a very strong debut for a new manga collection in the current market. All three volumes released in 2010 placed within the Top 750. While there is an associated anime, it doesn't appear that it has been broadcast on American television, making this launch all the much stronger looking, not being directly tied to other media., 142442=Coming in at #4 is Del Rey, with 32 manga books charting, for about 179k pieces and just a hair under $2 million retail dollars. This is about half their performance in 2009., 161400=As I mentioned more towards the top of this piece, prior to 2008, I had previously divided out \"Humor.\" Calvin & Hobbes and most other classic strip collections seem to have been moved entirely away from the numbers that I now receive, and the few books like that that I can track are, I think, a mistake on BookScan's end for not moving everything overly properly. Presumably we could still add another at least $8-10 million in sales to \"comics\" as a category (or, at least, insomuch as the percentage of sales that BookScan reports represents that category accurately, (which, like I said, it probably doesn't)), if comic strip numbers were included as well., 106902=There are a total of five \"million dollar books\" listed on BookScan in 2010. \"Twilight\" grossed $2.5m, \"Dork Diaries\" $2.2m, the \"Walking Dead\" Compendium at $1.7m (I really really wish I had some of those royalties!), \"Ook & Gluk\" grossed $1.2m, and \"Scott Pilgrim\" v1 with $1.1m. \"Kick-Ass\" came really close at 960k, but it still missed the cut., 109108=In 2008, however, I bowed to the inevitable and gave up on the \"humor\" category, because it only came in at 4 items that year (and only 2 in 2009 and 2010). It is virtually certain that this is because most of those kinds of items (typically strip collections like \"Calvin & Hobbes,\" etc.) have been recategorized to not appear on the charts I receive. I will now throw whatever comes into this category into the \"Everything Else\" section. That will throw the percentages off a bit, but I think it will make intent a good deal clearer. We'll talk about that more, a few sections below., 219465=However, there was another Marvel film in 2010 -- \"Iron Man 2.\" This was not a small film -- it had domestic ticket sales of $312m. \"Kick-Ass,\" on the other hand, had a box office of just $48m. \"Iron Man\" was clearly the bigger media deal, so how come the best-selling \"Iron Man\" comic listed on BookScan is \"Invincible Iron Man v1,\" which is only Marvel's #7 best-selling title, with not quite 6k copies sold? No later volume of \"Invincible\" charts, and, in fact, there's only one single other Iron Man title on Marvel's section of the Top 750: \"Marvel Adventures Iron Man v1\" with a minor 3700 copies., 102188=In place #12 is the first volume of Jeff Smith's \"Bone,\" at about 42k copies. Given that the color reprint series ended last year with volume nine's release, I'd say it's still exceptional that \"Bone\" v1 is continuing to sell this strongly. \"Bone\" v1 came in at #6 in 2009., 66968=LOOKING AT BOOKSCAN: 2010, 52166=Aug 03, 12:38pm, 85633=(I do, however, want to remind you that the nearly 20% of growth in 2006 was almost certainly overstated because of the difference in reporting methodologies between 2005 and 2006. Read 2006's report for more detail. My estimate was that it was probably closer to 10-12%.), 50349=Aug 03, 12:58pm, 87023=Obviously, Borders may be able to get through their current problems, and restructure their business to be healthy and profitable, but it is hard to imagine that we might not see at least another 20% drop in sales in 2011 because of one single chain's success or failure., 71041=For the last five years, what I've been given is the actual end-of-the-year total report, as opposed to 2003-2005 where I only had the report for the last week of the year. The effective difference for a casual chart reader is probably very little, but it does change some of the value in the percentage changes year-to-year. Please bear it in mind when comparing this year's report to the previous ones -- comparing 2010 to 2006-2009 is probably as close to apples-to-apples as it can get, as is 2003-2005, but comparing the '06-10 data to '03-'05 isn't going to be necessarily as valuable, and any analysis I can make of comparative growth is going to be off by some factor, possibly a significant one., 176444=DC's #2 title is \"V For Vendetta\" at nearly 21k -- that's down from 2009, but one imagines much of that was \"tack on\" effect from \"Watchmen's\" success. Its performance is almost exactly flat from 2008., 281842=And that's pretty much what BookScan in 2010 looks like to these eyes., 221442=Those of you following Direct Market comics news are probably aware that in 2010 that Marvel really flooded the market with \"Thor\" and \"Captain America\" mini-series and one-shots, with the assumption that those things will be in TP edition in time for those films to be released. But what history shows us (over and over again, going at least back to the first Spider-Man movie) is that this strategy doesn't work. In fact, I'd submit that this kind of strategy works against the best interests of the brand, not only by providing the bookstores consumer with too many undifferentiated choices (which of the eighty-two \"Iron Man\" TPs is the \"one that follows the film?\" And how could an uneducated consumer possibly know that?), but also weakening Marvel very core of their publishing business -- the periodical comic sales., 180301=Vertigo's successes are largely focused on three particular series: \"Fables\" places all fourteen volumes within the Top 750 (as well as the spin-off \"Cinderella: From Fabletown With Love\" with just under 5k copies sold), though, curiously not a single one of the \"Jack of Fables\" spin-off volumes hits within the chart, nor does the OGN \"1001 Nights of Snowfall.\" The second big hit is the perennial \"Sandman,\" with all ten volumes getting within the chart (but not the OGN \"Endless Nights\"), while the third is \"Y, The Last Man,\" which not only puts all ten volumes in placement, but also scores with two of the three deluxe hardcovers., 99744=The #3 comic for 2010 is Dav Pilkey's \"The Adventures of Ook and Gluk, Kung-Fu Cavemen from the Future,\" and there's absolutely no question to me that parts of this is, indeed, comics. More than that: comics aimed at kids. And more than that, comics that never once touched the Diamond Top 300 at any point in 2010 because our friends in Timonium don't even carry the book. And, of course, like the two titles before it, it is almost certain that the retail BookScan numbers just tell the fraction of the story of sales for the book -- while 125k is nothing to sneeze at, I bet this is selling many, many more copies at Book Fairs and sources like that., 123311=The leading title in 2010 is the same one as the last three years: \"Naruto.\" As discussed above, each and every volume (all forty-nine of them!) places within the Top 750. Taken together, those 49 \"Naruto\" volumes account for about 409k copies sold, or about 6.5% of all manga sold (across all 8700-ish available titles). Even with the incredible softening of \"Naruto\" as an engine (in 2009, the then-46 volumes sold a combined 971k copies), that's still a stellar performance, and not one to be sneezed at. \"Naruto\" places 3 of the Top 10 manga releases, and 9 of the Top 100., 120079=One thing to note is that the entire BookScan Top 750 chart is down by about $8m this year, but that manga, as a category is down by $10m. Or another way to think of it is that the entirety of this year's drop could to be said to be from the weakening of manga throughout 2010., 110547=2010 Manga, 114135=While Manga is still the dominant \"kind\" of comic on the BookScan charts, the category is now down to its lowest level in the eight years we have been able to follow -- all indicators are now below 2003 levels, roughly the start of the \"manga boom.\", 63643=Wed, February 9th, 2011 at 2:58pm PST | Updated: February 9th, 2011 at 4:52pm, 50000=Aug 03, 13:12pm, 75339=Frankly, I haven't bothered to ask BookScan for a client list every year, so it is pretty likely that the number or percentage of reporting stores has increased significantly since 2003. However, I'm also going to continue to assume that the Publisher's Weekly article is still accurate to the extent that these numbers are unreported by some potentially significant degree, and don't, in any way, represent all \"book stores\" selling comic book material. Having said that, I have reason to believe that, for graphic novels, the number is much closer to right than it is to wrong., 257894=For the non-historical onea, I want to note here (and, really, just as much for myself when I write the 2011 report, because I'm likely to forget all of this in a year) -- the #11 publisher is Holtzbrinck, which owns Macmillan, which has (at least) these imprints: First Second, Hill + Wang, Metropolitan, and Square Fish. Those imprints all made the Top 750, but there may be others down into the Long Tail as well -- I have identified Henry Holt, Roaring Brook, St. Martins, Times books, Tor, and manga publisher Seven Seas. Jeez, that's a lot of divisions! Either way, they placed seven titles in the Top 750, for about 38k combined., 87322=Another factor in this year's drop is the lack of a super-mega hit like last year's \"Watchmen\" results -- in 2009, the softcover of \"Watchmen\" sold an astonishing 425k copies into the bookstore channel, or nearly 5% of the total 2009 dollars! In 2010, \"Watchmen\" managed \"just\" 29k copies (making it the 19th best-selling title in units), a very large differential, and one that didn't appear to have a spillover impact into other graphic novels -- there is no \"next Watchmen,\" nor anywhere that I can detect any particular impact in the comics-reading acceptance, as related through these charts., 300789=© 1995-2015 Comic Book Resources. All Rights Reserved., 110593=As always, the largest grouping of titles, by far. In 2010, Manga continues to dominate with 436 spots (out of 750 -- or 58% of the placing books) on the charts for 3.1 million pieces (49% of the Top 750), and $31 million in retail dollars (36%)., 281974=Brian Hibbs has owned and operated Comix Experience in San Francisco since 1989, and is a founding member of the Board of Directors of ComicsPRO, the Comics Professional Retailer Organization. Feel free to e-mail him with any comments. You can purchase a collection of the first one hundred Tilting at Windmills (originally serialized in Comics Retailer magazine) from IDW Publishing. An Index of v2 of Tilting at Windmills may be found here. (but you have to insert \"classic.\" before all of the resulting links), 122243=The positive notion that could be drawn from this is that is would seem fairly possible that the first wave of \"aged out\" manga readers, who turned 14 or 15 in 2007, may want to return to the form as they enter their college years, starting, let's say, 2012 or 2013. Of course, this is dependent, to a certain degree, of there being enough material on the market that will appeal to their newer sensibilities. This will be an open question as to whether the English manga publishers have their pieces in place at that point. I suppose we'll see!, 162104=Before y2k, \"Humor\" was the comics chart, taking much of the top spaces in dollars and in pieces. But I don't have easy access to the \"humor\" data any longer. I've ended up collapsing together a number of the previous charts to give an idea of the \"new\" \"western\" comics totals, but it is meatball surgery, at best, and, especially anything before 2008 should be viewed as fairly garbage-esque data because of the \"humor\" change made by BookScan., 125216=As is typical with Manga, titles tend to cluster throughout the Top 750. Of the 436 manga series in that slice, there are only eighty-four distinct series. Given there were one-hundred-and-four series in the Top 750 in 2009, it would appear that buyers are concentrating on that which they are already familiar with.}",
    "textBeforeTable": "Here's the big picture for the Top 750: Beside the \"young reader\" books, I also cut things like the Paul Levitz written \"75 Years of DC Comics: The Art of Modern Mythmaking\" from Taschen or \"art books\" like \"The Art of Bleach.\" In all, I removed 54 items from the Top 750 that didn't match my personal definition of \"comics,\" to make room for 54 items that I think are comics. However, if there was a legitimate question about it, like our #1 book, I erred on the side of keeping it. One overall note on this year's chart -- this year I opted to cut out anything that clearly wasn't a",
    "textAfterTable": "2010 6,414,336 -15.9% $85,266,166 -8.5% Yikes. The sum of the Top 750 in 2010 is down by nearly 16% in unit sales, pushing things back to about what they looked like in 2004. This is the largest of the accelerating drops over the last three years, and hopefully the place where the drops stop happening. (I do, however, want to remind you that the nearly 20% of growth in 2006 was almost certainly overstated because of the difference in reporting methodologies between 2005 and 2006. Read 2006's report for more detail. My estimate was that it was probably closer to 10-12%.) In terms of dollars, the Top 750 dropped by 8.5%, again the largest drop we've seen since we've been tracking this. Certainly, we're still fighting the general American economy here, as well as the ongoing impact of the Borders' chain slow-motion collapse, and, depending on how things work out in 2011, Borders' fate could have a large additional negative impact on next year's charts. Diamond Book Distributors, which represents a large number of mid-range comics publishers (including Dark Horse, IDW, Image, Dynamite, Oni, Tokyopop, Top Shelf and Udon) has already cut-off new shipments to Borders, and, if bookstores are anything like the historical results of comic book stores closing (and they may not be), a significant percentage of the business Borders serves is likely to disappear into the ether. Obviously, Borders may be able to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}