{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3"
        ],
        [
            "Command or Action",
            "Router(config-if)# pvc [name] 0/16 ilmi",
            "Router(config-if-atm-vc)# exit",
            "Router(config-if)# atm esi-address esi . selector"
        ],
        [
            "Purpose",
            "Configures an ILMI PVC on an ATM main interface for communicating with the switch by using ILMI.",
            "Returns to interface configuration mode.",
            "Enters the ESI and selector fields of the NSAP address."
        ]
    ],
    "pageTitle": "Asynchronous Transfer Mode Configuration Guide, Cisco IOS Release 15S - Configuring ATM [Cisco IOS 15.5S] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/atm/configuration/15-s/atm-15-s-book/atm-cfg-atm.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 354721391,
    "recordOffset": 354607036,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{228873=Cisco routers may be configured as ATM ARP clients to work with any ATM ARP server conforming to RFC 1577. Alternatively, one of the Cisco routers in a logical IP subnet (LIS) may be configured to act as the ATM ARP server itself. In this case, it automatically acts as a client as well. To configure classical IP and ARP in an SVC environment, perform the tasks in one of the following sections:, 332234=IMA is supported on the Multiport T1/E1 ATM Network Module with Inverse Multiplexing over ATM on Cisco 2600 and Cisco 3600 series routers and the Multiport T1/E1 ATM Port Adapter with Inverse Multiplexing over ATM on Cisco 7100, Cisco 7200, and Cisco 7500 series routers. The Multiport T1/E1 ATM IMA network modules and port adapters provide four or eight T1 or E1 ports and allow wide-area networking (WAN) uplinks at speeds ranging from 1.536 Mbps to 12.288 Mbps for T1, and from 1.92 Mbps to 15.36 Mbps for E1. See the section Bandwidth Considerations later in this chapter for details., 697746=This example shows that IP configured is dynamically routed, but that AppleTalk is statically routed. An AppleTalk remote host is configured at address 10.2 and is associated with SMDS address c140.8111.1111., 289940=By default, the ATM interface allows the maximum of 2048 virtual circuits. However, you can configure a lower number, thereby limiting the number of virtual circuits on which your ATM interface allows segmentation and reassembly to occur. Limiting the number of virtual circuits does not affect the VPI-VCI pair of each virtual circuit., 618622=Any serial interface can be configured for multiprotocol encapsulation over ATM-DXI, as specified by RFC 1483. At the ADSU, the DXI header is stripped off, and the protocol data is segmented into cells for transport over the ATM network., 226548=Cisco implements both the ATM Address Resolution Protocol (ARP) server and ATM ARP client functions described in RFC 1577. RFC 1577 models an ATM network as a logical IP subnetwork on a LAN., 298343=By default, the ATM interface supports 1024 VCIs per VPI. Depending on what ATM interface card or port adapter you are using, this value can be any power of 2 in the range of 16 to 8192. (See the atm vc-per-vp command in the Cisco IOS Wide-Area Networking Command Reference for the exact values that apply to your configuration.) This value controls the memory allocation on your ATM interface that deals with the VCI table. It defines only the maximum number of VCIs to support per VPI., 587064=Optionally, configures the circuit cell delay variation. Range is 1 through 65535 milliseconds. The default range is 2000 milliseconds., 618883=RFC 1483 describes two methods of transporting multiprotocol connectionless network interconnect traffic over an ATM network. One method allows multiplexing of multiple protocols over a single PVC. The other method uses different virtual circuits to carry different protocols. Cisco’s implementation of RFC 1483 supports both methods and supports transport of Apollo Domain, AppleTalk, Banyan VINES, DECnet, IP, Novell IPX, ISO CLNS, and XNS traffic., 651383=The SVCs and the signalling keyword are not supported on the Cisco ASR 1000 series routers., 320203=The bridging implementation supports IEEE 802.3 frame formats, IEEE 802.10 frame formats, and Ethernet DIX frames. The router can accept IEEE 802.3 frames with or without frame check sequence (FCS). When the router receives frames with FCS (RFC 1483 bridge frame formats with 0x0001 in the PID field of the SNAP header), it strips off the FCS and forwards the frame as necessary. All IEEE 802.3 frames that originate at or are forwarded by the router are sent as 802.3 bridge frames without FCS (bridge frame formats with 0x0007 in the PID field of the SNAP header)., 627763=An ATM-DXI PVC can be defined to carry one or more protocols as described by RFC 1483, or multiple protocols as described by RFC 1490., 520516=For more information about configuring the T1/E1 interface on the OC-3/STM-1 ATM Circuit Emulation Service network module, see the Configuring 1- and 2-Port T1/E1 Multiflex Voice/WAN Interface Cards on Cisco 2600 and 3600 Series Routers Cisco IOS Release 12.0(5)XK online document., 719542=The following example shows a typical configuration for the ATM-CES port adapter with VP shaping on a Cisco 7200 series router. In this example, a VP is created with the VPI value of 1 and with a peak rate of 2000 kbps. The subsequent VCs created, one data VC and one CES VC, are multiplexed onto this VP. For further information, refer to the section \"Configuring Virtual Path Shaping\" earlier in this chapter., 479474=1-800-555-1212, 315565=The maximum number of message identifiers per virtual circuit is set at 16 by default; valid values are 16, 32, 64, 128, 256, 512, or 1024., 679283=The following example shows how to assign NSAP address AB.CDEF.01.234567.890A.BCDE.F012.3456.7890.1234.12 to ATM interface 4/0. For further information, refer to the section \"Configuring the Complete NSAP Address\" earlier in this chapter., 339916=Cisco 2600 series and Cisco 3600 series routers using the Multiport T1/E1 Network Module with Inverse Multiplexing over ATM, 325243=6.    Router(config)# bridge group protocol dec, 467324=When planning IMA groups and payload bandwidth requirements, consider the overhead required for ATM cell headers, service-layer encapsulation such as RFC 1483, AAL5 encapsulation, and ICP cells. The tables below show approximate values for T1 and E1 IMA groups, respectively, with a frame length of 128, estimating ATM overhead at about 10 percent. The effective payload bandwidth varies according to packet size because the packets must be divided into an integer number of ATM cells leaving the last cell padded with filler bytes., 81764=Unlike X.25 service, which uses in-band signaling (connection establishment done on the same circuit as data transfer), ATM uses out-of-band signaling. One dedicated PVC exists between the router and the ATM switch, over which all SVC call establishment and call termination requests flow. After the call is established, data transfer occurs over the SVC, from router to router. The signaling that accomplishes the call setup and teardown is called Layer 3 signaling or the Q.2931 protocol .}",
    "textBeforeTable": "DETAILED STEPS 4.    no shutdown 3.    ip address ip-address mask interface atm slot / port-adapter /0 interface atm slot /0 2.    Do one of the following: 1.    configure terminal SUMMARY STEPS Perform the following task to enable the ATM interface: This section describes how to configure an ATM interface. For the Advanced Inspection and Prevention Security Services (AIP), all ATM port adapters, and the 1-port ATM-25 network module, the port number is always 0. For example, the slot/port address of an ATM interface on an AIP installed in slot 1 is 1/0. Enabling Configuring the ATM Interface Monitoring and Maintaining the ATM Interface Troubleshooting the ATM Interface Configuring ATM Access over a Serial Interface Configuring Circuit Emulation Services Configuring ATM E.164 Auto Conversion Configuring Inverse Multiplexing over ATM Configuring Fast-Switched Transparent Bridging",
    "textAfterTable": "Example:  Router(config)# interface atm number   Specifies the ATM interface using the appropriate format of the interface atm command. To determine the correct form of the interface atm command, consult your ATM network module, port adapter, or router documentation.   Step 3 ip address ip-address mask   (Optional) If IP routing is enabled on the system, assigns a source IP address and subnet mask to the interface.   Step 4 no shutdown   Changes the shutdown state to up and enables the ATM interface, thereby beginning the segmentation and reassembly (SAR) operation on the interface. The no shutdown command passes an enable command to the ATM interface, which then begins segmentation and reassembly (SAR) operations. It also causes the ATM interface to configure itself based on the previous configuration commands sent.   Configuring PVCs To use a permanent virtual circuit (PVC), you must configure the PVC into",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}