{
    "relation": [
        [
            "Site Name",
            "BA-03",
            "BA-09",
            "BA-18",
            "BA-30/31",
            "BA-43",
            "BA-79",
            "BA-92",
            "W-25",
            "W-26",
            "W-35",
            "W-36",
            "W-44",
            "W-45",
            "W-64",
            "W-74",
            "W-83",
            "W-92",
            "W-93",
            "W-94"
        ],
        [
            "Missile Type",
            "Nike 1B, 2C/18H, 30A/12L-UA, (8L-H)",
            "Nike 1B, 2C/30A/12L-A",
            "Nike 2B, 4C/18H, 30A/23L-UA (12L-H)",
            "Nike 2B, 4C/18H, 30A/23L-UA, (12L-H)",
            "Nike 1B, 2C/30A/12L-A",
            "Nike 2B, 4C/24H, 20A/24L-UA, (16L-H)",
            "Nike 1B, 2C/30A",
            "Nike 2B/12H, 20A/8L-U",
            "Nike 1B, 2C/18H, 30A/12L-U, (8L-H)",
            "Nike 2B/20A/8L-A",
            "Nike 1B, 2C/30A/12L-A",
            "Nike 2B/12H, 20A/8L-UA",
            "Nike 2B/20A/8L-A",
            "Nike 2B, 2C/24H, 60A/24L-UA, (16L-H)",
            "Nike 2B/20A/8L-A",
            "Nike 1B, 2C/30A/12L-A",
            "Nike 1B, 2C/18H, 30A/12L-U",
            "Nike 1B, 2C/30A/12L-A",
            "Nike 1B, 2C/30A/12L-A"
        ],
        [
            "Defense Area",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore",
            "Washington - Baltimore"
        ],
        [
            "Site Location",
            "Phoenix/ Sweet Air, Maryland",
            "Fork, Maryland",
            "Edgewood Arsenal, Maryland",
            "Chestertown, Maryland (9 mi W)",
            "Jacobsville, Maryland",
            "Granite, Maryland",
            "Cronhardt, Maryland",
            "Davidsonville, Maryland * Nike Missile Base W-25",
            "Skidmore/ Bay Bridge, Maryland",
            "Croom/ Marlboro, Maryland",
            "Brandywine/ Naylor Maryland",
            "Mattawoman/ Waldorf, Maryland",
            "Accokeek, Maryland",
            "Lorton, Virginia (dual site)",
            "Fairfax/Pohick, Virginia",
            "Herndon/ Dranesville, Virginia",
            "Rockville, Maryland",
            "Derwood, Maryland",
            "Gaithersburg, Maryland"
        ],
        [
            "Service Dates",
            "Nov 1955 - Apr 1974",
            "Nov 1955 - Dec 1962",
            "1954 - Apr 1974",
            "1954 - Apr 1974",
            "1954 - Apr 1974",
            "Dec 1954 - Mar 1974",
            "1955 - Sep 1963",
            "Jun 1955 - Apr 1974",
            "1955 - Nov 1968",
            "1955 - Mar 1963",
            "1957 - Dec 1961",
            "1955 - Jun 1971",
            "1955 - Dec 1961",
            "1954 - Sep 1958",
            "1954 - Mar 1963",
            "1954 - Nov 1962",
            "1954 - Apr 1974",
            "1955 - Aug 1960",
            "1955 - Mar 1963"
        ],
        [
            "Control Site condition/owner",
            "FDS. Redeveloped into single-family housing. No evidence of IFC site. Manning was by A/602nd (11/55-8/56), A/54th (8/56-9/58), A/4/1st (9/58-12/62) and MDArNG D/1/70th (12/62-4/74).",
            "After being inactivated by the Army, BA-09C was taken over by the Air Force sometime prior to 15 September 1967. It was used until 15 December 1975 for Civil Air Patrol use, being called Fork CAP Annex. Redeveloped into single-family housing. The Integrated Firing Control Site buildings & radars (formerly located at the end of Hutschenreuter Road in Fork were removed sometime in the early 1980s and the property is now in private hands. Manning was by D/54th (11/55-9/58), D/4/1st (9/58-9/59) and MDArNG D/1/70th (9/59-12/62) 39°26′55″N 076°27′41″W﻿ / ﻿39.44861°N 76.46139°W﻿ / 39.44861; -76.46139﻿ (BA-09-CS)",
            "Partially Intact, Maryland Army National Guard. Most buildings razed, no radar towers. Operating units were C/54th (/55-9/58) and C/4/1st (9/58-4/74) 39°24′55″N 076°16′22″W﻿ / ﻿39.41528°N 76.27278°W﻿ / 39.41528; -76.27278﻿ (BA-18-CS)",
            "FDS. Buildings in use as \"4-H Park and County Fairgrounds\". Appears to be in good condition, no evidence of radar towers. Units assigned were D/36th (/54-9/58), D/1/562nd (9/58-12/62) and D/4/1st (12/62-4/74). 39°12′49″N 076°13′54″W﻿ / ﻿39.21361°N 76.23167°W﻿ / 39.21361; -76.23167﻿ (BA-30/31-CS)",
            "FDS. Redeveloped as Anne Arundel County Schools Maint & Operations center. Buildings in good shape, no evidence of radar towers. Manned by C/36th (/54-9/58), C/1/562nd (9/58-3/60) and MDArNG A/1/70th (3/60-12/62) 39°08′13″N 076°29′49″W﻿ / ﻿39.13694°N 76.49694°W﻿ / 39.13694; -76.49694﻿ (BA-43-CS)",
            "FDS. Obliterated. Concrete slabs and some wooden curb stops remain, but all buildings have been removed. Some roads still exist as unconnected concrete. Formerly manned by the A/54th (12/54-8/56), A/602nd (8/56-9/58), A/4/5th (9/58-8/60), B/4/1st (8/60-12/62), MDArNG A/2/70th (12/62-3/63), HHB 1/70th (10/62-8/74) and B/1/70th (12/62-4/74) 39°20′45″N 076°51′23″W﻿ / ﻿39.34583°N 76.85639°W﻿ / 39.34583; -76.85639﻿ (BA-79-CS)",
            "Mostly sold off. Small part US Army Reserve center. The buildings are all new; the motor pool, up a rise slightly, has a couple of older structures but the place otherwise has been cleaned off. Units assigned are the 2071st USAR School, 326th Maintenance Battalion and 214th MI Company. Little evidence of IFC site remains. Formerly manned by the B/54th (12/54-9/58), B/4/1st (9/58-9/59) and MDArNG D/2/70th (9/59-9/53) 39°27′24″N 076°43′44″W﻿ / ﻿39.45667°N 76.72889°W﻿ / 39.45667; -76.72889﻿ (BA-92-CS)",
            "Private ownership, complete and buildings look in good shape. No towers. After the Army closed the Nike facility, It was gained as an off-base installation of Andrews AFB on 21 Feb 1975, under Headquarters Command. At some later time it transferred to Military Airlift Command, and on 1 Jun 1992 transferred to Air Mobility Command. Closed by 1997. Units assigned: B/36th 96/55-9/58), B/1/562nd (9/58-12/62), B/1/71st (12/62-/65), B/4/1st (/65-11/68) and MDArNG A/1/70th (11/68-4/74). 38°54′12″N 076°39′07″W﻿ / ﻿38.90333°N 76.65194°W﻿ / 38.90333; -76.65194﻿ (W-25-CS)",
            "FDS. Redeveloped into Asbury Broadneck Methodist church. No evidence of IFC site. The units assigned were A/36th (/55-9/58), A/1/562nd (9/58-12/62) and MDArNG A/1/70th (12/62-11/68) 39°01′42″N 076°27′00″W﻿ / ﻿39.02833°N 76.45000°W﻿ / 39.02833; -76.45000﻿ (W-26-CS)",
            "FDS. Redeveloped into Croom Vocational High School. Some older buildings deteriorated. No evidence of radar towers. . The units were HHB and B/75th (11/54-9/58), HHB and B/3/562nd (9/58-6/60) and MDArNG B/3/70th (6/60-3/63) 38°46′29″N 076°44′41″W﻿ / ﻿38.77472°N 76.74472°W﻿ / 38.77472; -76.74472﻿ (W-35-CS)",
            "The housing area in Brandywine, Maryland, supported Washington Nike Site W-36 from approximately 1957 - 1961. It was transferred from the Army to the Air Force (Headquarters Command) on 10 Jun 1963. At that time it was redesignated; and Jurisdiction, Control, and Accountability assigned to Andrews AFB. At some later time it transferred to Military Airlift Command, and on 1 Jun 1992 transferred to Air Mobility Command. Current status is unknown.[12] The IFC is now abandoned. Most buildings in deteriorated state, large amount of vegetation overgrowth. Radar towers appear overgrown also. Manned by D/75th (11/54-9/58) and D/3/562nd (9/58-12/61). 38°42′38″N 076°46′14″W﻿ / ﻿38.71056°N 76.77056°W﻿ / 38.71056; -76.77056﻿ (W-36-CS)",
            "Maryland Indian Heritage Society, Melwood Horticultural Training Center. Buildings mostly razed, part of facility remains in SW corner. Operations were by C/75th (11/54-9/58), C/3/562nd (9/58-12/61), A/1/71st (12/61-3/63), MDArNG A/3/70th (12/61-3/63) and MDArNG C/1/70th (3/63-6/71). 38°39′09″N 076°52′07″W﻿ / ﻿38.65250°N 76.86861°W﻿ / 38.65250; -76.86861﻿ (W-44-CS)",
            "FDS. IFC site largely torn down. A few buildings, mostly forested. W-45 was manned by the A/75th (11/54-9/58), A/3/562nd (9/58-6/60) and MDArNG B/3/70th (6/60-12/61) ADA. 38°38′33″N 077°00′45″W﻿ / ﻿38.64250°N 77.01250°W﻿ / 38.64250; -77.01250﻿ (W-45-CS)",
            "This site was co-located with the now closed Lorton Reformatory. Under construction, all structures razed, land being re-graded. Units assigned were C/71st (7/54-9/58), C/1/71st (9/58-8/63), VAArNG A/1/280th (9/59-3/63) and VAArNG A/4/111th (8/63-4/74). 38°43′15″N 077°14′41″W﻿ / ﻿38.72083°N 77.24472°W﻿ / 38.72083; -77.24472﻿ (W-64-CS)",
            "Fairfax County ownership, maintenance yard. Only a couple of buildings standing. Two towers are still standing, covered with corrugated sheet steel. Manned by D/71st (7/54-9/58), D/1/71st (9/58-9/59) and VAArNG B/1/280th (9/59-3/63) 38°48′56″N 077°20′35″W﻿ / ﻿38.81556°N 77.34306°W﻿ / 38.81556; -77.34306﻿ (W-74-CS)",
            "Redeveloped into \"Observatory Park\". IFC was operated by B/71st (7/54-9/58) and B/1/71st (9/58-11/62)[13] 38°59′43″N 077°18′45″W﻿ / ﻿38.99528°N 77.31250°W﻿ / 38.99528; -77.31250﻿ (W-83-CS)",
            "FDS. Redeveloped into US Consumer Products Safety Commission Engineering Laboratory. IFC units assigned were A-71st (/54-9/55), D/602nd (9/55-9/58), D/4/5th (9/58-8/60), D/1/71st (8/60-/65) and A/4/1st (/65-4/74)[14] 39°06′09″N 077°13′23″W﻿ / ﻿39.10250°N 77.22306°W﻿ / 39.10250; -77.22306﻿ (W-92-CS)",
            "FDS. Redeveloped into American Foundation for Autistic Children. IFC site operated by B/602nd (9/55-9/58) and B/4/5th (9/58-8/60) 39°12′37″N 077°05′24″W﻿ / ﻿39.21028°N 77.09000°W﻿ / 39.21028; -77.09000﻿ (W-93-CS)",
            "FDS. Obliterated, residential area. Now NIKE MISSILE PARK run by MNCPPC. 39°09′51″N 077°11′01″W﻿ / ﻿39.16417°N 77.18361°W﻿ / 39.16417; -77.18361﻿ (W-94-CS)"
        ],
        [
            "Launch Site condition/owner",
            "FDS In private ownership, the barracks north of the launch area was demolished in 2010 but was previously used as the Jacksonville Senior Center. The Launch Area is still fenced in, although the access road to the magazine area leads to a maintenance yard. Most structures are still present but have been repurposed as storage buildings. A new structure adjacent to \"A\" Section houses offices used by the Baltimore County Fire Department Rescue Academy. Magazines are intact, per Baltimore County personnel are locked and dry and were until recently used for fire and rescue training. The training facilities have been relocated to a new underground structure in the SW corner of the former exclusion area. 39°30′59″N 076°34′11″W﻿ / ﻿39.51639°N 76.56972°W﻿ / 39.51639; -76.56972﻿ (BA-03-LS)",
            "Launch site with three intact missile pits located at the end of Stocksdale Road in Kingsville, MD. Assembly buildings are still standing but now in private hands. Entrance road has many abandoned trailers, also much junk along the sides. Magazine area is overgrown with vegetation and appears abandoned. Buildings torn down.[11] Magazine area looks like a storage/junkyard, concrete badly cracked. Launch doors visible, probably welded shut more junk lying around as well. 39°26′49″N 076°26′52″W﻿ / ﻿39.44694°N 76.44778°W﻿ / 39.44694; -76.44778﻿ (BA-09-LS)",
            "Partially Intact, Maryland Army National Guard. Double magazine, launch doors appear to be concreted over, some buildings erected on firing pads. Buildings appear to be in use in good condition. 39°25′27″N 076°15′58″W﻿ / ﻿39.42417°N 76.26611°W﻿ / 39.42417; -76.26611﻿ (BA-18-LS)",
            "FDS. Barracks buildings in use, double magazine site. Facility fenced but appears to be open. Roads in fair condition, both magazines appear to be concreted over, large gravel pile on them, generally badly deteriorated. Remaining buildings in deteriorated condition. 39°12′14″N 076°14′12″W﻿ / ﻿39.20389°N 76.23667°W﻿ / 39.20389; -76.23667﻿ (BA-30/31-LS)",
            "FDS. Double magazine site, now a storage yard. Buildings torn down, Launch doors visible, now welded shut. 39°07′43″N 076°29′48″W﻿ / ﻿39.12861°N 76.49667°W﻿ / 39.12861; -76.49667﻿ (BA-43-LS)",
            "FDS. Double magazine in good shape. Most buildings still being used by the Maryland Police & Correctional Training Commission. Thoroughly fenced in. Launch area well maintained shows both Ajax and Hercules elevators, per Maryland State Police recently welded shut. The Griggs House featured at the end of the movie, 'The Blair Witch Project' was located immediately behind the site, but has since been torn down. 39°21′19″N 076°51′02″W﻿ / ﻿39.35528°N 76.85056°W﻿ / 39.35528; -76.85056﻿ (BA-79-LS)",
            "FDS. Redeveloped into high-end single-family housing. A large planter covering the elevator of \"B\" Section and some berms is all that remains of launch site. 39°26′28″N 076°42′50″W﻿ / ﻿39.44111°N 76.71389°W﻿ / 39.44111; -76.71389﻿ (BA-92-LS)",
            "Former twin magazine site, intact, now Anne Arundel County Police Training Academy. Some construction on launching area, launch doors concreted over, but one of the two magazines has been converted into a gym 38°54′09″N 076°38′28″W﻿ / ﻿38.90250°N 76.64111°W﻿ / 38.90250; -76.64111﻿ (W-25-LS)",
            "FDS. Partial remains. Launch site now parking lot for the Children's Theatre of Annapolis and athletic fields. The generator building, guard house and warheading building are present and largely intact. The northern missile magazine is still exposed but has been fenced off and is modified into an underground machine shop. The elevator is present but the hydraulics have been removed. This magazine is currently abandoned and is flooded to a depth of several inches. The other magazines are buried beneath a modern parking lot and have been filled with soil. 39°01′39″N 076°25′42″W﻿ / ﻿39.02750°N 76.42833°W﻿ / 39.02750; -76.42833﻿ (W-26-LS)",
            "FDS Redeveloped into Croom Vocational High School, launch site is identified as the auto, building trades and grounds keeping school. Ajax launch covers visible, some obscured by buildings, two launch doors for Hercules, probably welded shut. 38°46′11″N 076°43′51″W﻿ / ﻿38.76972°N 76.73083°W﻿ / 38.76972; -76.73083﻿ (W-35-LS)",
            "FDS. Private owners, buildings in good shape, appears to be single-family homes built on site. Magazine area in good shape, launch doors visible, probably welded shut. Looks like some vehicles parked on concrete pads. 38°42′25″N 076°45′38″W﻿ / ﻿38.70694°N 76.76056°W﻿ / 38.70694; -76.76056﻿ (W-36-LS)",
            "Maryland Indian Heritage Society. Launch site looks abandoned, buildings in deteriorated condition. Ajax and Hercules launch doors visible, probably welded shut. 38°39′17″N 076°51′20″W﻿ / ﻿38.65472°N 76.85556°W﻿ / 38.65472; -76.85556﻿ (W-44-LS)",
            "FDS. Launch site relatively intact, magazines visible however appears launch doors concreted over. Perimeter fencing is intact and sturdy. Site was formerly the Naval Research Lab-Field Site lower Waldorf; the small observatory on the barracks associated with this usage has been removed. Signage indicates that it is being redeveloped as residential housing. 38°38′37″N 077°00′55″W﻿ / ﻿38.64361°N 77.01528°W﻿ / 38.64361; -77.01528﻿ (W-45-LS)",
            "Double launch magazine now District of Columbia minimum security prison. All six magazines are concreted over. Barracks buildings remain intact and little altered. 38°42′32″N 077°15′10″W﻿ / ﻿38.70889°N 77.25278°W﻿ / 38.70889; -77.25278﻿ (W-64-LS)",
            "Launch area obliterated, owned by Fairfax County and repurposed as Popes Head Park; a marker on the site indicates that the lad was transferred to the County by the US Army but does not mention Nike. Both magazines were unroofed and backfilled with earth. Perimeter fencing intact. Some ruins are visible along the west boundary, including the crushed fuelling stand and parts of the acid storage sheds. 38°48′50″N 077°21′21″W﻿ / ﻿38.81389°N 77.35583°W﻿ / 38.81389; -77.35583﻿ (W-74-LS)",
            "Redeveloped into \"Great Falls Nike Missile Park\" 38°59′30″N 077°19′44″W﻿ / ﻿38.99167°N 77.32889°W﻿ / 38.99167; -77.32889﻿ (W-83-CS)",
            "Remains under US government control, National Institute of Standards and Technology. Remains in secure area, used as a storage area. Apparently magazines still electrified, used for covered underground storage. The elevator still works in one magazine and is used at times to move the larger equipment. 39°07′01″N 077°13′11″W﻿ / ﻿39.11694°N 77.21972°W﻿ / 39.11694; -77.21972﻿ (W-92-LS)",
            "Still under US government control, Federal Emergency Management Agency. Magazine used as Olney Federal Support Center, within a fenced area, manned and guarded 24/7. . The assembly building still stands and is used as a warehouse. The generator building is still in use. 39°12′33″N 077°06′20″W﻿ / ﻿39.20917°N 77.10556°W﻿ / 39.20917; -77.10556﻿ (W-93-LS)",
            "Part of Army Reserve Center, in back of facility. Used as a storage yard/junkyard. Former Ajax installation with 12 launchers. Magazines were sealed during environmental hazards assessment in the 1990s but are presently open and badly vandalized. The battery was manned by C/602nd (9/55-9/58), C/4/5th (9/58-6/60) and MDArNG C/2/70th (6/60-3/63) 39°10′05″N 077°10′06″W﻿ / ﻿39.16806°N 77.16833°W﻿ / 39.16806; -77.16833﻿ (W-94-CS)"
        ]
    ],
    "pageTitle": "List of Nike missile sites - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Walker_AFB_Defense_Area",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861225043,
    "recordOffset": 861105506,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{408365=KC-65DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-72 / Z-72. Air Force operations ended 8 Sep 1968; the AADCP inactivated in 1969, 626551=An Army Air-Defense Command Post (AADCP) was established at Ellsworth AFB, SD in 1960 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system. The AADCP was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site M-97. The radar site ceased all operations on 15 August 1962., 41834=Army Air-Defense Command Post (AADCP) LA-45DC was established at San Pedro Hill AFS, CA in 1960 for Nike missile command-and-control functions. The site was initially an AN/FSG-l Missile-Master Radar Direction Center. It was later equipped with the AN/TSQ-51 \"Missile Mentor\" solid-state computer system., 549312=Army Air-Defense Command Post (AADCP) PI-70DC established at Oakdale AI, PA in 1960 for Nike missile command-and-control functions. The site was initially an AN/FSG-l Missile-Master Radar Direction Center. It was later upgraded to the AN/TSQ-51 \"Missile Mentor\" solid-state computer system. PI-70DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-62 / Z-62 Air Force operations ended 31 Dec 1969. The AADCP inactivated on 1 Sep 1974., 42249=LA-45DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-39 / Z-39 The AADCP was inactivated 1 Sep 1974 along with the remaining Nike Hercules sites., 265084=An Army Air-Defense Command Post (AADCP) was established at Caswell AFS, ME in 1957 for Nike missile command-and-control functions. It was designed for manual operations, using plexiglass plotting boards and telephonic inputs. The AADCP was later integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-80 with FPS-10 (2); FPS-8/GPS-3; FPS-7C and FPS-6A radars. The AADCP inactivated in 1966., 685631=S-90DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-1 / Z-1 The Air Force ceased radar operations in March 1963 and the AADCP was inactivated 1 Sep 1974., 155218=HM-01DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site Z-210. Site was demolished by Hurricane Andrew on 24 August 1992 and subsequently closed., 663255=The AADCP was later integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-56 / Z-56'. The AADCP inactivated in June 1974., 432504=The AAFC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-71 / Z-71. The site was inactivated on 8 Sep 1968., 640110=Dyess AFB Defense Area (DY): Installed to defend the SAC bombers and Atlas F missile silos stationed at and around Dyess AFB. Site DY-10, located at Fort Phantom Hill and site DY-50, located southwest of Abilene, remained operational from 1960 until 1966., 640380=An Army Air-Defense Command Post (AADCP) was established at Sweetwater AFS, TX in 1960 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 42891=San Francisco Defense Area (SF): San Francisco was defended by 12 Nike sites. Its defenders included both Regular Army and National Guard units. Sites SF-87 and SF-93 were deactivated in 1971. Three years later, the U.S. Army Air Defense Command deactivated the remaining missile batteries. When the Army abandoned the launch area of SF-88 at Fort Barry in 1974, the National Park Service assumed custody of the site, incorporating it into the Golden Gate National Recreation Area. Through the efforts of various volunteer groups, as of 1995, this is the only Nike site in the country that has been preserved and is open for public viewing., 18869=Fairbanks Defense Area: Sites were installed to replace Anti-Aircraft guns defending the Fairbanks area, which included Fort Wainwright and Eielson AFB. Manned by the 2nd Missile Battalion, 562d Air Defense Artillery. The sites around Fairbanks were inactivated in 1970-1971., 199466=C-80DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-31 / Z-31 The Air Force ceased radar operations on 30 Sep 1969 and the AADCP was inactivated 1 Sep 1974., 454645=New York Defense Area (NY): Combined with the sites located in New Jersey, the New York sites composed one of the largest defensive nets in the nation. Headquarters facilities were located at Tappan, Fort Totten, Fort Wadsworth, and Roslyn. Initially, New York's air defenses had been manually coordinated from Fort Wadsworth on Staten Island. Later, Army Air-Defense Command Post (AADCP) NY-55DC was established at Highlands AFS, NJ in June 1960 for Nike missile command-and-control functions. The site was an AN/FSG-l Missile-Master Radar Direction Center. Later the AN/TSQ-51 \"Missile Mentor\" solid-state computer system was installed., 409424=SL-47DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-70 / Z-70. The site was closed on 18 June 1968., 455667=NY-55DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-9 / Z-9 Air Force operations at the site ended on 1 July 1966, and Nike operations were inactivated on 31 Oct 1974., 684860=Seattle Defense Area (S): Home of Boeing Aircraft Company and military installations, Seattle was ringed with defenses manned by both Regular Army and Washington National Guard units. Nike Ajax sites were phased out from 1960 to 1963. Sites at (S-13) Redmond, (S-61) Vashon Island, and (S-92) Kingston were upgraded to launch Nike Hercules missiles and survived until 1974., 685248=Army Air-Defense Command Post (AADCP) S-90DC established at Fort Lawton AFS, WA in 1960 for Nike missile command-and-control functions. The site was initially an AN/FSG-l Missile-Master Radar Direction Center. It was later equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 362109=D-15DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-20 / Z-20 The Air Force ceased radar operations when the Army no longer needed radar support and the AADCP was inactivated 1 Sep 1974., 638804=Base and the Austin region from two Nike Hercules sites between 1960-1966., 683727=The AAFC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site SM-151 / Z-151. The AADCP was inactivated in May 1972., 43836=Army Air-Defense Command Post (AADCP) SF-90DC was established at Mill Valley AFS, CA in 1960 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 640679=The AADCP was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site M-89 / Z-89. The AADCP was inactivated in Sep 1969., 153943=Army Air Defense Command Post (AADCP) HM-01DC was established at Richmond AFS, FL 25°37′24″N 080°24′16″W﻿ / ﻿25.62333°N 80.40444°W﻿ / 25.62333; -80.40444﻿ (HM-101DC) in 1961 for Nike missile command-and-control functions. Site equipped with the AN/GSG-5(V) BIRDIE solid-state computer system. In 1965, upgraded to the AN/FSG-l Missile-Master Radar Direction Center. One height-finder radar was later removed and remaining set modified to an AN/FPS-116 c. 1977., 19461=The USAF radar site at Murphy Dome AFS, AK (F-2) was shared with the Army for Nike missile-defense system. The CPS-6B radar was removed in July 1958, FPS-8 removed 4Q 1960 until the Nike sites were inactivated in 1971., 607637=Site PR-79 at Foster was preserved, to be used as a State Police facility. Site PR-99 at North Smithfield stayed in operation until 1971 while PR-38 at Bristol held on until 1974., 331753=Army Air-Defense Command Post (AADCP) B-21DC established at Fort Heath, MA in 1960 for Nike missile command-and-control functions. The site was an AN/FSG-l Missile-Master Radar Direction Center. In early 1965 the AN/TSQ-51 \"Missile Mentor\" solid-state computer system was installed. B-21DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site MM-1., 518256=Cleveland Defense Area (CL): Headquarters facilities were located at the Shaker Heights Armory and in Cleveland. Sites CL-02, CL-ll, and CL-69 were converted to fire Nike Hercules missiles. In 1968, the Cleveland Defense Area merged with Detroit's. In June 1971, the three remaining Nike Hercules batteries were deactivated., 548880=Pittsburgh Defense Area (PI): At first, three active Army battalions manned the ring around \"Steel City\". Later manning responsibilities would eventually be supplied by one active duty unit (3rd Missile Battalion, 1st Artillery) and one Pennsylvania Army National Guard battalion (The Duquesne Greys-2nd Missile Battalion, 176th Artillery). Operations at five of these Nike Hercules sites lasted until 1974., 44150=SF-90DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-38 / Z-38 The AADCP was inactivated in mid-1971., 424533=Private Ownership - Purchased 7-12-14 by Ron Mertens of Smithton IL. Beck VoTech School. Buildings appear in excellent condition. 38°17′23″N 089°56′51″W﻿ / ﻿38.28972°N 89.94750°W﻿ / 38.28972; -89.94750﻿ (SL-40-CS), 408993=St. Louis Defense Area (SL): The Chicago District of the Corps of Engineers oversaw the design and construction. Army Air-Defense Command Post (AADCP) SL-47DC was established at Belleville AFS, IL in 1959 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 332582=The Boston Defense Area merged with Hartford & Providence Defense Areas in 1962, becoming the New England Defense Area. Air Force operations at the site ended in 1962, and Nike operations were inactivated in 1974., 198995=Army Air-Defense Command Post (AADCP) C-80DC established at Arlington Heights AI, IL in 1960 for Nike missile command-and-control functions. The site was initially an AN/FSG-l Missile-Master Radar Direction Center. It was later upgraded to the AN/TSQ-51 \"Missile Mentor\" solid-state computer system., 121037=Hartford Defense Area (HA): Operational in 1956, these sites were first manned by Regular Army and later by Guard Units. Units from the Bridgeport Defense Area assisted in operating the Plainville site. Sites HA-48 and HA-08 were converted to fire the Nike Hercules missile and remained operational until 1968 and 1971, respectively., 120621=with the Guard assuming duties in the waning years. Headquarters facilities were located in Bridgeport. Only site BR-04 was converted from Nike Ajax to Hercules. This battery would become integrated into the New England Defense Area before being deactivated in 1971., 662950=An Army Air-Defense Command Post (AADCP) was established at Cape Charles AFS, VA in 1958 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 361716=Army Air-Defense Command Post (AADCP) D-15DC established at Selfridge AFB, MI in 1960 for Nike missile command-and-control functions. The site was initially an AN/FSG-l Missile-Master Radar Direction Center. It was later upgraded to the AN/TSQ-51 \"Missile Mentor\" solid-state computer system., 279302=Army Air-Defense Command Post (AADCP) W-13DC established at Fort Meade, MD in 1957 for Nike missile command-and-control functions. Site was both an AN/FSG-l Missile-Master and later AN/GSG-5(V) BIRDIE Radar Direction Center. W-13DC was the first Missile-Master DC to become operational., 44747=Travis AFB Defense Area (T): Established to defend the USAF Strategic Air Command, later Military Airlift Command base. During the late 1960s and early 1970s, the Travis battalion assumed responsibility for the remaining active batteries guarding the entire San Francisco region. Inactivated by 1974., 256929=installed to provide protection to Shreveport and Barksdale AFB, which hosted Strategic Air Command bombers. U.S. Army Air Defense Command operated the sites with Regular Army units (possibly from 562nd Air Defense Artillery Regiment) from 1960 until 1966. Battalion Headquarters was located at the Louisiana Army Ammunition Plant located north of Doyline., 684329=Hanford Defense Area (H): Nike missiles replaced and augmented gun batteries that had been previously installed to defend this nuclear industrial complex. Headquarters facilities were located at Camp Hanford. Three sites were deactivated in December 1958 as only Saddle Mountain was converted to the new Nike Hercules. Upon deactivation of this Hercules battery in 1960, the equipment was forwarded to the Norfolk site at Deep Creek/Portsmouth., 279673=On 1 Oct 1961 W-13DC was integrated with USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-54/Z-227. Air Force operations ended 1 Oct 1972. AADCP inactivated 1 Sep 1974 and dissolved as part of the 1988 Base Realignment and Closure Commission., 547979=Army Air-Defense Command Post (AADCP) PH-64DC established at Gibbsboro AFS, NJ in 1960 for Nike missile command-and-control functions. The site was an AN/FSG-l Missile-Master Radar Direction Center. On 1 May 1961 PH-64DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site RP-63/Z-63 Nike operations were inactivated on 30 Sep 1966, 17938=USAF Air Defense Command/NORAD radar sites at Fire Island AFS (F-1) and King Salmon AFS (F-3) AK were integrated into the Army Nike operations. Radars used at Fire Island were CPS-6B, FPS-8, CPS-4, FPS-20A, FPS-6B. Nike missile operations continued there until 1979 when the site was closed. Afterwards, the Army Air-Defense Command Post (AADCP) was moved to King Salmon. Radars were FPS-93A and in 1982 the FPS-117 was installed. The King Salmon Long-Range Radar Site is still in use., 639475=DF-30DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-78 / Z-78. Air Force operations ended 31 July 1964. The AADCP was inactivated in 1969., 431827=Offutt AFB Defense Area (OF): Provided a Nike Hercules defense for Omaha's Offutt AFB, which was the Headquarters of the Strategic Air Command. Offutt also hosted SAC tankers and Atlas missiles were deployed around the area in the early 1960s. An Army Air-Defense Command Post (AADCP) was established at Omaha AFS, NE in 1959 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 638958=Dallas-Fort Worth Defense Area (DF): For air defense of Dallas/Fort Worth Metroplex. These Nike Hercules sites were manned by Regular Army and National Guard units and operated from 1960 to 1968. Army Air-Defense Command Post (AADCP) DF-30DC was established at Duncanville AFS, TX in 1959 for Nike missile command-and-control functions. The site was equipped with the AN/GSG-5(V) BIRDIE solid-state computer system., 454039=NF-17DC was integrated with the USAF Air Defense Command/NORAD Semi Automatic Ground Environment (SAGE) air defense radar network as Site P-21 / Z-21 Nike operations at the site inativated in 1962.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Nike sites in Alaska Nike Missile Jig Launch Battery Site Nike Missile Site Summit Nike Missile Site Bay Nike-Hercules ALASKA website Fairbanks Defense Area: Sites were installed to replace Anti-Aircraft guns defending the Fairbanks area, which included Fort Wainwright and Eielson AFB. Manned by the 2nd Missile Battalion, 562d Air Defense Artillery. The sites around Fairbanks were inactivated in 1970-1971. The USAF radar site at Murphy Dome AFS, AK (F-2) was shared with the Army for Nike missile-defense system. The CPS-6B radar was removed in July 1958, FPS-8 removed 4Q 1960 until the Nike sites were inactivated in 1971. External links[edit] Anchorage Defense Area: Sites were located around Anchorage to defend the city of Anchorage, Fort Richardson, and Elmendorf AFB. Situated at Fort Richardson near Anchorage, the Command Post hosted the regional air defense command and control facility. Manned by the 4th Missile Battalion (redesignated 1st",
    "textAfterTable": "LA-40 Nike 1B, 2C/30A/12L-A Los Angeles Long Beach Airport, California 1956–1963 Obliterated, Hotel and commercial development. Location now a parking deck. 33°48′32″N 118°08′08″W﻿ / ﻿33.80889°N 118.13556°W﻿ / 33.80889; -118.13556﻿ (LA-40-CS) Obliterated, Kilroy Airport Center 33°48′32″N 118°08′26″W﻿ / ﻿33.80889°N 118.14056°W﻿ / 33.80889; -118.14056﻿ (LA-40-LS) LA-43 Nike 2B/12H, 20A/8L-UA Los Angeles Fort MacArthur, California (upper) 1955 - Mar 1974 Located at Battery Leary, Merriam, Upper Reservation, Ft. MacArthur. Fenced-in area, redeveloped with new landscaping. No sign of IFC. 33°42′43″N 118°17′45″W﻿ / ﻿33.71194°N 118.29583°W﻿ / 33.71194; -118.29583﻿ (LA-43-CS) Intact, City of LA, White Point Park. Double-magazine site with Nike Assembly building evident, also concrete launcher foundations. Launch site roads still in place, overlaid by park facilities.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}