{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus has a lot of things in place to ensure safety. They have a safe walk program where you will get a police escort if you are afraid to walk alone at night. Also they have emergency buttons located all over campus where you can recieve help immediatly after pushing one of them.",
            "There are so many clubs and activities on campus. Every semester they have a fair where you can learn about the clubs and get involved which is really awesome.",
            "You get a great education for the tuition you pay.",
            "Uw-Oshkosh has a great rec center and is also on the river so there are many fun outdoor activities.",
            "There are a multiple dining area's on campus that include a variety of different types of food. Blackhawk offers an all you can eat buffet which is pretty good.",
            "The dorm environment is very comfortable and fun. In the dorms they have community advisors who help make the dorm life more enjoyable and fun.",
            "The course work is chanllenging, but the professors are always willing to help if you are struggling.",
            "Get involved right away, there are a lot of clubs and activities on campus that are really great.",
            "The University of Wisconsin-Oshkosh campus is a very beautiful and friendly campus. The staff and student on campus are very helpful and the services offered are tremendous. The University of Wisconsin-Oshkosh has a lot to offer to everyone."
        ]
    ],
    "pageTitle": "University of Wisconsin Oshkosh Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Oshkosh/reviews?_escaped_fragment_=/show/108995",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911971127,
    "recordOffset": 911906294,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27967=My name is Starlisha J Williams and I am in the eleventh grade at Madison high school in Milwaukee WI. I am very interested in this college and is looking forward to going here in the year of 2012. I am sure that this is the best college for me to attend at for my RN career., 284055=© 2015, Cappex.com, LLC, 162123=The food here is okay depending on what you get. They definitely have a lot of choices for students to pick with two main places to eat, a place to get food to go, a restaurant in one of the dorms, a coffee shop, small convenience stores/places to get food in each of the academic buildings, and a convenience store with more food and other products like toothpaste, cleaning products, and more. With so many places to choose from you are able to get a variety of foods, which really helps especially at the end of the semester. The only problem I have with the dining facilities are how early they close. Most are only open until 7:00 pm each night except for the dining place inside of the residence building., 191926=Athletics are big for fun on campus. Women's volleyball, basketball, and baseball are a few of the games I go to. Hanging around campus can be fun, however, I do wish there was more to do on the weekends, such as bowling, movies, etc. The weekends do get long and the city attractions such as restaurants and shopping are great but far away from campus and the buses only run until 6:00 p.m.}",
    "textBeforeTable": "10/26/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 63 Lindsey from Lomira, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin Oshkosh Reviews University of Wisconsin Oshkosh › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students I would recommend to every student to get involved in the student government. It is a flawless way to meet new people, have fun, and help the university. It is also extremely important to be aware of your own needs and attend to them. If you are having any troubles with your roommate, your floor, or even a friend, talk to someone. Never be afraid to reach out to your Campus Advisor, academic advisor, or the professional advisors located on campus. They will always help you to fix a situation. Bang for the buck UW Oshkosh is such an exciting school to attend. There are always community events occurring and so many diverse ways to get involved and meet new people. The residence halls are also very well kept and safe. There are many measures taken to ensure the safety and integrity of the residents, such as locked resident halls to anyone without a key card, and bathroom keys for every floor. Every night there are guards at each entrance to ensure the protection of students, as well. The university itself offers a wide variety of majors, minors, and general education classes for anyone to enroll. The classes are very educational, and always appropriately challenging. Am enjoying being here For perhaps the first",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}