{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2014-04868",
            "1210-AB53"
        ]
    ],
    "pageTitle": "29 CFR 2550.404c-1 - ERISA section 404(c) plans. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/29/2550.404c-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917522275,
    "recordOffset": 917491207,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1067=Title 29 published on 2013-07-01.}",
    "TableContextTimeStampAfterTable": "{66068=This document contains a proposed amendment to the final regulation under the Employee Retirement Income Security Act of 1974 (ERISA or the Act) requiring that certain service providers to pension plans disclose information about the service providers' compensation and potential conflicts of interest. The amendment would, upon adoption, require covered service providers to furnish a guide to assist plan fiduciaries in reviewing the disclosures required by the final rule if the disclosures are contained in multiple or lengthy documents. This amendment will affect pension plan sponsors and fiduciaries and certain service providers to such plans., 5623=§ 1107 - Limitation with respect to acquisition and holding of employer securities and employer real property by certain plans, 7553=The following are ALL rules, proposed rules, and notices (chronologically) published in the Federal Register relating to 29 CFR Part 2550 after this date., 61390=The Department of Labor's Employee Benefits Security Administration is reopening the period for public comment on proposed regulatory amendments relating to enhanced disclosure concerning target date or similar investments, originally proposed November 30, 2010, in a previously published document in the Federal Register . In 2013, the Securities and Exchange Commission's Investor Advisory Committee recommended that the Commission develop a glide path illustration for target date funds that is based on a standardized measure of fund risk as a replacement for, or supplement to, an asset allocation glide path illustration. The Department is reopening the comment period on its 2010 proposal, which contained an asset allocation glide path illustration requirement, to seek public comment on this recommendation., 42733=This document contains a notice of pendency before the Department of Labor of proposed amendments to prohibited transaction exemptions (PTEs) 75-1, 77-4, 80-83 and 83-1. Generally, the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code (the Code) prohibit fiduciaries with respect to employee benefit plans and individual retirement accounts (IRAs) from engaging in self-dealing, including using their authority, control or responsibility to affect or increase their own compensation. These existing exemptions generally permit fiduciaries to receive compensation or other benefits as a result of the use of their fiduciary authority, control or responsibility in connection with investment transactions involving plans or IRAs. The proposed amendments would require the fiduciaries to satisfy uniform Impartial Conduct Standards in order to obtain the relief available under each exemption. The proposed amendments would affect participants and beneficiaries of plans, IRA owners, and fiduciaries with respect to such plans and IRAs., 26846=This document contains a notice of pendency before the Department of Labor of a proposed amendment to PTE 75-1, Part V, a class exemption from certain prohibited transactions provisions of the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code (the Code). The provisions at issue generally prohibit fiduciaries of employee benefit plans and individual retirement accounts (IRAs), from lending money or otherwise extending credit to the plans and IRAs and receiving compensation in return. PTE 75-1, Part V, permits the extension of credit to a plan or IRA by a broker-dealer in connection with the purchase or sale of securities; however, it does not permit the receipt of compensation for an extension of credit by broker-dealers that are fiduciaries with respect to the assets involved in the transaction. The amendment proposed in this notice would permit investment advice fiduciaries to receive compensation when they extend credit to plans and IRAs to avoid a failed securities transaction. The proposed amendment would affect participants and beneficiaries of plans, IRA owners, and fiduciaries with respect to such plans and IRAs., 21815=This document contains a notice of pendency before the U.S. Department of Labor of a proposed exemption from certain prohibited transactions provisions of the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code (the Code). The provisions at issue generally prohibit fiduciaries with respect to employee benefit plans and individual retirement accounts (IRAs) from purchasing and selling securities when the fiduciaries are acting on behalf of their own accounts (principal transactions). The exemption proposed in this notice would permit principal transactions in certain debt securities between a plan, plan participant or beneficiary account, or an IRA, and a fiduciary that provides investment advice to the plan or IRA, under conditions to safeguard the interests of these investors. The proposed exemption would affect participants and beneficiaries of plans, IRA owners, and fiduciaries with respect to such plans and IRAs., 7463=Title 29 published on 2013-07-01, 5457=§ 1101 - Coverage, 5536=§ 1104 - Fiduciary duties, 7177=Reorganization ... 1978 Plan No. 4, 11734=Notice is hereby given that the Employee Benefits Security Administration (EBSA) will hold a public hearing on August 10, 11, and 12, and continuing through August 13, 2015 (if necessary) to consider issues attendant to adopting a regulation concerning its proposed conflict of interest rule and related proposed prohibited transaction exemptions. The Department also is extending the date by which comments may be submitted on the proposed rule and proposed new and amended exemptions. Public comments on the proposals may now be submitted to the Department on or before July 21, 2015., 5811=§ 1108 - Exemptions from prohibited transactions, 37622=This document contains a notice of pendency before the Department of Labor of proposed amendments to Prohibited Transaction Exemptions (PTEs) 86-128 and 75-1, exemptions from certain prohibited transaction provisions of the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code of 1986 (the Code). The ERISA and Code provisions at issue generally prohibit fiduciaries with respect to employee benefit plans and individual retirement accounts (IRAs) from engaging in self-dealing in connection with transactions involving plans and IRAs. The exemptions allow fiduciaries to receive compensation in connection with certain securities transactions entered into by plans and IRAs. The proposed amendments would increase the safeguards of the exemptions. This document also contains a notice of pendency before the Department of the proposed revocation of PTE 86-128 with respect to transactions involving investment advice fiduciaries and IRAs, and of PTE 75-1, Part II(2), and PTE 75-1, Parts I(b) and I(c), as duplicative in light of existing or newly proposed relief. The amendments and revocations would affect participants and beneficiaries of plans, IRA owners and certain fiduciaries of plans and IRAs., 32146=This document contains a notice of pendency before the Department of Labor of a proposed amendment to Prohibited Transaction Exemption (PTE) 84-24, an exemption from certain prohibited transaction provisions of the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code of 1986 (the Code). The ERISA and Code provisions at issue generally prohibit fiduciaries with respect to employee benefit plans and individual retirement accounts (IRAs) from engaging in self-dealing in connection with transactions involving these plans and IRAs. The exemption allows fiduciaries to receive compensation when plans and IRAs enter into certain insurance and mutual fund transactions recommended by the fiduciaries as well as certain related transactions. The proposed amendments would increase the safeguards of the exemption. This document also contains a notice of pendency before the Department of the proposed revocation of the exemption as it applies to IRA purchases of mutual fund shares and certain annuity contracts. The amendments and revocations would affect participants and beneficiaries of plans, IRA owners and certain fiduciaries of plans and IRAs., 16684=This document contains a notice of pendency before the U.S. Department of Labor of a proposed exemption from certain prohibited transactions provisions of the Employee Retirement Income Security Act of 1974 (ERISA) and the Internal Revenue Code (the Code). The provisions at issue generally prohibit fiduciaries with respect to employee benefit plans and individual retirement accounts (IRAs) from engaging in self-dealing and receiving compensation from third parties in connection with transactions involving the plans and IRAs. The exemption proposed in this notice would allow entities such as broker-dealers and insurance agents that are fiduciaries by reason of the provision of investment advice to receive such compensation when plan participants and beneficiaries, IRA owners, and certain small plans purchase, hold or sell certain investment products in accordance with the fiduciaries' advice, under protective conditions to safeguard the interests of the plans, participants and beneficiaries, and IRA owners. The proposed exemption would affect participants and beneficiaries of plans, IRA owners and fiduciaries with respect to such plans and IRAs., 5921=§ 1135 - Regulations, 56396=The Employee Benefits Security Administration of the U.S. Department of Labor (the Department) is publishing this Notice as part of its review of the use of brokerage windows (including self-directed brokerage accounts or similar arrangements) in participant-directed individual account retirement plans covered by the Employee Retirement Income Security Act of 1974 (ERISA). Some plans offer participants access to brokerage windows in addition to, or in place of, specific investment options selected by the plans' fiduciaries. Through these arrangements, plan participants may be able to choose among the full range of investment options available in the investment marketplace. The Request for Information contained in this Notice will assist the Department in determining whether, and to what extent, regulatory standards or other guidance concerning the use of brokerage windows by plans are necessary to protect participants' retirement savings. It also will assist the Department in preparing any analyses that it may need to perform pursuant to Executive Order 12866, the Paperwork Reduction Act, and the Regulatory Flexibility Act.}",
    "lastModified": "Thu, 23 Jul 2015 18:57:39 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 14301 - Fiduciary Requirements for Disclosure in Participant-Directed Individual Account Plans—Timing of Annual Disclosure 2015-03-19; vol. 80 # 53 - Thursday, March 19, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 29. Title 29 published on 2013-07-01. 75 FR 64946, Oct. 20, 2010] [57 FR 46932, Oct. 13, 1992, as amended at Transactions occurring before the date determined under subparagraph (g)(1) or (2) of this section, as applicable, are governed by section 404(c) of the Act without regard to the regulation. (3) This section is effective with respect to transactions occurring under a plan maintained pursuant to one or more collective bargaining agreements between employee representatives and one or more employers ratified before October",
    "textAfterTable": "DEPARTMENT OF LABOR, Employee Benefits Security Administration Direct final rule. Effective date: This rule is effective June 17, 2015, without further action or notice, unless significant adverse comment is received by April 20, 2015. If significant adverse comment is received, the Employee Benefits Security Administration (EBSA) will publish a timely withdrawal of the rule in the Federal Register . Applicability date: The amendment is applicable to disclosures made on or after June 17, 2015. 29 CFR Part 2550 Summary This direct final rule amends the Department of Labor's “participant-level fee disclosure” regulation. The amendment makes a technical adjustment to a timing requirement in the current regulation. As amended, the regulation provides plan administrators with flexibility as to when they must furnish annual disclosures to participants and beneficiaries. This is a list of United States Code sections, Statutes at Large, Public Laws, and Presidential Documents, which provide rulemaking authority for this CFR Part. This list is taken from the Parallel Table of Authorities and Rules provided by GPO [Government Printing Office]. It is not guaranteed to be accurate or up-to-date, though we do refresh the database weekly. More limitations on accuracy are described at",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}