{
    "relation": [
        [
            "Role",
            "Starter",
            "Reserve",
            "Reserve"
        ],
        [
            "Player",
            "B.J. Upton",
            "Sam Fuld",
            "Matt Joyce"
        ],
        [
            "Bats",
            "R",
            "L",
            "L"
        ],
        [
            "PA",
            "600",
            "50",
            "50"
        ],
        [
            "ZIPS BA",
            ".240",
            ".245",
            ".254"
        ],
        [
            "ZIPS OBP",
            ".329",
            ".322",
            ".342"
        ],
        [
            "ZIPS SLG",
            ".411",
            ".348",
            ".453"
        ],
        [
            "Fielding",
            "4",
            "7",
            "2"
        ],
        [
            "WAR",
            "4",
            "0.5",
            "1"
        ]
    ],
    "pageTitle": "FanGraphs Baseball » Positional Power Rankings: Center Field » Print",
    "title": "",
    "url": "http://www.fangraphs.com/blogs/positional-power-rankings-center-field/print/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437113467,
    "recordOffset": 437101004,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76998=Copyright © 2009 FanGraphs Baseball. All rights reserved., 69346=Now we’re into the elite of the elite. Yeah, it’s hard to think of Shane Victornio in the same league as Matt Kemp, Curtis Granderson and Jacoby Ellsbury, but he’s getting there. Well, at least he got close in 2012 with career-bests in walk rate and home run rate. ZIPS sees another big year for Victorino. If he stays healthy, that leaves little playing time for John Mayberry in center, just the way Phillies skipper Charlie Manuel likes it., 927=Center field is a glamour position. Think Willie Mays. Mickey Mantle. Joe DiMaggio. Ken Griffey, Jr. For some teams in 2012, center field will feature strong, glamorous players. Think Red Sox, Yankees, Dodgers, and Phillies. For other teams in 2012, center field will feature not-quite-there and been-there-done-that guys. Think Astros, Indians, Blue Jays, and Nationals. The other teams feature players — or platoons– that fall somewhere on the lackluster-to-glamorous spectrum., 13109=Center field is in flux for the Nationals. Part of the problem is the incumbent, Roger Bernadina, who is average at defense and below average at the plate. Another issue is whether and when Bryce Harper makes the 25-man roster. When that happens — and manager Davey Johnson seems to want that sooner rather than later — Jayson Werth will move to center field and Harper will play right. ZIPS expects a better season from Werth than 2011, but still not at the level he produced with the Phillies. The Nationals also signed Rick Ankiel to a minor-league deal, but he seems certain to make the team out of spring training. Ankiel adds good value on defense but not much at the plate. None of these players are perfect fit for the Nationals in center, and will likely share the time there until a more permanent solution is found., 55682=Denard Span gives the Twins what Cameron Maybin gives the Padres: decent offensive production and exceptional defense. Span did suffer a concussion at the end of last season, but all reports suggest he’s clear of symptoms and ready to play a full season. Nevertheless, I’ve penciled Ben Revere in for 100 plate appearance, just in case. It’s a drop in offense from Span, but not by much, and defense remains stellar. Prospect Joe Benson should see a bit of playing time in September., 48759=After fits and starts last season, it looks like Dexter Fowler now firmly has a grip on center field for the Rockies. And that’s a good thing for Colorado, according to ZIPS. Fowler looks to improve his on-base skills (mostly be decreasing strikeouts) and maintain the flashes of power he showed late in the 2011 season. The Rockies will also get a boost in center for any time Carlos Gonzalez plays there, shifting over from ususal spot in left. Even 100 plate appearances for CarGo while playing center will add 1 WAR for the Rockies in that position., 24244=Drew Stubbs played nearly every game in center field for the Reds in 2011 and looks to do the same in 2012. Stubbs doesn’t hit for average but has decent power and good speed. He’s also an above-average defender in center. Chris Heisey, the Reds starting left fielder, will back up Stubbs in center. If he plays 100 innings there, he’ll add good value to what Stubbs already brings to the table., 64840=It’s all about Andrew McCutchen for the Pirates in center field. For 2012 and many years after that, thanks to a shiny new contract. And if McCutchen continues to improve his power — like he did last season — it will be a big win for Pittsburgh. He does everything well, at the plate and in the field. Just an all-around excellent center fielder., 16667=The Mariners find themselves in somewhat the same position as the Indians, having lost their starting center fielder — Franklin Guitierrez — to an injury. Gutierrez has a strained pectoral muscle and is expected back in May. If he comes back fully healthy and plays center for the rest of the season, he’ll bring good value to the Mariners, largely with his glove. Casper Wells, Michael Saunders and Chone Figgins are likely to rove center at Safeco Field while Guitierrez is out. Wells has some power and is  solid on defense, so he should get the bulk of the playing time., 37039=Don’t look now but Craig Gentry looks to be in the mix for starting center fielder for the Rangers. Gentry doesn’t have much in the way of on-base skills or power but when he gets on he can make things happen with is legs. He was a perfect 18-for18 in stolen bases in 2011. His speed also makes Gentry a plus-plus defender. Julio Borbon will likely take as many plate appearances in center as Gentry, hitting from the other side of the plate. I expect Josh Hamilton to get significant time in center as well, particularly if the Rangers conclude he’s likely to sign elsewhere in 2013 and which leads the team to take fewer precautions with Hamilton., 31593=As in 2011, Austin Jackson will be the Tigers main center fielder. And as in 2011, much of his value will derive from his superior defense. Andy Dirks and Don Kelly will take some at bats from the left side but not enough to make much of a difference in value for the Tigers., 21920=The Marlins, along with the Reds, Giants and Cardinals, will get above-average value in center field, putting them ahead of the teams ranked 25-30.  The Marlins’ depth chart shows Emilio Bonifacio as the expected starter with back up help from Chris Coghlan. Bonifacio hasn’t played much center, but he’s versatile and a good defender. Bonifacio had a career year in 2011 offensively, but even with some regression, will be a nice compliment to the Marlins lineup., 34422=Alejandro De Aza played only 54 games in the majors in 2011 but ZIPS likes what it saw. No, De Aza isn’t going to slug over .500 in 2012, but a slash of .271/.308/.406 will give the White Sox good offensive value in center field. De Aza is also an excellent defender, which pushes his expected WAR production to 3.5., 73838=Granderson put it all together in 2011, dramatically improving his hitting against lefties, which made all the difference to his overall offensive production. And while ZIPS sees some drop off in power, Granderson looks to be one of the best of the best in center in 2012., 57670=Chris Young declined offensively last season, with drops in on-base percentage and power. But his exceptional defense more than made up for it. ZIPS projects a season somewhere between his 2010 and 2011 numbers. If his defense remains tops, he will continue to bring very good value to the D’Backs. I’ve penciled Gerardo Parra in for 200 plate appearances because Parra lost his starting job in left field to Jason Kubel, and I just can’t imagine Parra sitting on the bench for long. Nice problems for Arizona manager Kirk Gibson to have., 29126=Jon Jay did a nice job in center field for the defending World Series Champions in 2011 and ZIPS projects a repeat performance. Good on-base average, some pop and decent defense from Jay gives the Cardinals solid value in center. Carlos Beltran may play a bit for Jay against tough left-handers, adding more value to the mix. Skip Schumaker will get some innings as well., 71611=Matt Kemp had a break out year in 2011 and was, in many observers’ eyes, the best player in the National League. He’s promising better things in 2012, like getting into the 50/50 club — 50 home runs and 50 stolen bases.  That’s unlikely, as is matching his production from last season, but ZIPS doesn’t see much of a drop at all. Kemp’s defense has also improved, and there’s no reason to think that bump in value won’t be sustained., 10526=I expect Rajai Davis and Travis Snider to fill in the remaining time in center field for the Blue Jays. Even with his injury-riddled and poor-performing 2011, Snider still projects to have a decent bat with some pop, especially if he’s healthy. His above-average defense will also come in handy late in games. Davis doesn’t add much over Snider, other than speed, but he does bat right-handed, providing a change from Snider and Rasmus, who both bat from the left side.}",
    "lastModified": "Tue, 28 Jul 2015 01:44:44 GMT",
    "textBeforeTable": "30. Houston Astros And now, on to the show. As my colleagues have noted in their positional power rankings, this is an art, not a science. We do our best with the information we have, to which we add our analysis and judgment. I have not projected anyone to have more than 600 plate appearances as a center fielder, even though a number of  players have seen 650-plus plate appearances for several seasons. Things happen. Injuries happen. It just made sense to me to be conservative, particularly with a position that requires a great deal of athleticism. Center field is a glamour position. Think Willie Mays. Mickey Mantle. Joe DiMaggio. Ken Griffey, Jr. For some teams in 2012, center field will feature strong, glamorous players. Think Red Sox, Yankees, Dodgers, and Phillies. For other teams in 2012, center field will feature not-quite-there and been-there-done-that guys. Think Astros, Indians, Blue Jays, and Nationals. The other teams feature players — or platoons– that fall somewhere on the lackluster-to-glamorous spectrum. For an explanation of this series, please read Dave Cameron’s introduction from Monday. All the posts in the series can be found here. Posted By Wendy Thurm On March 7, 2012 @ 2:00 pm In 2012 Positional Power Rankings,Daily Graphings | 110 Comments Positional Power Rankings: Center Field - FanGraphs Baseball - http://www.fangraphs.com/blogs -",
    "textAfterTable": "Jordan Schafer appears to be the Astros’ choice for starting center fielder, but it’s not clear why. After coming over from the Braves in the Michael Bourn trade, Schafer did almost nothing with either his bat or his glove. ZIPS projects Schafer as the least productive center fielder in the majors this season. Understudy Jason Bourgeois hits better, fields better and is just as fast, if not faster, than Schafer and may soon replace him as the starting center fielder. Prospect J.B. Shuck may get some playing time in center as the Astros continue to evaluate their young talent. 29. Cleveland Indians Role Player Bats PA ZIPS BA ZIPS OBP ZIPS SLG Fielding WAR Starter Grady Sizemore L 200 .243 .319 .434 -4 1 Reserve Michael Brantley L 350 .270 .330 .367 -2 1 Reserve Ezequiel Carrera L 75 .263 .329 .327 Grady Sizemore’s back injury is expected to keep him out of action until mid-summer. That’s thrown a monkey wrench in the Indians’ plans in center field. Michael Brantley, who was slated as the starting left fielder, will take over",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}