{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Film students and business students",
            "There is many attractions close by Busch Gardens and Tampa Aquarium along with a short drive to Orlando attractions.",
            "Be aware of opportunities and things going on around campus. Maintain a strong gpa in all your classes. Obtain a good professional relationship with your professors.",
            "The student teacher ratio is really good. The teachers and advisors are well educated. The campus has transportation options."
        ]
    ],
    "pageTitle": "The University of Tampa (UT) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Tampa/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896659055,
    "recordOffset": 896571760,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{459908=Gasparilla every January is awesome., 174742=Great education. May be pricey, but well worth the costs., 442214=UT students always participate in the Gasparilla parade that takes place mid-January. It is a great experience, a lot like mardi gras, and a great way to let loosen up a bit half way through the school year., 36862=This university is great for kids who like a more one on one learning experience and like to get to know a variety of different people from a variety of different places, we have over 1000 international students! If you don't wanna take a twenty minute walk to your classes, get to know a lot of people, and have your teacher know who you are The University of Tampa is right for you!, 500214=© 2015, Cappex.com, LLC, 143323=Gasparilla. Every year in January the city of Tampa shuts down its main roads for what is essentially a pirate-themed Mardi Gras. The residence assistants will cook breakfast for each student in their hall and the students start drinking as early as 7am. Then we walk around the city watching the parade and seeing thousands of people. Best time of my life., 114690=The dorms are pretty good except really for Mckay. But, the school keeps accepting way more students than they have room for so some students are put in a hotel off campus but there is a shuttle to get to and from campus. A new dorm is underway and should be up in 2013., 324775=There is an annual event that happens in late January, right after you come back from winter break called Gasparilla, AKA Gatsby. Everybody wakes up at 9 am, puts on a pirate costume, gets drunk, and walks the streets of Tampa. This event is actually a lot of fun and sponsored by the city, there's a huge pirate parade and the pirates give away beads in the parade. It is complete madness and a nightmare if you decide to drive that day, but its ALWAYS better on foot if you're going to be drinking!! But if you're more of a wallflower, its pretty easy to opt out, there's no pressure to party, but a lot of people do. Tampa is actually on a river that is within a park so you can walk up to the river, lay out a towel and sunbathe, study, or take in the view. Its a really beautiful place to just sit and relax. Another cool thing was that we had the Republican National Debate come to UT this last Fall of 2012! We had the Today Show come and visit the campus as well as Senator John McCain stopped by to speak to our business students., 315565=I have heard great things from this school. I am planning to apply in the Fall of 2013. Is a beautiful campus and I hope to visit the campus soon!}",
    "textBeforeTable": "07/02/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 54 out of 62 people found this review useful. 1 of 118 Autumn from Apollo Beach, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. The University of Tampa Reviews The University of Tampa › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Great for these types of students Students who are determined and hard-working looking for a great education. If you like small classes and being able to work with your professors this is the college for you. The sports teams are also very good and UT offers a lot of clubs and interactive events. Tips for prospective students Take a tour of the college and definitely attend the open house days. Talk to some of the students and professors and make sure you feel like UT is the college for you. If you're going to apply make sure you also apply for their scholarships and grants. That will help you a lot and you will probably receive at least one. If you need any help or have any questions don't be afraid to talk to a counselor or advisor. They are more than happy to help you anytime and are quick to respond. Bang for the buck It is a very expensive school but you will get your money's worth. Am enjoying being here The environment is great and the location is very nice. The whole campus makes you feel like you're at home. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}