{
    "relation": [
        [
            "Patent application number",
            "20100072326",
            "20140339373"
        ],
        [
            "Description",
            "INTEGRATED LOCKING CONTROL AND STATUS INDICATOR FOR MANUALLY OPERATED RAILWAY SWITCH STAND - The invention relates to a device to be integrated with to a manual switch stand, particularly for use in dark territory. The device secures the spindle of the switch stand against rotation, thereby preventing authorized throwing of the switches. The device also contains sensors that will clearly indicate to an external observer both the position of the switch points and the locked or unlocked status of the switch stand. A particular sequence of steps must be taken before an operator will be able to unlock the switch stand and throw the switch, and further steps are required before he can secure the switch stand and remove his key. The switch stand must therefore be left in a locked state, and it continuously indicates the status of the switch stand to a remote monitor.",
            "DUAL INDEPENDENT CONTROL HYDRAULIC SWITCH MACHINE - A hydraulically powered switch machine having power and manual operating modes, and a dual disconnect mechanism. In power operation mode, the machine may be operated remotely, or using controls located on or near the machine. In the event of power failure, the machine may be operated manually. The dual disconnect mechanism physically disconnects the powered throw mechanism when the machine is operating in manual mode and physically disconnects the manual throw mechanism when the machine is operating in power mode, in both cases preventing unexpected movement of the manual throw mechanism."
        ],
        [
            "Published",
            "03-25-2010",
            "11-20-2014"
        ]
    ],
    "pageTitle": "Brent - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/brent-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439620219,
    "recordOffset": 439589948,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Brent Duffner, Pinson, AL US 08-18-2011 HEADGEAR FOR MASKS - A headgear for use with a mask includes a first strap ( 20110197341 Published Description Patent application number Brent Dravitzki, New South Wales AU 09-04-2014 USE OF PYRAZOLOPYRIMIDINE DERIVATIVES FOR THE TREATMENT OF PI3K-DELTA RELATED DISORDERS - The present application provides methods of treating PI3Kδ related disorders using compounds of Formula I: 20140249132 03-07-2013 HETEROCYCLYLAMINES AS PI3K INHIBITORS - The present invention provides heterocyclylamine derivatives of Formula I: 20130059835 Published Description Patent application number Brent Douty, Fallowfield, PA US 06-18-2009 System, method, and apparatus for multi-channel user interaction - A system and method for receiving a communication from a user over a communication channel, selecting and executing a bot, flow or procedure. The bot, flow or procedure to execute are selected by parameters such as the communication channel used, the device used by the user or a user profile. 20090158278 Published Description Patent application number Brent De-Kay, The Woodlands, TX US 12-30-2010 INFLATABLE EQUIPMENT STABILIZER - A method and apparatus for stabilizing a piece of equipment, especially a wind turbine blade when removed from a wind turbine tower, the method and apparatus including a stabilizer bag placed on the ground, having one or more interior inflatable cavities surrounded by a",
    "textAfterTable": "Patent applications by Brent Duffner, Pinson, AL US Brent Gawrys, Whitehall, PA US Patent application number Description Published 20090273299 Apparatus and Method for Controlling the Filament Voltage in an Electronic Dimming Ballast - An electronic dimming ballast comprises a filament turn-off circuit for controlling the magnitudes of filament voltages supplied to the filaments of a gas discharge lamp. Each of a plurality of filament windings is directly coupled to one of the filaments and is operable to supply a small AC filament voltage to the filaments. The plurality of filament windings and a control winding are loosely magnetically coupled to a resonant inductor of an output circuit of the ballast. A controllably conductive device is coupled across the control winding. When the controllably conductive device is conductive, the voltage across the control winding and the filament windings falls to zero volts. The controllably conductive device is driven with a pulse-width modulated (PWM) signal so as to control the magnitudes of the filament voltages. The filament voltages are provided to the filaments before striking the lamp, and when dimming the lamp near low end. 11-05-2009 Brent Getlin, Leander, TX US Patent application number",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}