{
    "relation": [
        [
            "Patent application number",
            "20100325469",
            "20110273618",
            "20120090002",
            "20120110366",
            "20140063065",
            "20140152606",
            "20140173470",
            "20140195935",
            "20140298276",
            "20140344750"
        ],
        [
            "Description",
            "CLOCK CONTROL DEVICE, CLOCK CONTROL METHOD, CLOCK CONTROL PROGRAM AND INTEGRATED CIRCUIT - An instruction detecting section (",
            "PORTABLE TERMINAL, VIDEO DATA REPAIR METHOD AND PROGRAM - A portable terminal wherein the amount of processing and power consumption when performing repair is reduced and video data can be reliably repaired, and video data repair method and program of the same. The portable terminal (",
            "DIGITAL BROADCAST RECEPTION DEVICE AND DIGITAL BROADCAST RECEPTION METHOD - Disclosed are a digital broadcast reception device and digital broadcast reception method which can quickly present a data broadcast presentation screen once a user instructs that data broadcast be presented. The digital broadcast reception device (",
            "CLOCK CONTROL DEVICE, CLOCK CONTROL METHOD, CLOCK CONTROL PROGRAM AND INTEGRATED CIRCUIT - An instruction detecting section (",
            "INFORMATION PROCESSING APPARATUS, SERVER APPARATUS, INFORMATION PROCESSING METHOD - Disclosed is an information processing apparatus including virtual object management section (",
            "INFORMATION PROCESSING DEVICE, INFORMATION PROCESSING METHOD, AND INFORMATION PROCESSING PROGRAM - Provided are an information processing device, an information processing method, and an information processing program, which simply switch to a display method which a user desires. When an information processing device (",
            "INFORMATION PROCESSING DEVICE, INFORMATION PROCESSING METHOD, AND INFORMATION PROCESSING PROGRAM - This information processing device enables a user to easily move objects between applications simultaneously displayed on touch panels. The information processing device (",
            "INFORMATION PROCESSING DEVICE, INFORMATION PROCESSING METHOD, AND INFORMATION PROCESSING PROGRAM - Disclosed is an information processing apparatus that allows the user to operate a plurality of applications simultaneously displayed on touch panels, using a hand that holds the terminal. Information processing apparatus (",
            "DISPLAY CONTROL DEVICE, DISPLAY CONTROL METHOD, AND DISPLAY CONTROL PROGRAM - This display control device can effectively reduce power consumption while assuring visibility of a display area. A display control device (",
            "DISPLAY DEVICE AND DISPLAY METHOD - Provided is a display device with which it is possible for a plurality of users to comfortably carry out different window manipulations without a screen being partitioned. This device ("
        ],
        [
            "Published",
            "12-23-2010",
            "11-10-2011",
            "04-12-2012",
            "05-03-2012",
            "03-06-2014",
            "06-05-2014",
            "06-19-2014",
            "07-10-2014",
            "10-02-2014",
            "11-20-2014"
        ]
    ],
    "pageTitle": "Yokoyama, Kanagawa - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yokoyama-kanagawa-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436165583,
    "recordOffset": 436141874,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ryo Yokoyama, Kanagawa JP 09-30-2010 SEMICONDUCTOR DEVICE - A semiconductor device includes: a semiconductor layer made of Fe-doped GaN; a first buffer layer that is provided on the semiconductor layer so as to contact an upper surface of the semiconductor layer and is made of AlN or Al 20100244098 09-23-2010 METHOD FOR FABRICATING SEMICONDUCTOR DEVICE - A method for fabricating a semiconductor device includes growing an AlN layer by MOVPE in which a nitrogen-source flow ratio at a far side from a substrate is set lower than that at a near side, the nitrogen-source flow ratio being a ratio of a flow rate of a nitrogen source to a total flow rate of growth gas; and growing a GaN-based semiconductor layer on the AlN layer by MOVPE. 20100240198 Published Description Patent application number Mitsunori Yokoyama, Kanagawa JP //]]> BarDraw('3470963',['Patent applications by Mineyuki Yokoyama, Kanagawa JP'],[[2,1,1]],['2005','2007','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3470963\" align=\"center\"></div> </div> <canvas id=\"bg3470963\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Mineyuki Yokoyama, Kanagawa JP</p> <div class=\"bar3470963\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-19-2009</td> <td><a href=\"/patents/app/20090076309\">Alpha-Ketol Unsaturated Fatty Acid Derivative And Plant Growth Regulating Agent Using Same</a> - An α-ketol unsaturated fatty acid derivative represented by the formula (1):</td> <td>20090076309</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3470963\"> <h2>Mineyuki Yokoyama, Kanagawa JP</h2> </table> </tbody> </tr> <td>05-30-2013</td> <td><a href=\"/patents/app/20130138259\">POWER",
    "textAfterTable": "Patent applications by Ryo Yokoyama, Kanagawa JP Ryouichi Yokoyama, Kanagawa JP Patent application number Description Published 20100297973 ORTHOGONALITY COMPENSATING DEVICE, RADIO RECEIVING DEVICE, ORTHOGONALITY COMPENSATING METHOD, AND NON-TRANSITORY COMPUTER READABLE MEDIUM - Provided is an orthogonality compensating device that compensates for orthogonality between a real signal and an imaginary signal of complex digital intermediate frequency signals, the orthogonality compensating device including: a first processing unit that outputs a first signal obtained by calculating one of the real signal and the imaginary signal by using a first coefficient and a second coefficient; and a coefficient specifying unit that specifies the first coefficient such that the first signal has the same amplitude as the other of the real signal and the imaginary signal, and specifies the second coefficient such that the first signal is orthogonal to the other of the real signal and the imaginary signal, by using the first signal and the other of the real signal and the imaginary signal. 11-25-2010 20100297974 ORTHOGONALITY COMPENSATING DEVICE, RADIO RECEIVING DEVICE, ORTHOGONALITY COMPENSATING METHOD, AND NON-TRANSITORY COMPUTER READABLE MEDIUM - Provided is an orthogonality compensating device that compensates for orthogonality between a real signal and an imaginary signal of complex digital",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}