{
    "relation": [
        [
            "Size",
            "X-Small",
            "Small",
            "Medium",
            "Large",
            "X-Large"
        ],
        [
            "Width",
            "5/8 inch",
            "5/8 inch",
            "1 inch",
            "1 inch",
            "1 inch"
        ],
        [
            "Circumference",
            "6 - 12 inch",
            "9 - 15 inch",
            "12 - 18 inch",
            "15 - 21 inch",
            "18 - 24 inch"
        ]
    ],
    "pageTitle": "Up Country North Star Collar - Free Shipping",
    "title": "",
    "url": "http://www.wag.com/dog/p/up-country-north-star-collar-175481",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 811104451,
    "recordOffset": 811030569,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "These ribbon collars are made from high-tensile strength nylon webbing with sewn on polyester/nylon ribbons. Ribbons are stain and fray resistant; designed to last a lifetime. All collar and lead hardware is cast, not welded brass for extra strength. The buckles are Coast Guard approved for high weight hold. Machine wash cold, air dry. Up Country Bella Floral Collar Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available Gift Wrap Not Available",
    "textAfterTable": "  Up Country Owl Dog Collar These ribbon collars are made from high-tensile strength nylon webbing with sewn on polyester/nylon ribbons. Ribbons are stain and fray resistant; designed to last a lifetime. All collar and lead hardware is cast, not welded brass for extra strength. The buckles are Coast Guard approved for high weight hold. Machine wash cold, air dry. Size Width Circumference X-Small 5/8 inch 6 - 12 inch Small",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}