{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Not the best or worst food you can get at a college",
            "The classes are not that challenging, which is good if you work.",
            "Ocean County College is a decent college. It will get you an Associates Degree for a minimal price. I would rate them as 5 out of 10"
        ]
    ],
    "pageTitle": "Ocean County College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ocean-County-College/reviews?_escaped_fragment_=/show/93340",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892289647,
    "recordOffset": 892246540,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{193781=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/11/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 43 Daniella from Brick, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Comments Campus Safety There are always security officers around campus...not too far away if you need one in a hurry. Greek Life None. Clubs and Activities Several different clubs and sports you can join. If they don't have something you want, create a new one. Great for these types of students Great for students who want to save money before they transfer to a different school, students who just need an Associate's degree, and those who want to stay close to home. Share any unusual traditions or locations on campus The solar lounge is like geek heaven. But it can also be a cool place to meet up with friends, as long as you don't mind people playing video games in the background. Sometimes there's live guitar music too. Bang for the buck Worth it's money for a community college education. What to do for fun Join a club, sport, or activity. You'll meet new people and make friends that share interests with you. Attend a show at the planetarium or a theater performance.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}