{
    "relation": [
        [
            "Domain Created On",
            "2007-08-09",
            "7 years, 346 days old"
        ],
        [
            "Last Modified On",
            "2007-08-09",
            "7 years, 346 days ago"
        ],
        [
            "Expires On",
            "2021-08-09",
            "6 years, 19 days from today"
        ]
    ],
    "pageTitle": "concursosnobrasil.com.br Concursos no Brasil – Concursos Públicos Abertos 2015 | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.concursosnobrasil.com.br",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 704970931,
    "recordOffset": 704949011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4320=IP address of concursosnobrasil.com.br is : 177.126.171.91. The domain concursosnobrasil.com.br was created on 2007-08-09 and it is 7 years, 346 days old. It will expire on 2021-08-09 which is 6 years, 19 days from today. The homepage of website concursosnobrasil.com.br has a size of 29689 bytes, and a text size of 3523 bytes, its Text to Code Ratio is 13.46% Homepage of concursosnobrasil.com.br has 128 links, 125 link to internal pages, while 3 link to pages on other websites. It takes 0.30 s ( 99.73 Kb/s ) to load the website concursosnobrasil.com.br.}",
    "textBeforeTable": "Concursos no Brasil – Concursos Públicos Abertos 2015 Words count: 7    Unique Words: 6    Length: 56 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 15 recommended tasks to improve your SEO performance. ... Combine the 12 script blocks and move them to an external file. Reduce number of links to other pages. Add more content and increase the size of your page, make it within 30k-150k bytes. Add more meta keywords for your page and allows it to contains 10 to 20 words. Create more back-links from root domains. Configure the server so that your site IP http://177.126.171.91 is redirected to the site domain name concursosnobrasil.com.br. Configure the server so that your site with or without 'www' (http://www.concursosnobrasil.com.br, http://concursosnobrasil.com.br) are resolved to the same URL. Move the 10 inline css components to an external style sheet file. Add in more high quality text content (adsbygoogle = window.adsbygoogle || []).push({});",
    "textAfterTable": "Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Concursos públicos no Brasil. Concursos Abertos, previstos 2015 e concurso em Andamento. Confira Edital, Simulados e Provas de concursos anteriores Words count: 20    Length: 148 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Excellent! Your meta description contains between 70 and 160 characters. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : Concursos no Brasil – Concursos Públicos Abertos",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}