{
    "relation": [
        [
            "First Name",
            "Brittany",
            "Katy",
            "Sarah"
        ],
        [
            "Last Name",
            "Jablonsky",
            "Ziegler Thomas",
            "Gallo"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4037E0A9-FFD8-4E97-8066-E2BF5D08726B&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226742065,
    "recordOffset": 226726154,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35942=Agriculture/food-related provisions of: H.R.232, to create a federal greenhouse gas registry. H.R.864, to amend 20005 Energy Policy Act to provide renewable fuel pipeline loan guarantees. H.R.260, to authorize loan guarantees for cellulosic ethanol production technology. H.R.6533, to carry out conservation reserve program notice CRP-598. H.R.6636, to protect farmers against any harm from food from genetically engineered organisms. H.R.6637, to give protection to farmers and ranchers that may be harmed by genetically engineered organisms. H.R.6670, to take certain actions to increase access to various fuels and lower energy prices. H.R.6709, to enhance U.S. path toward energy independence. H.R.6899, to reduce U.S. dependency on oil via clean and renewable, alternative fuels. S.3485, to increase number of automobiles capable of using higher-level blends of renewable fuels. H.R.2129, to protect consumers from price-gouging of gasoline and other fuels. H.R.2263, to amend the Clean Air Act to waive lifecycle greenhouse gas emission reduction requirements. H.R.2454, to create clean energy jobs, achieve energy independence, and other purposes. H.R.2846, to increase energy independence and job creation, and other purposes. H.R.2880, to establish a carbon incentive program for greenhouse gas emissions reductions on farm land. H.R.2895, to amend 1978 Public Utility Regulatory Policies Act, to promote energy independence and other. H.R.2998, to create clean energy jobs, achieve energy independence, and other purposes. S.787, to amend Federal Water Pollution Control Act to clarify U.S. jurisdiction over U.S. water. S.828, to amend 2005 Energy Policy Act to provide loan guarantees for renewable fuel pipeline projects. S.943, to amend Clean Air Act to allow waiver of lifecycle greenhouse gas emission reduction requirements. S.949, to amend 2005 Energy Policy Act to improve energy loan guarantee program. S.1095, to amend Clean Air Act to convert renewable fuel standard into low-carbon fuel standard. S.1148, to amend Clean Air Act relating to renewable fuel program. H.R.3136, to extend grant program for energy property in lieu of tax credits. S.1576, to establish a carbon incentives program. S.1666, to require EPA to satisfy conditions before granting ethanol blend waivers. S.AMDT.2521, to clarify agriculture secretarys authority on coordination of biobased product activities. Issues other than legislation: Environmental/Superfund Implications of global warming treaty. Biotechnology and genetically modified organisms. Conservation Incentives. National energy policy. Renewable energy. Regulation of Concentrated Animal Feeding Operations and Animal Feeding Operations. Water resource issues. Agricultural chemicals. Fuel storage. Endangered species. Fisheries management, 55489=Agriculture/food-related provisions of: H.R.1660, amends Immigration and Nationality Act on H-2A nonimmigrants working in dairy, sheepherding. S.1038, to improve agricultural job opportunities for aliens in the U.S. and for other purposes. Issues other than legislation: Seasonal immigration worker programs specific to agriculture., 24189=Agriculture/food-related provisions of: H.CON.RES.85, sets forth the budget for fiscal year 2010. H.R.1, provides economic stimulus measures. S.384, to provide aid to countries to promote food security and to stimulate rural economies. H.R.2436, to make 2009 supplemental appropriations and for other purposes. H.R.2997, to make 2010 agriculture and other appropriations. H.R.3077, to authorize 2010-2014 appropriations to provide foreign food security assistance, other purposes. S.1054, to make 2009 supplemental appropriations. S.1406, to make an agriculture appropriation. Issues other than legislation: Emergency economic assistance for farmers and ranchers Funding for USDA programs Appropriations and budget requests for USDA/other agencies with an ag-related mission or responsibility., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 75736=Agriculture/food-related provisions of: H.R.188, to lift the trade embargo on Cuba and for other purposes. S.337, to prohibit meat and livestock imports from Argentina until it's certified free of foot and mouth disease. H.R.2039, to clarify applicability of the Buy American Act to products bought for legislative branch use. H.R.2272, to lift trade embargo on Cuba. Issues other than legislation: Trade (domestic/foreign) Agricultural trade issues for the World Trade Organization. Revisions to U.S. sanctions policy. Export licensing requirements for agricultural sales. Implementation of Trade Adjustment Assistance to agricultural producers. Impact of domestic agricultural policy on trade agreements. Inclusion of labor and environmental standards in agricultural trade negotiations. International food assistance. Mechanisms to address impact of exchange rate fluctuations on trade. Implementation of Byrd Amendment. Agricultural imports. Harmonization of environmental regulations. Bilateral and regional trade negotiations and agreements., 12286=Agriculture/food-related provisions of: H.R.503, to amend title 18, U.S. Code, to prohibit certain conduct in human consumption of horses. H.R.800, to amend 2008 Food, Conservation and Energy Act regarding vegetable/fruit production, processing. H.R.977, to amend Commodity Exchange Act to bring greater transparency and accountability to markets. H.R.1609, to amend 1985 Food Security Act to require income verification for persons getting USDA benefits. S.221, to amend Commodity Exchange Act to require energy commodities be traded only on regulated markets. S.272, to amend Commodity Exchange Act to ensure commodity transactions be on regulated markets. S.447, to amend Commodity Exchange Act to prevent excessive speculation for farm, energy commodities. S.460, amends 1946 Ag Marketing Act to help packer competition, transparency S.527, amends Clean Air Act to prohibit certain permits for agriculture production emissions. H.RES.317, to recognize Kansas-Missouri region as the Kansas City Animal Health Corridor. H.RES.507, supporting the goals of National Dairy Month. H.R.2448, to regulate energy commodities on futures markets and other purposes. H.R.2869, to prevent manipulation of energy markets. S. RES.174, to recognize Kansas-Missouri region as the Kansas City Animal Health Corridor. S.889, to amend the Agricultural Adjustment Act to determine milk prices. S.931, to amend title 9 of USC regarding arbitration. S.1062, to amend the Beef Research and Information Act to allow U.S. born-and-raised beef promotion. S.1086, to amend 1921 Packers and Stockyards Act, to prohibit use of certain anti-competitive contracts. S.1225, to prevent energy market manipulation. S.1330, to amend the 2008 Food, Conservation and Energy Act to increase certain milk program payments. S.1331, to amend the 2008 Food, Conservation and Energy Act to index for inflation certain milk payments. S.1375, to amend the 1987 Agricultural Credit Act to reauthorize state mediation programs. H.R.3166, to amend 2008 Food, Conservation and energy Act to index for inflation milk payment rates. H.R.3322, to respond to over-supply of milk. H.R.3674, to impose tariff-rate quotas on certain casein and milk protein concentrates. S.1398, to amend 2008 Food Conservation and Energy Act to raise payment rate for some milk. S.1412, to amend Commodity Exchange Act, clarifying treatment of some commodity futures contract buys. S.1645, to amend the Agricultural Adjustment Act regarding milk prices. S.1650, to amend the Richard B. Russell National School Lunch Act to improve healthful food purchases. S.1682, to provide the Commodity Futures Trading Commission with clear antimarket manipulation authority. Issues other than legislation: Farm Service Agency personnel levels. USDA agricultural credit availability. Reform of the Federal Milk Marketing Order. Establishment of a farmer-owned grain reserve. Distribution of farm program benefits. Expansion and improvement of Federal Crop Insurance programs. Review of Packers and Stockyards Act effectiveness in enhancing competitive practices in the livestock industry. Mandatory livestock price reporting. Contract production of agricultural commodities. Long-term domestic agricultural policy. Commodity loan rate adjustments. Facility loan programs for commodity storage. Natural disaster assistance for farmers and ranchers. Regulations of the agriculture futures industry. Farm bill implementation. Indemnity payments to dairy producers. Agricultural conservation programs. Funding and implementation of rural development programs. Funding for farmer-owned cooperatives. Balancing supply and demand. Natural resources. Real estate, land use, public lands, conservation. Small business. Agroterrorism. Grain standards, reauthorization., 66751=Agriculture/food-related provisions of: H.R.435, to amend the 1986 Internal Revenue Code to extend credit on renewable energy-produced electricity. H.R.451, to amend the 1986 Internal Revenue Code to extend credit on renewable energy-produced electricity. H.R.1743, to amend the 1986 Internal Revenue Code to extend credit on renewable energy-produced electricity. H.R.1337, to amend 1986 Internal Revenue Code to reduce carbon dioxide in the U.S. domestic energy supply. H.R.2037, to amend 1986 Internal Revenue Code to provide exception to renewable energy credit. H.R.1637, to amend the 1986 Internal Revenue Code to improve energy-related tax provisions. H.R.1639, to amend the 1986 Internal Revenue Code to improve energy-related tax provisions. S.1589, to amend the 1986 Internal Revenue Code regarding biodiesel production incentives. Issues other than legislation: Targeted tax reductions. Tax exemption for farmland sold with residence. Tax credits for state and local property taxes. Federal estate tax reform. Tax deductibility of insurance premiums., 42432=Agriculture/food-related provisions of: H.R.800, to amend 2008 Food, Conservation and Energy Act for farming of fruits/vegetables for processing. H.R.814, to amend acts to improve safety of food, meat and poultry products through enhanced traceability. H.R.875, to create the Food Safety Administration within the Health and Human Services Department. H.R.907, amends 1986 Internal Revenue Code, to provide for a livestock energy investment credit. H.R.977, to amend Commodity Exchange Act to bring greater transparency, accountability to markets. H.R.1332, to amend Federal Food, Drug and Cosmetic Act with respect to food safety. S.245, to amend Federal Food, Drug and Cosmetic Act and other acts to improve food safety. S.666, to restrict labeling on products containing dry ultra-filtered milk products, MPCs or casein. H.R.1869, to set a White House Conference on Food and Nutrition. H.R.2297, to set a White House Conference on Food and Nutrition. H.R.2426, to amend Federal Food, Drug and Cosmetic Act to extend food labeling requirements. H.R.2795, to address global hunger and improve food security. H.R. 2817, to address global hunger and improve food security. S.934, to amend 1966 Child Nutrition Act to improve school nutrition. S. 982, to give tobacco regulation authority to Food and Drug Administration. S.1343, to amend Richard B. Russell National School Lunch Act to improve lunch and breakfast programs. S.1477, to establish a user fee for follow-up reinspections under the Federal Food, Drug and Cosmetic Act. S.1480, to amend the 1966 Child Nutrition Act to improve childrens health and education. S.1527, to amend the Federal Meat Inspection and Poultry Products Inspection Acts. S.1693, to amend the Richard B. Russell National School Lunch Act to improved school meal safety. Issues other than legislation: Implementation of country-of-origin labeling program. Establishment of national organic food and food production standards. Food Safety. Implementation of the Food Quality Protection Act. Domestic Food Assistance and hunger. Food stamps and domestic Nutrition Programs.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  LINDA D. KENDALL  2023143105  lkendall@nfudc.org 5. Senate ID#  14187-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}