{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are campus security. It is a safe campus and I never felt in danger, while I was there. Again, I am an online student that lives in Moore, Oklahoma.",
            "I am not quite sure of all of this. What I do know is Iowa Western has many clubs and activities that students can be involved in- I have heard nothing but good things about fellow classmates and friends that are involved in them.",
            "ANY students should go to Iowa Western. They offer a variety of Online classes and classes in class. All of which will help any type of student for the way they learn- especially with the flexibility IWCC offers.",
            "The campus is by the city, but in a quiet setting. The school is surrounded by school off of a busy street. It is a perfect place for quiet studying. There are trees, waterfalls, and so many different things to be around that isn't normal- at least I don't think it is.",
            "I am an online student in Moore, Oklahoma. I was involved in the Moore, Oklahoma tornado in 2013. With that said, it was a devastation in Moore that everything was hit, including all houses within a mile of my house. Altogether, during the time I was cleaning up and transitioning into a new home and rebuilding my city and home- Iowa Western professors and other employees at IWCC were flexible with me and helped me complete my classes in a orderly manor. No, they did not give me special treatment- but they did give me forgiveness. When the tornado happened they were truly understandable and gave me an extent on a the assignments that were due for that week and the next week. They are truly encouraging and did nothing but encourage me to try my best and they easily tested my knowledge.",
            "Iowa isn't a fun state, but there are a couple different things you are able to do at Iowa Western. They have sports games you can watch, a couple miles away is one of the towns in Council bluffs that has many things to do- including the mall.",
            "When I went on my college visit, I was able to eat some of their food and it is not bad. Of course it may not have been as good as Raising Canes, Taco bell or Mcdonald's; but the food they provide is nothing bad. At least nothing compared to cafeteria food in high school.",
            "My sister attended Iowa Western, on campus. I visited the campuses and the dorms and they are extremely nice and taken care of. The students that live in them also have respect for other classmates and their privacy.",
            "I am an online student, but this school has constantly been giving me the education and opportunities that fit my needs. Iowa Western has tested my brain and helped me learn more than any school I have been too. My father was military, which shows that I have attended many schools- Iowa Western has been the best so far!",
            "Prospective Students: If you are a prospective student, make sure that you have decided your major and the plan that you are taking for your course. Also, make sure that you ask as many questions possible when applying: what will transfer to and from the school, what classes they offer for your major online or in class, etc.",
            "Iowa Western Community college is an incredible school. They have given me nothing but opportunities since I started attending school at Iowa Western. This school is flexible, professional and an environment I would encourage any college student to be in."
        ]
    ],
    "pageTitle": "Iowa Western Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Iowa-Western-Community-College/reviews?_escaped_fragment_=/show/47402",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895999475,
    "recordOffset": 895972678,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110856=© 2015, Cappex.com, LLC, 94087=It is not to bad, but recently within the last two years the food has been under cooked/Raw. Cold French Fires, and weird Drinks that smell like Rodent/Skunk Spray.(Drink the Fountain drinks(Coke/Pepsi Products). Pizza that tastes like Rubber. that was spring of 2013 - spring of 2014' the fall of 2014 was better but the drinks were still bad. still go for the Fountain Drinks(Pepsi/Coke) at least the fruit is good. fruit bowl and physical fruit., 86423=I am an online student in Moore, Oklahoma. I was involved in the Moore, Oklahoma tornado in 2013. With that said, it was a devastation in Moore that everything was hit, including all houses within a mile of my house. Altogether, during the time I was cleaning up and transitioning into a new home and rebuilding my city and home- Iowa Western professors and other employees at IWCC were flexible with me and helped me complete my classes in a orderly manor. No, they did not give me special treatment- but they did give me forgiveness. When the tornado happened they were truly understandable and gave me an extent on a the assignments that were due for that week and the next week. They are truly encouraging and did nothing but encourage me to try my best and they easily tested my knowledge.}",
    "textBeforeTable": "10/08/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 29 Val from a small town in Iowa Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Categories Comments Great for these types of students Any student looking to further their education. Tips for prospective students If you don't like your major, it wont hurt you to change it. Don't be afraid to try something new that interests you. Am enjoying being here Great facilities, Nice Staff, Gorgeous Campus Login to rate or flag the reviews Adult Student from rural Iowa 03/20/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 4 of 29 Categories Comments Bang for the buck Yes, per credit hour is much less than a four year university and you can transfer a lot of the credit hours. What to do for fun I do not live on campus. Food and Dining",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}