{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of things to do for fun on campus. There's Devil's Den at 10pm (every Friday) where CAN members organize activities for students to participate in at the student center and receive free stuff, basketball and football games, and plenty other free things to do on campus.",
            "The food is pretty good at CCSU. There were times when the food was bland or not cooked to my liking but I still enjoyed the dining experience.",
            "Dorm life at CCSU is very interesting. You'd be surprised at the kind of things you see in your dorm, as well as the people you meet. But regardless of it all, the experience is amazing and you will never forget it.",
            "Very good.",
            "Do not let yourself get distracted from your academics! There are plenty of distractions on campus but you have to learn how to focus on your assignments and maintaining a satisfactory GPA before ANYTHING.",
            "Central Connecticut State University is a wonderful university. It has beautiful landscaping, the friends I made on campus have great personalities, and the staff are friendly and helpful. I enjoyed my first year on campus and I am looking forward to my remaining years as a student here."
        ]
    ],
    "pageTitle": "Central Connecticut State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Central-Connecticut-State-University/reviews?_escaped_fragment_=/show/77154",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917504635,
    "recordOffset": 917441004,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{299907=The classes that I took were not as hard as I thought they would be. My friends and I during spring 2015 all took College writing but had different professors. My professor assigned only three essays all semester and for finals we could redo all three to hand in. My friends however had six essays due all year, were not allowed to redo them, and had a final exam which was an essay. So the academics and rigor truly depends on what teacher you choose. Another examples is in fall 2014 My math teacher assigned homework but never looked at it or checked it so nobody did the homework. For that class I got a C-. In spring 2015 my professor assigned a quiz every class so if you missed a class you failed a quiz. And all of the quizzes were based on the homework so you had to do the homework to pass. For that class I ended with an A-. So even though there are easy going professors in the school and the academic rigor depends on each individual professor, I would choose the professor who is in fact harder., 15559=Since CCSU is a state school, the price is very low compared to the expensive private schools most high school students strive for. Last year around March 2010, I was planning on going to a private school. After getting the financial report of $35,000 a year including all of the financial aid I received, I decided that going to a state school would be much more affordable. Looking back on my first year of college, I am no where near in debt because my scholarships went a long way. Not only is the school inexpensive, the bookstore runs a program where you can rent books for half of what the price would be. It only cost me about $250 last semester for books for 6 classes., 17053=Central is, in my opinion, one of the best schools in the state. I have learned so much from all of the wonderful teachers. Majoring in elementary education studying biology, I have begun to take classes pertaining to my specific major. In the spring 2011 semester, I took a child psychology class learning how young minds develop and how his/her environment is crucial to cognitive development. Overall, I have learned a lot in each of my classes and I feel like I am extremely challenged., 188870=There is a programming board on campus called Central Activities Network that I am actually a part of. We offer weekend as well as weekday programs. We have comedians, trips to new york, lectures, music and all other kinds of events. We have had artists such as LMFAO, Big Sean, and this year Kendrick Lamar come for our spring concert. Other clubs and departments have their own events in addition so there is almost always something going on., 304351=© 2015, Cappex.com, LLC, 264293=Make sure to fill out the FAFSA before april or else you can become ineligible to receive grants based on academia. The school has numerous scholarships so please take the time to apply. Last, buy college books online because they are much cheaper through the internet than at the bookstore., 206535=Unlimited food for roughly $2000 a semester. It can be easily worth it if you make it worth it. The food is average, sometimes it is better than others., 247703=I rate this 5 stars because recently, on November 4th to be specific, we had our first college lock down. It was shown on national news and I know I could not have done a better job myself if I were the law enforcement officials. Everyone who was involved in protecting the college students and the college's faculty did a fantastic job. Our campus security was all over this and it's thanks to them that other law enforcement officials were notified.}",
    "textBeforeTable": "01/27/2010 Reviewer is A current student here. 7 out of 9 people found this review useful. 1 of 66 Jessica from South Windsor, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. Central Connecticut State University Reviews Central Connecticut State University › Connecticut › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Danielle from New Milford, CT 01/19/2010 Reviewer is A current student here. 4 out of 5 people found this review useful. 2 of 66 Categories Comments Great for these types of students CCSU is great for people who want to work on the weekends and make money. Tips for prospective students Know full well beforehand that the weekends are dead on the weekends, so if you are looking for a party school, Central is not for you. I would suggest joining a club or team to get to know people on campus. I, personally, do not mind the commuters because I am friends with a lot of the athletes who always stay the weekends. Bang for the buck Definitely worth the money, especially if it's in-state tuition Am enjoying being here I am enjoying my experience here. Central is a good size school, so there are familiar faces, but you also are able to meet new people constantly. The only",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}