{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Moderately Cold",
            "Pleasant",
            "Pleasant",
            "Very Hot",
            "Pleasant",
            "Rainy",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Moderately Cold",
            "Moderately Cold"
        ],
        [
            "Details",
            "January offers moderately cold climate. Days are warm and pleasant but nights experience a slight drop in temperature. Favorable month for enjoying sightseeing and taking up package for honeymoon. Make sure to carry some light warm clothes.",
            "The climate in this month is comfortably cold making it ideal for tourist visits. Days are pleasing while temperatures slightly dip down during nights. It is a great month for sightseeing and outdoor activities. Recommended to carry some light warm clothes during your trip.",
            "Summer begins from this month. The climate is mild and is comfortable for taking up tourist visits. Sightseeing, outdoor trips and adventure activities such as hiking and trekking can be enjoyed in this month.",
            "Summer in Lonavala is mild that makes it suitable for tourism. Days are quite pleasing during April month. This time is favorable enjoying all kinds of tourist activities. Light cotton clothes are preferable for summer months.",
            "May offers quite hot climate with an average maximum temperature of 37 °C. Warmest month of the year and it may not be a preferable time to visit or take up holiday package for Lonavala in this month. Protective sun gear and cotton clothes are recommended if you are planning for visits.",
            "Beginning month of monsoon season offering occasional showers. The climate is cool and Lonavala becomes very attractive in rain. It is a favorable time for enjoying waterfalls, and the scenic beauty of the place.",
            "This month receives heavy rainfall. The atmosphere is cool due to rains. It is a great month for nature enthusiast. The place becomes truly alive with lots of greenery all around. Dams are full and the gushing waterfalls during this month are worth enjoying. Carrying rain gear is recommended for monsoon months.",
            "Monsoon continues offering lots of rains in this month. Temperatures dip down to comfortable range. Cool climate during this month makes it a favorable time for tourist visits. The natural greenery and the gushing waterfalls can be best enjoyed during monsoon. One can easily take up Lonavala tour packages from Mumbai and can enjoy the best of nature during monsoon months.",
            "Due to rain the weather becomes cool and pleasing. The lush green meadows, the cascading waterfall and the natural beauty of the place are truly enjoyable during this month. Make sure you carry proper rain gear.",
            "It is one of the most favorable months for visiting Lonavala. The climate is very pleasing which makes it perfect for sightseeing and outdoor activities. It is a great time for indulging in adventure activities such as hiking and trekking.",
            "November has moderately cold weather. Daytime is pleasing with good amount of sunshine. Temperature slightly drops down during nights. It is an excellent time for holidaying in Lonavala. Sightseeing, outings and adventure activities like trekking and hiking can be best enjoyed in this month. It is recommended to carry some light warm clothes for your trip.",
            "Climate during December is comfortably cold. Days are cool and pleasing while temperature drops down during nights. It is a good month for honeymoon trip. You can enjoy sightseeing and adventure sports like hiking and trekking during this month. Make sure you carry some light warm clothes."
        ]
    ],
    "pageTitle": "LONAVALA Weather, Temperature, Best Season, Lonavala Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Lonavala-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 600034927,
    "recordOffset": 600005526,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lonavala Weather Home  ›  Destinations  ›  Maharashtra  ›  Lonavala  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - May Summer 22 to 40Â°C, Winter 12 to 33Â°C Best Season / Best time to visit Lonavala Lonavala has a moderate climate with warm summers. Best Season to visit Lonavala is all through the year, except perhaps May. Winters (November to February) are pleasant with a minimum temperature of 12°C and a maximum of 36°C. It is excellent for all tourist activities and honeymoon in Lonavala. Summers (March to May) are hot and the temperature rises up to 41°C. May is the warmest month and most people avoid visiting this place during May. Monsoons (June to September) have medium rainfall. The hill station looks very attractive in rains. October to March is ideal for sightseeing. April is bit warm, but suitable for outings. June to September offers grandeur views of natural beauty of Lonavala in showers. Book Lonavala tour package in these months if you are great nature enthusiast and want to enjoy the best of nature and the majestic beauty of waterfalls.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}