{
    "relation": [
        [
            "",
            "ODIs",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "2",
            "181",
            "246",
            "9"
        ],
        [
            "Inns",
            "2",
            "",
            "",
            "6"
        ],
        [
            "Balls",
            "90",
            "12748",
            "8477",
            "126"
        ],
        [
            "Runs",
            "60",
            "6038",
            "6832",
            "171"
        ],
        [
            "Wkts",
            "3",
            "136",
            "206",
            "5"
        ],
        [
            "BBI",
            "3/40",
            "5/20",
            "4/25",
            "2/36"
        ],
        [
            "BBM",
            "3/40",
            "",
            "4/25",
            "2/36"
        ],
        [
            "Ave",
            "20.00",
            "44.39",
            "33.16",
            "34.20"
        ],
        [
            "Econ",
            "4.00",
            "2.84",
            "4.83",
            "8.14"
        ],
        [
            "SR",
            "30.0",
            "93.7",
            "41.1",
            "25.2"
        ],
        [
            "4w",
            "0",
            "",
            "4",
            "0"
        ],
        [
            "5w",
            "0",
            "1",
            "0",
            "0"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Paul Grayson | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2013/content/player/13437.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417451631,
    "recordOffset": 417415369,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34268=Born March 31, 1971, Ripon, Yorkshire, 56478=After an extensive change of personnel during the winter of 2001-02, Grayson was appointed vice-captain of Essex and, while his season was disrupted to an extent by injury, he was at the helm at a crucial time. With Ronnie Irani away on international duty, Grayson was in charge when Essex won the Division Two title in the County Championship and gained promotion in the National League as well, but injury has continued to restrict his appearances and at the end of the 2005 summer decided to retire from first-class cricket., 60071=Apr 5, 2013, 54225=Paul Grayson was as surprised as anybody when he was called up to the England squad for the ICC KnockOut tournament in Kenya in October 2000. He had been on the verge of quitting cricket and starting work at a brewery in Romford when the call came. He played just one game in that competition, England's quarter-final defeat against South Africa at Nairobi. It was an ignominious international debut; he made a golden duck and although his five overs were tidy enough, he failed to take a wicket., 72240=New Zealand women's coach Haidee Tiffen on her mentoring philosophy, winning the 2000 World Cup final, and retiring young, 55943=Unoriginally nicknamed Larry, Grayson scored 1,000 runs for the first time in 1994 and was named the club's player of the year, but Yorkshire released him at the end of the following season. He moved south to Essex in 1996, and was awarded his county cap that same year. His allround abilities have proved useful for in first-class cricket, but his skills have mainly come to the fore in the limited-overs version, where he is renowned for tying up opposing batsmen at the end of the innings., 60701=Mar 31, 2004, 54827=Although his one-day batting in 2001 failed to reach the heights of his first-class efforts, Grayson was recalled for the England one-day squad to tour Zimbabwe in autumn 2001. He had limited opportunity there, appearing in just the fourth one-day international where he bowled well enough to take 3 for 40. However his batting is more suited to the longer version of the game, and he missed the opportunity to establish himself in the team, losing out to the off-spinner and specialist one-day lower order batsman, Jeremy Snape., 61273=May 8, 2002, 55399=A Yorkshireman, Grayson made his debut for his native county in 1990, having already played for England Young Cricketers in 1989 and toured with them in Australia in 1989-90. He also represented the Young Cricketers against Pakistan in 1990. The slow left-arm bowler and right-hand bat had plumped for cricket despite boasting considerable football skills. At 16 he had been offered apprentice terms by Middlesbrough but turned them down. His elder brother Simon played regularly for Blackburn Rovers., 75257=4391 runs after 35, and 2354 outside top five, 71770=The Cricket Monthly: Few Sri Lankans have been as widely adored. None has so painstakingly chiselled his way to greatness TCM August issue}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "0 1 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 ODIs 2 2 90 60 3 3/40 3/40 20.00 4.00 30.0 0 0 0 First-class 181 12748 6038 136 5/20 44.39 2.84 93.7 1 0 List A 246 8477 6832 206 4/25 4/25 33.16 4.83 41.1 4 0 0 Twenty20 9 6 126 171 5 2/36 2/36 34.20 8.14 25.2 0 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}