{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Open minded Divers Anyone who wants to go beyond the limiting majors.",
            "Yurt: campus radio station, student organized.",
            "Their are a hundred of different Student Groups. Ultimate, Circus, Sports... if students like the outdoors and sports. There are also groups for people who are interested in comics, films, books... We also have the opportunity of the four other colleges, as they host student groups and events open to college students from the area.",
            "Their new food provider is great. We have a large variety of choices: salad bar, sandwich bar, continental breakfast all day long, multitude of drinks... Their is also homemade food, aimed for comfort. A lot of the food is from the Farm, locally produced. All the vegetables are fresh and organic.",
            "It all depends on where you are. Merrill dorm life is Substance-free and may be the quietest of the dorms. Dakin are dorms for students who value social life and like being very open with their hallmates.",
            "The professors highly value participation.While being friendly, they want students to be involved and are very rigorous in evaluations.",
            "You don't have to know exactly what you want to become yet. Hampshire College lets you experience everything you want, while orienting you towards the best in the job market.",
            "A place where you dont' limit yourself to a major. We can look beyond, have great opportunities and a wide variety of classes in the five colleges. It is also a small community where the individual can become who they are meant to be."
        ]
    ],
    "pageTitle": "Hampshire College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hampshire-College/reviews?_escaped_fragment_=/show/79618",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907469423,
    "recordOffset": 907431150,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129761=© 2015, Cappex.com, LLC, 68141=There are lots of favorite spots in the woods - the Zen Garden, the Hampshire tree, the trampoline, etc. Hampshire Halloween and Spring Jam are big parties put on by the institution that happen in October and April, respectively.}",
    "textBeforeTable": "07/18/2009 Reviewer is A current student here. 12 out of 13 people found this review useful. 1 of 25 Eliza from Columbia, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students Your supplements are very important. No matter how awful your test scores are or your GPA if you can put together an intriguing essay you are in. Bang for the buck I feel like I am wasting away. The classes are not very challenging and the professors seem as enthused to be in class as I do. Class options are very limited and if you take a class at a 5 college it is very inconvenient. Am enjoying being here I feel like I am walking on egg shells every time I walk out of my room. If you do not enjoy doing drugs or smoking cigarettes in the gazebo finding friends is difficult and sometimes impossible. Being politically correct is the only way to get by at this school. The food at Saga (the cafeteria) is awful and the co-ed bathrooms take some getting use to. Hampshire is like a bubble. The public transportation is unreliable and getting anywhere but the school takes a while. Be prepared for a 4 hour trip to Target which by car would take 30 minutes. Am learning a lot Hampshire seems to be less about academics and more about self",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}