{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "UCPD is the second largest police force to the Vatican.",
            "Hilariously pathetic.",
            "Fantastic! Especially if you are a writer.",
            "Good night life, very relaxed drinking policies. Though if you're coming here for that reason, you've got the wrong school.",
            "But depends on the dorm. Very different feel in each.",
            "Don't join extra-curriculars for title purposes- you are not in high school any more. Be wary of how you present yourself on the internet before coming here, you will be judged. Don't feel the need to prove your intellectualism all the time, you'll come off as pompous. Safest assumption: everyone around you is smarter and more well-read then you. See this new modesty as an opportunity.",
            "UoC goes beyond its infamous tagline 'where fun comes to die'. Its actually enlightened fun, yet an ever-present intellectualism which isn't quite as overt as you might fear. It's certainly not a 'work hard then play hard culture', but rather a 'think hard and never stop playing'."
        ]
    ],
    "pageTitle": "University of Chicago (UChicago) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Chicago/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900965019,
    "recordOffset": 900882110,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87321=* Polar Bear Run - running naked across the quad during the coldest week of January. * Jumping into the lake on the first and last day of class., 347541=I am very excited to be applying to The University of Chicago as a freshman for the Class of 2020. This prestigious university provides numerous opportunities for its students and I love its diversity in student body and in student life. I am definitely thrilled in looking forward to the day that the admissions decisions are mailed out., 155057=When the admissions say they are holistic; they are holistic. Don't get caught up with your test scores and having the highest GPA. Those might help a little, but once you are in the range of a 2200 and in the top 10-15% of your class, you don't have much to worry about in that respect. Focus on your essays. Give yourself time and make sure to explore the school. Talk to admissions officers and have a strong interview. Your Uncommon essay will make the difference of how the admissions office perceives your character. It's hard. But never impossible., 352039=© 2015, Cappex.com, LLC, 278446=We occasionally have health code type issues, but all in all the food and dining is pretty good here. There are options for vegans, vegetarians, and people with allergy or faith restricted diets. There are 2 dining halls (as of 2013-14), a food court with national chains, and more coffee shops than you can imagine. There are also two small grocery store type markets on campus. Your meal plan will more than cover all your needs. And if you get tired of campus dining, there are plenty of restaurants in the area to choose from!, 257805=Scav- Every year, for one weekend, UChicago students participate in the world's largest scavenger hunt to try to finish a list of over 300 items. There are road trip elements where students have been taken to Iowa, Canada, and Tennessee; a Scav Olympics where students compete in multiple challenges over the course of one afternoon; and some items that are just bizarre, like creating a drink-dispensing piano, or converting a bus into a bowling alley. Kuviasungnerk- a week-long January festival where hundreds of students wake up at 5 a.m. every day to do calisthenics or sun salutations by Lake Michighan, literally saluting the sun as it rises. Humans vs. Zombies- A quarterly event where hundreds of students fight the zombie apocalypse. Hosted by the UChicago Zombie Readiness Taskforce, one student (the lead zombie) attempts to spread a human-flesh craving virus among other participating students. Humans defend themselves by shooting nerf darts at zombies. If you are a human, and you're tagged by a zombie, you will become one. Buildings are safe, but the outside is not. If you are able to complete the final mission at the end of the week, you will have survived the zombie apocalypse., 130211=I visited the school in April and it was an amazing experience! I was able to attend several overviews of different subjects and one especially I enjoyed was the economics one lectured by one of their Nobel Prize winners. The classes are small and in depth from what I experienced!}",
    "textBeforeTable": "09/06/2009 Reviewer is A current student here. 102 out of 103 people found this review useful. 1 of 76 Faisal from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Chicago Reviews University of Chicago › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students -Students who want an academic challenge. -Students who want a diverse college experience. -Students who are interested in research fields or in theoretical fields. -Students with a passion, who want to study with other students with a passion. -Students comfortable in a big city setting. Tips for prospective students -Visit campus before you decide to apply/accept. The atmosphere at UChicago is intimidating for some and invigorating for others. If you feel overwhelmed on a campus visit, this might not be the place for you. -Take the most time on the Uncommon Essay part of the application. That's your opportunity to show the admissions staff a side of yourself that isn't evident in letter grades and an extracurricular list. They want to see what makes you tick, not just what makes you better than every other applicant. -If you do decide to come here, look at all the student organizations, research opportunities, extracurricular activities, and so on. The college has a lot to offer, if you take the time to explore. Bang for the buck The only disadvantage of UChicago is that it's very expensive. The high academics and numerous opportunities provided are wonderful, and I feel they are worth the price, but $50,000+ per year is still an awful",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}