{
    "relation": [
        [
            "itch",
            "Ikças DYN",
            "Ikças DYN"
        ],
        [
            "I",
            "êti GEN/AFF",
            "ête GEN/ABS"
        ],
        [
            "my back",
            "oxnell ABS",
            "xnâ’oll LOC"
        ],
        [
            "MEANING",
            "‘Something is making my back itch me.’ Implies that the cause of the itching is an external unnamed agent.",
            "‘Something is itching me on my back.’ Switches the patient role to me as opposed to my back, and implies that the cause of the itching is an external unnamed agent."
        ]
    ],
    "pageTitle": "A Grammar of the Ithkuil Language - Chapter 4: Case Morphology",
    "title": "",
    "url": "http://www.ithkuil.net/04_case.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 521451047,
    "recordOffset": 521397774,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{185503=The CONVERSIVE case is marked by the Vc value -öu-. The CONVERSIVE is used in conjunction with hypothetical or potential contexts to identify a hypothetical exception to a potential outcome or an actual circumstance which alters or has altered a potential outcome. This translates two different ways into English. Where it indicates an exception to a hypothetical situation, it is translated by the conjunction ‘unless’ in verbal contexts, and by the preposition ‘without’ for nouns (note that ‘without’ in this sense does not correspond to its usual ABESSIVE usage in Sec. 4.5.23 above). If applied to a real or actual situation, it is translatable by such expressions as ‘but for,’ ‘if not for,’ ‘if it wasn’t for,’ or ‘if it wasn’t on account of.’ Example of usage: Without peace, this society is doomed; If not for the rain, we would have had a good time., 210838=The temporal cases deal with contexts relating to time. In many respects, Ithkuil analyzes time similarly to Western languages, particularly in the ability to spatially compartmentalize time as seen in such English phrases as ‘in 3 hours,’ ‘for 5 years,’ ‘day by day,’ and ‘per month,’ as well as in analyzing time as progressively linear using concepts such as ‘before,’ ‘after,’ ‘during,’ ‘until,’ and ‘ago.’ The fifteen temporal cases are the SIMULTANEITIVE, ASSESSIVE, CONCURSIVE, ACCESSIVE, DIFFUSIVE, PERIODIC, PROLAPSIVE, PRECURSIVE, POSTCURSIVE, ELAPSIVE, ALLAPSIVE, INTERPOLATIVE, EPISODIC, PROLIMITIVE, and LIMITATIVE. Following are explanations of the function and usage of each case. Actual Ithkuil examples of these cases in use are provided in Sec. 4.6.16., 12783=In Sentence (2b) however, Mary entertains the children, there is a subtle distinction. At first we might consider Mary an agent who initiates a change in the children (i.e., the fact that they become entertained). But, in fact, the act of entertainment is not one whose result (enjoyment by the audience) can be guaranteed by the party doing the entertaining. In fact, the result of the act of entertainment is not Mary’s to determine, but rather the children’s, based on whether they “feel” a sense of enjoyment at experiencing Mary’s act. And so, Mary is more like a patient here, not an agent, as she is undergoing a change in her state or behavior (she is performing an attempt to entertain) which she herself has chosen to initiate and undergo, yet the act has the potential to cause a resulting change in the children, the success of this motivation to be determined by the children, however, not Mary. Such a semantic role as Mary here is termed an ENABLER. And how do the children make the decision as to whether they are entertained or not (i.e., what is their semantic role?). Can the children deliberately or consciously choose to feel a sense of enjoyment, or are they not themselves unwilling “patients” to their own emotional reactions? In case grammar, a party such as the children who undergo an unwilled experience are termed EXPERIENCERS. Besides emotional reactions, such unwilled experiences include autonomic sensory perceptions (e.g., parties that see or hear because their eyes were open and pointed in a particular direction or who were within earshot of a sound), and autonomic bodily reactions or responses as well as proprioceptive sensations (e.g., coughing, sneezing, perspiring, feeling hot or cold, feeling pain, etc.)., 18946=The grammar of natural languages specifies the requirements of which arguments to a verb must be present for a sentence to be grammatical and which arguments are optional.  This is illustrated, for example, in the following English sentences (ungrammatical sentences are preceded by an asterisk): , 239459=Also: see Section 4.5.25 above regarding the use of the CORRELATIVE case in sentences involving spatial direction or orientation., 259670=©2004-2011 by John Quijada. You may copy or excerpt any portion of the contents of this website for private, individual, or personal use which is non-commercial in nature and not for purposes of profit. Otherwise, you may copy or excerpt brief portions of the contents of this website in published, web-accessible, or commercially distributed articles, papers or webpages for purposes of review, commentary or analysis, provided you give full attribution to the author and this website., 258387=For those who would like a copy of the Ithkuil Grammar in book form, it is now available!, 9421=The case structures of Western languages mark positional slot (i.e., grammatical relations) only, and have no overt way to indicate semantic role, thus providing no way of showing the intuitive causal relationship between sets of sentences like those above. In Ithkuil, however, the case of a noun is based on its underlying semantic role, not its syntactic position in the sentence relative to the verb. These semantic roles reflect a more fundamental or primary level of language irrespective of the surface case marking of nouns in other languages. Thus Ithkuil noun declension more accurately reflects the underlying semantic function of nouns in sentences. Consequently, the Western grammatical notions of “subject” and “object” have little meaning or applicability in Ithkuil grammar., 45057=Actual Ithkuil examples of these cases in use are provided in Section 4.3.12., 146806=The Associative cases refer to a large group of cases which modify a noun to show that it has some relationship to another, usually adjacent noun or that it functions in an adverbial relationship to a verb. Most of these cases correspond to relationships in which, in English translation, we find two nouns together in apposition or as a compound noun, as in cat box, schoolbook, peace march, mountain man, etc., or joined by the word ‘of’ in a non-possessive relationship, e.g., box of coins, dreams of youth, sounds of laughter, or as a modifier of a verbal phrase. Following are explanations of the function and usage of each case. Actual Ithkuil examples of the cases in use are given in Sec. 4.5.33 ., 119139=4.3.13 Using Case to Achieve “Middle Voice” Semantic Effects, 125031=It should be noted that Ithkuil provides an array of suffixes specifically designed to work in conjunction with nouns inflected into one of the Transrelative cases to significantly expand their ability to specify the exact nature of the causal relationships between participants to a verb in an Ithkuil sentence. These suffixes include the Consent CNS suffix, the Reason RSN suffix, the Expectation XPT suffix, the Deliberateness DLB suffix, the Enablement ENB suffix, the Agency/Intent AGN suffix, and the Impact IMP suffix. These affixes are detailed in Section 7.4.12 and discussed further in Section 10.1.2., 63708=The second function of the DERIVATIVE case is to identify the non-agential, unconscious or non-deliberate STIMULUS of an affective mental state, emotion, or autonomic sensory experience, as in The coffee smells good, I saw her today, She hates that boy, Victor coughed from the gas, We laughed at his jokes, That song makes me cry. Ithkuil grammar views the stimulus of an experiential state as having a similar role to that of an abstract circumstantial or situational cause (as in the above examples); this explains why the DERIVATIVE case serves to indicate both functions.}",
    "lastModified": "Thu, 04 Dec 2014 20:13:11 GMT",
    "textBeforeTable": "Use of the ABSOLUTIVE case with DYNAMIC function conveys the idea of an unnamed external agent that is causing the itching. Again, each of the above Ithkuil sentences could delete the affective patient “I/me” from the sentence to render equivalents to the English sentence ‘My back itches’ and ‘There’s itching on my back.’  ‘The itching I’m feeling is coming from my back.’  Conveys the sense of the back being the place of origin of the itch. oxnaell OGN êti GEN/AFF Kças STA ‘I itch on my back.’  Emphasizes the bodily location of the itch. xnâ’oll LOC êti GEN/AFF Kças STA          LISTEN  ‘My back itches me.’  This is grammatically acceptable and the most neutral or vague. oxnall OBL êti GEN/AFF Kças STA MEANING my back I itch -kç-  informal Pattern 1, Stem 1:  ‘itch’ -xn-  informal Pattern 2, Stem 1:  ‘back, dorsal bodily surface’ OGN  = ORIGINATIVE case Possible Ithkuil",
    "textAfterTable": "If we remove the personal reference adjunct ‘I/me’ from the above two sentences, the respective translations become ‘Something is itching my back’ and ‘Something itches on my back.’   4.3.13 Using Case to Achieve “Middle Voice” Semantic Effects English (among other languages) allows some of its verbs to operate both transitively (i.e., taking a direct object) as well as intransitively (i.e., without a direct object), where the object of the transitive sentence becomes the subject of the intransitive sentence.  Furthermore, the intransitive sentence describes the same potential event as the transitive version does, except that no agent is expressed, the focus of the sentence being on the result, not the act which gives rise to the result.  Examples: The manager opened the store at 8 a.m. The store opened at 8 a.m. Robert flies the airplane beautifully. The airplane flies beautifully. The engineer increased the pressure. The pressure increased. I molded the soft clay easily. The soft clay molded easily. Note that the second sentence of each pair above is semantically distinct from its passive voice equivalent (i.e., The store was opened at 8 a.m., The airplane is flown beautifully, The pressure was increased, The soft clay was molded easily) in that passives allow for the agent to be overtly stated (using the preposition ‘by’ in English, as in The store was opened by the",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}