{
    "relation": [
        [
            "Part #",
            "SK 70 DT 16",
            "IPZ3036J21439070",
            "4232035110090255",
            "MXPCIII20311L1FI",
            "3027415V145A420M"
        ],
        [
            "Distributor",
            "Allied Electronics, Inc.",
            "Radwell",
            "Radwell",
            "Radwell",
            "Radwell"
        ],
        [
            "Manufacturer",
            "SEMIKRON INC",
            "Chromalox",
            "Chromalox",
            "Chromalox",
            "Control Concepts"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "THREE PHASE SCR BRIDGE RECTIFIER, 1600V, SEMITOP3",
            "THREE PHASE THREE-LEG ZERO FIRED SCR POWER CONTROL",
            "THREE PHASE TWO-LEG ZERO FIRED SCR POWER CONTROL P",
            "THREE PHASE SIX-SCR ZERO-CROSS FIRING SCR POWER PA",
            "SCR POWER CONTROLLER THREE PHASE ZERO-CROSS"
        ]
    ],
    "pageTitle": "Three Phase SCR | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/three_phase_scr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480344247,
    "recordOffset": 480317515,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17288=Description: Totally enclosed, permanent magnet DC gearmotors, performance matched for continuous duty service over a 60:1 speed range. All have constant torque throughout the range when powered by a full-wave unfiltered SCR-type adjustable speed control having a typical form factor of 1.3 to 1.4., 66868=Description: @ 230 VAC 7.5 - 1000 HP @ 460 VAC 10 - 1200 HP @ 575 VAC Features and benefits Easy to install — Two or three wire control, contactor style wiring, bypass contactor control, no separate overload required, use in ambients up to 140ºF Preset for quick and easy start-up without adjustments}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Hybrids ceramic substrate to efficiently conduct heat to the ambient. Common configurations include single- phase half-wave bridges that often contain a freewheeling diode for inductive loads, switches for single and three-phase ac switching applications, and SCR doubles for single and three-phase bridges More Information Top Indicates content that may require registration and/or purchase. Electrostatic Precipitation The fashion method is three phase SCR and switch mode. three phase bridge diode datasheets and application notes, data sheet, circuit, pdf, cross reference, pinout, datasheet | Datasheets.org.uk First line: SD-52 sd 50 diode 200 mA chips scr three phase scr module SD-50 diode CE420860 Three-Phase SCR/Diode Bridge Modules Amperes/800 Volts Abstract: .. Diode Modules datasheets and application notes, data sheet, circuit, pdf, cross reference, pinout, datasheet | Datasheets.org.uk First line: SD-52 sd 50",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}