{
    "relation": [
        [
            "Code",
            "ZAM",
            "ZIM"
        ],
        [
            "Ref",
            "[203]",
            "[204]"
        ],
        [
            "Nation (NOC)",
            "[[Image:Template:Country flag IOC alias ZAM|22x20px|border|Template:Country IOC alias ZAM]] [[wikipedia:Template:Country IOC alias ZAM at the Olympics|Template:Country IOC alias ZAM]]",
            "[[Image:Template:Country flag IOC alias ZIM|22x20px|border|Template:Country IOC alias ZIM]] [[wikipedia:Template:Country IOC alias ZIM at the Olympics|Template:Country IOC alias ZIM]]"
        ],
        [
            "Other codes used",
            "NRH (1964)",
            "RHO (1960–1972)"
        ]
    ],
    "pageTitle": "List of IOC country codes - Olympics Wiki - Summer and Winter Olympic Results, News, Photos, Blogs, Videos, Contests – a sports site that anyone and everyone can edit.",
    "title": "",
    "url": "http://olympics.wikia.com/wiki/List_of_IOC_country_codes?diff=prev&oldid=16205",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 172871239,
    "recordOffset": 172835185,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8399=The 1956 Winter Olympics and 1960 Summer Olympics were the first Games to feature Initials of Nations to refer to each NOC in the published official reports.[1] However, the codes used at the next few Games were often based on the host nation's language (e.g., GIA for Japan at the 1956 Winter Olympics and 1960 Summer Olympics, both held in Italy, from Italian Giappone) or based on the French name for the nation (e.g., COR for Korea, from Corée). By the 1972 Winter Olympics, most codes were standardized on the current usage, but several have changed in recent years. Additionally, the dissolution of the Soviet Union, division and unification of Germany, breakup of Yugoslavia, dissolution of Czechoslovakia, and several other instances of geographical renamingTemplate:Cn have all resulted in code changes.}",
    "textBeforeTable": "A A B C D E F G H I J K L M N O P Q R S T U V Y Z Contents: There are 204 current NOCs (National Olympic Committees) within the Olympic Movement. The following tables show the currently used code for each NOC and any different codes used in past Games, per the official reports from those Games. Some of the past code usage is further explained in the following sections. Codes used specifically for a Summer Games only or a Winter Games only, within the same year, are indicated by \"S\" and \"W\" respectively. Current NOCs In addition to this list of over 200 NOCs, the participation of National Paralympic Committees (NPCs) at the Paralympic Games requires standardised IOC codes. namely Macau and the Faroe Islands, coded MAC and FRO respectively.[2][3] The 1956 Winter Olympics and 1960 Summer Olympics were the first Games",
    "textAfterTable": "ALG [3] [[Image:Template:Country flag IOC alias ALG|22x20px|border|Template:Country IOC alias ALG]] [[wikipedia:Template:Country IOC alias ALG at the Olympics|Template:Country IOC alias ALG]] AGR (1964), AGL (1968 S) AND [4] [[Image:Template:Country flag IOC alias AND|22x20px|border|Template:Country IOC alias AND]] [[wikipedia:Template:Country IOC alias AND at the Olympics|Template:Country IOC alias AND]] ANG [5] [[Image:Template:Country flag IOC alias ANG|22x20px|border|Template:Country IOC alias ANG]] [[wikipedia:Template:Country IOC alias ANG at the Olympics|Template:Country IOC alias ANG]] ANT [6] [[Image:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}