{
    "relation": [
        [
            "Photo",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "3 Family Yard Sale",
            "THREE FAMILY YARD SALE, LINMONT, BARBOURSVILLE WV",
            "Yard sale - lavalette - friday and sat july 25,26",
            "Yard Sale Sat 7/18- 3416 Crane Ave (Altizer)",
            "Huge rummage sale",
            "Deals Pro Cleaning Services",
            "Garage Sale"
        ],
        [
            "Description",
            "3 Family Yard Sale-1606 Chestnut Street Kenova WV Friday 7/31 & Saturday 8/1 7:00am-2:00pm Women & Men Clothes, Maternity Clothes, Baby boy clothes (newborn-4T) Baby and Kid Toys,Home Décor, Lamps, Rugs, Kitchen Items, Jogging Stroller, Complete Baby Boy Forest theme Crib Bedding, Baby Items, Small Furniture-End tables, Chairs, Dining Room Table. We have something for everyone!! Come see us and you'll get a deal!! Everything priced to go!",
            "Three Family Yard Sale, Friday, July 24 at 74 Cedar Drive, Barboursville, WV, Linmont 8 A.M. to ??? Items including men's suits and clothing, bakeware, small appliances, kitchenware, furniture and lamps. Some plus size women's clothing, king size eyelet comforter w/pillow shams, pillows, lots of nice home decor items. Boy's youth size large clothing, books, and movies . Lots of miscellaneous items for sale, too numerous to mention! Stop by and look around!",
            "Yard sale - 76 north lynn oak drive lavalette near PO. Follow signs. Friday and saturday july 25 + 26. 9am -? Rugs, bathroom vanities, pedestal sink, clothes and much more.",
            "8:00am-3:00pm Saturday 7/18 3416 Crane Ave Huntington (Altizer) We've got way too much and it's time to make room. Don't miss out on some really good items that are gently used. -Baby, toddler and youth size clothing -Adult clothing -Baby, toddler and youth toys -Pool supplies and equipment including a pool pump and sand filter. Also have some pool chemicals -3 working Window AC units -Collectibles -Some scrap booking supplies -Large Humidifier All nice stuff. We just have too much of it!!",
            "1623 Campbell Drive. Huntington WV Off Norway across from middle school 9 am Saturday July 18 th Lots of everything!!",
            "Residential and commercial cleaning we do week Bi-weekly Monthly or one time cleanings free eat 304-544-9774",
            "Everything must go! Garage Sale August 1, 2016 from 8 am -3 pm and on August 3rd through the 5th from 8 am-3 pm. (No sale on the 2nd.) 1841 11th Ave, garage is Located in the back off Charleston Ave, so please come in through the back. Signs will be posted to help get you there. Everything is marked to go and all prices are negotiable! Dishes, Antique dinning room table with chairs, clothes, shoes, knick-knacks, toys, DVD's and VHS's, TV's, 2 toddler beds with mattresses, and more. Also have a \"2001 Hyundai Accent\" with one previous owner, has 144,696 miles. Automatic transmission, 4-cylinder, a/c, am/fm cassette player. This is an excellent running car that is extremely easy on gas. Has new alternator and new battery. It does need new brake pads and one of the tires needs to be sealed as it has a slow leak (currently has dummy tire on it, the original tire and matching hubcap are in the trunk. Has no other known problems. Asking $1500 O.B.O. Cash only, No Trades. Clean and clear title."
        ],
        [
            "City",
            "Kenova",
            "Barboursville",
            "Lavalette",
            "Huntington",
            "Huntington",
            "Barboursville",
            "Huntington"
        ],
        [
            "Price",
            "$0.00 USD",
            "$0.00 USD",
            "$0.00 USD",
            "$0.00 USD",
            "$0.00 USD",
            "$0.00 USD",
            "$0.00 USD"
        ]
    ],
    "pageTitle": "Garage/Yard Sales",
    "title": "",
    "url": "http://www.wsazclassifieds.com/index.php?a=5&b=213&page=1&c=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 850502063,
    "recordOffset": 850493861,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Newest Classifieds in Garage/Yard Sales Lowest Price Highest Price Title City   Sort By: Garage/Yard Sales Main Current Category: Twitter Facebook Login ) Register | Guest ( Welcome, All Fields title only description only All Categories Appliances Boats Celebrations Farm Equipment Furniture Garage/Yard Sales Household Items Jobs Musical Instruments Pets Sports Equipment Swap/Trade Tickets Tools/Machinery Transportation Wanted to Buy Antiques & Collectibles Books/Movies/DVD Computers /Office Equipment Crafts Electronics",
    "textAfterTable": "Contact Us Need assistance? Have a question that isn't answered in our help sections? You can contact support by visiting our contact us page. Home Sell Search Features Pricing Help How It Works Copyright © 2015 Gray Television Inc. All Rights Reserved. Use of this Web site constitutes acceptance of the Terms of Use and Privacy Policy.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}