{
    "relation": [
        [
            "Group #",
            "Group 1",
            "Group 2",
            "Group 3",
            "Group 4",
            "Group 5",
            "Group 6",
            "Group 7",
            "Group 8",
            "Group 9",
            "Group 10"
        ],
        [
            "No of bugs",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "20",
            "19",
            "18",
            "8"
        ],
        [
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query",
            "Query"
        ],
        [
            "IRC Nickname",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Status",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Contribute/Bugsquad/BugDays/KDEPimDay1 - KDE TechBase",
    "title": "",
    "url": "https://techbase.kde.org/index.php?title=Contribute/Bugsquad/BugDays/KDEPimDay1&oldid=33911",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881548923,
    "recordOffset": 881519615,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  Keep an eye on what the \"Version:\" fields say in Bugzilla. If it says \"unspecified\", it won't show up in developer's searches for 4.0 bugs! If the bug is not reproducable in KDE4, change the version field to match what the other one says, i.e. to match version the bug was first reported in. If the bug is reproducable, change the version field to the newest version of KDE that the bug is reproducable (be explicit as to what version of 4 you are using, mentioning whether it is a source build or which distro the packages come from). If you don't have bugzilla permissions to change the version field, mark it below that it needs version field change. Version field Prioritizing is good. If a major website doesn't work, that is important. Let's keep track of them. Is it a big bug? If something has no clear instructions on how to reproduce it, or has little useful information, add a comment asking the reporter for more detail. Then list it in the bugs awaiting feedback section. Be polite, we want to be nice to our bug reporters! Unclear Most importantly, we need to create testcases. These are time-consuming, but extremely useful and really help out developers. If",
    "textAfterTable": "Period of time / month No of bugs Query IRC Nickname Status REMOVE ME!!! 2008-03 - now 8 Query (Total bugs XXX) Kontact Bugs Group # No of bugs Query IRC Nickname Status Group 1 20 Query Group 2 20 Query Group 3 20 Query Group 4 20 Query Group 5 20 Query Group 6 20 Query Group 7 20 Query Group 8 19 Query",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}