{
    "relation": [
        [
            "",
            "(a.) Primary Prevention of Stroke",
            "(b.) Prevention of Recurrence of Stroke",
            "(c.) History of Acute Chest Syndrome",
            "(d.) Renal Failure",
            "(e.) Congestive Heart Failure",
            "(f.) Pulmonary Hypertension",
            "(g.) Recurrent Debilitating Painful Episodes",
            "(h.) Nonhealing Leg Ulcers",
            "(i.) Prevention of Recurrence of Priapism",
            "(j.) Uncomplicated Pregnancy",
            "(k.) Other indications (please specify):"
        ],
        [
            "Always",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3"
        ],
        [
            "Sometimes",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Rarely",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Never",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Transfusion Practices in the Management of Sickle Cell Disease: A Survey of Florida Hematologists/Oncologists",
    "title": "",
    "url": "http://www.hindawi.com/journals/isrn/2012/524513/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 497541455,
    "recordOffset": 497508609,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{56718=1Division of Hematology/Oncology, Department of Pediatrics, University of Florida, Box 100296, Gainesville, FL 32610, USA 2Division of Hematology/Oncology, Department of Medicine, University of Florida, Box 100278, Gainesville, FL 32610, USA 3Department of Pharmaceutical Outcomes and Policy, University of Florida, Box 100496, Gainesville, FL 32610, USA, 19953=Phenotype matching and blood product selection are important aspects of transfusion management of patients with SCD. In a survey of 1182 North American laboratories, the majority did not determine the red cell antigen phenotype of nonalloimmunized SCD patients beyond ABO and D [17]. In the assessment of blood banks associated with institutions previously designated as Comprehensive Sickle Cell Centers, more than 90 percent of institutions provided C, E, and Kell routinely [13]. In this study, the majority of respondents did not routinely request phenotypically matched RBCs for SCD patients until the patient demonstrated a new antibody. Of note, pediatric practice respondents did request up-front matching more frequently than the adult-oriented practices. The majority of respondents used leukocyte reduced products, consistent with current recommendations [6, 11]. There was variability in the request of sickle negative products, which was consistent with previous survey results of the blood bank practices [17]. However, a survey of blood bank centers associated with previously designated Comprehensive Sickle Cell Centers revealed 66% of respondents always provided sickle cell trait-negative RBCs [13]. The indications for washed and irradiated RBC product are limited to specific situations such as previous anaphylactic transfusion reactions or bone marrow transplant recipients, respectively. The survey question was specifically indicated to address choices in an SCD patient who had not had a bone marrow transplant. Nevertheless, 15% of physicians responded they “always” request irradiated blood and 6% responded that they “always” request washed blood. This response rate is in contrast to the survey of blood banks, where irradiated and washed RBCs were rarely or never indicated by the majority of institutions [13]. The discrepancies found in this portion of the survey highlight specific provider issues, which can be addressed in providing appropriate blood products for SCD patients., 56308=Received 24 April 2012; Accepted 7 August 2012, 56123=Copyright © 2012 Levette N. Dunbar et al. This is an open access article distributed under the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited., 62650=Data were input and organized for evaluation in Access 2007. SAS Version 9.1 (SAS Institute Inc., Cary, NC, USA) statistical software was used for all statistical analyses. Frequencies and percentages were calculated for categorical data, with means and standard deviations calculated for numerical data. Chi-square and Fisher’s exact tests were used to test relationships between bivariate categorical data. Groups were compared using Mantel-Haenzel tests. values < 0.05 were considered significant., 55694=The purpose of this study was to characterize transfusion practices in the management of sickle cell disease and to identify factors attributing to differences in prescribing practices among Florida hematologists/oncologists. A cross-sectional study was performed in 2005-2006 utilizing a mail survey. The survey instrument addressed practice characteristics, sickle cell patient populations, transfusion settings, indications and techniques, red blood cell phenotype specifications/modifications, use of practice guidelines, and educational resource utilization. One hundred fifty two physicians (75% adult-oriented, 25% pediatric) completed the survey. Non-academic practice settings (78 %) were the primary location. Pediatric practices had a larger percentage of patients with overt strokes, and receiving hydroxyurea therapy than adult-oriented practices. The majority of survey respondents did not request limited phenotypically matched red blood cells on a routine basis. The majority of pediatric practices (60%) had individually defined transfusion practice guidelines in contrast to 8% of adult-oriented practices. There were statistically significant differences for pediatric and adult-oriented practices in managing certain acute and chronic transfusion indications. Analysis of clinical vignette data revealed variation among hematologists/oncologists in the transfusion management of common clinical scenarios. The study underscores the need for the development and dissemination of comprehensive sickle cell transfusion guidelines and protocols., 48834=The survey was mailed to hematologists/oncologists (H/Os) in the state of Florida from fall 2005 through spring 2006. A list of respondents was compiled from membership directories of the American Society of Hematology (ASH), the American Society of Clinical Oncology (ASCO), and the Florida Association of Pediatric Tumor Programs (FAPTP). Surveys were distributed to physicians in three sequential mailings, with telephone and email follow-up for nonresponders., 12332=There are limitations to this physician survey. As a result of nonresponse bias, the completed responses may not be a true representation of a larger sample. Although we attempted to specifically contact only H/Os prescribing transfusions to SCD patients, our sample size of 474 represents all physicians listed in the directories and not actually the number of H/Os managing SCD patients with transfusions. Generalization of the results is also limited by the fact that only one state was sampled and practice can vary by state and country based on perceived standard of care and available resources [26, 27]. This survey provided a cross-sectional evaluation of SCD transfusion practices during 2005-2006. The majority of results likely remain relevant to current practices. However, at the time of the survey, deferasirox was just undergoing Food and Drug Administration approval; therefore, deferoxamine was the only readily available iron chelating agent in the USA Followup surveys will be informative and necessary pertaining to chronic transfusion with the availability of an effective oral iron chelator. Our study indicates variability in the incorporation of literature-based approaches when comparing pediatric and adult-oriented practices. In addition, routine use of local transfusion guidelines and availability of exchange transfusion on an emergent basis were more widespread for pediatric providers. Interestingly, we also found more widespread use of HU therapy amongst pediatric providers.}",
    "TableContextTimeStampAfterTable": "{21841=The authors gratefully acknowledge the Perry A. Foote Health Outcomes Quantitative Core for providing statistical analysis. The project was supported by Award no. K30RR022258 from the National Center for Research Resources. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Center for Research Resources or the National Institute of Health. L. C. Brown received support from the Minority Student Award Program of the American Society of Hematology.}",
    "textBeforeTable": "(C-1) Which best describes the setting used for the nonemergent transfusion of SCD patients? (Circle ALL that apply)(a)Hospital as an inpatient(b)Day hospital (including 23 hour observation)(c)Hospital Oncology Infusion Center(d)Office Oncology Infusion Center(e)Other:______________________________(C-2) Does your practice site have defined criteria (e.g., guidelines) for the transfusion management of SCD patients? (1) YES (2) NO(C-3) Does your practice routinely request phenotypically matched RBC’s for sickle cell patients?(1)Yes, Extended/Complete Matching(2)Yes, Limited Matching (e.g., antigens C, E, Kell)(3)No, not until the patient makes an antibody(C-4) Please indicate how often each of the following RBC products is requested for a sickle cell patient who has not had a bone marrow transplant. C. Transfusion Practice (B-1) How many SCD patients do you currently have in your practice? (1) NONE (2) 1–5 (3) 6–10 (4) 11–15 (5) 16–20 (6) 21–50 (7) 51 or more(B-2) What is the average number of SCD patients you see in a month? (1) NONE (2) 1-2 (3) 3–5 (4) 6–10 (5) 11–15  (6) 16–20  (7) 20 or more(B-3) What",
    "textAfterTable": "3 2 1 0 (e.) Pre-operative for General Anesthesia 3 2 1 0 (f.) Vitreoretinal Surgery 3 2 1 0 (g.) Other Indications (please specify): 3 2 1 0 (C-7) For SCD patients, when do you consider the following as an indication for chronic transfusion?   Always Sometimes Rarely Never (a.) Primary Prevention of Stroke 3 2 1 0 (b.) Prevention of Recurrence of Stroke 3 2 1 0 (c.) History of Acute Chest Syndrome 3 2 1 0 (d.) Renal Failure 3 2 1 0 (e.) Congestive Heart Failure 3 2 1 0 (f.) Pulmonary Hypertension 3 2 1 0 (g.) Recurrent Debilitating Painful Episodes 3 2 1 0 (h.) Nonhealing Leg Ulcers 3 2 1 0 (i.) Prevention of Recurrence of Priapism 3 2 1 0 (j.) Uncomplicated Pregnancy 3 2 1 0 (k.) Other",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}