{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Education",
            "Primary",
            "Secondary",
            "Secondary",
            "Secondary",
            "Vocational",
            "Tertiary",
            "Tertiary",
            "Tertiary",
            "Tertiary"
        ],
        [
            "School/Level",
            "Escuela primaria",
            "Escuela Tecnologica/ Technical Secondary",
            "Secundaria Basica/ Basic Secondary",
            "Ciclo medio superior/preuniversitario/ Higher Intermediate Cycle",
            "Technical/Vocational",
            "Licenciatura",
            "Diplomado/ Maestria/ Especialista",
            "Candidato a Doctor en Ciencias",
            "Doctor en Ciencias"
        ],
        [
            "Grade From",
            "1",
            "",
            "7",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Grade To",
            "6",
            "",
            "9",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Age From",
            "6",
            "15",
            "12",
            "15",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Age To",
            "11",
            "18",
            "15",
            "18",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Years",
            "6",
            "3",
            "3",
            "3",
            "3",
            "4",
            "2",
            "4",
            ""
        ],
        [
            "Notes",
            "",
            "Secondary education is divided into basic secondary education and pre-university secondary education. At the end of basic secondary education, pupils can choose between pre-university education and technical and professional education. Those who complete pre-university education are awarded the Bachillerato. Technical training leads to two levels of qualification - skilled worker and middle-level technician.",
            "Secondary School Completion Diploma awarded",
            "Upper Secondary",
            "Technical/vocational studies are provided in Institutos superior politécnicos. Studies last for two-and-a-half to three years.",
            "The first and main stage of higher education usually lasts for four or five years. In Medicine, studies last for five or six years.. Courses that are offered to workers usually last longer than traditional courses. At the end of the first stage, students are awarded a Licenciatura or a Título profesional (professional diploma).",
            "University level second stage: Diplomado, Maestría, Especialista: Diplomado courses have three levels, each requiring some 200 hours of theoretical instruction, practical work, industrial internship and a final project. Students can gain academic credit towards completion of a Master's degree and are allowed to work on a Master's thesis as they progress through Diplomado studies. The second stage corresponds to a period of in-depth study and research which leads to the Maestría after two years.",
            "Three to four year programs lead to the Candidato a Doctor en Ciencias. This qualification is required for entry to studies for the Doctor en Ciencias.",
            "The Doctor en Ciencias is awarded following additional years of scientific research. The thesis has to be defended before a jury, and once approval is forthcoming."
        ]
    ],
    "pageTitle": "Cuba Education System",
    "title": "",
    "url": "http://www.classbase.com/Countries/Cuba/Education-System",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357951619,
    "recordOffset": 357943417,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Education System in Cuba Resources Universities Credentials Grading System Education System jQuery(function(){jQuery(\"#Menu\").kendoMenu({\"direction\":\"bottom\"});});",
    "textAfterTable": "Primary Education Cuban education was nationalized in 1959 at a time when less than half the children had access to education. Today the island has the highest literacy rate in the world, although schooling does come at a cost of loyalty to the state, and an obligation to do community service as well. The process begins with 6 years of primary education, during which time the \"3 R's\" of reading, riting and rhymetic are taught. Middle Education The purpose of the 3 years of middle education in Cuba is to provide a grounding in traditional school subjects like languages, technology and social science. Thereafter pupils choose to go on to secondary school, or switch to vocational training to prepare them for a practical career. Secondary Education The final 3 years of schooling at secondary level are an extension of middle school. This time though academic standards are tighter, and enthusiastic participation in school para-military parades a must. School holidays are spent doing one or other form of social service - the Cuban ethos is built on giving back. Those who complete are awarded a bachillerato certificate. Vocational Education A student who proceeds to vocational training following middle school may follow two streams. These are skilled worker courses, and programs that provide middle-level technicians. Graduates of the latter courses with good grades have the choice of going on to technological",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}