{
    "relation": [
        [
            "Name",
            "Unfuddle",
            "ProjectLocker",
            "Origo",
            "XP-Dev",
            "Beanstalk"
        ],
        [
            "Mb",
            "200",
            "500",
            "?",
            "200",
            "100"
        ],
        [
            "Projects",
            "1",
            "Unlimited",
            "?",
            "2",
            "?"
        ],
        [
            "Users",
            "2",
            "5",
            "?",
            "Unilimited",
            "3"
        ],
        [
            "Notes",
            "",
            "",
            "Origo is an OpenSource project in itself and provides both the product so you can host it yourself and online services. I couldn’t find any information on online limits though",
            "I used it once but found to my dismay they erased my account because of months of inactivity",
            ""
        ]
    ],
    "pageTitle": "A Java geek > Free online SVN repositories",
    "title": "",
    "url": "http://blog.frankel.ch/free-online-svn-repositories",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 26590865,
    "recordOffset": 26574904,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "This is my results table and it definitely not exhaustive: The number of user accounts you can create in order to access the SVN The number of projects you can store The amount of disk space available From what I’ve found, there aren’t so many free SVN repositories around. Since it’s free and provided as a courtesy (not mentioning a thought toward upgrading to priced services later), there are some limits. Criteria are mainly: This week, I searched for free online SVN repositories for closed-source projects. Of course, there are plenty of sites offering services for OpenSource projects: Google Code, SourceForge, etc. It may seem amazing, but everybody does not necessarily want to expose its code to the world. Go to comments Leave a comment Nicolas Frankel February 22nd, 2010 Free online SVN repositories Development > Free online SVN repositories Home > //]]> } } return false; if(searchtxt.value == \"\" || searchtxt.value == tiptext) { searchbtn.onclick = function(e) { } } searchtxt.value = tiptext; searchtxt.className += \" searchtip\"; if(searchtxt.value == \"\") { searchtxt.onblur = function(e) { }",
    "textAfterTable": "From a purely numerical point-of-view, and paying features aside, my pick will surely be ProjectLocker. This is not to say the others are bad but the free account has also some very interesting features: Unlimited Bandwidth Transfer SSL Encryption (very unusual for a free service) Redundant RAID storage and Nightly Backups I would definitely be interested in knowing what free Subversion provider do you use for your closed-source projects. Disclaimer: I haven’t had any contact from any person working from ProjectLocker. I’m not an employee of ProjectLocker. The following only reflects my unbiased opinion. email Digg Digg Send to Kindle",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}