{
    "relation": [
        [
            "Region",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Unit Identifier",
            "ID-CDC",
            "ID-GVC",
            "MT-BDC",
            "MT-BRC",
            "MT-BZC",
            "MT-DDC",
            "MT-GDC",
            "MT-HDC",
            "MT-KDC",
            "MT-KIC",
            "MT-LEC",
            "MT-MCC",
            "MT-MDC",
            "ND-NDC"
        ],
        [
            "Center Name",
            "Coeur d'Alene Interagency Dispatch Center",
            "Grangeville Interagency Dispatch Center",
            "Billings Dispatch Center",
            "Bitterroot Dispatch Center",
            "Bozeman Interagency Dispatch Center",
            "Dillon Dispatch Center",
            "Great Falls Dispatch Center",
            "Helena Interagency Dispatch Center",
            "Kootenai Interagency Dispatch Center",
            "Kalispell Interagency Dispatch Center",
            "Lewistown Interagency Dispatch Center",
            "Miles City Dispatch Center",
            "Missoula Interagency Dispatch Center",
            "North Dakota Dispatch Center"
        ],
        [
            "City",
            "Coeur d'Alene",
            "Grangeville",
            "Billings",
            "Hamilton",
            "Bozeman",
            "Dillon",
            "Great Falls",
            "Helena",
            "Libby",
            "Kalispell",
            "Lewistown",
            "Miles City",
            "Missoula",
            "Bismarck"
        ],
        [
            "State",
            "ID",
            "ID",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "MT",
            "ND"
        ]
    ],
    "pageTitle": "U.S. Forest Service - Business Operations",
    "title": "",
    "url": "http://www.fs.fed.us/business/incident/dispatchlookup.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457768187,
    "recordOffset": 457759985,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Northern Rockies Several centers are Geographic Area Coordination Centers (GACCs), as indicated by asterisks in the tables below. If you select a Host Dispatch Center that appears to be incongruent with your Vendor location, the Contracting Officer may request that you review your selection and possibly re-submit your offer. An example of how to find the Dispatch Center: if you are responding to a solicitation from Forest Service Region 5, California, you would first look at the Host Dispatch Centers that start with “CA,” and then select the Host Dispatch Center for the city from which you wish to be dispatched, say, Redding; the Dispatch Center Unit Identifier is CA-RICC. The lists are alphabetical by State and then by the Dispatch Center (i.e. AL-AIC, AR-AOC… WY-TDC). What you need to know about the Dispatch Center drop-down lists in the Formatta resource information forms and in the drop-down list in the vendor application: Make a note of the Unit Identifier, which you will use when you complete the appropriate resource information forms that are included in the solicitation package or when you submit a quote on a solicitation using the vendor application. From the list, select a Host Dispatch Center. Using the map above, click on the Region/Geographic Area that corresponds to the solicitation and is in the Geographic Area where you wish to submit an offer. To determine the appropriate Host Dispatch Center to use, do",
    "textAfterTable": "Rocky Mountain Region Region Unit Identifier Center Name City State 2 CO-CRC Craig Interagency Dispatch Center Craig CO 2 CO-DRC Durango Interagency Dispatch Center Durango CO 2 CO-FTC Fort Collins Interagency Dispatch Center Fort Collins CO 2 CO-GJC Grand Junction Air Center Grand Junction CO 2 CO-MTC Montrose Interagency Dispatch Center Montrose CO 2 CO-PBC Pueblo Interagency Dispatch Center Pueblo CO 2 SD-GPC Great Plains Interagency Dispatch Center Rapid City SD 2 WY-CDC Cody Interagency Dispatch Center Cody WY 2 WY-CPC Casper Interagency Dispatch Center Casper WY 2 WY-RWC Rawlins Interagency Dispatch Center Rawlins WY Southwest Region Unit Identifier Center Name City State 3 NM-SWC* Southwest Area Coordination Center Albuquerque NM 3 AZ-FDC Flagstaff Interagency Dispatch Center Flagstaff AZ 3 AZ-PDC Prescott Interagency Dispatch Center Prescott AZ 3 AZ-PHC Phoenix Interagency Dispatch Center Phoenix AZ 3 AZ-SDC Show Low Interagency Dispatch Center (Formerly Springerville Interagency Dispatch Center Show Low (Springerville) AZ (AZ) 3 AZ-TDC Tucson Interagency Dispatch Center Tucson AZ 3 AZ-WDC Williams Interagency Dispatch Center Williams AZ 3 NM-ABC Albuquerque Interagency Dispatch Center Albuquerque NM 3",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}