{
    "relation": [
        [
            "Insider Trading",
            "Korsgaard Mark P.",
            "FINNEGAN JOHN D",
            "Barnes Walter Brian",
            "Robusto Dino",
            "KRUMP PAUL J"
        ],
        [
            "Relationship",
            "Executive Vice President",
            "Chairman, President and C.E.O.",
            "SVP",
            "Executive Vice President",
            "Executive Vice President"
        ],
        [
            "Date",
            "Mar 31",
            "Mar 04",
            "Feb 22",
            "Feb 22",
            "Feb 22"
        ],
        [
            "Transaction",
            "Option Exercise",
            "Sale",
            "Option Exercise",
            "Option Exercise",
            "Option Exercise"
        ],
        [
            "Cost",
            "100.90",
            "100.15",
            "100.21",
            "100.21",
            "100.21"
        ],
        [
            "#Shares",
            "238",
            "95,645",
            "1,567",
            "1,318",
            "1,270"
        ],
        [
            "Value ($)",
            "24,013",
            "9,578,933",
            "157,021",
            "132,070",
            "127,260"
        ],
        [
            "#Shares Total",
            "10,948",
            "207,631",
            "67,144",
            "44,942",
            "63,107"
        ],
        [
            "SEC Form 4",
            "Apr 02 02:11 PM",
            "Mar 06 04:19 PM",
            "Feb 24 03:36 PM",
            "Feb 24 03:36 PM",
            "Feb 24 03:36 PM"
        ]
    ],
    "pageTitle": "Stock Screener - Snapshot n_upgrades",
    "title": "",
    "url": "http://finviz.com/screener.ashx?v=340&s=n_upgrades",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 68,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 90831031,
    "recordOffset": 90799288,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "ACE Limited, through its subsidiaries, provides a range of property and casualty insurance and reinsurance products worldwide. The company's Insurance North American P&C segment offers casualty insurance, environmental, inland marine, professional risk, disaster protection, vacant land and building, and claims and risk management services; homeowners, automobile, valuables, umbrella liability, and recreational marine insurance; and wholesale excess and surplus lines property, casualty, environmental, professional liability, inland marine, and product recall coverages. Its Insurance North American Agriculture segment provides comprehensive multiple peril crop insurance and crop-hail insurance; and farm and ranch coverages, as well as specialty P&C coverages for companies that manufacture, process, and distribute agriculture products. The company's Insurance Overseas General segment offers traditional commercial fire coverage, as well as energy industry-related, marine, construction, and other technical products; commercial primary and excess casualty, environmental, and general liability; and specialty coverages include D&O, professional indemnity, energy, aviation, political risk, and specialty personal lines products, as well as personal accident and supplemental medical products. Its Global Reinsurance segment markets reinsurance products; and provides solutions for small to mid-sized clients and multinational ceding companies, including licensed reinsurance capabilities, property and workers' compensation catastrophe, loss-warranty, stop-loss cover, marine, and aviation programs. The company's Life segment offers protection and savings products comprising whole life, endowment plans, individual term life, group term life, group medical, personal accident, credit life, universal life, and unit linked contracts. ACE Limited was founded in 1985 and is headquartered in Zurich, Switzerland.",
    "textAfterTable": "Ticker AIXG [NASD] Company Aixtron SE Country Germany Industry Diversified Machinery Market Cap 667.53M EPS (ttm) -0.58 P/E - EPS this Y 42.60% Forward P/E - EPS next Y 85.70% PEG - EPS past 5Y -26.00% P/S 3.20 EPS next 5Y - P/B 1.51 EPS Q/Q 25.00% Dividend - Sales Q/Q -8.20% Insider Own",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}