{
    "relation": [
        [
            "Name",
            "Mark Curtis",
            "Paul Tramontano",
            "Richard Zinman",
            "Bill Gurtin",
            "Raj Sharma",
            "Tetsu Tanimoto",
            "Jon Goldstein",
            "Ira Walker",
            "Walter Meranze",
            "Ron Hart",
            "Anthony Malatino",
            "Dana Jackson",
            "Nick Bapis",
            "David Hou",
            "Mark Sear",
            "John Fitzpatrick",
            "Tim Cass",
            "Mark Hutchinson",
            "Patrick Dwyer",
            "John Rafal",
            "Jerome Klein",
            "Alan Yarkin",
            "Tom Phillips",
            "Ron Carson",
            "Frank Fenton",
            "Mark Birringer",
            "Bruce Pomerantz",
            "Shane Brisbin",
            "Sanford Katz",
            "Steve Hefter",
            "Scott Magnesen",
            "Phil Scott",
            "Dick Kelley",
            "Michael Swenson",
            "Erik Brechnitz",
            "Alan Zafran",
            "Heliane Steden",
            "Jeff Gerson",
            "Alan Whitman",
            "Michael Stern",
            "Chris Errico",
            "Larry Palmer",
            "William Einstein",
            "Harold Trischman",
            "William Easom",
            "Tom Gau",
            "Maha Matta",
            "Michael E. Dowell",
            "Richard Camp",
            "Gregory S. Hurlbrink"
        ],
        [
            "Firm",
            "Smith Barney",
            "Smith Barney",
            "Smith Barney",
            "Morgan Stanley",
            "Merrill Lynch",
            "Merrill Lynch",
            "Smith Barney",
            "Morgan Stanley",
            "Wachovia Securities",
            "Smith Barney",
            "Morgan Stanley",
            "Smith Barney",
            "Morgan Stanley",
            "Merrill Lynch",
            "Merrill Lynch",
            "UBS",
            "Morgan Stanley",
            "Smith Barney",
            "Merrill Lynch",
            "Essex Financial Services",
            "Merrill Lynch",
            "Smith Barney",
            "Merrill Lynch",
            "LPL",
            "Smith Barney",
            "Merrill Lynch",
            "Wachovia Securities",
            "Smith Barney",
            "UBS",
            "Morgan Stanley",
            "Morgan Stanley",
            "Merrill Lynch",
            "RBC Dain Rauscher",
            "Merrill Lynch",
            "Raymond James and Associates",
            "Merrill Lynch",
            "Merrill Lynch",
            "Smith Barney",
            "Morgan Stanley",
            "Wachovia Securities",
            "Morgan Stanley",
            "Smith Barney",
            "UBS",
            "Smith Barney",
            "Smith Barney",
            "Oregon Pacific Financial Advisors",
            "Smith Barney",
            "Smith Barney",
            "Smith Barney",
            "Smith Barney"
        ],
        [
            "City",
            "Palo Alto, CA",
            "New York",
            "New York",
            "Ranch Santa Fe, CA",
            "Boston",
            "Los Angeles",
            "Menlo Park, CA",
            "Red Bank, NJ",
            "Yardley, PA",
            "Atlanta",
            "Saratoga Springs, NY",
            "Menlo Park, CA",
            "Salt Lake City",
            "Century City, CA",
            "Century City, CA",
            "New York",
            "Monterrey, CA",
            "Chicago",
            "Miami",
            "Essex, CT",
            "Century City, CA",
            "Hallandale, FL",
            "White Plains, NY",
            "Omaha, NE",
            "Beverly Hills, CA",
            "Chicago",
            "Short Hills, NJ",
            "San Francisco",
            "San Francisco",
            "Riverwoods, IL",
            "Oak Brook, IL",
            "Bellevue, WA",
            "Omaha, NE",
            "Wayzata, MN",
            "Decatur, IL",
            "Menlo Park, CA",
            "New York",
            "New York",
            "Pasadena, CA",
            "Vineland, NJ",
            "New York",
            "Los Angeles",
            "New York",
            "Greenwich, CT",
            "Chicago",
            "Ashland, OR",
            "San Francisco",
            "Jackson, MS",
            "St. Louis, MS",
            "Baltimore, MD"
        ],
        [
            "Estimated Total Assets in millions",
            "$12,000",
            "$6,000",
            "$5,000",
            "$5,000",
            "$3,820",
            "$3,500",
            "$3,000",
            "$3,000",
            "$2,312",
            "$2,280",
            "$2,100",
            "$2,000",
            "$1,900",
            "$1,894",
            "$1,898",
            "$1,637",
            "$1,610",
            "$1,600",
            "$1,600",
            "$1,600",
            "$1,589",
            "$1,516",
            "$1,500",
            "$1,400",
            "$1,400",
            "$1,380",
            "$1,369",
            "$1,350",
            "$1,300",
            "$1,300",
            "$1,300",
            "$1,300",
            "$1,233",
            "$1,200",
            "$1,200",
            "$1,100",
            "$1,100",
            "$1,100",
            "$1,100",
            "$1,000",
            "$1,000",
            "$1,000",
            "$987",
            "$940",
            "$929",
            "$905",
            "$900",
            "$900",
            "$900",
            "$866"
        ],
        [
            "Years with Firm",
            "25",
            "15",
            "4",
            "7",
            "19",
            "37",
            "12",
            "19",
            "39",
            "6",
            "19",
            "13",
            "18",
            "13",
            "13",
            "2",
            "21",
            "6",
            "13",
            "17",
            "11",
            "28",
            "23",
            "16",
            "16",
            "12",
            "8",
            "4",
            "4",
            "7",
            "25",
            "20",
            "26",
            "17",
            "Since May 06",
            "14",
            "6",
            "20",
            "35",
            "47",
            "7",
            "12",
            "11",
            "22",
            "18",
            "10",
            "3",
            "18",
            "23",
            "20"
        ],
        [
            "Business Description/Specialty",
            "Corporate services, stock plans, cash management, investment consulting, fixed income.",
            "Private wealth management.",
            "HNW wealth management.",
            "UHNW, fixed-income management.",
            "Asset management, estate, wealth and legacy planning in a family-office structure.",
            "Financial planning, asset allocation, rebalancing.",
            "UHNW wealth management.",
            "UHNW individuals.",
            "HNW, specialty transactions (144, 10b18 etc), and in-house portfolio management.",
            "HNW individuals, corporations and foundations.",
            "Managed assets.",
            "HNW, risk management, credit and investment strategies, estate and income-tax planning.",
            "HNW client service.",
            "UHNW.",
            "Asset allocation, structured derivatives.",
            "UHNW families.",
            "HNW, healthcare industry.",
            "Equity portfolio management.",
            "UHNW, investment consulting, restricted stock.",
            "Comprehensive financial planning, managed money, trusts, pensions, 401(k)s.",
            "N/A",
            "Private wealth management for HNW individuals and families.",
            "Multi-generation family planning.",
            "Wealth, trust services, tax, estate, risk-management and small business planning.",
            "Wealth management with financial planning and portfolio management.",
            "HNW, concentrated stock solutions.",
            "HNW clients.",
            "HNW private wealth management",
            "UHNW, HNW.",
            "HNW.",
            "Retirement specialist.",
            "HNW.",
            "Full-service broker. stocks, bonds, mutual funds.",
            "HNW families, executives, small businesses.",
            "HNW, foundations, defined-benefit pension plans.",
            "N/A",
            "UHNW clients, family office-type services.",
            "Private wealth management and planning and asset management for individuals.",
            "HNW, UHNW individuals.",
            "Estate planning.",
            "Equity, high-yield fixed income, UHNW.",
            "Private wealth management for corporate executives.",
            "HNW, municipal bonds.",
            "Diversified income and managed growth accounts.",
            "Retirement planning.",
            "Financial planning, including tax and estate planning, wealth-transfer strategies.",
            "HNW, municipal bonds.",
            "HNW individuals, fixed income, estate planning and executive financial services",
            "Foundations, endowments, defined-benefit plans.",
            "HNW comprehensive wealth management, investment consulting."
        ],
        [
            "Remarks",
            "“We are benefiting tremendously from the trend of clients who want a more comprehensive relationship.”",
            "“We operate as a full family office within the firm. Our philosophy has been to be all things to some people. We help with every aspect of our client's financial lives.”",
            "“Maintaining a balance between wealth preservation and capital growth is the goal. Finding both asset classes and investment-management talent is essential.”",
            "“The Gurtin Group manages all client assets internally, as opposed to outsourcing, and we do so in large part on a discretionary basis.”",
            "“We bring an institutional risk-management approach to our clients.”",
            "“Our mission is to help our clients achieve their financial goals with less risk.”",
            "“We strive to be our client's primary financial advisor and offer comprehensive financial and investment management strategies.”",
            "“We develop comprehensive diversification and asset-allocation strategies for our clients utilizing exchange-traded funds.”",
            "“In a world where advisors often shop out many of their clients' tasks I built a team of experts allowing me to handle all client relationships under one roof.”",
            "“We provide investment strategies that seek to maximize the after-tax rate of return while preserving capital and providing necessary liquidity for our clients.”",
            "“Day trading is ill-advised. Low commission rates simply mean it now costs less to engage in behavior that can be financially harmful.”",
            "“We deliver objective investment advice using a broad approach that integrates liquidity strategies, tax and philanthropic planning and unique investment ideas.”",
            "“Our team strives to assist our clients with any financial needs or requests.”",
            "N/A",
            "“We're all about customization, access and service. We serve only $10 million-plus households and we want to give them best in class.”",
            "“As the client's advocate we strive to understand the client's needs and objectives and customize an ongoing solution that is unique for each of them.”",
            "“In 2005, I was recognized as one of the “Top 50 Advisors” by Registered Rep. In January 2006 I was noted in Research Magazine as one of the ‘Top-Ranked Advisors in America’.”",
            "“Our goal is to be the trusted advisor to clients and their families focusing on all of their total wealth issues, which includes risk and portfolio management.”",
            "“We provide independent investment-management consulting, private banking and lending services and concentrated stock and risk-management strategies.”",
            "“We are a high-net-worth practice based on three core principals: Service, independence and knowledge.”",
            "N/A",
            "“Modern portfolio theory and asset allocation provide the foundation for the structuring of our clients' portfolios and each is uniquely tailored based on the client's return objective and risk tolerance.”",
            "“Service sets us apart.”",
            "“Ron is one of America's most recognized and honored wealth advisors, familiar to viewers of CNBC, Fox News Network and KMTV in Omaha.”",
            "“Meeting each client's objectives is our primary goal, whether it's capital preservation or above-average market returns, or a combination of both.”",
            "“Our message is one of wealth preservation. We have found for our clients the important experience is not taking the big loss.”",
            "“My team and I are dedicated to achieving client satisfaction in both portfolio performance and client service.”",
            "“Our clients benefit from the scale and expertise of Citigroup's global platform. We leverage this platform to deliver comprehensive wealth-management solutions and high-quality service.”",
            "“We help clients achieve a risk-balanced plan that best suits their long-term financial goals, which we then implement using a variety of external and internal products and managers.”",
            "“In part, our success can be attributed to our ability to find the regions and sectors around the globe that have the best risk-reward opportunities.”",
            "“An educated client will be your best client.”",
            "“We focus on helping people generate reliable, safe income streams that grow significantly over time.”",
            "“I lead a highly experienced support team to work with clients and develop strategies and recommend personalized solutions to help accumulate protect”",
            "“The Swenson Financial Advisory Group is a corporate & family advisory group that helps companies and affluent families protect wealth and financial security.”",
            "“Our philosophy is to ensure that our clients never assume more risk than is necessary.”",
            "“Providing access to world-class money managers with an overlay of tax and financial planning.”",
            "“We deal with a select number of ultra-high-net-worth families offshore, providing private banking services, strategic asset allocation, tactical trading strategies and family-office services.”",
            "“I believe that when managing a client's portfolio, I should take the least amount of risk necessary to attain the client's agreed upon goals.”",
            "“We build long-term relationships based on trust, exceptional service and sound investment strategies.”",
            "“Estate planning is complicated and proper management of wealth requires liquidity and intelligence, integrity and patience.”",
            "“I'm constantly searching for value in all asset classes and committed to providing my clients with a customized plan to meet their needs.”",
            "“Our team helps officers, directors and founders of companies create liquidity and preserve and grow their capital.”",
            "“I focus on the goals of my clients and develop strategies accordingly. I emphasize conservative, high-quality fixed-income portfolios.”",
            "“Detailed review process for managed accounts.”",
            "“Quality, process-driven practice”",
            "“We prepare consolidated asset allocation for all clients with updated reports determining if their current mix of assets is appropriate for their current situation.”",
            "“Our emphasis is to work with our HNW clients to develop financial plans to help diversify their holdings, facilitate estate plans and achieve their financial goals.”",
            "“While I do not profess to be all things financial to all people, I do claim a broad array of expertise via my team and gatekeeper to the experts on all else.”",
            "“We are very long-term equity investors and use bonds to reduce volatility”",
            "“We are a multi-disciplined team offering comprehensive wealth management to high net worth families, in true open architecture investment consulting to small institutions.”"
        ]
    ],
    "pageTitle": "Offering Specialized Services Can be Key to Success | Practice Management content from WealthManagement.com",
    "title": "",
    "url": "http://wealthmanagement.com/practice-management/specialized-bunch",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 255648079,
    "recordOffset": 255607817,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31693=Brechnitz worked for Edward Jones in St. Louis, his hometown, after college. He later moved to Decatur and opened his own brokerage firm, which was bought by a predecessor of Wachovia Securities. He joined Morgan Stanley in 1994, just before finishing up a six-year term as mayor of Decatur, and this past May all six partners in The Brechnitz Group joined Raymond James & Associates., 45000=Prior to joining Merrill, she worked as an investment banker at Bankers Trust. When Bankers was bought by Deutsche Bank in 1998, she headed to Merrill because of its “strong retail roots” and full-service platform. Her extensive background in investment banking and derivatives has given her an added edge over other advisors, she says. It enables her to employ active option-trading strategies and currency overlays in 80 percent of the accounts, either as a hedge or to generate alpha., 40803=It shouldn't come as a surprise that Stern is such a student of history. He's 67 and has been in the business for 47 years — and though he does business in 34 states, he lives and works in the same town where he was born and raised, Vineland, N.J. He started out in 1959 at Bache & Company, calling people he knew in town, and then asking them for referrals. (Bache & Company, of course, has been devoured a few times over and is now a part of Wachovia). But, he says, “I probably haven't asked for a referral in 25 years — the business just comes because of good people who are happy with me.”, 37890=His reputation grew as a reliable source, and he began getting requests from companies, like Pepsi and Sears, to offer advice to its employees. After 25 years of doing it his way, Magnesen has $1.3 billion in assets under management and over 2,000 clients. By his fifth year in the business, Magnesen had $100 million in assets and went on to receive Registered Rep.'s Outstanding Broker Award in 1989. Needless to say, things seemed to have gone OK without the cold calls., 39414=But his educating doesn't stop with clients and students. By 1990, his business was growing and he needed an extra hand. “I hired my 57-year-old father, a retired college professor, and put him through a lot of training,” he says. And another generation of educators is on its way to the Oak Brook office as well. Magnesen is already predicting which one of his four sons will be coming to work for him. — HT, 46071=Taking care of her children, however, is her biggest responsibility, she says. In July, she gave birth to a baby boy, Jack, and she also has a three-year-old daughter, Madison. Balancing work and family is not easy, but her goal “is to be successful at two careers.” It appears she is already hitting the mark. — Kevin Burke, 20565=When President Gerald Ford signed the Pension Reform Act of 1974 into law — better known as ERISA — he made Tetsu Tanimoto's professional life a little easier. Tanimoto was about six years in the advisory game at the time and was looking for a way to stay ahead of the competition. The reform, which established requirements and standards for private pension plans, provided Tanimoto with a new group of possible clients whose retirement money was now being protected by the federal government. “I bought the book and read about ERISA and said, ‘Wow, this stuff is really important.’ That's when I started making these accounts part of my business,” Tanimoto recalls., 26267=John Fitzpatrick, an advisor with UBS in New York who specializes in high-net-worth families, says he recalls having to go back and redesign his clients' plans after realizing “that something was missing.” He says estate planning was not talked about when he began practicing in 1985. But, he learned in the early 1990s how important estate planning was, so he had to go back to his clients and integrate estate planning into their plans. Specialization is a learning process, he says. For him “it was a trial-and-error process but, over time, I think we broke the code of what our clients need to have.”, 34771=Kelley wasn't an investing neophyte when he decided to join the money game full time. Since his small manufacturing business threw off enough income to support his family, he was able to invest his wife's teaching salary in the market. The thing was: He generated better returns than a friend who was a stockbroker. Not long after, he gave up his small business and took a job with the St. Louis-based regional firm G.H. Walker & Company. After its acquirer (White, Weld & Co.) was bought out by Merrill Lynch in 1978, Kelley jumped to another regional firm in an attempt to keep his practice away from a large wirehouse. And when his new firm was bought by Paine Webber a year later, Kelley was again forced to change firms, but this time it was for good. “Dain has been terrific. Even since we've been sold to RBC, the firm feels the same. I think it's just easier to talk to the home office when you're with a smaller firm,” he says.}",
    "lastModified": "Fri, 31 Jul 2015 01:35:27 GMT",
    "textBeforeTable": "The following rankings of financial advisors are based on a combination of objective and subjective factors, including production, assets under management and tenure at current firm. As part of our information-gathering process, we promised to hold production numbers in confidence. To provide some sense of who these top advisors are, we profiled five of them in the pages preceding this chart. America's Top 50 Advisors Taking care of her children, however, is her biggest responsibility, she says. In July, she gave birth to a baby boy, Jack, and she also has a three-year-old daughter, Madison. Balancing work and family is not easy, but her goal “is to be successful at two careers.” It appears she is already hitting the mark. — Kevin Burke “Technically, there is not a lot of difference between the top players,” Steden says. “It's so much more in the attitude and mental toughness, which is something that completely translates into business.” But Steden has an unusual background: She was once ranked as the No. 1 women's tennis player in Mexico. She later went on to become a three-time all-American at USC, where she played on two NCAA championship teams. After college, she spent five years on the pro tour and played against tennis legend Martina Navratilova. Prior to joining Merrill, she worked as an investment banker at Bankers Trust. When Bankers was bought by Deutsche Bank in 1998, she headed to Merrill because of its “strong retail roots” and full-service platform. Her extensive background in",
    "textAfterTable": "Print reprints Favorite EMAIL Tweet Please Log In or Register to post comments. Related Articles \"Getting Wasted Key to Success on Wall Street\" 5 Keys to Partnering for Succession Morningstar: Gender Diversity Key to Success, Says Krawcheck How Advisors Spend Their Time May Hold Key to Their Success   Don’t Wait, Formalize your Succession Plan Now Advertisement",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}