{
    "relation": [
        [
            "",
            "WA 318 Psychology",
            "WH 137 Nursing Lab",
            "WS 219 Finance",
            "WH 301 Math",
            "Founders Hall 205",
            "HI 114 HPX",
            "WS 208 tables",
            "MT & WS 24hr labs",
            "MT & WS Comp Ctrs.",
            "MIS Security classroom",
            "WSCC Computer Ctr (C4)",
            "Net Support School",
            "4 OpScan Scanners",
            "13 New / upgrade servers",
            "VMWare Infrastructure",
            "Black/White and Color & HP4250 printer upgrades for labs",
            "OM Generator",
            "Microsoft Campus Agreement",
            "Continue Wireless Implementation",
            "Total Summer 2008 Expenditure"
        ],
        [
            "",
            "30 desktops w 17” fpm",
            "5 desktops w 17” fpm",
            "30 laptops",
            "30 used laptops",
            "25 laptops",
            "Projector, HP, 17” fpm",
            "",
            "18 used desktops",
            "108 desktops w 17” fpm",
            "12 desktops 12 laptops",
            "30 desktops w 17” fpm",
            "",
            "@SB, WSCB, WA, WH",
            "",
            "",
            "",
            "UC balance after DPW",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "Instr. Table, carpet",
            "",
            "",
            "Furniture",
            "Tables, chairs",
            "Desks, chairs",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "Sony DVD combo",
            "",
            "",
            "",
            "Servers, printers",
            "Color and b/w laser prtrs",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Approximate cost",
            "$25,500",
            "$4,250",
            "$51,750",
            "$22,500",
            "$43,125",
            "$10,540",
            "$10,000",
            "$9,000",
            "$103,800",
            "$104,400",
            "$58,100",
            "$ 9,700",
            "$20,500",
            "$99,205",
            "$16,298",
            "$16,900",
            "$100,000",
            "$152,125",
            "$450,000",
            "$1,307,693"
        ]
    ],
    "pageTitle": "WCSU - Information Technology Committee (ITC) Minutes",
    "title": "",
    "url": "http://wcsu.edu/committees/itc/archives/minutes-2008-09-11.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 256258047,
    "recordOffset": 256238011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{22927=Lorraine asked the school technology chairs and Veronica to refrain from adding new machine allocations to their respective FY 05, 06, 08 Bond Money New and Used Machine Allocation Spreadsheet until Gail Walsh updates them. Lorraine distributed a document that lists current status on machine installations. Lorraine also provided that latest “Distribution of Desktop Funds FY0099 through FY0708” to the tech chairs and Veronica. Lorraine believes the FY09 equipment money for desktop and servers and technology in the classroom will be bonded and she will have move information later in the semester as the process continues. Gail will email the July 2008 machine pricing spreadsheet to the school technology chairs and Veronica as a reference. Updated pricing will be provided as it is received., 25142=Before the start of the semester, there were 8 buildings out of 22 left to complete wireless networking. Of those 8, 2 were being worked on and will be live shortly. All academic and ResHall buildings were complete by September 2, 2008. Administrative and ancillary buildings are left. The Science Building, Westside Campus Center, Westside Classroom building, Midtown Student Center, Warner Hall, Haas Library, Berkshire Hall, White Hall, Irfan Kathwari Honors House, Centennial Hall, Newbury Hall, Litchfield Hall, Pinney Hall and Grasso Hall are complete. Higgins and Fairfield Halls are being worked on for completion in early Fall. The following buildings need to be finished and/or started: Old Main (has hotspots on the 2nd and 3rd floor); University Hall (has hotspots in President’s Conference Room); O’Neill Center (has hotspots in Athletic Director’s office); Westside Athletic Complex; Observatory; and Boiler House. Wireless printing is now available in the WS Campus Center Information Desk, Centennial Hall Lounge, Litchfield Hall Lounge, MT 24-hour lab (SC 214a), MTCC, Newbury Hall Lounge, Science Building 24-hour Lab (SB 127), STTC (SC 225), WS Campus Center Computer Center, WS 24-hour lab (WS 247c), and WSCC. To find out more about wireless areas are on campus go to http://www.wcsu.edu/technology/wireless/locations.asp , 20119=Next Meeting:  Thursday, October 9, 2008, 12:00noon to 1:30pm, OM304., 32492=Beginning Wednesday, August 27, all Macintosh computers on campus will automatically lock after 15 minutes of inactivity. You will need to enter your windows username and password to unlock the computer to resume use. The enforcement of this policy is required by system-wide security policies and brings the Macintosh computers in line with all other computers on campus., 38187=September 11, 2008, 12:15pm-1:45pm, OM 304, 23619=As a result of requests by students for additional staffed computer centers, the C 4 was created. The ribbon cutting ceremony was September 10th. The C 4 has 28 new PC workstations, 1 24” iMac station, group workstation, 2 graphic stations with scanners, black/white and color laser printers, Wi-Fi and lounge area available for laptop users. For more information about the C4 go to http://www.wcsu.edu/technology/c4-spotlight.asp or http://www.wcsu.edu/technology/techrooms/c4.asp, 37529=Dan Goble will try to adjust his schedule with his students in order to attend the entire meeting. Lorraine suggested that we start the meeting at noon and asked the committee members if that would work for everyone. The committee members agreed to meet from 12:00pm to 1:30pm. The ITC will continue to meet on the second Thursday of the month in OM304. The next meeting will take place on Thursday, October 9, 2008 at 12:00 noon., 21690=As of 6/20/08, in addition to being CIO at WestConn, Lorraine was appointed Interim CIO at SCSU by Chancellor Carter. Lorraine has been working 3 to 4 days per week at SCSU and the balance of her time at WestConn. The search committee for a permanent CIO at SCSU is actively pursuing a replacement. Lorraine hopes to return to WestConn shortly after the start of the semester. (UPDATE:  Lorraine’s Tenure at Southern ended September 19th and she has returned full time to WestConn)}",
    "TableContextTimeStampAfterTable": "{8236=Summer 2015 music festivals  }",
    "textBeforeTable": "Lorraine distributed and reviewed a list of summer projects to the ITC. The following is a summary of the accomplishments and approximate costs.  Review of Summer Projects & Replacement Plan Beginning Wednesday, August 27, all Macintosh computers on campus will automatically lock after 15 minutes of inactivity. You will need to enter your windows username and password to unlock the computer to resume use. The enforcement of this policy is required by system-wide security policies and brings the Macintosh computers in line with all other computers on campus. Lorraine discussed the hiring freeze declared by Governor Rell. Faculty positions were granted “exemption from hiring freeze.” ERP/Academic Applications Manager position and a vacant web developer position in UC were approved as “exemption from hiring freeze.” The interviews are scheduled for next week. Lorraine mentioned plans for the creation of the Academic Success Center for students and the plans for an Instructional Technology Center for faculty. Lorraine asked the school technology chairs to survey their committees for topics that they would like to see offered by the Instructional Technology Center. Rich suggested that Lorraine send an email to faculty reminding them to use their access code at the start of class and secure the room at the end of class. The incoming instructor should complete the same process and not enter the room without using their own code. Rich also mentioned that the tables in WS241 were taken out of formation and if this was done to suit to the purpose of",
    "textAfterTable": "Wireless Update Before the start of the semester, there were 8 buildings out of 22 left to complete wireless networking. Of those 8, 2 were being worked on and will be live shortly. All academic and ResHall buildings were complete by September 2, 2008. Administrative and ancillary buildings are left. The Science Building, Westside Campus Center, Westside Classroom building, Midtown Student Center, Warner Hall, Haas Library, Berkshire Hall, White Hall, Irfan Kathwari Honors House, Centennial Hall, Newbury Hall, Litchfield Hall, Pinney Hall and Grasso Hall are complete. Higgins and Fairfield Halls are being worked on for completion in early Fall. The following buildings need to be finished and/or started: Old Main (has hotspots on the 2nd and 3rd floor); University Hall (has hotspots in President’s Conference Room); O’Neill Center (has hotspots in Athletic Director’s office); Westside Athletic Complex; Observatory; and Boiler House. Wireless printing is now available in the WS Campus Center Information Desk, Centennial Hall Lounge, Litchfield Hall Lounge, MT 24-hour lab (SC 214a), MTCC, Newbury Hall Lounge, Science Building 24-hour Lab (SB 127), STTC (SC 225), WS Campus Center Computer Center, WS 24-hour lab (WS 247c), and WSCC. To find out more about wireless areas are on campus go to http://www.wcsu.edu/technology/wireless/locations.asp  C 4 – WS Campus Center Computer Center As a result of requests by students for additional staffed computer centers, the C 4 was created. The ribbon cutting ceremony was September 10th. The C 4 has 28 new PC workstations,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}