{
    "relation": [
        [
            "Table (1):",
            "Year/Quarters",
            "1996",
            "1997",
            "1998",
            "1999"
        ],
        [
            "",
            "I",
            "75",
            "86",
            "90",
            "100"
        ],
        [
            "",
            "II",
            "60",
            "65",
            "72",
            "78"
        ],
        [
            "",
            "III",
            "54",
            "63",
            "66",
            "72"
        ],
        [
            "",
            "IV",
            "59",
            "80",
            "85",
            "93"
        ]
    ],
    "pageTitle": "Seasonal variations - Psychology Wiki",
    "title": "",
    "url": "http://psychology.wikia.com/wiki/Seasonal_variations?direction=prev&oldid=150391",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 190650991,
    "recordOffset": 190619684,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{14692=Organizations facing seasonal variations, like the motor vehicle industry, are often interested in knowing their performance relative to the normal seasonal variation. The same applies to the ministry of employment which expects unemployment to increase in June because recent graduates are just arriving into the job market and schools have also been given a vacation for the summer. That unemployment increased as predicted is a moot point, the relevant factor is whether the increase is more or less than expected., 352=4. If the sum of these indices is not 1200(or 400 for quarterly figures), multiply then by a correction factor = 1200/ (sum of monthly indices). Otherwise, the 12 monthly averages will be considered as seasonal indices., 12845=Seasonality is quite common in economic time series. It is also very common in geophysical and ecological time series. A notable example is the concentration of atmospheric carbon dioxide: it is at a minimum in September and October, at which point it begins to increase, reaching a peak in April/May, before declining. Another example consists of the famous Milankovitch cycles., 13303=For example, retail sales tend to peak for the Christmas season and then decline after the holidays. So time series of retail sales will typically show increasing sales from September through December and declining sales in January and February., 2496=Now let us try to understand the measurement of seasonal variation by using the Ratio-to-Moving Average method. This technique provides an index to measure the degree of the Seasonal Variation in a time series. The index is based on a mean of 100, with the degree of seasonality measured by variations away from the base. For example if we observe the hotel rentals in a winter resort, we find that the winter quarter index is 124. The value 124 indicates that 124 percent of the average quarterly rental occur in winter. If the hotel management records 1436 rentals for the whole of last year, then the average quarterly rental would be 359= (1436/4). As the winter-quarter index is 124, we estimate the no. of winter rentals as follows:}",
    "textBeforeTable": "Let us calculate the seasonal index by the ratio-to-moving average method from the following data: 4. If the sum of these indices is not 1200(or 400 for quarterly figures), multiply then by a correction factor = 1200/ (sum of monthly indices). Otherwise, the 12 monthly averages will be considered as seasonal indices. 3. Arrange these percentages according to months or quarter of given years. Find the averages over all months or quarters of the given years. 2. Express each original data value of the time-series as a percentage of the corresponding centered moving average values obtained in step(1).In other words, in a multiplicative time-series model, we get(Original data values)/(Trend values) *100 = (T*C*S*I)/(T*C)*100 = (S*I) *100. This implies that the ratio–to-moving average represents the seasonal and irregular components. 1. Find the centered 12 monthly (or 4 quarterly) moving averages of the original data values in the time-series. Steps This method is also called the percentage moving average method. In this method, the original data values in the time-series are expressed as percentages of moving averages. The steps and the tabulations are given below. Here, 359 is the average quarterly rental. 124 is the winter-quarter index. 445 the seasonalized winter-quarter rental. 359*(124/100)=445; Now let us try to understand the measurement of seasonal variation by using the Ratio-to-Moving Average method. This technique provides an index to measure",
    "textAfterTable": "Now calculations for 4 quarterly moving averages and ratio-to-moving averages are shown in the below table. Table (2) Year Quarter Original Values(Y) 4 Figures Moving Total 4 Figures Moving Average 2 Figures Moving Total 2 Figures Moving Average(T) Ratio-to-Moving Average(%)(Y)/ (T)*100 1996 1 75 2 60 248 62.00 3 54 126.75 63.375 85.21 259 64.75 4 59 130.75 65.375 90.25 264 66.00 1997 1 86 134.25 67.125 128.12 273 68.25",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}