{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Name",
            "Antwerp Central Youth Hostel Antwerp Central Hostel \"Pulcinella\" is our latest and most modern youth hostel. The perfect match with a hip and young city like Antwerp! Its location in the old city centre turns the youth hostel into the ideal starting point for a city trip in this metropolis! Antwerp is a mosaic of culture, architecture, fashion and shopping.",
            "Hotel Rubenshof A charming hotel with plenty of personality in the buzzing area of Antwerp.",
            "Hotel Postiljon Unique family hotel in the heart of the old city center, the best bed and breakfast in town!",
            "Diamonds and Pearls Guesthouse26 is a Bed & Breakfast in the centre of Antwerp, on the historical Pelgrimstraat.",
            "Alias Youth Hostel Have an amazing holiday in Antwerp, Belgium. Alias Youth hostel awaits you, offering the best service and low prices. Our staff of young locals welcomes you and can help you plan a perfect trip. We have shared and private dorms, 2-3-4-6-8 bedded rooms. We also offer some ensuite rooms. The international atmosphere and our multilingual staff, make our YouthHostel a haven for travellers from all over the world.",
            "Antwerp Student Hostel Welcome to Antwerp Student Hostel! Located in the city centre of Antwerp within 1 km from Antwerp Central Train Station, Antwerp Student Hostel offers great affordable accommodation with free access to WiFi, a private garden and a shared kitchens."
        ],
        [
            "Rating",
            "92%",
            "89%",
            "81%",
            "78%",
            "74%",
            ""
        ],
        [
            "Atmosphere",
            "85",
            "93",
            "82",
            "84",
            "68",
            ""
        ],
        [
            "Staff",
            "95",
            "95",
            "89",
            "76",
            "81",
            ""
        ],
        [
            "Location",
            "100",
            "80",
            "97",
            "92",
            "66",
            ""
        ],
        [
            "Cleanliness",
            "95",
            "89",
            "77",
            "75",
            "75",
            ""
        ],
        [
            "Facilities",
            "90",
            "86",
            "66",
            "69",
            "69",
            ""
        ],
        [
            "Safety",
            "100",
            "91",
            "80",
            "75",
            "82",
            ""
        ],
        [
            "Fun",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Value",
            "85",
            "90",
            "79",
            "76",
            "81",
            ""
        ],
        [
            "Private",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Shared",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Antwerp, Belgium Search Results",
    "title": "",
    "url": "http://www.roughguides.com/hostels/hostel/locations/belgium/antwerp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 686787979,
    "recordOffset": 686763577,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21375=© 2015 Rough Guides Limited, Registered Number 01969090, Registered Office: 80 Strand, London WC2R 0RL}",
    "textBeforeTable": "| Previous | Next | View all of 6 - 6 Showing Results 1 Saving... --> or Cancel Shared Price Private Price Value Rating Fun Rating Safety Rating Facilities Rating Cleanliness Rating Location Rating Staff Rating Atmosphere Rating Overall Rating Show property attributes for: (Max 7) - Reset Show Property Attributes or Cancel -->",
    "textAfterTable": "Searching Available Hostels . . . We are building the list of available properties in this location. Please wait... About us Contact us Write or Work for us Mobile Site FAQs Terms & Conditions Privacy & Cookies Community Guidelines Site map Pounds SterlingUS Dollars Change Currency © 2015 Rough Guides Limited, Registered Number 01969090, Registered Office: 80 Strand, London WC2R 0RL",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}