{
    "relation": [
        [
            "Course",
            "APSC 100",
            "APSC 101",
            "APSC 160",
            "CHEM 154",
            "ENGL 112",
            "MATH 100",
            "MATH 101",
            "MATH 152",
            "PHYS 157",
            "PHYS 158",
            "PHYS 159",
            "PHYS 170",
            "ABCD 100",
            "Total"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Introduction to Engineering I *",
            "Introduction to Engineering II *",
            "Introduction to Computation in Engineering Design",
            "Chemistry for Engineering",
            "Strategies for University Writing (or equivalent)",
            "Differential Calculus (or MATH 180 (4 credits) if you haven't taken a high school calculus course. Check the Math department site for more information).",
            "Integral Calculus",
            "Linear Systems",
            "Introductory Physics for Engineers I (formerly part of Physics 153)",
            "Introductory Physics for Engineers II (formerly part of Physics 153)",
            "Introductory Physics Lab for Engineers (formerly part of Physics 153)",
            "Mechanics 1",
            "Humanities and Social Sciences elective (typically from the Faculty of Arts - there are some exceptions, see \"Humanities\" section in \"Complementary Studies Electives' above, under \"Degree Requirements\")",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Credits",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "1",
            "3",
            "3",
            "37"
        ]
    ],
    "pageTitle": "Registering for courses | Student Services",
    "title": "",
    "url": "http://students.engineering.ubc.ca/registering-courses",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 234767455,
    "recordOffset": 234746918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50198=2.    All other courses (English and the Humanities & Social Sciences elective): First you should register for a full 37-credit schedule and wait for your results. Usually by mid-late July, when you know you will get credit for your course, you can make changes to your registration yourself in the Student Service Centre. Any changes should be completed by the add/drop deadline.}",
    "lastModified": "Fri, 31 Jul 2015 00:20:11 GMT",
    "textBeforeTable": "1st Year Program First Year Program You can also find technical electives listed under your program in the left-side menu of the BASC Degree Requirements in the UBC Calendar.  Check with your department/program for your approved technical elective courses. Technical Electives If you are looking for advice as to which course you should take, think about what subject interests you and what you think you will excel in. Contact Engineering Student Services regarding this question will result in the same advice.  Also, if you are considering doing a Minor in Arts, Commerce, Mathematics Honours, or Science, you could use this opportunity to take a course that fulfills both requirements. For example, if you are considering a Minor in Commerce, ECON 101 would satisfy the Humanities elective as well as one of the Minor in Commerce courses.  You can take 3 credits of a language course and count it as a humanities and social science elective.  If you take more than 3 credits of a language course, you",
    "textAfterTable": "  * Please note: our first year APSC122 & APSC 150 no longer exist. The courses that have replaced them are APSC 100 and APSC 101.  However, these courses are not equivalent courses - APSC 100 and APSC 101 are completely new courses.  If you have transfer credit for APSC 150 or APSC 151, you will not have to take APSC 100 and APSC 101, you will receive credit for the course you have taken and are exempt from APSC 100 and APSC 101.  1st Year Empty Empty Basic Registration Steps! Read this first... All engineering students use standard timetables (STT) to register their core courses.  You will select an STT to register your core courses and then add your electives to that timetable (new students should also check their Registration Guide). Remember to select the correct session code - usually 20XX Winter (top right corner). Find the STT for your year and program** on the Student Service Centre. 1st and 2nd year students can check the registration guides (see tabs on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}