{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Player",
            "Cobi Jones",
            "C.J. Brown",
            "Logan Pause",
            "Shalrie Joseph",
            "Jason Kreis",
            "Kerry Zavagnin",
            "Jay Heaps",
            "Ramiro Corrales",
            "Nick Garcia",
            "Davy Arnaud"
        ],
        [
            "Club",
            "LA Galaxy",
            "Chicago Fire",
            "Chicago Fire",
            "New England Revolution",
            "Dallas Burn",
            "Kansas City Wizards",
            "New England Revolution",
            "San Jose Earthquakes",
            "Kansas City Wizards",
            "Sporting KC"
        ],
        [
            "Years",
            "1996-2007",
            "1998-2010",
            "2003-present",
            "2003-2012",
            "1996-2004",
            "2000-2008",
            "2001-2009",
            "2001-2004; 2008-2013",
            "2000-2007",
            "2002-2011"
        ],
        [
            "Consecutive Games Played",
            "306",
            "296",
            "274*",
            "261",
            "247",
            "237",
            "228",
            "225",
            "224",
            "218"
        ],
        [
            "Seasons",
            "12",
            "13",
            "11",
            "10",
            "9",
            "9",
            "8",
            "10",
            "8",
            "10"
        ]
    ],
    "pageTitle": "New England Revolution | Chicago Fire",
    "title": "",
    "url": "http://www.chicago-fire.com/blog/new-england-revolution",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370023035,
    "recordOffset": 369980054,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{87146=Following the draw, Marstaller said the published fourth round scenarios would not be accompanied Friday by match dates yet. This is because the Fourth Round has three possible match dates over an eight-day span. With USL PRO and the PDL, along with amateur sides having league games between the June 10-18 Fourth Round window, all clubs that have the potential to host a Fourth Round match will have the weekend to give their preferred hosting date before U.S. Soccer balances the already scheduled league games. Because of the logistical process, hosting dates are expected to be announced sometime next week. , 34940=A third round pick in the 2003 MLS SuperDraft, Chicago Fire midfielder Logan Pause had already capped off a decade with the Men in Red last year before extending his deal to come back for a 12th season with the club in 2014 on Friday., 73446=When speaking about the team, their attitude, their effort in training and their prospects for the season, Yallop hasn’t changed in his thinking since his arrival at Toyota Park last October. If anything, he is more optimistic now than before the season began., 49654=New England’s hope of keeping the Fire scoreless will be dealt a huge blow if 2013 MLS Defender of the Year Jose Goncalves fails to overcome a right quad injury that he picked up last week. Goncalves was outstanding against the Fire last season. His strength and positional awareness often masks many of the deficiencies in partner A.J. Soares., 107255=With those done, I will underscore that the most important principle to keep in mind for how pairings are determined comes from Page 7 of the 2014 U.S. Open Cup Handbook. It states:, 34621=Logan's longevity got me thinking about players that held the longest consecutive tenures in terms of both years and games played ith one MLS club. After some research, I found that Fire legend and new assistant coach C.J. Brown holds the record for consecutive seasons with one team at 13, while Logan will tie Cobi Jones (LA Galaxy) and Pablo Mastroeni (Colorado Rapids) when he makes his first appearance for the Fire in 2014. , 108515=The Fourth Round draw for the 2014 Lamar Hunt U.S. Open Cup occurred Friday morning at Soccer House in downtown Chicago and with MLS teams entering at this stage, the process was much more elaborate than the straight forward flips from last week’s Third Round draw., 29224=In Corrales' case, while he never played for another MLS club other than San Jose after being traded back to the Quakes in 2001, he did spend a few years abroad in Norway with HamKam that keep him out of the consecutive seasons count. Corrales spent a total of 12 seasons in San Jose over three stints (1996-97, 2001-04, 2008-13), 49920=In 2013, the Revs stood tall and kept an MLS best 14 clean sheets. After a dismal start this year, conceding four in Houston, Jay Heaps’ defense is starting to show its strengths once more, allowing just three goals in their last four matches., 74706=However, four of those seven games were on the road, so if the Fire can pick up all three points at home to Real Salt Lake on Saturday, May 3 after a bye week, the complexion of the season, and more importantly the table, will suddenly look a whole lot better., 125190=Quote Sheet     Chicago Fire at New England Revolution Gillette Stadium - Foxborough, Mass. July 12, 2014 – MLS Regular Season, 25254=2001-2004; 2008-2013}",
    "TableContextTimeStampAfterTable": "{7570=© 2014 MLS. All Major League Soccer trademarks and copyrights used by permission. All rights reserved. Made by MLS Digital}",
    "lastModified": "Fri, 31 Jul 2015 21:33:59 GMT",
    "textBeforeTable": "Just for fun, a look at the record number for consecutive appearances for MLS club is below too: In Corrales' case, while he never played for another MLS club other than San Jose after being traded back to the Quakes in 2001, he did spend a few years abroad in Norway with HamKam that keep him out of the consecutive seasons count. Corrales spent a total of 12 seasons in San Jose over three stints (1996-97, 2001-04, 2008-13) You may be wondering where are Jaime Moreno and Ramiro Corrales? Good question. Moreno holds the MLS record for most seasons with one club, spending 14 years with D.C. United but he did have one stint with the MetroStars that broke up his two long stints in the nation's capital. *-denotes active MLS player 228 8 2001-2009 New England Revolution Jay Heaps 10 216 9* 2005-present LA Galaxy Landon Donovan 9 237 9 2000-2008 Kansas City Wizards Kerry Zavagnin 8 247 9 1996-2004 Dallas Burn Jason Kreis 7 218 10 2002-2011 Sporting KC Davy Arnaud 6 261",
    "textAfterTable": "*-denotes active MLS player Blog Player Chicago Fire Colorado Rapids D.C. United FC Dallas LA Galaxy New England Revolution San Jose Earthquakes Sporting Kansas City MLS Regular Season 1 2 3 4 5 6 7 next › last » News and Blogs Latest News Latest Blogs",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}