{
    "relation": [
        [
            "Outcome",
            "Runner-up",
            "Winner",
            "Winner",
            "Winner",
            "Runner-up",
            "Runner-up",
            "Winner",
            "Runner-up"
        ],
        [
            "No.",
            "1.",
            "1.",
            "2.",
            "3.",
            "2.",
            "3.",
            "4.",
            "4."
        ],
        [
            "Date",
            "February 24, 2013",
            "March 3, 2013",
            "July 7, 2014",
            "July 27, 2014",
            "August 17, 2014",
            "October 19, 2014",
            "March 21, 2015",
            "April 4, 2015"
        ],
        [
            "Championship",
            "U.S. National Indoor Tennis Championships, United States",
            "Delray Beach International Tennis Championships, United States",
            "Wimbledon, United Kingdom",
            "Atlanta Tennis Championships, United States",
            "Cincinnati Masters, United States",
            "If Stockholm Open, Stockholm, Sweden",
            "Indian Wells Masters, United States",
            "Miami Masters, United States"
        ],
        [
            "Surface",
            "Hard (i)",
            "Hard",
            "Grass",
            "Hard",
            "Hard",
            "Hard (i)",
            "Hard",
            "Hard"
        ],
        [
            "Partner",
            "James Blake",
            "James Blake",
            "Vasek Pospisil",
            "Vasek Pospisil",
            "Vasek Pospisil",
            "Treat Huey",
            "Vasek Pospisil",
            "Vasek Pospisil"
        ],
        [
            "Opponents in the final",
            "Bob Bryan Mike Bryan",
            "Max Mirnyi Horia Tecău",
            "Bob Bryan Mike Bryan",
            "Steve Johnson Sam Querrey",
            "Bob Bryan Mike Bryan",
            "Eric Butorac Raven Klaasen",
            "Simone Bolelli Fabio Fognini",
            "Bob Bryan Mike Bryan"
        ],
        [
            "Score in the final",
            "1–6, 2–6",
            "6–4, 6–4",
            "7–6(7–5), 6–7(3–7), 6–4, 3–6, 7–5",
            "6–3, 5–7, [10–5]",
            "3–6, 2–6",
            "4–6, 3–6",
            "6–4, 6–7(3–7), [10–7]",
            "3–6, 6–1, [8–10]"
        ]
    ],
    "pageTitle": "Jack Sock - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Jack_Sock",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865220200,
    "recordOffset": 865179993,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30879=His second tournament was the 2015 Miami Open, in which he won his first two matches, including beating 21st seed Fabio Fognini, before losing to Dominic Thiem in the third round. He made the doubles final, again partnering with Pospisil, but lost in a third set tiebreaker to the Bryan brothers., 20333=After winning his first Grand Slam title, Sock returned to competing on the Challenger Tour.[12] His most successful tournament was the Sacramento Challenger, in which he reached in the quarterfinals of the singles tournament and, partnering Nicholas Monroe, the final of the doubles tournament.[13] Sock finished 2011 ranked no. 381 in the singles, and no. 370 in the doubles., 22177=Jack played in the 2012 Campbell's Hall of Fame Tennis Championships, and lost in the second round to Izak van der Merwe. Sock's next tournament was the 2012 BB&T Atlanta Open. He upset the number 7 seed of the tournament, Alex Bogomolov, Jr.. He made it to the quarterfinals where he lost to John Isner. At the US Open, Sock defeated the number 22 seed, Florian Mayer, in the first round when Mayer retired. He then went on to defeat world number 85 Flavio Cipolla of Italy in straight sets, setting up his first ever Grand Slam third round match against 11th seed Nicolás Almagro,[16] however he was defeated in 4 sets. In the final two months of the 2012 season Sock reached his first two Challenger Tour finals, winning at Tiburon in October and finishing as runner-up in the November Champaign-Urbana Challenger. These finals helped him rise to the top 150 for the first time.[17], 12766=As a junior, Sock reached as high as No. 22 in the world combined rankings in October 2010. He played his first ITF junior tournament in October 2008, aged 16, at the Pan American Championships.[3] In the 2009 US Open, his third junior tournament, he reached the semifinals of the junior doubles with Matthew Kandath, and the third round of the junior singles., 29327=Sock beat Bernard Tomic and world number 6 player Kei Nishikori to reach third round of the 2014 Shanghai Rolex Masters., 29656=In December, he underwent hip surgery, sidelining him for the start of the 2015 season.[22], 32587=At the French Open, Jack upset 10th seeded Grigor Dimitrov in the first round in straight sets. He continued his run by beating Pablo Carreño Busta in four sets and teenager Borna Ćorić in straight sets. At age 22, He became the youngest American to reach the round of 16 at French Open since Pete Sampras in 1993. In the 4th round he lost in four sets to defending champion Rafael Nadal., 17068=Sock began playing in Futures tournaments in 2009, winning his first senior tournament on that circuit in November 2009.[6] He entered his first qualifying draw for an ATP tournament at the 2010 Miami Masters.[7] His first main-draw match as a professional came at the 2010 US Open, where he lost to Marco Chiudinelli.[5] Sock finished the 2010 season ranked 878th in the world.[8], 27671=Jack began his 2014 campaign in Auckland, opening his campaign against Frenchman Adrian Mannarino. His aggressive playing style was too much for his opponent, winning in straight sets to set up a match with German second seed Tommy Haas. In a considerable upset, Sock defeated the world number 12 in straight sets to advance to the quarterfinals. There he faced Spaniard Roberto Bautista-Agut, however lost in straight sets. He then gained his first direct entry into the Australian Open main draw, after having failed to qualify the previous year. He started strongly, defeating German Tobias Kamke in four sets in his opening match before losing to former world number 7 Gaël Monfils in the second round., 30203=After missing the first two months of 2015 ATP season, Sock made his return at 2015 BNP Paribas Open. He won his first three matches, including victories over seeded players Gilles Muller and Roberto Bautista Agut. He lost in the fourth round to second seed Roger Federer in straight sets. In doubles, he resumed his partnership with Pospisil to win their first Masters level tournament., 21429=In 2012, Sock won the Futures tournament at Plantation, as well as losing in the doubles final.[14] Stepping back up to the Challenger level, he competed at the Honolulu Challenger, making the quarterfinals of the singles tournament and, alongside Nick Monroe, once again made the final of the doubles tournament.[15], 35928=Furthermore, Sock is very fast around the court, and is particularly good at running around his backhand to hit powerful inside-in or inside-out forehands. His great court speed allows him to retrieve many shots and use his forehand, his main weapon from the baseline, more frequently. Sock aggressively slides his left foot on the ground when running to his forehand, which wore a hole in his sock and shoe, and drew blood, at the 2015 BNP Paribas Open., 18284=In 2011, he reached the final of the USA F3 tournament.[9] He also began to play in a few tournaments at Challenger level, with his biggest success being a quarterfinal at the Dallas Challenger. He also competed in the main draw of the 2011 Miami Masters. As 2010 US Junior champion, he received a wildcard into the 2011 US Open, winning his first ATP match against Marc Gicquel in four sets. He advanced to play his idol Andy Roddick, a fellow Nebraskan in the second round, however he lost in straight sets.[10] Sock's real breakthrough came in the mixed doubles, however, where he advanced to the final alongside Melanie Oudin, defeating the defending champions Bob Bryan and Liezel Huber in the second round.[11] In the final, Sock and Oudin defeated Gisela Dulko and Eduardo Schwank in three sets to win their first Grand Slam title, both individually and together., 13730=Sock played relatively infrequently on the junior circuit, however, entering just two further tournaments: the Dunlop Orange Bowl in 2009 and the junior singles at the 2010 U.S. Open.[4] At this tournament, he received a wildcard entry, but proceeded to the final. There, he defeated fellow American Denis Kudla in three sets, to become the first American winner of the junior championships since Andy Roddick in 2000.[5] He won the Boy's Junior National Tennis Championship in 2010 [5] and 2011, earning a wildcard in both years for the main draw of the US Open., 24446=Sock had a slow start to 2013, losing in the qualifying of the Brisbane International and the 2013 Australian Open.[18] However, he received a wildcard entry into the U.S. National Indoor Tennis Championships, in which he gained his first wins of the season in reaching the quarter-final, the second of his career.[19] In the doubles competition at the same tournament Sock teamed up with James Blake, also a wildcard entry, reaching the final where the pair lost to the Bryan Brothers.[20] Sock made it through three rounds of qualifying without dropping a set to get into the main draw of the 2013 French Open. In the first round he defeated the accomplished player Guillermo García-López in only 1 hour and 59 minutes. He then lost to the 35 year old veteran Tommy Haas in straight sets.[21] He tried to qualify for Wimbledon for the first time, but although seeded second, lost to Mischa Zverev. He returned to the US to win his 2nd career Challenger level title in Winnetka, IL on July 6, allowing him to break into the top 100 for the first time in his career. At the US Open, he defeated Philipp Petzschner in the first round, going 5 games to 2 up in the third set before Petzschner retired. Sock then went on to beat Maximo Gonzalez, however lost to 18th seed Janko Tipsarević in the third round. Following the US Open, his career ranking rose to 86., 7367=Jack Sock (born September 24, 1992) is an American professional tennis player currently on the ATP Tour. His singles success includes an ATP title and the boys' junior US Open title in 2010. He also regularly plays doubles, winning the 2014 Wimbledon title with Vasek Pospisil and the 2011 US Open mixed doubles title with Melanie Oudin., 34558=Retired American tennis player Andy Roddick has remarked that he and young Sock have similar playing styles, saying, “[Sock] kind of has the half take up with the serve. He’s got the flailing elbow on the forehand and the backhand.” Sock feels that he and Spaniard Rafael Nadal, currently ranked number 10 in the world (8 June 2015), actually have a more similar playing style, stating in an interview last year that “Nadal prefers the forehand to the backhand and hits with incredible spin. I also like to hit with more spin than pace and prefer my forehand.”[24], 28853=At the 2014 Wimbledon Championships, Sock at the last moment teamed up with Canadian Vasek Pospisil, where they eventually went on to win the Men's Doubles title in a five set final against the Number one seeds, Bob and Mike Bryan., 79696=This table is current through the 2014 US Open., 35531=He has excellent touch at net, being able to hit volley winners with ease. While he does not come to net often, in recent months he has played a great deal of doubles, both improving his net game and showcasing his impressive reflexes. This improved net game helped him and Vasek Pospisil win the 2014 Wimbledon doubles title., 31360=Jack continued his successful start to the year by winning his first ATP tournament, the 2015 U.S. Men's Clay Court Championships. En route to the title, he knocked off second seed, Roberto Bautista Agut, fifth seed, Santiago Giraldo, third seed Kevin Anderson, and defeating eighth seed Sam Querrey 7/6 7/6 in the final. He then competed in the 2015 Mutua Madrid Open in Spain advancing to the second round by beating wildcard Pablo Andujar in straight sets before losing to 12th seed Jo-Wilfried Tsonga 3/6 6/1 6/7(4).[23], 68221=Won tournament; or reached Final; Semifinal; Quarter-final; Round 4, 3, 2, 1; competed at a Round Robin stage; lost in Qualification Round; absent from tournament event; played in a Davis Cup - / Fed Cup Zonal Group (with its number indication) or Play-off; won a bronze, silver (F or S) or gold medal at the Olympics; a downgraded Masters Series/1000 tournament (Not a Masters Series); or a tournament that was Not Held in a given year.}",
    "lastModified": "Wed, 29 Jul 2015 06:34:25 GMT",
    "textBeforeTable": "Doubles: 1 (1–0)[edit] Grand Slam finals[edit] Significant finals[edit] Some commentators have remarked that his technique on the forehand, while quite effective, actually hinders his ability to hit returns well. If Sock has a successful singles career, it will be in spite of, not because of, his technique, according to retired American tennis champion and now commentator Jim Courier. Furthermore, Sock is very fast around the court, and is particularly good at running around his backhand to hit powerful inside-in or inside-out forehands. His great court speed allows him to retrieve many shots and use his forehand, his main weapon from the baseline, more frequently. Sock aggressively slides his left foot on the ground when running to his forehand, which wore a hole in his sock and shoe, and drew blood, at the 2015 BNP Paribas Open. He has excellent touch at net, being able to hit volley winners with ease. While he does not come to net often, in recent months he has played a great deal of doubles, both improving his net game and showcasing his impressive reflexes. This improved net game helped him and Vasek Pospisil win the 2014 Wimbledon doubles title. Jack has a very strong service game, being able to hit serves at",
    "textAfterTable": "Outcome No. Date Championship Surface Opponent Score in the final Winner 1. April 12, 2015 U.S. Men's Clay Court Championships, United States Clay Sam Querrey 7–6(11–9), 7–6(7–2) Doubles: 8 (4 titles, 4 runners-up)[edit] Winner – Legend Grand Slam tournaments (1–0) ATP World Tour Finals (0–0) ATP World Tour Masters 1000 (1–2) ATP World Tour 500 Series (0–1) ATP World Tour 250 Series (2–1) Titles by Surface Hard (3–4) Clay (0–0) Grass (1–0) Carpet (0–0) Outcome No. Date Championship Surface Partner Opponents in the final Score in the final Runner-up 1. February 24, 2013 U.S. National Indoor Tennis Championships, United States Hard (i) James Blake",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}