{
    "relation": [
        [
            "Citing Patent",
            "US7358441",
            "US7367830",
            "US7561399 *",
            "US7616420 *",
            "US7623011",
            "US8035947 *",
            "US20020080545 *",
            "US20120307477 *"
        ],
        [
            "Filing date",
            "Apr 3, 2007",
            "Mar 7, 2006",
            "Feb 9, 2006",
            "Dec 26, 2000",
            "Oct 12, 2005",
            "May 1, 2009",
            "Dec 26, 2000",
            ""
        ],
        [
            "Publication date",
            "Apr 15, 2008",
            "May 6, 2008",
            "Jul 14, 2009",
            "Nov 10, 2009",
            "Nov 24, 2009",
            "Oct 11, 2011",
            "Jun 27, 2002",
            "Dec 6, 2012"
        ],
        [
            "Applicant",
            "Eaton Corporation",
            "Eaton Corporation",
            "Landis+Gyr, Inc.",
            "Landis+Gyr, Inc.",
            "R. J. Reynolds Tobacco Company",
            "Panamax Corporation",
            "Slater Byron J.",
            "Fujitsu Limited"
        ],
        [
            "Title",
            "Electrical enclosure assembly and electrical enclosure",
            "Busway fitting with switch mounted perpendicular to primary axis",
            "Excessive surge protection method and apparatus",
            "Excessive surge protection method and apparatus",
            "Device for remotely operating a circuit breaker apparatus and associated assembly and method",
            "Controlled convection thermal disconnector",
            "Excessive surge protection method and apparatus",
            "Electronic device"
        ]
    ],
    "pageTitle": "Patent US6411486 - Surge protected electrical power distribution system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6411486?dq=6,049,612",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480646611,
    "recordOffset": 480625263,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While specific embodiments of the invention have been described in detail, it will be appreciated by those skilled in the art that various modifications and alternatives to those details could be developed in light of the overall teachings of the disclosure. Accordingly, the particular arrangements disclosed are meant to be illustrative only and not limiting as to the scope of invention which is to be given the full breadth of the claims appended and any and all equivalents thereof. As shown in FIG. 12, the surge protector unit 210 is suitably mechanically mounted to the upstream side (e.g. the left side of FIG. 12) and is directly electrically connected to the electrical power bus 224 of the main disconnect unit 212 (e.g., a fuse and switch, a circuit breaker). Alternatively, as shown in FIG. 8, the surge protector unit 124 is mounted on the downstream side (e.g., the right side of FIG. 8) of the main disconnect unit 122. Although an exemplary configuration of the surge protector unit 210 (left), main disconnect unit 212 (center), and multiple meter unit 214 (right) is shown in FIG. 12, a wide range of equivalent configurations of these and other units may be provided in which the electrical power buses thereof are electrically connected in series. The exemplary surge protector units 6,124,178,202,210 may be mounted in combination with new or existing disconnect units or other group metering applications. These surge",
    "textAfterTable": "US4688135 Aug 8, 1986 Aug 18, 1987 Eagle Electric Mfg. Co., Inc. Duplex electrical receptacle with replaceable surge suppressor US4886468 Dec 8, 1988 Dec 12, 1989 General Electric Company Insulated electrical power distribution busway tabs US4980801 May 19, 1989 Dec 25, 1990 La Telemecanique Electrique Protection module for a contact-maker electromagnet US5023747 Apr 12, 1990 Jun 11, 1991 Efi Electronics Corporation Meter base surge suppresion system US5229909 Feb 13, 1991 Jul 20, 1993 Square D Company Surge suppression and fault containment circuit and packaging therefor US5414587 Dec 30, 1992 May 9, 1995 Trw Inc. Surge suppression device US5483212 Oct 14, 1993 Jan 9, 1996 Klockner-Moeller Gmbh Overload relay to be combined with contactors US5606299 Nov 14, 1995 Feb 25, 1997 Eaton Corporation Modular surge suppressor US5781844 * Dec 2, 1996 Jul 14, 1998",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}