{
    "relation": [
        [
            "Citing Patent",
            "US6944262 *",
            "US7833013",
            "US7839970",
            "US8073101",
            "US8126112",
            "US8423335",
            "US8498374",
            "US8989567 *",
            "US8998609 *",
            "US20040197728 *",
            "US20130209954 *",
            "DE102005023875A1 *"
        ],
        [
            "Filing date",
            "Jan 24, 2003",
            "Dec 13, 2006",
            "Sep 12, 2005",
            "Oct 31, 2007",
            "Oct 13, 2008",
            "Oct 6, 2011",
            "Sep 14, 2012",
            "May 23, 2014",
            "Feb 11, 2013",
            "Jul 24, 2003",
            "Feb 11, 2013",
            "May 24, 2005"
        ],
        [
            "Publication date",
            "Sep 13, 2005",
            "Nov 16, 2010",
            "Nov 23, 2010",
            "Dec 6, 2011",
            "Feb 28, 2012",
            "Apr 16, 2013",
            "Jul 30, 2013",
            "Mar 24, 2015",
            "Apr 7, 2015",
            "Oct 7, 2004",
            "Aug 15, 2013",
            "Nov 30, 2006"
        ],
        [
            "Applicant",
            "Massie Ronald E",
            "Diers Nelson R",
            "Massie Ronald E",
            "Massie Ronald E",
            "Massie Ronald E",
            "Alain Methot",
            "Osseo Imaging, Llc",
            "Apollo Oral Scanner, LLC",
            "The Board Of Trustees Of The Leland Stanford Jr. University",
            "Amir Abolfathi",
            "Manu Prakash",
            "Silvia Zilian"
        ],
        [
            "Title",
            "Dental and orthopedic densitometry modeling system and method",
            "Device, method and kit for determining orthodontic dimensions",
            "Dental and orthopedic densitometry modeling system and method",
            "Digital modality modeling for medical and dental applications",
            "Osseo classification system and method",
            "Dental analysis method and system",
            "Dental and orthopedic densitometry modeling system and method",
            "Dental scanner device and system and methods of use",
            "Techniques for standardized imaging of oral cavity",
            "Architecture for treating teeth",
            "Techniques for Standardized Imaging of Oral Cavity",
            "Assessment of used dental prostheses, for potential recipients, measures their geometry for comparison with plaster casts for a match with production and material cost savings"
        ]
    ],
    "pageTitle": "Patent US6821116 - System for scanning oral environment - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6821116?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476301679,
    "recordOffset": 476275482,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that the invention is not to be limited to the exact configuration as illustrated and described herein. Accordingly, all expedient modifications readily attainable by one of ordinary skill in the art from the disclosure set forth herein, or by routine experimentation therefrom, are deemed to be within the spirit and scope of the invention as defined by the appended claims. After the teeth have been imaged, the dental professional can prepare the teeth to receive the necessary restorations. After the tooth or teeth have been prepared to receive the restoration(s), an image of the prepared teeth can be taken and forwarded to the technician for use in connection with the formulation of the proper size and color of a ceramic buildup or other suitable material. The technician can also take into consideration the color of the prepared tooth when preparing the restoration. The inclusion of the shade of the prepared tooth can be incorporated into the final color calculations so that the closest match can be made. Another use of the image is to compare the image to shade and color standard guides, such as VITA™, BIOFORM™, or CHROMASCOP™ to determine the patient's tooth shade. The digital processor could then relay this information to a lab technician, where the tooth shade may be matched to the shade of the tooth to be replaced, or to the patient's adjacent or contra-lateral teeth.",
    "textAfterTable": "US6206691 Oct 4, 1999 Mar 27, 2001 Shade Analyzing Technologies, Inc. System and methods for analyzing tooth shades US6210159 Feb 3, 2000 Apr 3, 2001 Shade Analyzing Technologies, Inc. System and methods for analyzing tooth shades US6244865 * Dec 6, 1999 Jun 12, 2001 Sensormedics Corporation Tongue positioning device with optional filter US6386867 * Nov 30, 2000 May 14, 2002 Duane Milford Durbin Method and system for imaging and modeling dental structures US20020058229 * Oct 23, 2001 May 16, 2002 Orange House Co., Ltd. Dentition image reading apparatus * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6944262 * Jan 24, 2003 Sep 13, 2005 Massie Ronald E Dental and orthopedic densitometry modeling system and method US7833013",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}