{
    "relation": [
        [
            "Citing Patent",
            "US8197892",
            "US8308325 *",
            "US8309484 *",
            "US8513157",
            "US8795588"
        ],
        [
            "Filing date",
            "Nov 16, 2007",
            "Apr 30, 2008",
            "May 31, 2007",
            "Jun 30, 2011",
            "May 31, 2007"
        ],
        [
            "Publication date",
            "Jun 12, 2012",
            "Nov 13, 2012",
            "Nov 13, 2012",
            "Aug 20, 2013",
            "Aug 5, 2014"
        ],
        [
            "Applicant",
            "Ppg Industries Ohio, Inc",
            "Murakami Corporation",
            "Carrier Corporation",
            "Carrier Corporation",
            "Carrier Corporation"
        ],
        [
            "Title",
            "Method of making coated articles and coated articles made thereby",
            "Image pickup device-equipped rear-view mirror",
            "Preparation and manufacture of an overlayer for deactivation resistant photocatalysts",
            "Deactivation resistant photocatalysts",
            "Systems and methods for removal of contaminants from fluid streams"
        ]
    ],
    "pageTitle": "Patent US6908698 - Composite material - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6908698?dq=2040248",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459593923,
    "recordOffset": 459568742,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28055=Conventionally techniques have been known in which a photocatalyst is coated on the surface of a substrate to decompose and remove dirt etc. adhered on the surface thereof or to make the surface hydrophilicity. For example, Japanese Patent Laid-Open No. 63-100042 discloses a technique in which a photocatalyst is coated on the surface of a substrate to decompose and remove dirt etc. adhered on the surface thereof. Also, Japanese Patent Laid-Open No. 10-36144 and Japanese Patent Laid-Open No. 2000-53449 disclose techniques in which a photocatalyst layer is formed on the surfaced of a substrate, and a porous inorganic oxide layer is further formed thereon as the outermost layer to obtain hydrophilicity possessed by the outermost porous inorganic oxide layer and to decompose and remove dirt adhered on the surface of the outermost porous inorganic oxide layer through the lower photocatalyst layer, whereby the hydrophilicity possessed by the outermost porous inorganic oxide layer is maintained. International Patent Publication WO96/29375 discloses a technique in which a photocatalyst layer is formed on the surface of a substrate whereby the hydrophilicity possessed by the photocatalyst itself is utilized to make the surface of the substrate hydrophilicity.}",
    "textBeforeTable": "Patent Citations , from which reflecting film 68 and protective coating 69 are removed. FIG. 9 has a configuration of FIG. 13 , from which reflecting film 68 and protective coating 69 are removed. EC element 104 as shown in FIG. 8 has a configuration of FIG. 12 , from which reflecting film 68 and protective coating 69 are removed. EC element 102 as shown in FIG. 7 has a configuration of FIG. 11 , except that transparent electrode 96 is placed instead of electrode/reflecting film 42 and glass substrate 98 comprises transparent glass substrate. EC element 100 as shown in FIG. 5 has a configuration of FIG. 10 to 13. They can be used as light controlling windows, e.g., for constructions and automobiles. The same number or symbols will be applied to the parts, which are the same as those of the forgoing embodiments. EC element 94 as shown in FIGS. 10 Embodiments of EC elements, entire area of which is transparent, utilizing the composite material according to the present invention will be shown in represent the same numbers or symbols. FIGS. 7 and 8 is configured that EC layer 90 is composed of an EC solution. EC layer 90 is sealed by sealing material 92. In this figure,",
    "textAfterTable": "EP0737513A1 Oct 30, 1995 Oct 16, 1996 Kanagawa Academy Of Science And Technology Titanium oxide photocatalyst structure and method of manufacturing the same EP1066878A1 Sep 28, 1999 Jan 10, 2001 Nippon Sheet Glass Co., Ltd. Photocatalyst article, article prevented from fogging and fouling, and process for producing article prevented from fogging and fouling * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US8197892 Nov 16, 2007 Jun 12, 2012 Ppg Industries Ohio, Inc Method of making coated articles and coated articles made thereby US8308325 * Apr 30, 2008 Nov 13, 2012 Murakami Corporation Image pickup device-equipped rear-view mirror US8309484 * May 31, 2007 Nov 13, 2012 Carrier Corporation Preparation and manufacture of an overlayer for deactivation resistant photocatalysts US8513157 Jun 30, 2011 Aug 20, 2013 Carrier Corporation Deactivation resistant photocatalysts",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}