{
    "relation": [
        [
            "Cited Patent",
            "US3008089 *",
            "US3324224 *",
            "US3419813 *",
            "US3428866 *",
            "US3489956 *",
            "US3500428 *",
            "US3577181 *",
            "US3626259 *",
            "US3649872 *",
            "GB1206675A *"
        ],
        [
            "Filing date",
            "Feb 20, 1958",
            "Sep 1, 1965",
            "Jun 22, 1967",
            "Dec 12, 1966",
            "Apr 27, 1967",
            "Aug 30, 1967",
            "Feb 13, 1969",
            "Jul 15, 1970",
            "Jul 15, 1970",
            ""
        ],
        [
            "Publication date",
            "Nov 7, 1961",
            "Jun 6, 1967",
            "Dec 31, 1968",
            "Feb 18, 1969",
            "Jan 13, 1970",
            "Mar 10, 1970",
            "May 4, 1971",
            "Dec 7, 1971",
            "Mar 14, 1972",
            ""
        ],
        [
            "Applicant",
            "Bell Telephone Labor Inc",
            "Raytheon Co",
            "Rca Corp",
            "Ibm",
            "Nippon Electric Co",
            "Gen Electric",
            "Rca Corp",
            "Trw Inc",
            "Trw Inc",
            ""
        ],
        [
            "Title",
            "Semiconductive device comprising p-i-n conductivity layers",
            "High frequency interconnections",
            "Wide-band transistor power amplifier using a short impedance matching section",
            "Solid state device including electrical packaging arrangement with improved electrical connections",
            "Semiconductor device container",
            "Microwave hybrid microelectronic circuit module",
            "Transistor package for microwave stripline circuits",
            "High-frequency semiconductor package",
            "Packaging structure for high-frequency semiconductor devices",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US3740672 - Semiconductor carrier for microwave applications - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3740672?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466870819,
    "recordOffset": 466848203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10029=[ June 19, 1973 Primary ExaminerRudolph V. Rolinec Assistant Examiner-Wm. H. Punter Attorney-G. l-l. Bruestle, Donald S. Cohen and Sanford .1. Asman [57] ABSTRACT A semiconductor carrier, having microstrip transmission means designed integrally into the carrier structure, includes a ground plane member of electrical and thermally conductive material having a notch therein extending continuously from two adjacent surfaces thereof. A microstrip transmission pedestal of thermally conductive material is mounted within the notch and has its upper surface partially covered with an electrically conductive film that is separated from the ground plane member. A semiconductor element, having at least two electrodes on its surface-is mounted on the conductive-film on the upper surface of the pedestal. An input microstrip transmission section is mounted on an upper-surface of the ground plane member and extends to an edge of the notch. One semiconductor elementelectrode is electrically connected to the ground plane member and another electrode is electrically connected to the input microstrip section.-, 9409=317/234 H, 234 G, 234 A, 101 CP; 174/DIG. 3, DIG. 330/56; 340/174 BP, 174 GB; 29/626 [56] I Reierences Cited f v UNITED STATES PATENTS 3,489,956 l/l970 Yanai et al. 317/234 G 3,428,866 2/1969 Chiou et al. 317/234 G 3,649,872 3/1972 Garboushian t 317/234 G 3,008,089 \"ll/1961 Uhlir, Jr. 333/84 M 3,324,224 6/1967, Thibodeaut... 317/234 A 3,419,813 12/1968 Kamnitsis 333/84 M 3,500,428 3/1970 Allen 333/84 M 3,577,181 5/1971 Belohoubek 333/84 M 3,626,259 12/1971 Garboushian et al l74/DlG. 3 FOREIGN PATENTS OR APPLICATIONS 1,206,675 9/1970 Great Britain 330/56 Adolph Presser, Kendall Park, NJ.}",
    "textBeforeTable": "Patent Citations 4. The semiconductor carrier of claim 1 in which said top surface of said semiconductor element is substantially coplanar with said top surface of said ground plane member. 3. The semiconductor carrier of claim 2 in which said slanted portion of said top surface of said ground plane member is recessed such that said upper metallic layer of said input microstrip transmission section is substantially the same height as the nonslanted portions of said top surface of said ground plane member. 2. The semiconductor carrier of claim 1 wherein said input microstrip transmission section is flat and comprises upper and lower metallic layers with a dielectric material sandwiched therebetween. f. means electrically connecting one of said electrodes from said semiconductor element to said plane member and the other of said electrodes from said semiconductor element to said input microstrip transmission section. e. a semiconductor element having a top surface and a bottom surface, said bottom surface being mounted on said microstrip transmission pedestal such that said semi conductor element is electrically and thermally connected to said electrically conductive upper surface of said microstrip transmission pedestal, and said top surface having at least two electrodes connected thereto; and d. an output strip comprising a substantially flat piece of an electrically conductive material mounted on and electrically connected to said electrically conductive upper surface of said microstrip transmission pedestal, said",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4092664 * Jul 21, 1977 May 30, 1978 Hughes Aircraft Company Carrier for mounting a semiconductor chip US5025305 * May 1, 1990 Jun 18, 1991 Kabushiki Kaisha Toshiba Semiconductor device for detecting or emitting a magnetic line of force or light US5122045 * May 9, 1991 Jun 16, 1992 Kabushiki Kaisha Toshiba Mold for molding a package for a semiconductor device for detecting or emitting a magnetic line of force or light US6049126 * Dec 16, 1996 Apr 11, 2000 Nec Corporation Semiconductor package and amplifier employing the same EP0020787A1 * Jul 14, 1980 Jan 7, 1981 Fujitsu Limited High frequency semiconductor unit * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}