{
    "relation": [
        [
            "Citing Patent",
            "US5636460 *",
            "US5970636 *",
            "US8112912 *",
            "US8469622 *",
            "US8888072 *"
        ],
        [
            "Filing date",
            "Sep 18, 1995",
            "Jul 25, 1997",
            "Sep 22, 2009",
            "Nov 18, 2008",
            "Dec 14, 2010"
        ],
        [
            "Publication date",
            "Jun 10, 1997",
            "Oct 26, 1999",
            "Feb 14, 2012",
            "Jun 25, 2013",
            "Nov 18, 2014"
        ],
        [
            "Applicant",
            "Harnischfeger Corporation",
            "Esco Corporation",
            "Columbia Steel Casting Co., Inc.",
            "Esco Corporation",
            "T&T Engineering Services, Inc."
        ],
        [
            "Title",
            "Dragline with cantilevered side-access dump block",
            "Dump block",
            "Dump block with improved assembly features",
            "Pinned connections",
            "Underwater fairlead assembly"
        ]
    ],
    "pageTitle": "Patent US5321902 - Dump block for strip mine rigging apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5321902?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465593985,
    "recordOffset": 465578026,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although preferred embodiments of the invention have been described in the foregoing Detailed Description and illustrated in the accompanying drawings, it will be understood that the invention is not limited to the embodiments disclosed, but is capable of numerous rearrangements, modifications, and substitutions of parts and elements without departing from the spirit of the invention. Accordingly, the present invention is intended to encompass such rearrangements, modifications, and substitutions of parts and elements as fall within the scope of the invention. FIG. 4 provides a sectional view across section line 4--4 in FIG. 3. The internal plate 106 is rigidly attached to both the external plate 108 and the scrub plate 112. The point of attachment is generally curved with a radius of curvature of approximately two inches in one embodiment. However, the radius of curvature of the attachment point can vary with the size of the dump block. The method of attachment can be welding. The curvature is an important advantage of the present invention. Namely, prior art dump blocks have a hard edge along their circumference. A dump rope passing through dump block could rub against that hard edge, fraying the rope. If the dump rope fails, the bucket might suddenly go vertical, dumping its load in the wrong location. The curved edge does not fray the dump rope nor promote kinks in the dump rope. FIG. 3 provides a side view of dump block",
    "textAfterTable": "US5061089 * Apr 16, 1990 Oct 29, 1991 Eaton Corporation Tapered bearing isolator * Cited by examiner Non-Patent Citations Reference 1 Brochure by Esco entitled \"Exploded View of Swivel Dump Block\", p. 6.9. 2 * Brochure by Esco entitled Exploded View of Swivel Dump Block , p. 6.9. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5636460 * Sep 18, 1995 Jun 10, 1997 Harnischfeger Corporation Dragline with cantilevered side-access dump block US5970636 * Jul 25, 1997 Oct 26, 1999 Esco Corporation Dump block US8112912 * Sep 22, 2009 Feb 14, 2012 Columbia Steel Casting Co., Inc. Dump block with",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}