{
    "relation": [
        [
            "Date",
            "7 Mar 2005",
            "24 Aug 2007",
            "16 Dec 2008",
            "21 Dec 2010",
            "31 Oct 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: MIPS TECHNOLOGIES, INC.,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KISSELL, KEVIN D.;PARALOGOS S.A.R.L.;REEL/FRAME:015736/0752 Effective date: 20050122",
            "Owner name: JEFFERIES FINANCE LLC, AS COLLATERAL AGENT,NEW YOR Free format text: SECURITY AGREEMENT;ASSIGNOR:MIPS TECHNOLOGIES, INC.;REEL/FRAME:019744/0001 Effective date: 20070824",
            "Owner name: MIPS TECHNOLOGIES, INC.,CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:021985/0015 Effective date: 20081205",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7711931 - Synchronized storage providing multiple synchronization semantics - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7711931",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 16,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466803323,
    "recordOffset": 466750821,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations These and other novel aspects of the present invention will be apparent to those of ordinary skill in the art upon review of the drawings and the remaining portions of the specification. Therefore, the scope of the invention is to be determined solely by the appended claims. The above-described arrangements of apparatus and methods are merely illustrative of applications of the principles of this invention and many other embodiments and modifications may be made without departing from the spirit and scope of the invention as defined in the claims. Thus, while the present invention has been described herein with reference to particular embodiments thereof, a latitude of modification, various changes and substitutions are intended in the foregoing disclosures, and it will be appreciated that in some instances some features of embodiments of the invention will be employed without a corresponding use of other features without departing from the scope and spirit of the invention as set forth. Therefore, many modifications may be made to adapt a particular situation or material to the essential scope and spirit of the present invention. It is intended that the invention not be limited to the particular terms used in following claims and/or to the particular embodiment disclosed as the best mode contemplated for carrying out this invention, but that the invention will include any and all embodiments and equivalents falling within the scope of the appended claims.",
    "textAfterTable": "US5758142 31 May 1994 26 May 1998 Digital Equipment Corporation Trainable apparatus for predicting instruction outcomes in pipelined processors US5799188 15 Dec 1995 25 Aug 1998 International Business Machines Corporation System and method for managing variable weight thread contexts in a multithreaded computer system US5812811 3 Feb 1995 22 Sep 1998 International Business Machines Corporation Executing speculative parallel instructions threads with forking and inter-thread communication US5835748 19 Dec 1995 10 Nov 1998 Intel Corporation Method for executing different sets of instructions that cause a processor to perform different data type operations on different physical registers files that logically appear to software as a single aliased register file US5867704 22 Feb 1996 2 Feb 1999 Matsushita Electric Industrial Co., Ltd. Multiprocessor system shaving processor based idle state detection and method of executing tasks in such a multiprocessor system US5892934 * 2 Apr 1996 6 Apr 1999 Advanced Micro Devices, Inc. Microprocessor configured to detect a branch to a DSP routine and to direct a DSP to execute said routine",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}