{
    "relation": [
        [
            "Date",
            "Sep 3, 2005",
            "Sep 8, 2009",
            "Oct 11, 2013",
            "Dec 31, 2013",
            "Dec 31, 2013"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "FPAY",
            "SULP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 12",
            "Year of fee payment: 11"
        ]
    ],
    "pageTitle": "Patent US6352726 - Method of killing protozoa - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6352726?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 17,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465259327,
    "recordOffset": 465235833,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations From the above specific examples, it will be apparent to those of skill in the art that certain alterations and modifications may be made to the examples and to the specific hop resins and carbon dioxide pretreatments described without departing from the spirit of the present invention. As to all such alterations and modifications, it is desired that they be included within the purview of this invention, which is to be limited only by the scope, including equivalents, of the following, appended claims. Moreover, it has also been found that carbon dioxide impregnated medium, e.g., carbonated water, has a decidedly inhibitory, even killing effect on protozoa. As set forth in the footnotes to Tables 7 and 8 carbon dioxide solutions, when carbon dioxide was bubbled into the medium for 30 seconds prior to inoculation of the protozoa, but without the addition of hop extract, death occurred within 40 to 50 minutes. Thus, carbon dioxide solutions kill both P. caudatum-type and Chaos sp.-type protozoa. Of course, a source of the carbon dioxide may be other than the pure, gaseous form; for example, it may be generated in situ by the reaction of a carbonate and an acid. The conclusions that have been drawn from these tests is that both the alpha and beta resins of hops, as well as the resin xanthohumol, have a definite ability to kill protozoa, with xanthohumol apparently being the most effective and",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7361374 May 15, 2003 Apr 22, 2008 S.S. Steiner, Inc. Application for hop acids as anti-microbial agents US7910140 Nov 13, 2006 Mar 22, 2011 S.S. Steiner, Inc. Application for hop acids as anti-microbial agents US20050031743 * Feb 10, 2004 Feb 10, 2005 Areso Carlos Longo Antimicrobial casing * Cited by examiner Classifications U.S. Classification 424/725, 424/776, 514/690, 568/366, 426/600 International Classification A61K36/185 Cooperative Classification A61K36/185, A01N65/08 European Classification A01N65/00, A61K36/185 Legal Events Date Code Event Description",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}