{
    "relation": [
        [
            "Year",
            "1995",
            "1996",
            "1997",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "Total"
        ],
        [
            "Conservation Subsidies",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0"
        ],
        [
            "Disaster Subsidies",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0"
        ],
        [
            "Commodity Subsidies",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$1,273",
            "$460",
            "$0",
            "$277",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$2,010"
        ],
        [
            "Total USDA Subsidies 1995-2012",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$1,273",
            "$460",
            "$0",
            "$277",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$0",
            "$2,010"
        ]
    ],
    "pageTitle": "EWG Farm Subsidy Database",
    "title": "",
    "url": "http://farm.ewg.org/persondetail.php?custnumber=A00274051",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 82735019,
    "recordOffset": 82726925,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6106=Note: The information on conservation spending for 2011and 2012 are incomplete due to missing data from USDA's Natural Resource Conservation Service. In addition some payments made in 2010 were not assigned to recipients in the data received from NRCS. Those payments are also not included., 6925=Unfortunately, NRCS has not provided the data to show where these farms and wetlands are located or which farmers or landowners are enrolling in the program, so EWG is unable to allocate these large sums of money to individuals beyond the title companies. Therefore, these companies skew the conservation rankings and payment concentration, which EWG cannot avoid unless and until NRCS makes available the additional farm attribution data. Therefore, we have not included WRP payments in the 2011 or 2012 data update.}",
    "textBeforeTable": "James S Rockefeller received payments totaling $2,010 from 1995 through 2012 Farm Location(s) Programs by year Programs Summary Analyses: JAMES S ROCKEFELLER ESTATE Share This 677,810,787 searches since Nov. 29, 2004 Press Crop Insurance Farm Payments Some Link Five Some Link Four Some Link Three Some Link Two Some Link One",
    "textAfterTable": "Crop Summary for James S Rockefeller Crop Payments 1995-2012 Tobacco Subsidies $2,010 Counties where payments were made from County Subsidy Payments 1995-2012 Fayette County, Kentucky $0 Cumberland County, North Carolina $2,010 Total $2,010 Note: The information on conservation spending for 2011and 2012 are incomplete due to missing data from USDA's Natural Resource Conservation Service. In addition some payments made in 2010 were not assigned to recipients in the data received from NRCS. Those payments are also not included. The information provided for the Wetland Reserve Program (WRP) provides an inaccurate picture of how WRP payments are distributed. USDA's Natural Resource Conservation Service uses title companies as intermediaries to finalize wetlands easements under the Wetlands Reserve Program. As a result, the data provided to us shows large sums of money going to these title companies. In reality, the payments are ultimately distributed to landowners participating in the WRP. Unfortunately, NRCS has not provided the data to show where these farms and wetlands are located or which farmers or landowners are enrolling in the program, so EWG is unable to allocate these large sums of money to individuals beyond the title companies. Therefore, these companies skew the conservation rankings and payment concentration, which EWG cannot avoid unless",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}