{
    "relation": [
        [
            "",
            "Telephony",
            "SMS",
            "GPRS",
            "WiFi",
            "VoIP",
            "Bluetooth",
            "GPS"
        ],
        [
            "Om 2009",
            "yes",
            "yes",
            "yes ?",
            "yes ?",
            "no",
            "no",
            "yes (1)"
        ],
        [
            "Om 2008",
            "yes",
            "yes",
            "Not through UI",
            "yes (*)",
            "??",
            "yes (*)",
            "yes (1)"
        ],
        [
            "Om 2007.2",
            "yes",
            "yes",
            "Not through UI",
            "yes",
            "??",
            "yes (*)",
            "yes"
        ],
        [
            "SHR",
            "yes",
            "yes",
            "yes",
            "yes",
            "??",
            "yes (*)",
            "yes"
        ],
        [
            "Qt Extended Improved",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes (1)",
            "yes (*)",
            "yes"
        ],
        [
            "Debian",
            "yes (1)",
            "yes (1)",
            "yes (1)",
            "yes",
            "yes",
            "yes (*)",
            "yes (1)"
        ],
        [
            "Gentoo",
            "yes",
            "yes",
            "Not through UI",
            "Not through UI",
            "??",
            "yes",
            "yes (1)"
        ],
        [
            "Android",
            "yes",
            "yes",
            "yes",
            "yes",
            "no",
            "yes",
            "yes"
        ]
    ],
    "pageTitle": "Distributions - Openmoko",
    "title": "",
    "url": "http://wiki.openmoko.org/index.php?title=Distributions&oldid=78082",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 42,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250301927,
    "recordOffset": 250274021,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34999=As of release 12.2, Slackware is now officially supported on the Neo Freerunner [2] --djdas 15:54, 13 June 2009 (UTC)There aren't any confirmations of ArmedSlack running on Freerunner either on the website or the official ML, do you have any link pointing on that?, 7228=Openmoko distributions are designed to run on various mobile devices, with the primary aim of supporting Openmoko Inc.'s Neo 1973 and Neo FreeRunner phones. They are GNU/Linux distributions -- complete operating systems including user applications. You can install any of them on your phone or even have a dualboot system with two distributions installed. For downloads see Download, for installation instructions see Flashing the Neo FreeRunner., 33125=SHR is a community driven distribution. It contains some basic EFL based applications which make use of the FSO. There currently is an EFL (with elementary) dialer, messages and contacts application programmed in C, as well as a nice Settings-GUI in Python. As of April 12th, 2009, there is no stable release of this distribution yet, as the SHR team doesn't feel it to be good enough. You can find images though on the SHR buildhost., 29617=On 5th March 2009 Qt Software released Qt Extended 4.4.3. On 3rd March 2009 Qt Software announced that Qt Extended 4.4.3 would be the last release of the Qt Extended product. Prior to version 4.3, Qt Extended was known as Qtopia., 8282=According to a survey from August 2009 SHR is by far the most used distribution (60%), followed by Om (15%, Om 2007, Om 2008 and Om 2009 counted as one distribution), Debian (6%), the Debian-based Hackable:1 (6%), Qt Extended Improved (5%) and Android (4%).[1] As the development of Om 2009 basically stopped after this poll even more people might switch to SHR., 17834=Hackable1 is a community distribution for hackable devices like the Neo Freerunner. It is based on Debian and 2007.2 userland which has been abandoned by Openmoko. It follows the GNOME mobile platform.}",
    "textBeforeTable": "Hardware Support Open source applications: more games, scientific, you name it... Smartphone applications: GPS, media player, simple games, web browser... Basic telephony applications: voice calls, SMS, alarm clock... Libraries and application framework (widget toolkit and and graphical environment) : EFL, Qt, Gtk+ or Java ? Display driver. The original Qt Extended uses the framebuffer, most other distributions today use X11. Middleware: daemons to handle GSM calls or GPS, sound system, personal information storage and so on. Qt and Android have their own subsystems, FreeSmartphone.Org (FSO) is working towards a standard-based Free Software one. The kernel. GNU/Linux kernels versions 2.6.24, 2.6.26 or 2.6.28 can be found. Some have modules compiled in, others have modules compiled separately. If compiled separately, modules can be distributed in the same package file as the kernel or separately. The bootloader. Theoretically, any version of uboot could be used with any distribution. In the future Qi will replace uboot. The bootsplash screen image. This is purely decorative. Generally, distributions can differ on one or more of the following components: Features by distribution/release target Archlinux is a distribution that follows the KISS principle. mySTEP by Openmoko distributor Golden Delicious Computers is based on GNUstep and brings a Objective-C API to the Neo. Core GUI frameworks are \"Foundation\"",
    "textAfterTable": "yes Not through UI yes VoIP no  ??  ??  ?? yes (1) yes  ?? no Bluetooth no yes (*) yes (*) yes (*) yes (*) yes (*) yes yes GPS yes (1) yes (1) yes yes yes yes (1) yes (1) yes Power Om 2009 Om 2008 Om 2007.2 SHR Qt Extended Improved Debian Gentoo Android Suspend yes yes  ?? yes yes yes yes yes Resumes on Event yes  ??  ?? yes yes yes yes  ?? Functions after Resume yes yes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}