{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Club",
            "FC Bayern Munich",
            "FC Schalke 04",
            "Eintracht Frankfurt",
            "Borussia Dortmund",
            "Bayer 04 Leverkusen",
            "Hannover 96",
            "SV Werder Bremen",
            "1. FSV Mainz 05",
            "Hamburger SV",
            "SC Freiburg",
            "Borussia Mönchengladbach",
            "VfB Stuttgart",
            "VfL Wolfsburg",
            "1899 Hoffenheim",
            "1. FC Nuremberg",
            "Fortuna Düsseldorf",
            "Greuther Fürth",
            "FC Augsburg"
        ],
        [
            "Matches",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12",
            "12"
        ],
        [
            "W*",
            "10",
            "7",
            "7",
            "6",
            "6",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "3",
            "3",
            "2",
            "1",
            "1"
        ],
        [
            "D*",
            "1",
            "2",
            "2",
            "4",
            "3",
            "2",
            "2",
            "2",
            "2",
            "4",
            "4",
            "4",
            "2",
            "3",
            "3",
            "5",
            "4",
            "3"
        ],
        [
            "L*",
            "1",
            "3",
            "3",
            "2",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "6",
            "6",
            "6",
            "5",
            "7",
            "8"
        ],
        [
            "G*",
            "33:5",
            "22:14",
            "25:18",
            "26:13",
            "21:17",
            "25:20",
            "20:18",
            "15:14",
            "12:14",
            "16:14",
            "18:23",
            "14:20",
            "12:19",
            "18:26",
            "10:18",
            "11:18",
            "10:23",
            "8:22"
        ],
        [
            "GD*",
            "+28",
            "+8",
            "+7",
            "+13",
            "+4",
            "+5",
            "+2",
            "+1",
            "-2",
            "+2",
            "-5",
            "-6",
            "-7",
            "-8",
            "-8",
            "-7",
            "-13",
            "-14"
        ],
        [
            "Pts.*",
            "31",
            "23",
            "23",
            "22",
            "21",
            "17",
            "17",
            "17",
            "17",
            "16",
            "16",
            "16",
            "14",
            "12",
            "12",
            "11",
            "7",
            "6"
        ],
        [
            "",
            "CL*",
            "CL*",
            "CL*",
            "CL* Qual.",
            "EL* Qual.",
            "EL* Qual.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Play-offs",
            "Relegation",
            "Relegation"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Bundesliga Show » Wolfsburg",
    "title": "",
    "url": "http://www.bundesligalounge.com/archives/category/wolfsburg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357202543,
    "recordOffset": 357175602,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6554=After Felix Magath’s departure in October, it’s no coincidence that Wolfsburg have hit form since., 6432=Popularity and respect are two important things for a coach to have. You don’t have to necessarily be popular but if you have the respect of the players, you’ve got a decent chance of succeeding. The problem for Felix Magath is that he had neither by the time he left Wolfsburg for a second time in October., 12272=Even when the sparkly toothed wonder of York failed and the club re-installed Magath in March 2011 (dispensing with sporting director, Dieter Hoeness at the same time) there was still an expectation of a return to the big time for the Volkswagen owned club even though, by that time, they were out of Europe and almost out of the Bundesliga., 13079=Since the first departure of coach Felix Magath, in 2009, Wolfsburg have looked to appoint high profile coaches, none of whom have come close to emulating that fantastic Bundesliga title winning season at the end of the last decade. However, each appointment was a statement of intent that the Wolves regarded itself as a Champions League and Championship contending club., 10686=However, despite a modest upturn in results it was clear that a more established coach was desirable and reliable sources had former Real Madrid boss and German International, Bernd Schuster nailed on as the man for the job. But it wasn’t to be and reports suggest that the “Blond Angel” who won the European Championship with Allofs in 1980 could not agree terms so an alternative was sort from a largely unexpected place, Nuremberg., 5794=Most spectacularly, in his time at Stuttgart, he once had his players, during training, stand in a circle for 90 minutes in near freezing temperatures after a defeat the day before. This season, his antics have continued. Here’s Raphael Honigstein’s account of what he did to his players in September. (, 9949=When Dieter Hecking succeeded Michael Oenning at the Nuremberg club in November 2009 he succeeded in making the newly promoted side tough to beat. In his two years in charge, Der Club may not be the most interesting team to watch but have remained stable and brought through a number of exciting young players such as, Dennis Diekmeier, Timothy Chandler, Philipp Wollscheid, Alexander Esswein and Hiroshi Kiyotake. Hecking’s virtue’s of building teams with a strong defensive core will be of great value to Wolfsburg in the short term but his ability to turn young players into accomplished Bundesliga footballers will be of greater value in the long term.}",
    "TableContextTimeStampAfterTable": "{30488=His rise to fame was a difficult one. He didn’t just burst onto the scene; instead his first successes were in the lower leagues. In the 2004/05 season he hit 21 goals in 34 games for Sportfreunde Siegen and helped the club gain promotion to the 2.Bundesliga. After that blast of goals, Helmes returned to FC Cologne where he had previously played youth and under-17 football. Over the next three seasons he would follow Cologne down to the second division himself before firing the goals to help get them back again, alongside Milivoje Novakovic., 45456=So, the cat is back, but will this type of old school encouragement work on his current Wolfsburg squad? Magath demonstrated last season during Schalke’s woeful 2010/11 league campaign this sort of managerial style works only in the proper circumstances, and can often backfire with lacklustre results. Last season, Magath isolated players such as Jermaine Jones and Alex Baumjohann in a similar fashion, labeling them as lazy and opting for them to rot on the reserve squad of the Royal Blues during his tenure. This, of course, was the same Jones who was vital in Schalke’s midfield just the previous 2009/10 season and impressive when he was finally able to escape the final days of Magath’s reign while on loan to Blackburn earlier this year. As for Baumjohann, he was returned to the side when Ralf Rangnick took over, and looks to be a first choice substitute as Rangnick rotates his midfield during the Bundesliga and Europa League campaigns this season., 34086=Having spent almost 6-months out of the first team, Helmes was back in the side at the end of February and scored from the penalty spot on his return against Hoffenheim. Since then, three more goals have followed but what does this say about his future? The public attitude of Helmes and Magth is one that suggests that they have put their differences aside, but also this could be more of a functional relationship that suits both parties. Wolfsburg could do with Helmes’ goals to help them grab a place in the Europa League and for the player himself, doing that could be the perfect shop window for another move. At 28, he is probably hoping that the next move will be his most successful and his last., 17760=This in itself was a surprise. After all, Hannover hadn’t won in Wolfsburg since 2006 and they weren’t great on the road last year, picking up just two away wins all season. The Wolves have also been tipped to do well this season and were expected to build on last weekend’s win at Stuttgart., 31503=With 31 goals in two seasons with Cologne, Helmes was certainly getting noticed by other clubs and ones not too far away. Having moved to neighbours Bayer Leverkusen in the summer of 2008, the striker started to his hit best run of form. He formed a partnership with Stefan Kiessling but it was Helmes who was the main goal outlet for Leverkusen. He scored over a third of the teams goals that season and was the clubs top scorer., 31948=He’d already made his debut for Germany by that point, but any progress with the national team and with Leverkusen was cut short as he was hit by a serious injury. While on his summer holiday, he ruptured a cruciate ligament and this kept him out of the side until November of 2009. As a result, Helmes lost his place to Eren Derdiyok and was left to mainly making appearances from the bench.}",
    "textBeforeTable": "Table: Hoffenheim 1-3 Wolfsburg Werder Bremen 2-1 Fortuna Düsseldorf Bayer Leverkusen 2-0 Schalke Nuremberg 1-1 Bayern Munich Hannover 1-2 Freiburg Hamburg 1-0 Mainz Gladbach 1-2 Stuttgart Eintracht Frankfurt 4-2 Augsburg Borussia Dortmund 3-1 Fürth Matchday 12 Results: For more on the Bundesliga, follow @archiert1 on Twitter Meanwhile in mid table, Son-Heung Min ensured Hamburg beat Mainz. Freiburg continue to chug away quietly after they won at Hannover and Stuttgart recovered from their collapse last weekend to win at Gladbach. Werder Bremen were the weekend’s other victors, coming from behind to beat Fortuna Düsseldorf at the Weserstadion. Bayern’s stumble allowed the chasing pack to close the gap and Borussia Dortmund were only too happy to do so. Inspired by Mario Götze, they overcame Greuther Fürth and surprise package Eintracht Frankfurt were also victorious as Alexander Meier continued his rich vein of form. He scored two as the Eagles beat Augsburg. No such luck for Schalke who were lacklustre in a 2-0 defeat to Bayer Leverkusen – the highlight of that was André Schürrle’s stunning opener. The unthinkable happened this weekend – Bayern Munich didn’t just concede a goal away from home, they also failed to win. Nuremberg were the team to stop them as they claimed an unlikely point against the Bundesliga leaders. There was controversy too after Mario Mandzukic’s celebration prompted claims he was showing support to two Croatian generals who had convictions overturned on Friday. Elsewhere in the Bundesliga Diego is likely to",
    "textAfterTable": "Table thanks to official Bundesliga website Article originally written on Football Fan Cast Tags Felix Magath | Permalink | Comment (0) 2.Bundesliga Bundesliga Werder Bremen Wolfsburg The Bundesliga Show Episode 80 – The Future For Allofs November 13, 2012 – 9:32 pm On this weeks edition of The Bundesliga Show, Matt Hermann and Jon Hartley get under the skin of Matchday 12 in the Bundesliga. They also tackle some of the big issues of the week including the future of crowd control in German stadiums, as well as the future for Klaus Allofs, Wolfsburg and Werder Bremen. All that, plus a round-up of the 2.Bundesliga",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}