{
    "relation": [
        [
            "#",
            "2",
            "26",
            "4",
            "23",
            "22",
            "3",
            "16",
            "31",
            "8",
            "24",
            "11",
            "17",
            "18",
            "15",
            "7",
            "5",
            "28",
            "10",
            "13",
            "1",
            "30",
            "27",
            "20",
            "6",
            "12",
            "25",
            "19",
            "9",
            "29",
            "21",
            "14"
        ],
        [
            "Incorporated Community",
            "Coconut Creek",
            "Cooper City",
            "Coral Springs",
            "Dania Beach",
            "Davie",
            "Deerfield Beach",
            "Fort Lauderdale",
            "Hallandale Beach",
            "Hillsboro Beach",
            "Hollywood",
            "Lauderdale-by-the-Sea",
            "Lauderdale Lakes",
            "Lauderhill",
            "Lazy Lake",
            "Lighthouse Point",
            "Margate",
            "Miramar",
            "North Lauderdale",
            "Oakland Park",
            "Parkland",
            "Pembroke Park",
            "Pembroke Pines",
            "Plantation",
            "Pompano Beach",
            "Sea Ranch Lakes",
            "Southwest Ranches",
            "Sunrise",
            "Tamarac",
            "West Park",
            "Weston",
            "Wilton Manors"
        ],
        [
            "Designation",
            "City",
            "City",
            "City",
            "City",
            "Town",
            "City",
            "City",
            "City",
            "Town",
            "City",
            "Town",
            "City",
            "City",
            "Village",
            "City",
            "City",
            "City",
            "City",
            "City",
            "City",
            "Town",
            "City",
            "City",
            "City",
            "Village",
            "Town",
            "City",
            "City",
            "City",
            "City",
            "City"
        ],
        [
            "Date incorporated",
            "000000001967-02-20-0000February 20, 1967",
            "000000001959-06-20-0000June 20, 1959",
            "000000001963-07-10-0000July 10, 1963",
            "000000001904-11-30-0000November 30, 1904",
            "000000001925-11-16-0000November 16, 1925",
            "000000001925-06-11-0000June 11, 1925",
            "000000001911-03-27-0000March 27, 1911",
            "000000001927-05-11-0000May 11, 1927",
            "000000001939-06-12-0000June 12, 1939",
            "000000001925-11-28-0000November 28, 1925",
            "000000001927-11-30-0000November 30, 1927",
            "000000001961-06-22-0000June 22, 1961",
            "000000001959-06-20-0000June 20, 1959",
            "000000001953-06-03-0000June 3, 1953",
            "000000001956-06-13-0000June 13, 1956",
            "000000001955-05-30-0000May 30, 1955",
            "000000001955-05-26-0000May 26, 1955",
            "000000001963-07-10-0000July 10, 1963",
            "000000001929-06-10-0000June 10, 1929",
            "000000001963-07-10-0000July 10, 1963",
            "000000001957-10-10-0000October 10, 1957",
            "000000001959-03-02-0000March 2, 1959",
            "000000001953-04-30-0000April 30, 1953",
            "000000001908-06-06-0000June 6, 1908",
            "000000001959-10-06-0000October 6, 1959",
            "000000002000-06-06-0000June 6, 2000",
            "000000001961-06-22-0000June 22, 1961",
            "000000001963-08-15-0000August 15, 1963",
            "000000002005-03-01-0000March 1, 2005",
            "000000001996-09-03-0000September 3, 1996",
            "000000001947-05-13-0000May 13, 1947"
        ],
        [
            "Population",
            "52,909",
            "28,547",
            "121,096",
            "29,639",
            "91,992",
            "75,018",
            "165,521",
            "37,113",
            "1,875",
            "140,768",
            "6,056",
            "32,593",
            "66,887",
            "24",
            "10,344",
            "53,284",
            "122,041",
            "41,023",
            "41,363",
            "23,962",
            "6,102",
            "154,750",
            "84,955",
            "99,845",
            "670",
            "7,345",
            "84,439",
            "60,427",
            "14,156",
            "65,333",
            "11,632"
        ]
    ],
    "pageTitle": "Broward County, Florida - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Broward_County",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 856323055,
    "recordOffset": 856281651,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87938=From 2008 to 2011, Broward county led the nation in new HIV/AIDS diagnoses, according to federal health officials.[35] The per capita cases of new infections in Broward has not decreased in over a decade, prompting government health agencies to direct more funding to AIDS prevention campaigns in Broward.[35] During that time period, Miami-Dade County was ranked number two nationally for the epidemic. However, as of January 31, 2014, those statistics have reversed, though not dramatically enough to be called an improvement. Some communities in the area have been affected disproportionately, with 48% of the afflicted being in black communities.[36] In Broward County, sexual education in public schools is not mandatory and the curriculum that is employed sporadically has not been updated in ten years or more, according to school officials. In 2013, the Broward County School Board held a vote to require schools to teach sex-ed at least once a year for every grade, a program slated to begin in the 2014-2015 school year if passed.[37], 31419=As of the 2013 Census Estimate,[15] the 2013 population estimate is 1,838,844 which is a 5.2% increase since the 2010 Census., 7552=Broward County is a county located in the U.S. state of Florida. As of 2010, the population was 1,748,066,[1] making it the second-most populous county in Florida and the 18th-most populous in the United States. Its county seat is Fort Lauderdale.[2], 64718=Municipality populations are based on the 2010 Census.[31], 26035=As of the census of 2000, there were 1,623,018 people, 654,445 households, and 411,645 families residing in the county. The population density was 1,346 people per square mile (520/km²). There were 741,043 housing units at an average density of 615 per square mile (237/km²). The racial makeup of the county was 70.57% White (58% were Non-Hispanic),[11] 20.54% Black or African American, 0.24% Native American, 2.25% Asian, 0.06% Pacific Islander, 3.00% from other races, and 3.35% from two or more races. 16.74% of the population were Hispanic or Latino of any race., 28581=Broward is the only county in the nation outside the Northeast in which Italian-Americans formed the largest ethnic group in 2000. They are concentrated mainly in the Pompano Beach area., 15341=Broward County was founded in 1915. It was named for Napoleon Bonaparte Broward, Governor of Florida from 1905 to 1909. It was originally intended to be named Everglades County, but then-Speaker of the Florida House of Representatives Ion Farris amended the bill that established the county to be named after Broward.[3] In 1915, Palm Beach County and Dade County contributed nearly equal portions of land to create Broward County. At its inception Broward County was considered a leader in agricultural products and services within the State of Florida, but the massive post-World War II buildup of South Florida transformed the region. It was one of the counties at the center of the 2000 U.S. Presidential election recount controversy., 37326=According to the most recent estimates from the U.S. Census of 2013, the total population of Broward County had risen to almost 1.85 million people (1,838,844), and increased by 5.2% between April 1, 2010 and July 1, 2013. This number is accounted for by an increase to 90,778 (5.2%) in its Hispanic population., 35579=As of 2010, 32% of Broward residents were foreign born (including naturalized American citizens.) Haitians made up the largest population of immigrants, with Jamaicans coming in second, Colombians in third, followed by Cuban exiled refugees in fourth place, then Peruvians, Venezuelans, Brazilians, Dominicans, Canadians, and Mexicans being the tenth highest group of expatriates.[18], 33971=U.S. Census Bureau 2013 Ethnic/Race Demographics:[17], 31065=According to the Census,[14] Broward County is the 9th largest county with same sex households. As of the 2010 Census, there were 9,125 same sex households out of a total of 686,047 households (1.33%)., 31978=As of 2010, 63.44% of all residents spoke English as their first language, while 22.22% spoke Spanish, 5.42% French Creole, 1.48% Portuguese, 1.41% French, and 0.59% of the population spoke Italian as their mother language. In total, 36.56% of the population spoke languages other than English as their primary language.[16] Since many immigrants are coming from the Anglophone Caribbean, where English is spoken, the change is not as fast as the rate of immigration would suggest.[citation needed], 30366=As of 2005, Broward County led the nation's metropolitan areas in new AIDS diagnoses, with a reported rate 58.4 new AIDS diagnoses per 100,000 people. County officials think the numbers may stem from a new and successful HIV testing campaign that has resulted in many people being diagnosed with AIDS at the same time they've been diagnosed with HIV.[13] Ironically, without the implementation of the new testing campaign, the reported numbers of new diagnoses would have probably been lower., 47875=Over the past fifty years, Broward County has gone from solidly Republican to solidly Democratic. In the 1972 U.S. presidential election, Broward County residents voted overwhelmingly for Richard Nixon over George McGovern. From the 1992 U.S. presidential election onward, however, voters of Broward County backed the Democratic presidential nominee over the Republican nominee by strong majorities. Broward County is now the most reliably Democratic county in the state,[26][27] with the exception of the much less populous Gadsden County. This change in voting tendencies may likely be the result of a continuous flow from large migrations of snowbirds and transplanted people from the historically more liberal Northeastern states and other blue states, as well as a growing LGBT community, and also naturalized U.S. citizens born in places such as Latin America, the Caribbean, Canada, Europe, and Asia.}",
    "lastModified": "Sat, 01 Aug 2015 00:03:02 GMT",
    "textBeforeTable": "Municipality populations are based on the 2010 Census.[31] Communities[edit] Construction is underway on a network of recreational trails to connect cities and points of interest in the county.[28][29][30] Greenways System[edit] Sun Trolley Tri-Rail Broward County Transit Public transportation[edit] Downtown Fort Lauderdale Heliport Pompano Beach Airpark Fort Lauderdale Executive Airport North Perry Airport Fort Lauderdale Hollywood International Airport Airports[edit] Tri-rail and Amtrak run through Broward. Railroads[edit] State Road 869 (Sawgrass Expressway) Florida's Turnpike, including Homestead Extension",
    "textAfterTable": "Neighborhoods[edit] Bonnie Loch-Woodsetter North in Pompano Beach. Broadview-Pompano Park in North Lauderdale. Broward Estates in Lauderhill. Carver Ranches in West Park. Chambers Estates in Dania Beach. Chula Vista Isles in Fort Lauderdale. Collier Manor-Cresthaven in Pompano Beach. Country Estates in Southwest Ranches. Crystal Lake in Deerfield Beach. Edgewater in Dania Beach. Estates of Fort Lauderdale in Dania Beach, and partially in Hollywood. Godfrey Road in Parkland. Golden Heights in Fort Lauderdale. Green Meadow in Southwest Ranches. Hacienda Village in Davie. Hillsboro Ranches in Coconut Creek. Ivanhoe Estates in Southwest Ranches. Kendall Green in Pompano Beach. Lake Forest in West Park. Leisureville in Pompano Beach. Loch Lomond in Pompano Beach. Melrose Park in Fort Lauderdale. Miami Gardens in West Park. North Andrews Gardens in",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}