{
    "relation": [
        [
            "Size",
            "UK 8",
            "UK 10",
            "UK 12",
            "UK 14",
            "UK 16",
            "UK 18"
        ],
        [
            "Waist (CM)",
            "66",
            "71",
            "76",
            "81",
            "86",
            "91"
        ],
        [
            "Hips (CM)",
            "79",
            "81",
            "86",
            "89",
            "91",
            "97"
        ],
        [
            "Rise (CM)",
            "20",
            "20",
            "22",
            "23",
            "24",
            "24"
        ],
        [
            "Inseam (CM)",
            "81",
            "81",
            "81",
            "81",
            "81",
            "81"
        ],
        [
            "Cuff (CM)",
            "28",
            "30",
            "33",
            "36",
            "36",
            "38"
        ]
    ],
    "pageTitle": "Bleeding Heart Plain rose skinny jeans \u0096 emo clothing - womens jeans UK",
    "title": "",
    "url": "https://www.bluebanana.com/product.php/1004335/0/bleeding-heart-plain-skinny-fit-jeans--rose-",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902732191,
    "recordOffset": 902679270,
    "tableOrientation": "VERTICAL",
    "lastModified": "Thu, 30 Jul 2015 06:41:07 GMT",
    "textBeforeTable": "Display size guide in Inches (in) Display size guide in Centimeters (cm) Spice Up Your Look With These Bleeding Heart Skinny Fit JeansMade with 97% cotton and 3% spandex, these Bleeding Heart rose skinny jeans have the ultimate comfort and perfect fit that ensures you can enjoy your favourite activities every day. Their long lasting durability gives you a chance to make the most out of their flexible design and desirable image without that exciting colour fading and stretchy shape becoming loose. Created with a high quality finish, these rose Plain skinny jeans form Bleeding Heart have a high trend design that will not only ensure they keep that flattering shape but also it gives you the best form on the street. Get these Bleeding Heart rose skinny jeans and experience their high quality design that ensures you feel and look great no matter where you are heading. Their stretchy, bold coloured fabric gives these jeans a slimming image that will not only boost your confidence but keep you comfortable all day. Complete with two back pockets and an embroidered leather patch, you can be certain that these rose Plain skinny jeans from Bleeding Heart will always give you a sliming and elongated form that you will love. Description",
    "textAfterTable": "Size Waist (IN) Hips (IN) Rise (IN) Inseam (IN) Cuff (IN) UK 8 26 31 8 32 11 UK 10 28 32 8 32 12 UK 12 30 34 8.5 32 13 UK 14 32 35 9 32 14 UK 16 34 36 9.5 32 14 UK 18 36 38 9.5 32 15 How To Find The Correct Jeans SizeWe know that purchasing clothing on the internet can lead to size mismatches, but not at Blue Banana. We aim to deliver you the perfect size every time! In order to measure your Bleeding Heart jeans size, you need to measure in five key areas and then compare them to the size guide above: 1. Waist \u0096 Measure around your natural waistline. 2. Hips \u0096 Measure around the widest part. 3. Rise \u0096 Measure from the top of your inside leg to waist. 4. Inseam \u0096 Measure from top of your inside leg to ankle bone. 5. Cuff \u0096 Measure the circumference around your ankle.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}