{
    "relation": [
        [
            "S",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "M",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "T",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "W",
            "1",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "T",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "F",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "S",
            "4",
            "11",
            "18",
            "25",
            ""
        ]
    ],
    "pageTitle": "Home | Florida Coalition Against Domestic Violence",
    "title": "",
    "url": "http://www.fcadv.org/home?device=desktop&mini=training%2Fcalendar%2F2013-05",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435608187,
    "recordOffset": 435586228,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2901=In 1977, a small group of 14 shelters in Florida formed a network of battered women’s advocates known as the Refuge Information Network. Several years later, this initial organization was incorporated as the Florida Coalition Against Domestic Violence.  The Coalition, like the Network, was founded on principles of cooperation and unity among shelters. FCADV serves as the professional association for the state’s 42 certified domestic violence centers, and is the primary representative of battered women and their children in the public policy arena.  Members share the goal of ending domestic violence through community education, public policy development and services for victims., 13332=If you need information, want to ask a question or need someone to talk to, we encourage you to call Florida’s toll-free statewide hotline 1-800-500-1119 or to find a certified domestic violence center near you go to Local Services.}",
    "TableContextTimeStampAfterTable": "{15378=Find the local certified domestic violence center nearest you, or call the toll-free statewide hotline, 1-800-500-1119.}",
    "lastModified": "Sat, 01 Aug 2015 13:48:56 GMT",
    "textBeforeTable": "»   May «   Click here for a complete list of scheduled events Upcoming Events & Institutes In 1977, a small group of 14 shelters in Florida formed a network of battered women’s advocates known as the Refuge Information Network. Several years later, this initial organization was incorporated as the Florida Coalition Against Domestic Violence.  The Coalition, like the Network, was founded on principles of cooperation and unity among shelters. FCADV serves as the professional association for the state’s 42 certified domestic violence centers, and is the primary representative of battered women and their children in the public policy arena.  Members share the goal of ending domestic violence through community education, public policy development and services for victims. HISTORY The mission of the Florida Coalition Against Domestic Violence (FCADV) is to create a violence free world by empowering women and children through the",
    "textAfterTable": "What's New at FCADV Shelter Staffing Ratio Evaluation Request for Proposals The Florida Coalition Against Domestic Violence (FCADV) is soliciting evaluation services that will provide us with factual information regarding the ideal ratio of certified domestic violence advocate staff needed to provide optimal services to shelter participants. DUE AUGUST 15, 2015 Are you courageous? Learn more about teen dating violence and how you can be a part of the solution For the current edition of the Florida Voice newsletter click this link View a list of available FCADV Trainings We have updated our calendar to include FCADV trainings available to domestic violence centers and other organization. Home Back to top",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}