{
    "relation": [
        [
            "Date",
            "April 4",
            "April 7",
            "April 9",
            "April 12",
            "April 14",
            "April 16",
            "April 18"
        ],
        [
            "Away",
            "Detroit",
            "Detroit",
            "Toronto",
            "Toronto",
            "Detroit",
            "Toronto",
            "Detroit"
        ],
        [
            "Score",
            "3",
            "4",
            "2",
            "4",
            "3",
            "3",
            "1"
        ],
        [
            "Home",
            "Toronto",
            "Toronto",
            "Detroit",
            "Detroit",
            "Toronto",
            "Detroit",
            "Toronto"
        ],
        [
            "Score",
            "2",
            "2",
            "5",
            "3",
            "9",
            "0",
            "3"
        ],
        [
            "Notes",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "1942 Stanley Cup Finals - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1942_Stanley_Cup_Final",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866509839,
    "recordOffset": 866479512,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9832=The first game was held in Toronto. Detroit's Don Grosso opened the scoring in the second minute before John McCreedy tied it for Toronto. Sid Abel put the Wings ahead, only to have Sweeney Schriner tie it to leave the teams tied after the first period. Grosso scored again at the 14:11 mark of the second and the Wings held off the Leafs from there to win the opening game 2–1.[1], 18010=The seventh and deciding game was again a close game. Detroit survived a two-man disadvantage in the first period and the teams finished the period tied at zero. Detroit's Syd Howe opened the scoring in the second period on a pretty passing play between Abel, Jimmy Orlando, and Howe. The Wings were determined to protect the lead and led after two periods 1–0. Toronto got its chance in the third period to tie the score when Orlando drew a tripping penalty on Apps. Just as the penalty expired, Schriner scored for Toronto in a goalmouth scramble to tie the game. After the goal, Toronto picked up the pace, eventually out-shooting Detroit 16–7 in the third. Pete Langelle scored the series winner two minutes later in another goalmouth scramble. Schhriner scored the third goal for the Leafs at the 16:13 mark to close out the scoring and the unprecedented comeback win was complete.[11], 19141=It was the first time a crowd of over 16,000 attended a hockey game in Canada. 16,218 fans squeezed into Maple Leaf Gardens and remained for an hour after the game waiting for the Leafs to reappear from the dressing room after the game.[11] Coach Day, who had played for the Leafs in their last win in 1932, deadpanned \"We won it the hard way.\" He was asked if he had any doubts during the series, and replied \"I had my doubts right up until that final bell rang.\" Rookie Gaye Stewart, who had joined the club for the fifth game of the final,[7] became the youngest player to win the Stanley Cup as he was still 18 years of age. John McCreedy completed his triple championship with the win. He was a member of the Winnipeg Monarchs' 1937 Memorial Cup win and won an Allan Cup with the Kirkland Lake Blue Devils.[12], 5836=The 1942 Stanley Cup Final was a best-of-seven series between the Toronto Maple Leafs and the Detroit Red Wings. After losing the first three games, the Maple Leafs won the next four to win the series 4–3, winning their fourth Stanley Cup. It was the first Cup Final in history to go seven.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Toronto Maple Leafs vs. Detroit Red Wings Syl Apps with the Stanley Cup It was the first time a crowd of over 16,000 attended a hockey game in Canada. 16,218 fans squeezed into Maple Leaf Gardens and remained for an hour after the game waiting for the Leafs to reappear from the dressing room after the game.[11] Coach Day, who had played for the Leafs in their last win in 1932, deadpanned \"We won it the hard way.\" He was asked if he had any doubts during the series, and replied \"I had my doubts right up until that final bell rang.\" Rookie Gaye Stewart, who had joined the club for the fifth game of the final,[7] became the youngest player to win the Stanley Cup as he was still 18 years of age. John McCreedy completed his triple championship with the win. He was a member of the Winnipeg Monarchs' 1937 Memorial Cup win and won an Allan Cup with the Kirkland Lake Blue Devils.[12] The seventh and deciding game was again a close game. Detroit survived a two-man disadvantage in the first period",
    "textAfterTable": "Toronto wins best-of-seven series 4–3. Toronto Maple Leafs 1942 Stanley Cup champions[edit] Roster    Centres 8 Pete Langelle 10 Sylvanus Syl Apps Sr. (Captain) 21 Billy Taylor Sr.    Wingers 4 Bob Davidson 9 Lorne Carr 11 David Sweeney Schriner 12 Gord Drillon 14 John McCreedy 16 Don Metz 16 Gaye Stewart 19 Nick Metz 20 Hank Goldup    Defencemen 2 Bob Goldham 3 Wally Stanowski 5 Reg Hamilton 6 Rudolph \"Bingo\" Kampman 19 Wilfred Bucko McDonald 23 Ernie Dickens    Goaltenders 1 Walter Turk Broda   Coaching and administrative staff George Cottrelle (President/Owner), Ed Bickle (Vice President/Owners)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}