{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30"
        ],
        [
            "Group",
            "Toyota",
            "General Motors",
            "Volkswagen",
            "Hyundai",
            "Ford",
            "Nissan",
            "FCA (Fiat Chrysler Automobiles)",
            "Honda",
            "Suzuki",
            "PSA Peugeot Citroën",
            "Renault",
            "BMW",
            "SAIC",
            "Daimler",
            "Mazda",
            "Dongfeng",
            "Mitsubishi",
            "Changan",
            "Tata",
            "Geely",
            "BAIC",
            "Fuji",
            "Brilliance",
            "FAW",
            "Mahindra & Mahindra",
            "Great Wall",
            "Isuzu",
            "JAC",
            "BYD",
            "AvtoVAZ"
        ],
        [
            "Country",
            "Japan",
            "United States",
            "Germany",
            "South Korea",
            "United States",
            "Japan",
            "Italy / United States",
            "Japan",
            "Japan",
            "France",
            "France",
            "Germany",
            "China",
            "Germany",
            "Japan",
            "China",
            "Japan",
            "China",
            "India",
            "China",
            "China",
            "Japan",
            "China",
            "China",
            "India",
            "China",
            "Japan",
            "China",
            "China",
            "Russia"
        ],
        [
            "Total",
            "10,324,995",
            "9,628,912",
            "9,379,229",
            "7,233,080",
            "6,077,126",
            "4,950,924",
            "4,681,704",
            "4,298,390",
            "2,842,133",
            "2,833,781",
            "2,704,675",
            "2,006,366",
            "1,992,250",
            "1,781,507",
            "1,264,173",
            "1,238,948",
            "1,229,441",
            "1,109,889",
            "1,062,654",
            "969,896",
            "918,879",
            "808,919",
            "782,904",
            "717,883",
            "584,534",
            "557,564",
            "532,966",
            "517,577",
            "510,950",
            "507,242"
        ],
        [
            "Cars",
            "8,565,176",
            "6,733,192",
            "9,259,506",
            "6,909,194",
            "3,317,048",
            "4,090,677",
            "2,163,040",
            "4,263,239",
            "2,452,573",
            "2,445,889",
            "2,347,913",
            "2,006,366",
            "1,685,392",
            "1,631,502",
            "1,175,443",
            "642,092",
            "1,090,571",
            "873,794",
            "650,708",
            "969,896",
            "243,437",
            "808,919",
            "479,335",
            "448,290",
            "407,563",
            "430,423",
            "",
            "206,132",
            "510,950",
            "495,013"
        ],
        [
            "LCV",
            "1,481,722",
            "2,890,958",
            "119,723",
            "242,021",
            "2,667,220",
            "837,331",
            "2,350,697",
            "35,151",
            "389,560",
            "387,892",
            "356,762",
            "",
            "231,374",
            "150,005",
            "88,730",
            "226,319",
            "135,306",
            "166,056",
            "279,511",
            "",
            "285,947",
            "",
            "264,210",
            "61,822",
            "173,398",
            "127,141",
            "36,094",
            "120,588",
            "",
            "12,229"
        ],
        [
            "HCV",
            "272,411",
            "4,762",
            "",
            "67,290",
            "92,858",
            "22,916",
            "124,131",
            "",
            "",
            "",
            "",
            "",
            "74,431",
            "",
            "",
            "357,414",
            "3,564",
            "70,039",
            "117,425",
            "",
            "384,425",
            "",
            "39,359",
            "203,895",
            "2,2337",
            "",
            "494,907",
            "174,571",
            "",
            ""
        ],
        [
            "Heavy Bus",
            "5,686",
            "",
            "",
            "14,575",
            "",
            "",
            "43,836",
            "",
            "",
            "",
            "",
            "",
            "1,053",
            "",
            "",
            "13,123",
            "",
            "",
            "15,010",
            "",
            "5,070",
            "",
            "",
            "3,876",
            "1,236",
            "",
            "1,965",
            "16,286",
            "",
            ""
        ]
    ],
    "pageTitle": "Automotive industry - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Automobile_manufacturer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861233775,
    "recordOffset": 861192291,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{871=1990s; Korea became a volume producer. In 2004, Korea became No. 5 passing France., 765=2000s; China increased its production drastically, and 2009 became the world largest producing country., 11418=The automotive industry began in the 1890s with hundreds of manufacturers that pioneered the horseless carriage. For many decades, the United States led the world in total automobile production. In 1929 before the Great Depression, the world had 32,028,500 automobiles in use, and the U.S. automobile industry produced over 90% of them. At that time the U.S. had one car per 4.87 persons.[3] After World War II, the U.S. produced about 75 percent of world's auto production. In 1980, the U.S. was overtaken by Japan and became world's leader again in 1994. In 2006, Japan narrowly passed the U.S. in production and held this rank until 2009, when China took the top spot with 13.8 million units. With 19.3 million units manufactured in 2012, China almost doubled the U.S. production, with 10.3 million units, while Japan was in third place with 9.9 million units.[4] From 1970 (140 models) over 1998 (260 models) to 2012 (684 models), the number of automobile models in the U.S. has grown exponentially.[5], 6855=Around the world, there were about 806 million cars and light trucks on the road in 2007, consuming over 980 billion litres (980,000,000 m3) of gasoline and diesel fuel yearly.[7] The automobile is a primary mode of transportation for many developed economies. The Detroit branch of Boston Consulting Group predicts that, by 2014, one-third of world demand will be in the four BRIC markets (Brazil, Russia, India and China). Meanwhile, in the developed countries, the automotive industry has slowed down.[8] It is also expected that this trend will continue, especially as the younger generations of people (in highly urbanized countries) no longer want to own a car anymore, and prefer other modes of transport.[9] Other potentially powerful automotive markets are Iran and Indonesia.[10] Emerging auto markets already buy more cars than established markets. According to a J.D. Power study, emerging markets accounted for 51 percent of the global light-vehicle sales in 2010. The study, performed in 2010 expected this trend to accelerate.[11][12] However, more recent reports (2012) confirmed the opposite; namely that the automotive industry was slowing down even in BRIC countries.[8] In the United States, vehicle sales peaked in 2000, at 17.8 million units.[13]}",
    "TableContextTimeStampAfterTable": "{76661=The table below shows the world's largest motor vehicle manufacturing groups, along with the marques produced by each one. The table is ranked by 2013 production figures from the International Organization of Motor Vehicle Manufacturers (OICA)[34] for the parent group, and then alphabetically by marque. Joint ventures are not reflected in this table. Production figures of joint ventures are typically included in OICA rankings, which can become a source of controversy.[36][37]}",
    "lastModified": "Thu, 30 Jul 2015 11:14:21 GMT",
    "textBeforeTable": "Rank of manufacturers by production in 2013[34] By manufacturer[edit] \"Production Statistics\". OICA.  743,680  Iran 791,007  Argentina 975,000  Slovakia 1,125,534  Turkey 1,132,931  Czech Rep. 1,208,211  Indonesia 1,597,433  UK",
    "textAfterTable": "OICA[35] defines these entries as follows: Passenger cars are motor vehicles with at least four wheels, used for the transport of passengers, and comprising no more than eight seats in addition to the driver's seat. Light commercial vehicles (LCV) are motor vehicles with at least four wheels, used for the carriage of goods. Mass given in tons (metric tons) is used as a limit between light commercial vehicles and heavy trucks. This limit depends on national and professional definitions and varies between 3.5 and 7 tons. Minibuses, derived from light commercial vehicles, are used for the transport of passengers, comprising more than eight seats in addition to the driver's seat and having a maximum mass between 3.5 and 7 tons. Heavy trucks (HCV) are vehicles intended for the carriage of goods. Maximum authorised mass is over the limit (ranging from 3.5 to 7 tons) of light commercial vehicles. They include tractor vehicles designed for towing semi-trailers. Buses and coaches are used for the transport of passengers, comprising more than eight seats in addition to the driver's seat, and having a maximum mass over the limit (ranging from 3.5 to 7 tones) of light commercial vehicles. Company relationships[edit] It is common for automobile manufacturers to hold stakes in other automobile manufacturers. These ownerships can be explored under the detail for the individual companies. Notable current relationships include:[",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}