{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "",
            ""
        ],
        [
            "Company Name",
            "ATHENE ANNUITY & LIFE ASSURANCE COMPANY OF NEW YORK",
            "ATHENE ANNUITY & LIFE ASSURANCE COMPANY",
            "ATHENE ANNUITY AND LIFE COMPANY",
            "Subtotal for Selection:",
            "Total for Entire Market:"
        ],
        [
            "Average Annual Premium Volume 2010-2012",
            "$382,509",
            "$17,633,070",
            "$140,927,742",
            "$158,943,321",
            "$8,513,943,942"
        ],
        [
            "Market Share 2010-2012",
            "0.00%",
            "0.21%",
            "1.66%",
            "1.87%",
            "100.00%"
        ],
        [
            "Number of Complaints 2010-2012",
            "3",
            "8",
            "14",
            "25",
            "1075"
        ],
        [
            "Complaint Index",
            "6200",
            "359",
            "79",
            "",
            ""
        ]
    ],
    "pageTitle": "Complaint Index | Missouri Department of Insurance, Financial Institutions & Professional Registration",
    "title": "",
    "url": "http://insurance.mo.gov/consumers/complaints/compindx.php?formPost=1&setDel=0&line=Life&compName=ATHENE%20ANNUITY%20&%20LIFE%20ASSURANCE%20COMPANY&sortby=company_name&year=2012&B1=Submit",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 121353150,
    "recordOffset": 121344948,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "2012 Complaint Index An index of 100 is considered average   The complaint index compares the ratio of complaints to premium sales for each company to the industry average, for each line of business. The formula is: 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 Year Three-year period ending: Company Name Average Premium Number of Complaints Complaint Index Sort By Sort By: Company Name Company Name: Private passenger auto Homeowners Life and annuities Health HMO's Long-term care insurance Medicare Supplement Insurance Line Line of Insurance: The DIFP encourages consumers to use the complaint index as a \"tiebreaker\" in choosing an insurance policy - after carefully considering individual insurance needs, benefits, premium costs, service and other factors in your purchasing decision. You can also search complaints by reason. More",
    "textAfterTable": "View a semicolon-delimited text list to copy into a spreadsheet. Topics for Consumers Auto Agent/Agency Search Autism Insurance Resources Consumer Complaints FAQ Glossary of Terms (Alphabetical) Glossary of Terms (Categorized) Health (Including Federal Health Care Reform) HMOs Homeowners Insurance Company Search Life & Annuities Long-Term Care Medical Loss Ratio Hearing Publications Seniors Medigap CLAIM Severe Weather Small Business Teens Workers' Compensation Vehicle Service Contracts File a Complaint Complaint Index Find an Agent/Agency Find an Insurance Company Missouri Department of Insurance Truman State Office Building Room 530 P.O. Box 690 Jefferson City, MO 65102 (573) 751-4126 Map to Office About the Department About Us About the Director Contact Us FAQ's Industry Forms Purchasing (Vendors)",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}