{
    "relation": [
        [
            "Rk",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "AA",
            "2",
            "4",
            "6",
            "3",
            "3",
            "3"
        ],
        [
            "Lvl",
            "55",
            "55",
            "55",
            "62",
            "63",
            "64"
        ],
        [
            "Expansion",
            "Shadows of Luclin",
            "Shadows of Luclin",
            "Shadows of Luclin",
            "Planes of Power",
            "Planes of Power",
            "Plane of Power"
        ],
        [
            "Prerequisites",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "EQ:Combat Fury :: Wiki :: EverQuest :: ZAM",
    "title": "",
    "url": "http://everquest.allakhazam.com/wiki/EQ:Combat_Fury",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 84568887,
    "recordOffset": 84561011,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Rank Requirements This ability increases your chance to land a critical hit. Non-Warriors will nearly match the original critical hit abilities of Warriors, while Warriors will remain significantly ahead of other classes. Bard Beastlord Monk Paladin Shadowknight 30 Type: Passive Expansion: Shadows of Luclin Total AA: 21 Classes: Bard, Beastlord, Monk, Paladin, Shadowknight Combat Fury Quick Facts EQ:Combat Fury   Wiki search Recent changes What links here Print this page Main page Tools Discuss Media History View",
    "textAfterTable": "Alternate Name PoP Ability old format tab is called Fury of the Ages 1-3 for ranks 4-6 Quick Facts Combat Fury Type: Passive Expansion: Shadows of Luclin Total AA: 21 Classes: Berserker, Warrior 309 Berserker Warrior This ability increases your chance to land a critical hit. Non-Warriors will nearly match the original critical hit abilities of Warriors, while Warriors will remain significantly ahead of other classes. further increases your chance to score a critical blow against your opponent. Rank Requirements Rk AA Lvl Expansion Prerequisites 1 2 55 Shadows of Luclin 2",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}