{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Boat Model",
            "BASS BUGGY® 16 DLX With all the fishing features you and your crew need to catch the big ones, the BASS BUGGY 16 DLX is ready for fun!",
            "BASS BUGGY® 16 DLX ET Reliable, environmentally friendly electric power for unlimited family fun and fishing!",
            "BASS BUGGY® 18 DLX The BASS BUGGY 18 DLX is designed for three things: Family, Fishing, and Fun!",
            "FISHIN' BARGE® 20 DLX With room for a crew of up to 10, the FISHIN' BARGE 20 DLX is fully equipped to make your time on the water a pure joy for everyone in the family.",
            "FISHIN' BARGE® 22 DLX Go big with the FISHIN' BARGE 22 DLX! It’s loaded with fishing features and comfortably designed to please everyone in the family. For a limited time, receive a FREE Custom Boat Cover or a $500 Bass Pro Shops gift card on purchase of a 2015 SUN TRACKER FISHIN’ BARGE 22 DLX.",
            "FISHIN' BARGE® 22 XP3 The NEW FISHIN’ BARGE® 22 XP3 with easy-clean vinyl flooring provides everything you and your crew need to reel ‘em in.",
            "FISHIN' BARGE® 24 DLX Our biggest dual-pontoon, the 24 DLX boasts an expansive deck footprint of over 200 square feet, and it's outfitted with an impressive collection of fishing and comfort advantages.",
            "FISHIN' BARGE® 24 XP3 If you yearn for a bigger family boat that provides more fishing features, you need to check out the FISHIN’ BARGE® 24 XP3."
        ],
        [
            "Length",
            "16'",
            "16'",
            "20'",
            "21' 11''",
            "22' 2''",
            "22' 2''",
            "26' 2''",
            "26' 2''"
        ],
        [
            "Beam",
            "85\"",
            "85\"",
            "98\"",
            "102\"",
            "102\"",
            "102\"",
            "102\"",
            "102\""
        ],
        [
            "Person Cap.",
            "7 Person",
            "7 Person",
            "8 Person",
            "10 Person",
            "10 Person",
            "10 Person",
            "12 Person",
            "12 Person"
        ],
        [
            "Price",
            "$11,395* USA",
            "$13,095* USA",
            "$15,395* USA",
            "$17,995* USA",
            "$20,995* USA",
            "$26,595* USA",
            "$25,195* USA",
            "$29,595* USA"
        ],
        [
            "View Prices w/Prep & Freight",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "SUN TRACKER Boats : 2014 Regency Edition Boats",
    "title": "",
    "url": "http://www.suntrackerboats.com/regency-pontoons.cfm?modelyear=2013&segmentOrderBy=personasc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 732731173,
    "recordOffset": 732715244,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "NMMA certified, letting you know they are built to meet and exceed the highest industry standards. REGENCY boats are Refine your on-the-water excursions and upscale your excitement with an exclusive REGENCY pontoon boat. And, on most models, the XP3 performance package provides three logs with lifting strakes, hydraulic steering and high-horsepower outboard motors for fast excitement rivaling that of a runabout boat. Whoever said luxury had to be slow had yet to see a REGENCY pontoon! ™ offers the ultimate in uncompromising luxury, refinement and excitement to discriminating boaters. REGENCY Kick off your shoes and grab a cooling drink. Relax the day away as you soak up the sun. Revel in compliments and admiring looks from friends and onlookers. Dial up the music to supply a soundtrack to your entertaining. Serve your guests with grace and style. And when the sun sets below the horizon, just turn on the courtesy lighting to keep your soiree going well into the night. Uncompromising elegance. Refinement with distinction. #segmentPromotion h3 {font-size:2em; line-height:1em; color:white; text-shadow: 0px 2px 2px rgba(0, 0, 0, 0.8);} #segmentPromotion h2 {font-size:3.8em; font-weight:bold; color:white; text-shadow: 0px 3px 3px rgba(0, 0, 0, 0.8);} .segmentPromoImage {margin:0 0 20px 0;} #segmentPromotion {position:relative;}",
    "textAfterTable": "Copyright © 2015, Tracker Marine Group. All Rights Reserved. Get the Gear You Need for Your SUN TRACKER Boat Shop Bass Pro Shops for all the supplies to make your new SUN TRACKER pontoon boat the perfect relaxation destination for friends and family. Whether tubing or wakeboarding, swimming or fishing, Bass Pro Shops has a full assortment of swimming gear, fishing supplies, water sports accessories, and much more to make your new SUN TRACKER your perfect weekend",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}