{
    "relation": [
        [
            "Player",
            "Bryce Harper",
            "Wade Miley",
            "Todd Frazier",
            "Wilin Rosario",
            "Norichika Aoki",
            "Yonder Alonso",
            "Matt Carpenter",
            "Jordan Pacheco"
        ],
        [
            "Team",
            "Nationals",
            "D-backs",
            "Reds",
            "Rockies",
            "Brewers",
            "Padres",
            "Cardinals",
            "Rockies"
        ],
        [
            "1st",
            "16",
            "12",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "2nd",
            "8",
            "13",
            "7",
            "2",
            "2",
            "0",
            "0",
            "0"
        ],
        [
            "3rd",
            "8",
            "6",
            "9",
            "1",
            "5",
            "1",
            "1",
            "1"
        ],
        [
            "Points",
            "112",
            "105",
            "45",
            "12",
            "11",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Reds infielder Todd Frazier places third in NL Rookie of the Year voting | reds.com",
    "title": "Voting results for NL Rookie of the Year, conducted by the Baseball Writers' Association of America",
    "url": "http://m.reds.mlb.com/news/article/40253682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 153287275,
    "recordOffset": 153261868,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3203=Frazier batted .273 with 19 home runs and 67 RBIs in 128 games in 2012. Among NL rookies, he was second in RBIs and slugging percentage (.498). He was tied for second with six triples, third in homers and 10th in batting average., 5229=From Aug. 8-Sept. 8, Frazier reached base safely in a career-best 30-straight games -- the longest stretch by a Reds hitter in 2012., 3084=The last Reds player to win NL Rookie of the Year honors was reliever Scott Williamson in 1999., 3922=The final cut from the Reds' 25-man roster the day before the regular season commenced, Frazier made his return to the Majors in mid-April. But he didn't crack the starting lineup regularly until third baseman Scott Rolen went on the disabled list on May 12. After that, it was hard to keep him out of the lineup as his popularity on and off of the field soared., 4308=On May 23, Frazier connected for the first walk-off home run of his big league career in a ninth-inning win over the Braves. Four days later vs. the Rockies' Jamie Moyer, Frazier hit an improbable homer after he threw his bat at the ball. And the following night, he even proved clutch off of the field when Frazier saved a man from choking at a Pittsburgh restaurant by performing the Heimlich maneuver., 4736=About a month after Rolen returned from the DL, Frazier was needed to play first base regularly when star Joey Votto went on the DL on July 16. In 47 games while Votto was out, Frazier batted .305 with eight homers and 32 RBIs.}",
    "textBeforeTable": "2012 NL ROOKIE OF YEAR VOTING D-backs lefty Wade Miley finished in second place with 12 first-place votes and 105 total points. Frazier, who was named a finalist for the award on Wednesday, had three first-place votes, seven second-place votes and nine third-place votes and finished with 45 points in the 5-3-1 tabulation system. Nationals outfielder Bryce Harper was the winner with 112 total points, including 16 first-place votes out of 28 ballots cast by members of the Baseball Writers' Association of America. CINCINNATI -- After breaking out with a strong first full year in the Majors, Reds infielder Todd Frazier finished third in National League Rookie of the Year voting when results were revealed on Monday. 0 COMMENTS + | MLB.com By Mark Sheldon / Todd Frazier talks about winning the Players Choice NL Outstanding Rookie of the Year award and where he will donate to charity",
    "textAfterTable": "The last Reds player to win NL Rookie of the Year honors was reliever Scott Williamson in 1999. Frazier batted .273 with 19 home runs and 67 RBIs in 128 games in 2012. Among NL rookies, he was second in RBIs and slugging percentage (.498). He was tied for second with six triples, third in homers and 10th in batting average. Versatility proved to be a key asset for the 26-year-old Frazier, who made 36 starts at first base, 66 starts at third base and seven starts in the outfield. He was also good off the bench as he went 6-for-12 as a pinch-hitter. Last week, Frazier beat out Harper and Miley when his Major League peers voted him as the NL's outstanding rookie winner in the Major League Baseball Players Association Players Choice Award. The final cut from the Reds' 25-man roster the day before the regular season commenced, Frazier made his return to the Majors in mid-April. But he didn't crack the starting lineup regularly until third baseman Scott Rolen went on the disabled list on May 12. After that, it was hard to keep him out of the lineup as his popularity on and off of the field soared. On May 23, Frazier connected for the first walk-off home run of his big league career in a ninth-inning win over the Braves. Four days later vs. the Rockies' Jamie Moyer, Frazier hit an improbable",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}