{
    "relation": [
        [
            "Program Area",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE"
        ],
        [
            "Course Number",
            "CIS162AB",
            "CIS166AA or CIS166AB or CIS166AC or CIS166AD or CIS166AE or CIS166AF",
            "CIS259",
            "CIS262AB",
            "CIS262AD",
            "CIS263AA",
            "CIS224",
            "CIS249",
            "CIS250",
            "CIS190 or CNT140 or CNT140AA or MST140"
        ],
        [
            "Course Name",
            "C++: Level I",
            "Introduction to Javascripting or Web Scripting with Perl/CGI or Web Scripting with Active Server Pages (ASP).NET or Web Scripting with (JSP) or Web Scripting with PHP: Hypertext Preprocessor (PHP) or Web Scripting with Python",
            "Visual Basic Programming II",
            "C++: Level II",
            "C# Level II",
            "Java Programming: Level II",
            "Project Management Microsoft Project for Windows",
            "Software Testing for Quality Assurance",
            "Management of Information Systems",
            "Introduction to Local Area Networks or Cisco Networking Basics or Introduction to Networks or Microsoft Networking Essentials"
        ],
        [
            "Prerequisites",
            "CIS105 or Permission of Instructor",
            "CIS133CA, or CIS133DA, or Permission of Instructor",
            "CIS159 or Permission of Instructor",
            "CIS162AB or Permission of Instructor",
            "CIS162AD or Permission of Instructor",
            "CIS163AA or Permission of Instructor",
            "",
            "CIS159 or CIS162AB or CIS162AD or CIS163AA or Permission of Instructor",
            "CIS105",
            "CIS105 or Permission of Instructor"
        ],
        [
            "Notes",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Credits",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3–4"
        ]
    ],
    "pageTitle": "Associate in Applied Science in Computer Programming | Programs & Degrees | Mesa Community College",
    "title": "",
    "url": "http://www.mesacc.edu/programs/course-sequences/computer-programming-aas",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 583535799,
    "recordOffset": 583519846,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33108=mesacc.edu  |  480-461-7000  |  © 2015 Mesa Community College  |  A Maricopa Community College The Maricopa County Community College District is an EEO/AA institution and an equal opportunity employer of protected veterans and individuals with disabilities.}",
    "textBeforeTable": "Select from the following courses to meet the Restricted Electives requirement. Program Electives 15 Restricted Electives RE 15 Credits Notes Prerequisites Course Name Course Number Program Area Term 4 4 Any approved general education course in the Natural Sciences area Natural Science NS 3 Any approved general education course in the Humanities and Fine Arts area Humanities and Fine Arts HUM 3 CIS105 or Permission of Instructor Java Programming: Level I CIS163AA RC 3 CIS105 or Permission of Instructor C#: Level I CIS162AD RC 13 Credits Notes Prerequisites Course Name Course Number Program Area Term 3 3 Society and Business SBU200 SB",
    "textAfterTable": "Ready to get started? Follow one of the options below to get started on your personal career pathway. Become a Student Click here for MCC's easy-to-use Student Checklists. Program Information Learn more about and find contact information for the Computer Information Systems program. General Help Ask general questions over the phone at 480-461-7400 or via online chat. Disclaimer All information is administered by the Center for Curriculum and Transfer Articulation at Maricopa County Community College District and published is subject to change without notice. Every effort has been made to ensure the accuracy of information presented, but based on the dynamic nature of the curricular process, course and program information is subject to change in order to reflect the most current information available. View MCCCD's program website for the Associate in Applied Science in Computer Programming (https://aztransmac2.asu.edu/cgi-bin/WebObjects/acres.woa/wa/freeForm3?id=26042).",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}