{
    "relation": [
        [
            "First Name",
            "Robert",
            "Robert",
            "Roger",
            "Roger",
            "Ron",
            "Ryan",
            "Sandra",
            "Sarah",
            "Scott",
            "Sean"
        ],
        [
            "Last Name",
            "Palmer",
            "Rodes",
            "Alford",
            "Jacobs",
            "Dolin",
            "McCaffrey",
            "Klein",
            "Pojanowski",
            "Hengert",
            "O'Brien"
        ],
        [
            "Middle Name",
            "",
            "",
            "P.",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Office",
            "1100 Eck Hall of Law",
            "",
            "3118 Eck Hall of Law",
            "3355 Biolchini Hall",
            "",
            "1100 Eck Hall of Law",
            "2353 Biolchini Hall",
            "2186 Eck Hall of Law",
            "1188D Eck Hall of Law",
            "2161 Eck Hall of Law"
        ],
        [
            "Phone",
            "574.631.6627",
            "",
            "574.631.3771",
            "574.631.5868",
            "",
            "",
            "574.631.8447",
            "574.631.1871",
            "574.631.5766",
            "574.631.8544"
        ],
        [
            "Fax",
            "574.631.4197",
            "",
            "574.631.4197",
            "",
            "",
            "",
            "574.631.6371",
            "",
            "",
            "574.631.8702"
        ],
        [
            "Email",
            "Robert.J.Palmer.11@nd.edu",
            "",
            "ralford@nd.edu",
            "Roger.F.Jacobs.1@nd.edu",
            "",
            "",
            "klein.26@nd.edu",
            "Sarah.B.Pojanowski.2@nd.edu",
            "Scott.M.Hengert.1@nd.edu",
            "Sean.B.O'Brien.17@nd.edu"
        ],
        [
            "Website",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "SSRN Page",
            "",
            "http://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=431258",
            "http://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=460060",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "CV Upload",
            "",
            "http://www.nd.edu/~ndlaw/faculty/cv/rodes_cv.pdf",
            "http://www.nd.edu/~ndlaw/faculty/cv/alford_cv.pdf",
            "",
            "",
            "",
            "",
            "",
            "",
            "/assets/72145/original/obrien_cv.pdf"
        ],
        [
            "Department Role",
            "Faculty",
            "",
            "Faculty",
            "Faculty",
            "Faculty",
            "Faculty",
            "Faculty",
            "Faculty",
            "Staff",
            "Faculty Staff"
        ],
        [
            "Faculty Type",
            "Adjunct",
            "Emeriti",
            "Deans Tenured and Tenure-Track",
            "Emeriti",
            "Adjunct",
            "Adjunct",
            "Library",
            "Legal Writing",
            "",
            "Concurrent"
        ],
        [
            "Areas of Expertise",
            "",
            "Church & State Jurisprudence Law & Religion Legal Education Legal Ethics Legal History Medieval Legal History Professional Responsibility",
            "Comparative Law",
            "Legal Education Legal Research",
            "",
            "",
            "",
            "",
            "",
            "Human Rights Law"
        ],
        [
            "Personal Bio",
            "",
            "Robert E. Rodes Jr. joined the Notre Dame Law School faculty in 1956 as an assistant professor of law, achieved the rank of associate professor of law in 1958, and a professor of law in 1963. In 2000, the University honored Professor Rodes over 40 years of teaching and scholarship in the fields of legal ethics and jurisprudence by naming him the first permanent holder of the Paul J. Schierl/Fort Howard Paper Corporation Chair in Legal Ethics. He earned his A.B. from Brown University in 1947 and his LL.B. magna cum laude from Harvard in 1952, where he also served on the staff of the Harvard Law Review. A member of the Massachusetts Bar since 1952 and the Indiana Bar since 1959, Professor Rodes has worked as an attorney with Liberty Mutual Insurance Company in Boston (1952-54), with Kaufman & Harris in Pittsburgh (summer 1977), and with the Legal Services Program of Northern Indiana (summer 1982). He has also taught as an assistant professor of law at Rutgers University (1954-56). Professor Rodes teaches and writes in the areas of administrative law, civil procedure, ethics, jurisprudence, law and theology, legal history and welfare legislation. He is a member of the Catholic Commission on Intellectual and Cultural Affairs. Professor Rodes passed away on November 25, 2014.",
            "Roger P. Alford joined the NDLS faculty in January 2012. Prof. Alford teaches and writes in a wide range of subject-matter areas, including international trade, international arbitration, and comparative law. Prof. Alford earned his B.A. with Honors from Baylor in 1985, and his J.D. with Honors from New York University. He also has degrees from Edinburgh University and Southern Seminary. Before entering the legal academy, he served as a law clerk to Judge James Buckley of the United States Court of Appeals for the D.C. Circuit, and Judge Richard Allison of the Iran-United States Claims Tribunal in The Hague, Netherlands. He practiced law with Hogan & Hartson in Washington, D.C., and was also a senior legal advisor to the Claims Resolution Tribunal for Dormant Activities in Switzerland. In addition to publishing widely in leading law reviews and journals, Prof. Alford contributes regularly to the international-law blog, Opinio Juris and is editor of Kluwer Arbitration Blog.",
            "Associate Dean Roger F. Jacobs joined the Notre Dame Law School as director of the Kresge Law Library and professor of law in 1985, after serving from 1978 to 1985 as the librarian of the United States Supreme Court. He became associate dean in 1990. He earned his A.B. from the University of Detroit in 1962, his M.A.L.S. from the University of Michigan in 1964 and his J.D. from the University of Detroit in 1970. He was admitted to the Michigan Bar in 1970. He has worked as a librarian at the University of Detroit (1962-67), and as founding librarian and professor at both the University of Windsor in Ontario, Canada (1967-73), and the University of Southern Illinois (1973-77). His areas of academic interest include legal research and writing, which he taught to first-year students. In addition, he often taught a course introducing foreign students to the American legal system. He gives lectures and presentations to other library professionals as an active member of a number of professional organizations including the American Association of Law Libraries (member since 1963, president 1981-82), the Canadian Association of Law Libraries (since 1967, president 1971-73), the ABA Section of Legal Education and Admissions to the Bar (member since 1970, council member 1990-96). He maintains his strong interest in high-quality legal education through his participation on more than 30 ABA law-school site-review committees and as a consultant to other law libraries including, the Supreme Court of Canada and 10 academic libraries in North America. In 2007 the American Association of Law Libraries honored Dean Jacobs by bestowing on him its Marian Gould Gallagher Distinguished Service Award. Additionally, Dean Jacobs received a 2000 Presidential award for outstanding service to the University and in 2001 he was honored with the Grenville Clark Award, which honors members of the community whose voluntary activities and public service advances the cause of peace and human rights. Dean Jacobs retired from active law school service in 2007.",
            "Ron received his B.A. in math and physics from U.C. Berkeley before heading to Geneva to work at CERN, the high-energy physics lab. After a few years there, he left for graduate work, obtaining a Ph.D. in Computer Science from U.C. Santa Barbara with his dissertation on scalable search. Ron ended up as one of the first 100 employees at Google, and left after several years to get a law degree from U.C. Hastings. Ron is an angel investor, focusing on legal technology startups, and has taught legal technology and informatics at Stanford Law School and Notre Dame Law School. Ron has taught MCLE courses on document automation for the CA Bar, and was on the executive committee of the Bar’s Law Practice Management and Technology section. He co-founded the Program for Legal Technology and Design with SLS alum Margaret Hagan and is working on legal innovation at the Stanford Center on the Legal Profession. Ron has been asked to participate on panels and give talks at universities such as Stanford and Harvard, and organizations such as COLPM, ILTA, and ACC, on issues related to legal technology and innovation. Ron was selected as one of the 2014 Fastcase 50 and 2014 ALM Recorder’s Innovator Award recipient. Ron's current work can be found at his blog at radicalconcepts.com.",
            "Ryan A. McCaffrey is the General Counsel of Post Brothers Apartments, a real estate multi-family developer with properties along the east coast. Prior to taking over as General Counsel Mr. McCaffrey practiced law at Sullivan & Cromwell LLP in the New York City. Mr. McCaffrey has represented real estate private equity sponsors, investment banks, high net worth individuals, developers, real estate operating companies, and hospitality clients in all aspects of private equity real estate transactions, including acquisitions and dispositions, joint ventures, structured finance, and general corporate counseling. Mr. McCaffrey has served as an adjunct professor at the University of Notre Dame Law School since 2012, teaching a class on the practice of transactional law. During his time at Sullivan & Cromwell LLP he served as a member of the Sullivan & Cromwell LLP’s commercial real estate training committee, where he taught various continuing education sessions on structured finance, financing ground leases, and emerging case law in the real estate market place. Prior to attending law school Mr. McCaffrey was the President and Co-Founder of McCaffrey Realty Professionals, a residential real estate brokerage company. He holds a J.D. from the University of Notre Dame. He recently published New York City’s Annual Income and Expenses Statement Filing Requirement: A Land Mine for the Unwary Purchaser or Owner of Real Property, published in Cornell Real Estate Review, Volume 12, No. 1 (June 2014).",
            "Sandra S. Klein joined the Notre Dame Law School faculty in 1998 as associate librarian. She received her B.A., M.Ed. and M.S.L.I.S. degrees from the University of Illinois (Urbana-Champaign) in 1981, 1983 and 1988, respectively. She is a member of Phi Beta Kappa. Ms. Klein has worked in the technical-services department at the University of Illinois (1985-95) and as human-resources librarian at Western Carolina University in North Carolina (1995-98). Ms. Klein was a member of the American Library Association and the North Carolina Library Association. She served on both the membership (1989-91) and program (1992-93) committees of the Mid-America Association of Law Libraries, and is a current member of the American Association of Law Libraries. She has actively participated in faculty service at each of the University libraries where she worked, serving on the University Council on Institutional Effectiveness (1996-98) and the Research Council (1995-98) at Western Carolina. She also served on the Search Committee (chair 1995) and as a board member (1995-98) of the Friends of Hunter Library at WCU. In addition, she served on the search committee at the law library at the University of Illinois (1989-90), as a member of the University’s User Services Committee (1993-94), AALL ALL-SIS Collection Development Committee 2004-2006, AALL Awards Committee 2005-2007, Law School LRAP Committee 2007/08, AALL ALL-SIS Collection Development Committee 2009-2010, and the Innovative User’s Group Meeting Co Coordinator Acquisitions Forum in Boston, MA 2004 Denver, CO 2006 San Jose, CA 2007 Washington DC 2008.",
            "",
            "",
            "Sean O’Brien joined the Center for Civil and Human Rights in 2005, bringing with him his experience in international and domestic human rights work. He holds three degrees from the University of Notre Dame, most recently graduating summa cum laude from the Center’s LL.M. program in 2002. His experience includes work with the Belfast law firm of Madden & Finucane before the Bloody Sunday Inquiry in Derry, Northern Ireland and litigation with the Center for Justice and International Law (CEJIL) in the Inter-American System for the Protection of Human Rights. Immediately prior to his return to Notre Dame, he served as Chief Counsel for Immigration and Human Rights at the Center for Multicultural Human Services (CMHS) in Falls Church, VA, directing a legal services program for survivors of torture and war trauma."
        ],
        [
            "Staff Department",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Library Information Technology",
            "Center for Civil and Human Rights"
        ],
        [
            "Image Upload",
            "",
            "/assets/71699/original/rodes.jpg",
            "/assets/79291/original/alford_9_12.jpg",
            "/assets/71755/original/jacobs.jpg",
            "/assets/151572/257x/ron_dolin.jpg",
            "",
            "/assets/71766/original/klein.jpg",
            "",
            "/assets/72146/original/hengert.jpg",
            "/assets/72144/original/obrien.jpg"
        ],
        [
            "Courses Taught",
            "LAW75743, Moot Court Appellate",
            "LAW70315, Administrative Law LAW70813, Jurisprudence LAW70827, Ethics II LAW73835, Medieval Legal History",
            "LAW70433, Law of International Trade LAW70435, Intl Commercial Arbitration",
            "",
            "LAW73131, Legal Technology & Informatics Law",
            "",
            "",
            "Legal Writing",
            "",
            "LAW70413, Intro to International Human Rights Research & Writing LAW70415, Human Rights Practice"
        ],
        [
            "Scholarship",
            "",
            "Books SCHOOLS OF JURISPRUDENCE (Carolina Academic Press 2011). On Law and Chastity (Carolina Academic Press 2006). Classic Problems of Jurisprudence (Carolina Academic Press 2005). Pilgrim Law (University of Notre Dame Press 1998). Premises and Conclusions: Symbolic Logic for Legal Analysis, with Howard Pospesel (Prentice Hall 1997). This House I Have Built: A Study of the Legal History of Establishment in England, a three-volume collection of the following: Law and Modernization in the Church of England: Charles II to the Welfare State (University of Notre Dame Press 1991); Lay Authority and Reformation in the English Church: Edward I to the Civil War (University of Notre Dame Press 1982); Ecclesiastical Administration in Medieval England: The Anglo-Saxons to the Reformation (University of Notre Dame Press 1977). Law and Liberation (University of Notre Dame Press 1986). Sanctions Imposable for Violations of the Federal Rules of Civil Procedure: A Report to the Federal Judicial Center from the Thomas J. and Alberta White Center for Law, Government and Human Rights, Notre Dame Law School, with Kenneth F. Ripple and Carol Ann Mooney (Federal Judicial Center 1981). The Legal Enterprise (Kennikat Press 1976). Book Segments Catholic Universities and the New Pluralism, in The Challenge and Promise of a Catholic University 305 (Rev. Theodore M. Hesburgh, C.S.C., ed., University of Notre Dame Press 1994). Articles Professor Rodes has published numerous articles in legal and theological publications, including: The Waning of the Enlightenment, Historically Speaking, vol. 11, No. 2, at 30-32 (April 2010). The Heart and the Wall - Courtly Love and Christian Courtship, 34 COMMUNIO INT'L CATH. REV. 535-72 (2007) On Lawyers and Moral Discernment, 46 Journal of Catholic Legal Studies 259 (2007) On Marriage and Metaphysics, 7 The National Catholic Bioethics Quarterly 693 (Winter 2007) On Professors and Poor People: A Jurisprudential Memoir, 22 Journal of Law and Religion 527 (2007) On the Historical School of Jurisprudence, 49 American Journal of Jurisprudence 165 (2004) On Juridical Elements in Theology, 28 Louvain Studies (2003) Forming an Agenda â\u0080\u0093 Ethics and Legal Ethics, 77 Notre Dame L. Rev. 289 (2002) On Law and Chastity, 76 Notre Dame L. Rev. 643 (2001). What O'Clock I Say: Juridical Epistemics and the Magisterium of the Church, 14 Journal of Law and Religion 285 (2000). De Re and De Dicto, 73 Notre Dame L. Rev 627 (1998). Nonrepresentative Jurisprudence: A Centennial Reading of 'The Path of the Law',_ 42 American Journal of Jurisprudence 263 (1997). Social Justice and Liberation, 71Notre Dame L. Rev. 619 (1996). Pluralist Establishment: Reflections on the English Experience, 12 Cardozo Law Review 867 (1991). Religion and Procedure, 4 Journal of Law and Religion 179 (1986). Law, History, and the Option for the Poor, 6 LOGOS (USA) 61 (1985). Greatness Thrust Upon Them: Class Biases in American Law, 28 American Journal of Jurisprudence 1 (1983). On Clandestine Warfare,: 39 Washington & Lee Law Review 333 (1982). Pluralist Christendom and the Christian Civil Magistrate, 8 Capital University Law Review 413 (1979), and 9 Communio 321 (Winter 1982). On Validity and Invalidity of Sacraments, 42 Theological Studies 580 (1981). Law, Social Change and the Ambivalence of History, 49 Proceedings of American Catholic Philosophical Association 164 (1975). Natural Law and the Marriage of Christians, 35 Jurist 409 (1975). The Last Days of Erastianism â\u0080\u0094 Forms in the American Church-State Nexus, 62 Harvard Theological Review 301 (1969). Sub Deo et Lege â\u0080\u0094 A Study of Free Exercise, 4 Religion and the Public Order 3 (1968). The Passing of Nonsectarianism -\u0080\u0094 Some Reflections on the School Prayer Case, 38 Notre Dame Lawyer 115 (1963). Due Process and Social Legislation in the Supreme Court â\u0080\u0094 A Post-Mortem, 33 Notre Dame Lawyer 5 (1957). A Prospectus for a Symbolist Jurisprudence, 2 Natural Law Forum 88 (1957). Workmen'\u0080\u0099s Compensation for Maritime Employees: Obscurity in the Twilight Zone, 68 Harvard Law Review 637 (1955).",
            "The Convergence of International Arbitration and International Trade, 53 Santa Clara L. Rev. ___ (2013) (forthcoming) Transnational Torts After Kiobel, (work in progress) CHAMPIONS OF PEACE: HOW NOBEL PEACE PRIZE LAUREATES CHANGED THE WORLD, (2014) (book in progress) A Broken Windows Theory of International Corruption, 73 Ohio State L. J. 1253 (2012) Ancillary Discovery to Prove Denial of Justice, 52 Virginia J. Int’l L. 127 (2012) Claims Resolution Tribunal for Dormant Accounts in Switzerland, in AN INTRODUCTION TO INTERNATIONAL COURTS AND TRIBUNALS, 575 (ed. Chiara Giorgetti) (Martinus Nijhof Publishers, 2012) Civil Law in the Wisdom Literature, (with Leslie Alford), in THE BIBLE AND CIVIL LAW, (ed. Robert Cochran) (InterVarsity Press 2013) (forthcoming book chapter) Moral Reasoning in International Law, (with James Tierney) in THE ROLE OF ETHICS IN INTERNATIONAL LAW, 11 (ed. Donald Childress) (Cambridge University Press, 2012) The Self-Judging WTO Security Exception, 2011 Utah L. Rev. 697 International Law as an Interpretive Tool, 1900-1945, in THE U.S. SUPREME COURT AND INTERNATIONAL LAW: CONTINUITY OR CHANGE? 257 (eds. David Sloss, Michael Ramsey, William Dodge) (Oxford University Press, 2011) International Law and Constitutional Interpretation: Change and Continuity: A Response to Mark Tushnet, in THE U.S. SUPREME COURT AND INTERNATIONAL LAW: CONTINUITY OR CHANGE? 518 (eds. David Sloss, Michael Ramsey, William Dodge) (Oxford University Press, 2011) (forthcoming) Apportioning Responsibility Among Joint Tortfeasors for International Law Violations, 38 Pepperdine Law Review 233 (2011) (symposium issue) The Future of Investment Arbitration, (Oxford University Press, 2009) (co-editor with Catherine Rogers) The Nobel Effect: Nobel Peace Laureates as International Norm Entrepreneurs, 49 Virginia Journal of International Law 61 (2008) Inferior Courts and Constitutional Comparativism, 77 Fordham Law Review 647 (2008) Free Speech and the Case for Constitutional Exceptionalism, 106 Michigan Law Review 1071 (2008) Arbitrating Human Rights, 83 Notre Dame Law Review 505 (2008) International Dispute Resolution and State Succession, 23 Arbitration International 511 (2007) Evidentiary Practices Before the Iran-United States Claims Tribunal, THE IRAN-UNITED STATES CLAIMS TRIBUNAL AT 25: THE CASES EVERYONE NEEDS TO KNOW FOR INTERNATIONAL AND INVESTOR-STATE ARBITRATION, 165 (Chris Drahozal and Chris Gibson, eds. Oxford University Press 2007) Foreign Relations as a Matter of Interpretation: The Use and Abuse of Charming Betsy, 67 Ohio State L. J. 1339 (2006) Reflections on US—Zeroing: A Study on Judicial Overreaching by the WTO Appellate Body, 44 Columbia J. Trans. L. 196 (2006) Four Mistakes in the Debate on Outsourcing Authority, 69 Albany Law Review 653 (2006) Holocaust Restitution: Perspectives on the Litigation and Its Legacy (NYU Press 2006) (co-editor with Michael Bazyler) Arbitrating Human Rights, 99 ASIL Proc. 233 (2005) Our Constitution in International Equipoise, 53 UCLA Law Rev. 1 (2005) In Search of a Theory for Constitutional Comparativism, 52 UCLA Law Rev. 639 (2005) International Legal Developments in Review: 2003, 38 The International Lawyer 115 (2004) (General Editor) Foreign Law Year in Review: 2003, 38 The International Lawyer 521 (2004) (General Editor) Federal Courts, International Tribunals, and the Continuum of Deference: A Postscript on Lawrence v. Texas, 44 Virginia Journal of International Law 913 (2004) Binding Sovereign Non-Signatories, 19 Mealey’s International Arbitration Reports 1 (March 2004) Misusing International Sources to Interpret the Constitution, 98 American Journal of International Law 57 (2004)",
            "Books Comp., Memorials of the Justices of the Supreme Court of the United States (F.B. Rothman 1981). Illinois Legal Research Sourcebook, with others (Illinois Institute for Continuing Legal Research 1977). In addition, Professor Jacobs writes regularly for law-library and bibliographic publications, and has published several articles on law-library management.",
            "Articles “Training Tomorrow’s Lawyers”, ILTA Peer to Peer Magazine, Summer 2014 “Right to Privacy: Do You Have Standing?”, co-authored with Nancy Situ, The Recorder, March 7, 2013 “New Tricks for an Old Dog: Teaching Legal Technology,” Center on the Legal Profession, Stanford Law School, August, 2013",
            "",
            "Articles Sandra Klein has published several articles involving the right to privacy, including: Sexual Freedom and Your Right to Privacy: A Selective Bibliography, Legal Reference Services Quarterly, vol. 13, no. 4, 113 (1994). Your Right to Privacy as an Employer/Employee: A Selective Bibliography, Legal Reference Services Quarterly, vol. 13, no. 3, 129 (1994). Your Right to Privacy and AIDS: A Selective Bibliography, Legal Reference Services Quarterly, vol. 13, no. 1, 105 (1993). Your Right to Privacy: A Selective Bibliography, Legal Reference Services Quarterly, vol. 12, no. 2-3, 217 (1992).",
            "",
            "",
            ""
        ],
        [
            "In the News",
            "",
            "",
            "Justice for Sale (Quotes: Roger Alford) - Washington Free Beacon, February 4, 2013 CPR INSTITUTE PRESENTS ITS 29th ANNUAL AWARDS FOR OUTSTANDING SCHOLARSHIP IN ADR – January 11, 2012",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Adjunct Faculty",
            "Paul J. Schierl/Fort Howard Corporation Professor of Legal Ethics Emeritus",
            "Associate Dean for International and Graduate ProgramsProfessor of Law",
            "Professor Emeritus of Law",
            "Adjunct Assistant Professor",
            "Adjunct Faculty",
            "Acquisition/Collection Development Librarian",
            "Adjunct Assistant Professor",
            "Audio-Visual Engineer",
            "Assistant Director of the Center for Civil and Human RightsConcurrent Assistant Professor of Law"
        ],
        [
            "Staff Assistant",
            "Rebecca Ward",
            "",
            "Beth Ferrettie",
            "",
            "",
            "Rebecca Ward",
            "",
            "Debbie Sumption",
            "",
            "Jody Klontz"
        ],
        [
            "NetID",
            "RPALMER",
            "",
            "RALFORD",
            "",
            "",
            "RMCCAFFR",
            "",
            "SPOJANOW",
            "",
            "SOBRIEN2"
        ]
    ],
    "pageTitle": "Directory // The Law School // University of Notre Dame",
    "title": "",
    "url": "http://law.nd.edu/directory/page/19/?page=13",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 137130607,
    "recordOffset": 137112098,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32660=Law School Admissions Office 1329 Biolchini Hall, Notre Dame, IN 46556 Phone 574.631.6626 Fax 574.631.5474 lawadmit@nd.edu Like us on Facebook, 31961=Copyright © 2015 University of Notre Dame}",
    "lastModified": "Mon, 27 Jul 2015 20:32:06 GMT",
    "textBeforeTable": "Directory -- TEST Library Alumni News & Events Faculty Student Life International Careers Admissions Academics About Contact Search Search Menu Educating a Different Kind of Lawyer The Law School Office of the Provost University of Notre Dame Skip To Navigation Skip To Content",
    "textAfterTable": "About Academics Admissions Careers International Student Life Faculty News & Events Alumni Library Why ND Law? Apply Now Faculty & Staff Library Support the Law School Copyright © 2015 University of Notre Dame The Law School P.O. Box 780, Notre Dame, IN 46556 Phone 574.631.6627 Fax 574.631.3980 ndlaw@nd.edu Law School Admissions Office 1329 Biolchini Hall, Notre Dame, IN 46556 Phone 574.631.6626 Fax 574.631.5474 lawadmit@nd.edu Like us on Facebook Law School Career Development Office Phone 574.631.7542 Fax 574.631.4789 lawjobs@nd.edu Like us on Facebook  Facebook  Twitter  LinkedIn Today@NDLS",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}