{
    "relation": [
        [
            "No.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "Date",
            "16.08.2002",
            "09.11.2007",
            "20.11.2007",
            "24.11.2007",
            "18.12.2007",
            "30.01.2008"
        ],
        [
            "Together with",
            "V. Korzun",
            "Y. Malenchenko",
            "D. Tani",
            "D. Tani",
            "D. Tani",
            "D. Tani"
        ],
        [
            "Time",
            "4h 25m",
            "6h 55m",
            "7h 16m",
            "7h 04m",
            "6h 56m",
            "7h 10m"
        ],
        [
            "Main tasks and notes",
            "Installing first six of an eventuel 23 debris shields on Zvezda",
            "They disconnected and stowed cables from Destiny to PMA 2, removed cover on Node 2 (Harmony) forward docking mechanism, demated avionics cables and released fluid tray bolts. They performed also a temporary stow of CETA light on Destiny and configured cables for power transfer for S0 truss/Node1/Zvezda and PMA 1/Zarya. At least they retrieved the Baseband Signal Processor from Z1 truss and released bolts on P1 Nitrogen Tank Assembly. Originally it was the planned fifth EVA work of the STS-120 crew",
            "Complete the exterior hookup of Harmony. Much of the spacewalk included the moving of a 300-pound, 18.5-foot fluid tray from its temporary location at the center of the station's main truss to Harmony.",
            "Complete the exterior hookup of Harmony. Much of the spacewalk included the moving of another 300-pound, 18.5-foot fluid tray from its temporary location at the center of the station's main truss to Harmony.",
            "Examination of the starboard Solar Alpha Rotary Joint (SARJ) and return a trundle assembly to the station's interior.",
            "Replacing a motor with electrical failures, the Bearing Motor Roll Ring Module (BMRRM), called the 'broom\". The motor drives the starboard solar wings as they tilt along their axis to follow the sun for optimal power generation as the station orbits the Earth. The second main goal of the spacewalk was inspection of the starboard Solar Alpha Rotary Joint (SARJ). That device causes the starboard solar wings to rotate in a paddlewheel-like motion to keep the arrays pointed toward the sun."
        ]
    ],
    "pageTitle": "Peggy Whitson - EVA experience",
    "title": "",
    "url": "http://www.spacefacts.de/eva/astronauts/english/whitson_peggy.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 705462173,
    "recordOffset": 705453971,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 09 Nov 2014 09:03:39 GMT",
    "textBeforeTable": " 39h 46m  Total EVA time:  6  Total EVAs: Peggy Annette Whitson",
    "textAfterTable": "close window",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}