{
    "relation": [
        [
            "Class",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic",
            "Diuretic"
        ],
        [
            "Drug",
            "HCTZ",
            "Chlorthalidone",
            "Furosemide",
            "Spironolactone",
            "Triamterene",
            "Amiloride"
        ],
        [
            "Initial Dose*",
            "1 mg/kg/day",
            "0.3 mg/kg/day",
            "0.5-2.0 mg/kg/ dose",
            "1 mg/kg/day",
            "1-2 mg/kg/day",
            "0.4-0.625 mg/kg/day"
        ],
        [
            "Maximal Dose",
            "3 mg/kg/day up to 50 mg/day",
            "2 mg/kg/day up to 50 mg/day",
            "6 mg/kg/day",
            "3.3 mg/kg/day up to 100 mg/day",
            "3-4 mg/kg/day up to 300 mg/day",
            "20 mg/day"
        ],
        [
            "Dosing Interval",
            "qd",
            "qd",
            "qd-bid",
            "qd-bid",
            "bid",
            "qd"
        ],
        [
            "Evidence?",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion",
            "Expert opinion"
        ],
        [
            "FDA?",
            "Yes",
            "No",
            "`No",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "8. High Blood Pressure - NHLBI, NIH",
    "title": "",
    "url": "http://www.nhlbi.nih.gov/health-pro/guidelines/current/cardiovascular-health-pediatric-guidelines/full-report-chapter-8",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 612618423,
    "recordOffset": 612587726,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{393=BP recommendations are based on The Fourth Report on the Diagnosis, Evaluation, and Treatment of High Blood Pressure in Children and Adolescents (Fourth Report), with the evidence review updated from 2003., 19635=In 2004, an NHLBI Task Force published The Fourth Report on the Diagnosis, Evaluation, and Treatment of High Blood Pressure in Children and Adolescents (Fourth Report).[1] This report was based on a complete review of the current evidence on BP management up to that time and included detailed recommendations for diagnosing and managing high BP throughout childhood. Those expert consensus recommendations were used as the basis for the recommendations for this section of these Guidelines. The review of the science was considered complete until 2003, when the review of the Fourth Report ended. Therefore, the evidence review on high BP for these Guidelines was limited to studies published between January 1, 2003, and June 30, 2007,with the addition of selected studies through June 30, 2008, identified by the Expert Panel that met all the criteria for inclusion. Repeating the review performed by the Fourth Report Task Force was not believed to be either necessary, given the relatively short time since publication of the Fourth Report, or to be a judicious use of the resources available for the development of these Guidelines. The randomized controlled trials (RCTs) identified from 2003 to 2008 for this evidence review were graded individually and can be viewed in the evidence tables, which will be available at http://www.nhlbi.nih.gov/health-pro/guidelines/current/cardiovascular-health-pediatric-guidelines/index.htm., 12379=A series of epidemiologic studies provide important information. Long-term followup studies suggest that low birth weight is inversely associated with BP later in adult life[18] and that differences in birth weight may explain the origin of \"Black/White\" differences in BP.[19] A weighted analysis of BP data from national surveys in 8- to 17-year-olds obtained from 1963 to 2002 demonstrated that BP, prehypertension, and hypertension trended downward from 1963 to 1988 but upward thereafter.[20] At least part of this increase was explained by the rise in obesity, with the upward shift in BP occurring approximately 10 years after the upward trend in the prevalence of obesity. There were racial/ethnic differences, with non-Hispanic Blacks and Mexican Americans showing a greater prevalence of hypertension and prehypertension than non-Hispanic Whites and males showing a greater prevalence than females. BP variability was assessed in an analysis of longitudinal data from the National Childhood Blood Pressure database.[21] Among subjects designated as having prehypertension at baseline, 14 percent of boys and 12 percent of girls had hypertension 2 years later. Among subjects classified as hypertensive at baseline, 31 percent of boys and 26 percent of girls were still hypertensive after 2 years, and 47 percent of boys and 26 percent of girls were in the prehypertension category. Baseline BP z-score, baseline body mass index (BMI), and change in BMI were significant independent determinants of subsequent BP. Finally, a meta-analysis of 50 cohort studies confirmed that BP consistently tracks from childhood into adulthood, with the strength of tracking increasing with baseline age and decreasing with followup length.[22]}",
    "TableContextTimeStampAfterTable": "{197594=[11] Steffen LM, Kroenke CH, Yu X, Pereira MA, Slattery ML, Van Horn L, Gross MD, Jacobs DR Jr. Associations of plant food, dairy product, and meat intakes with 15-y incidence of elevated blood pressure in young black and white adults: the Coronary Artery Risk Development in Young Adults (CARDIA) Study. Am J Clin Nutr 2005;82(6):1169-1177. (PM:16332648), 171160=2.5-6.25 mg/day, 199421=[15] Larnkjaer A, Christensen JH, Michaelsen KF, Lauritzen L. Maternal fish oil supplementation during lactation does not affect blood pressure, pulse wave velocity, or heart rate variability in 2.5-y-old children. J Nutr 2006;136(6):1539-1544. (PM:16702318), 161984=Quinapril, 201683=[20] Din-Dzietham R, Liu Y, Bielo MV, Shamsa F. High blood pressure trends in children and adolescents in national surveys, 1963 to 2002. Circulation 2007;116(13):1488-1496. (PM:17846287), 171820=Children >6 years: 1 mg/kg/day (12.5-50 mg/day), 201158=[19] Cruickshank JK, Mzayek F, Liu L, Kieltyka L, Sherwin R, Webber LS, Srinavasan SR, Berenson GS. Origins of the \"black/white\" difference in blood pressure: roles of birth weight, postnatal growth, early blood pressure, and adolescent body size: the Bogalusa heart study. Circulation 2005;111(15):1932-1937. (PM:15837946), 202814=[23] Chobanian AV, Bakris GL, Black HR, Cushman WC, Green LA, Izzo JL Jr, Jones DW, Materson BJ, Oparil S, Wright JT Jr, Roccella EJ; National Heart, Lung, and Blood Institute Joint National Committee on Prevention, Detection, Evaluation, and Treatment of High Blood Pressure; National High Blood Pressure Education Program Coordinating Committee. The Seventh Report of the Joint National Committee on Prevention, Detection, Evaluation, and Treatment of High Blood Pressure: the JNC 7 report. JAMA 2003;21;289(19):2560-2572. (PM:12748199), 193614=[2] Shahinfar S, Cano F, Soffer BA, Ahmed T, Santoro EP, Zhang Z, Gleim G, Miller K, Vogt B, Blumer J, Briazgounov I. A double-blind, dose-response study of losartan in hypertensive children. Am J Hypertens 2005;18(2 Pt 1):183-190. (PM:15752945)}",
    "lastModified": "Tue, 28 Jul 2015 01:29:45 GMT",
    "textBeforeTable": "Table 8-3. Blood Pressure (BP) Norms for Boys by Age and Height Percentiles (%iles) Figure 8-2 Legend: * Work up for target organ damage (TOD)/ LVH if obese or (+) for other CV risk factors; ? Cardiovascular Health Integrated Lifestyle Diet; See Section V. Nutrition and Diet; ** Activity Education. See Section VI. Physical Activity; *** Weight management. See Section X. Overweight and Obesity. GOAL BP: <95th%ile for age/sex/HT, <90th %ile if CKD, DM, Target Organ Damage Forward to GOAL BP: <95th%ile for age/sex/HT, <90th %ile if CKD, DM, Target Organ Damage Continue close follow-up Forward to GOAL BP: <95th%ile for age/sex/HT, <90th %ile if CKD, DM, Target Organ Damage Continue moderate follow-up Forward to GOAL BP: <95th%ile for age/sex/HT, <90th %ile if CKD, DM, Target Organ Damage Monitor Q 6 Mo Forward to GOAL BP: <95th%ile for age/sex/HT, <90th %ile if CKD, DM, Target Organ Damage Re-evaluate at next visit Forward to Continue close follow-up Forward to Continue moderate follow-up Consider re-evaluation of BP Category if BP well controlled, ?BMI or s/p Rx for 20 cause Forward to Continue moderate follow-up Anti-HTN Drug if no improvement Forward to Monitor Q 6 Mo Consider basic W/U + cardiac U/S for TOD* Forward to Consider re-evaluation of BP Category if BP well controlled, ?BMI or s/p",
    "textAfterTable": "54 54 55 56 57 58 58 1 99th 105 106 108 110 112 113 114 61 62 63 64 65 66 66 2 50th 84 85 87 88 90 92 92 39 40 41 42 43 44",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}