{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,131 topics 2,125,053 replies",
            "85,557 topics 1,153,877 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,232 replies",
            "22,766 topics 196,306 replies",
            "4,272 topics 60,464 replies",
            "1,127 topics 8,216 replies",
            "3,604 topics 115,493 replies"
        ],
        [
            "Last Post Info",
            "game runs poorly By Troubadour 5 minutes ago",
            "Pixelated glass and smoke By CatsAhoy 2 minutes ago",
            "Why does this game receive... By Sayuri 15 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 6 hours ago",
            "Favorite Gang By Mr. Fahrenheit An hour ago",
            "Favorite gym fighting style? By Mr. Fahrenheit 2 hours ago",
            "Reasons why Vice City is be... By Mr. Fahrenheit An hour ago",
            "How Did Miguel and Catalina... By GTA_The_Series 24 minutes ago",
            "What do you hate of GTA 2? By Cerium 7 hours ago",
            "Lets play a game of \"Wo... By NightSpectre 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=55&t=300014&p=1057269325",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107325975,
    "recordOffset": 107300705,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12560=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20620=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14126=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 9462=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16339=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47495=Google, Yahoo, Whitedodge00, KlIIUMlNATl, qzance88, Israel7892, xXModkillXx, deadx23, YaDoesntHaveToCallMeRay, Bing, Flawless_mike, CBStian, WWEMichaelB, truthy, Kingurui, TovarishTony, TwisterVictor1, Edward Nashton, conedotexe, Nameless Foot Soldier, Chloroform, Cudwieser, Synshade, U.N.K.N.O.W.N, TJGM, customkingpimp, Zodape, ZiggZagg420, saintsrow, Kirsty, xiaoshung, Arms Dealer, ChickenAndBeer, undeadrwby911, S1N0D3UTSCHT3K, Slasherr, OFlame, AuSsIeThUnDeR36, Ss4gogeta0, Tchuck, timason, RmpTebow15, Zonnex, lester622, TexasRocks, Neuling2000, This Guy Is Here, Bootels, Jon Snow, Jesse.yancey320, Ledorus, SilentSeasons, swirler, Kamran&jordan, craigdyid, Black Terminator, Daemian, Alaannnn, ironMANx956, Cypster, koztop, T-rellz2324, Shadowfennekin, YngDady, Topsy05, Matias_Montanna, StangOne50, theGTAking101, JON22, Pletzturra, Russell_Brand, Victor Strawn, PkUnzipper, tdavies457, Google Mobile, Pyro_Indigo, slayso, Modojo, Ezza., BlackAce23, Captain Sensib1e, Mr. Fahrenheit, Ac3snip3r12345, DaGengster, Sadhu_FM, skyline59, TheGTR1957, pinche_mayos, FourFingersOfFun, Scuba 21, Majesticnug420, JaegerPilot1, GTAOnlineAddict123, TheUnholy, Josh, SouthLand, shadowkill98, BlackHeartedGovernor, TheTechPoTaToCHIP, Delta8042, hornedturtle, FlexPiTo, MAR10HD, tr28999, 22Laxer22, the_sniper_29, Dillono, athande, Bangha, IKNOWICANFLY, lpgunit, Monkeyhobo10101, ItsOnlyMac, Alan Eastwood, NightSpectre, kingcs, Fozzie_420, A Maned Wolf, AndrewDeSanta, Viezo, PSgtaplayer1, top dog, Reyks, sttc, Foreverpast, Rented, Rokussi, GrandMaster Smith, Chief Ryze, Jerome, ReaperCrew, Pants_Doe, Black_MiD, Lee., Ronzilla187, A.O.D.88, ForcedFedSupra, Corndog93, cheen, Alexander Blade, feedthefishy, Shotty Pop, Niobium, AeroAviation, theminted, JoeFury1997, NightTrainCaine, Jason Frost, CatsAhoy, toxluv, Claptrap NL, ngazi, smiffy84, David_CARP96, Cover2blitz0, Tony_Florence, X12-1992, jeanrjm, lebongjames187, MyNamesLiam, SuzukiBlaze, L0SS4NT0SK1LL3RV, JRC99, Joekill95, brad476, Smale45, K0ol-G-R4P, Nicinator16, Black-Legion, TheNumberOfTheBreast, GradientDruid, MrSaucyZ, manhhgvip123, Rangerlump, Choco Taco, iiConTr0v3rSYx, jakematos2, Zaldrex, Bubbles_Shed, Mogathule, WhiteLikePaste, Dern Sure, MKKJ, pizzapuff1990, Ameeno98, Electrogypsy, TM1138, Luk38644, Twin Turbo, Deus Ex, RussianCommie, Pyroshox, DustyRider, hvcciookay, The Ost, lydianduck, Lebowski_RS, stonemaggot666, javiEmma, goldadderXD, Razbos, Simply logic, statistic, TimeLordDoctor, terminalnapkin, adamaineiac, MagellanFall, Alexa, Fabricator, KingVee, m8son, Z i X, Spectacus, zzr, RoloBabs, lexustt, Silver le Belge, Shaundi., lord tammerlain, Donel, Benny164, The Made Man, TCMike, DragonSpade, blacknambala, JuanG12, feloniousrick, fiebru787, Progeekzy, tsouryavong13, TristanAnderson, FlacidJack, Cripto136, NoaJM, Wanderer800, 109624=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 18472=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 18 minutes ago By Elite_Task_Force [Xbox 360] Elite Task Force... 613,513 replies 15,207 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Shadowfennekin Series A Funding 2x$ 2... 2,284,356 replies 113,440 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,633 replies Adding contacts to iFruit (... By CamxxCore 41 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}