{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Announcements (Mac) Important announcements about µTorrent for Mac.",
            "General (Mac) General discussion for µTorrent Mac.",
            "Feature Requests (Mac) Post feature requests for the Mac µTorrent here.",
            "Troubleshooting (Mac) µTorrent not working properly or crashing? Found a bug? Post here!",
            "User Interface Design (Mac) Discuss µTorrent Mac's user interface and how you'd like it to be changed."
        ],
        [
            "Stats",
            "28 topics 1,294 replies",
            "709 topics 1,626 replies",
            "290 topics 1,222 replies",
            "1,925 topics 5,355 replies",
            "79 topics 357 replies"
        ],
        [
            "Last Post Info",
            "3D Globe feature By Melon555 06 Feb 2015",
            "How To Remove uTorrent adWa... By jtrag Yesterday, 05:35 PM",
            "ip6 Peer Flood Mitigations,... By DreadWingKnight 30 Jun 2015",
            "Spyware on DL from utorrent... By pavilion_alex Yesterday, 10:43 PM",
            "OS X Yosemite Interface By nskylinebam 31 Dec 2014"
        ]
    ],
    "pageTitle": "µTorrent Community Forums",
    "title": "",
    "url": "https://forum.utorrent.com/viewforum.php?id=4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886231207,
    "recordOffset": 886199624,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46709=phaiquen - Today, 02:29 AM, 45983=werwerwerew - Today, 03:06 AM, 47528=maidenseye - Yesterday, 08:34 PM, 45259=yudtuyi - Today, 03:24 AM, 44529=flying6withoutwings - Today, 03:29 AM}",
    "textBeforeTable": "Toggle µTorrent Mac µTorrent Mac 21 Mar 2015 By bradsmithsite Looking for a Developer who... 944 replies 190 topics Protocol Design Discussion A place to discuss protocol design and interpretation of the protocol. 10 Jul 2015 By DreadWingKnight µTorrent WebUI 10,130 replies 1,233 topics Web API Apps using the Web API (including our WebUI) and any issues or discussion related to the WebUI and API should go here. Last Post Info Stats Forum",
    "textAfterTable": "Toggle µTorrent Linux µTorrent Linux   Forum Stats Last Post Info Announcements (Linux) Important announcements about µTorrent for Linux. 5 topics 591 replies µTorrent Server 3.3 alpha b... By richard-bt 03 Apr 2014 General (Linux) General discussion about µTorrent for Linux. 200 topics 794 replies What was the point? By fudu 18 Jul 2015",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}