{
    "relation": [
        [
            "",
            "Wooden",
            "Metal aluminium",
            "Metal iron",
            "Rattan",
            "Plastic (resin)"
        ],
        [
            "Durability",
            "Long-lasting Low maintenance",
            "Long-lasting Low maintenance Can be more easily bent or dented",
            "Long-lasting Low maintenance",
            "Flexible Low maintenance",
            "Long-lasting Low maintenance"
        ],
        [
            "Weight",
            "Heavy",
            "Lightweight, no mould or rust",
            "Heavy",
            "Lightweight",
            "Lightweight"
        ],
        [
            "Look",
            "Authentic",
            "Contemporary",
            "Traditional Heritage",
            "Traditional to contemporary",
            "Traditional to contemporary"
        ],
        [
            "Colour options",
            "Generally brown",
            "Wider range",
            "Limited",
            "Generally brown",
            "Generally green or white"
        ],
        [
            "Treatment",
            "Teak oils, stain",
            "None",
            "Anti-rust solutions, paints and laquer",
            "None",
            "None"
        ],
        [
            "Protective cover",
            "Yes",
            "Advised",
            "Advised",
            "Should be put away for winter",
            "Advised"
        ],
        [
            "Annual maintenance",
            "Advised",
            "None",
            "Yes",
            "None",
            "None"
        ]
    ],
    "pageTitle": "Aland 450mm Parasol Base | Rooms | DIY at B&Q",
    "title": "",
    "url": "http://www.diy.com/rooms/aland-450mm-parasol-base/197577_BQ.prd?view-all=colour",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412653331,
    "recordOffset": 412631192,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Our furniture sets are all designed to be the right height, size and shape for comfort and ease of use. Comfort Once you have determined the garden furniture you need think about how this blends in with the current style of your home and garden. Style If you have limited space then consider whether you want stackable or folding furniture and if it's key for you to be able to store indoors / outdoors. Our bistro sets are ideal for small spaces such as balconies and patios. We also sell a range of furniture covers that mean you can store your furniture outdoors if you don't have space indoors. Space This can help to determine the material of your furniture, plastics will need less maintenance, are cheaper and more durable. Budget How will you be using your outdoor area? For reading, eating, entertaining… this determines what items you'll need. Purpose Things to think about Material is one of the key considerations when choosing your garden furniture; there is a range of different materials available, each of which has distinct features and advantages. Whatever you’re trying to create in your garden, furniture makes a good starting point for you to build around. From stylish table and chair sets to laid back sunbeds and sofas; choosing the right furniture for your garden is a huge step in the process. Garden furniture is the centrepiece of any well planned outdoor area, choosing the right style and function to suit your needs can",
    "textAfterTable": "Inspiration The art of mixing and matching your outdoor furniture We all dream about the day when we can get back out doors and enjoy our garden once again. Long sunny days, warm evenings and plenty of barbecues; you’ll really need a space to entertain, relax and eat – all under the big blue sky! Reviews 4.0 out of 5 stars bvseo-${version} bvseo-true bvseo-j bvseo-CLOUD bvseo-1ms bvseo-REVIEWS bvseo-PRODUCT bvseo-getAggretateRating bvseo-msg: JavaScript-only Display; bvseo-${version} bvseo-true bvseo-j bvseo-CLOUD bvseo-0ms bvseo-REVIEWS bvseo-PRODUCT bvseo-getReviews bvseo-msg: JavaScript-only Display; More Information",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}