{
    "relation": [
        [
            "Size",
            "5,4",
            "6,0",
            "6,6",
            "7,3",
            "7,8",
            "8,2"
        ],
        [
            "Boom max (cm)",
            "175",
            "182",
            "188",
            "198",
            "207",
            "214"
        ],
        [
            "Luff max (cm)",
            "443",
            "464",
            "464",
            "480",
            "493",
            "500"
        ],
        [
            "Vario Top",
            "•",
            "•",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Battens",
            "6",
            "6",
            "7",
            "7",
            "7",
            "7"
        ],
        [
            "Camber",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Weight (kg)",
            "3.90",
            "4.10",
            "4.35",
            "4.60",
            "4.80",
            "4.95"
        ],
        [
            "Mast Type: Best//Alternative",
            "Platinum/Gold//Silver",
            "Platinum/Gold//Silver",
            "Platinum/Gold//Silver",
            "Platinum/Gold//Silver",
            "Platinum/Gold//Silver",
            "Platinum/Gold//Silver"
        ],
        [
            "Mast Length (cm): Best/Alternative",
            "430/460",
            "430/460",
            "430/460",
            "460",
            "460/490",
            "460/490"
        ],
        [
            "Mast Geometry: Best/Alternative",
            "SDM/RDM",
            "SDM/RDM",
            "SDM/RDM",
            "SDM/--",
            "SDM/--",
            "SDM/--"
        ]
    ],
    "pageTitle": "S_Type - With the new S_TYPE the... | NorthSails",
    "title": "",
    "url": "http://www.north-windsurf.com/deu/nodes/display/products/s-type-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 617421472,
    "recordOffset": 617413270,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8365=For example a small but essential detail is the steeper top batten, which provides a better connection to the top of the sail, which gives a more active twist. This leads to quicker acceleration and an expanded wind range. Following the extremely successful WARP F2012 the compact shape got taken over, but with a slightly longer CROSS.BATTEN. This results in greater comfort and control during acceleration and in overpowered conditions, because the longer CROSS.BATTEN flexes more. These and many other details secure that the S_TYPE combines planing with impressive performance and incredible speed. Better than any other sail - without any disadvantages in control or handling! The medium wide luff sleeve supports this, CONICAL.AERO.SLEEVE.DESIGN that offers the best combination of optimum propulsion and great for water starting., 7954=With the new S_TYPE the incredible story of our most successful sail continues! International magazines have repeatedly declared the predecessors as test winner, which made the S_TYPE the benchmark in its class. To maintain this, for 2013 Kai Hopf developed new features and an optimized profile which increase the outstanding performance yet again.}",
    "textBeforeTable": "S_Type   COMPARE PERFORMANCE SAILS   > 2 Year Warranty. Get an additional 3 years warranty: register here > 06 SWITCH.CAM.OPTION 3/2: 3 cams for max. performance - 2 cams for improved handling > 05 HYPER.CAM - the first hard camber that rotates like a soft cam > 04 MINIMUM.MAST.CONCEPT: one mast (460-25) fits all sizes > 03 Lower aspect ratio makes for increased acceleration after start and jibing > 02 iBUMPER, the most advanced and effective moulded mast protector > 01 NEW: Steeper top batten for more power and better twist, greater acceleration and wider wind range KEY FEATURES   As to its durability: Apart from legendary features such as DOUBLE.SEAM and DURATECH.FOOT, we gave the CROSS.BATTEN additional seam protection to prevent chafing. Simply ingenious: All S_TYPE sizes work with one mast length! Another reason for the huge range of use is the medium-size CONICAL.AERO.SLEEVE. DESIGN mast pocket. This represents the ideal compromise between optimum propulsion and comfortable waterstart behaviour. Regardless whether at high speed or simply cruising and jibing, the S_TYPE has many faces - the perfect universal performer. For example a small but essential detail is the steeper top batten, which provides a better connection to the top of the sail, which gives a more active twist. This leads to quicker acceleration and an expanded wind range. Following the extremely successful WARP F2012 the compact shape got taken over, but with a slightly longer",
    "textAfterTable": "X_Type Size Boom max (cm) Luff max (cm) Vario Top Battens Camber Weight (kg) Mast Type: Best//Alternative Mast Length (cm): Best/Alternative Mast Geometry: Best/Alternative 5,4 175 443 • 6 -- 3.90 Platinum/Gold//Silver 430/460 SDM/RDM 6,0 182 464 • 6 -- 4.10 Platinum/Gold//Silver 430/460 SDM/RDM 6,6 188 464 -- 7 -- 4.35 Platinum/Gold//Silver 430/460 SDM/RDM 7,3 198 480 -- 7 -- 4.60 Platinum/Gold//Silver 460 SDM/-- 7,8 207 493 -- 7 -- 4.80 Platinum/Gold//Silver 460/490 SDM/-- 8,2 214 500 -- 7 -- 4.95 Platinum/Gold//Silver 460/490 SDM/-- You may also like X_Type Wanna see your gear in action? Latest Tweets Tweets by @northwindsurf Learn more about North Sails",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}