{
    "relation": [
        [
            "Model",
            "WinTV-D",
            "WinTV-HD",
            "WinTV-HVR-850",
            "WinTV-HVR-950",
            "WinTV-HVR-950Q",
            "WinTV-HVR-1250",
            "WinTV-HVR-1255",
            "WinTV-HVR-1500",
            "WinTV-HVR-1600",
            "WinTV-HVR-1800",
            "WinTV-HVR-1850",
            "WinTV-HVR-1950",
            "WinTV-HVR-2250"
        ],
        [
            "Standard",
            "ATSC",
            "ATSC",
            "ATSC & NTSC",
            "ATSC & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC",
            "ATSC & ClearQAM & NTSC"
        ],
        [
            "Interface",
            "PCI",
            "PCI",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "PCIe",
            "PCIe",
            "ExpressCard",
            "PCI",
            "PCIe",
            "PCIe",
            "USB 2.0",
            "PCIe"
        ],
        [
            "Supported",
            "✘ No",
            "✘ No",
            "✔ Yes",
            "✔ Yes",
            "✔ Yes",
            "✔ Yes",
            "✘ No",
            "✔ Yes",
            "✔ Yes",
            "✔ Yes",
            "✘ No",
            "✔ Yes",
            "✔ Yes"
        ],
        [
            "Comments",
            "analog works though",
            "",
            "Analog and Digital \"hybrid\" stick; two versions exist -- essentially rebrands of the 950 & 950Q models",
            "Analog and Digital (ATSC-only) \"hybrid\" stick",
            "Analog and Digital \"hybrid\" stick",
            "Digital mode only currently.",
            "",
            "Digital mode only currently.",
            "Analog and Digital \"combo\" card.",
            "Digital mode in recent kernels. Analog hardware mpeg encoder requires kernel 2.6.26",
            "",
            "",
            "Digital mode only currently"
        ]
    ],
    "pageTitle": "Hauppauge - LinuxTVWiki",
    "title": "Sortable Table of ATSC/ClearQAM (USA) Devices sold by Hauppauge",
    "url": "http://www.linuxtv.org/wiki/index.php?title=Hauppauge&oldid=29531",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 563073104,
    "recordOffset": 563056710,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3991=On October 29, 2008, Hauppauge purchased the Pinnacle PCTV product range and related assets from parent company Avid Technology, with the transaction expected to close before the end of Q4 2008. Hauppauge is apparently intending to continue to market the Pinnacle range of devices under the PCTV brand line.}",
    "textBeforeTable": "ATSC/ClearQAM Products WinTV-HVR The WinTV-HVR moniker is used for Hauppauge's hybrid line of devices (i.e. they feature both analog and digital tuning capabilities). The \"HVR\" stands for Hybrid Video Recorder. WinTV-NEXUS Hauppauge used the WinTV-NEXUS moniker for digital TV PCI cards that included an onboard MPEG-2 decoder; these were rebranded Technotrend SkyStar 1.x full-featured cards to which a second PCI card could be interconnected to provide hardware support for Common Interface subscription-TV modules. WinTV-NOVA Hauppauge uses the WinTV-NOVA moniker for their digital TV PCI cards that lack an onboard MPEG-2 decoder (i.e. the designation is used for their so-called \"budget\" or software decoding cards). The -C, -S or -T suffices respectively signify whether the device is intended for DVB-C, DVB-S or DVB-T reception. Many of Hauppauge's early DVB-S and DVB-T products were actually rebranded TechnoTrend devices. This, however, is no longer the case today. Digital Devices 4 External Links 3 Hauppauge Model Synopsis and internal names 2.4 Music, Video, Picture 2.3 Personal Video Recording 2.2 Analog TV Viewing 2.1 Analog Video Grabbing 2 Analog Devices",
    "textAfterTable": "DVB Products Sortable Table of DVB (digital and hybrid) Devices sold by Hauppauge Model Standard Interface Supported Comments WinTV-HVR-900 DVB-T USB 2.0 Stick ✔ Yes Bus powered. Apparently more then one version (models 65008 & 65018). WinTV-HVR-900H DVB-T USB 2.0 Stick ✔ Yes Bus powered, model 66009, TM6010 based, no analoge audio! WinTV-HVR-930 DVB-T USB 2.0 Stick ✘ No (France) - Bus powered WinTV-HVR-1100 DVB-T PCI ✔ Yes Analog and Digital \"hybrid\" card (rectangular shape) WinTV-HVR-1110 DVB-T PCI ✔ Yes Analog and Digital \"hybrid\" card (triangular shape) WinTV-HVR-1200 DVB-T PCIe ✔ Yes Digital mode only currently.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}