{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Film",
            "2 Guns",
            "The Wolverine",
            "The Smurfs 2",
            "The Conjuring",
            "Despicable Me 2",
            "Grown Ups 2",
            "Turbo",
            "Red 2",
            "The Heat",
            "Pacific Rim"
        ],
        [
            "Weekend",
            "$27,361,000",
            "$21,725,000 (-51.9)",
            "$18,200,000",
            "$13,660,000 (-38.5)",
            "$10,391,000 (-36.7)",
            "$8,100,000 (-30.2)",
            "$6,400,000 (-53.4)",
            "$5,650,000 (-39.5)",
            "$4,725,000 (-31.7)",
            "$4,570,000 (-40.7)"
        ],
        [
            "Per Screen",
            "$9.045",
            "$5,536",
            "$4,708",
            "$4,385",
            "$3,240",
            "$2,634",
            "$2,144",
            "$2,051",
            "$2,278",
            "$2,535"
        ],
        [
            "",
            "$27,361,000",
            "$95,039,000",
            "$27,761,000",
            "$108,590,000",
            "$326,668,000",
            "$116,400,000",
            "$69,479,000",
            "$45,153,000",
            "$149,566,000",
            "$92,961,000"
        ]
    ],
    "pageTitle": "Weekend Box Office Report: ’2 Guns’ Shoots Down ‘The Smurfs 2′",
    "title": "",
    "url": "http://hot1047.com/weekend-box-office-report-2-guns/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 115883631,
    "recordOffset": 115861398,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31524=In fourth place, ‘The Conjuring‘ flew past $100 million, making it the highest grossing original horror film since ‘The Sixth Sense’ back in 1999. It may have the legs to reach $150 million, but at this point, the final numbers aren’t as important as the fact that this is one of the biggest horror smashes in a long, long time. This is the box office success story of the summer., 63798=It appears that you already have an account on this site associated with . To connect your existing account just click on the account activation button below. You will maintain your existing VIP profile. After you do this, you will be able to always log in to http://hot1047.com using your original account information.}",
    "textBeforeTable": "Ah, the continuing appeal of the one and only Denzel Washington. How much do people love this guy? They love him so much that they’ll transform just about any movie he appears in into a respectable hit, even if that movie is a poorly marketed (but well-reviewed) action movie based on a comic book that no one read. We shouldn’t be surprised that ‘2 Guns‘ shot to the top of the box office, but we are a little. Oh, Denzel Washington, you always catch us off guard. Universal Share on Twitter Share on Facebook ScreenCrush August 4, 2013 12:02 PM | By Jacob Hall Weekend Box Office Report: ’2 Guns’ Shoots Down ‘The Smurfs 2′ My Local Experts Music Videos Hot Music Survey Sporting SD",
    "textAfterTable": "Although $27 million is far from the most impressive opening of the summer, it’s pretty darn good for a non-sequel action movie with a generic title. ’2 Guns’ didn’t cost too much, so it didn’t need a massive opening. With Washington’s star power (no one will ever give co-star Mark Wahlberg any credit for this), the film should be a minor hit, letting everyone in the Denzel business know that yes, this Oscar-winning actor should continue pumping out action films twice a year or so for the foreseeable future. In second place, ‘The Wolverine‘ took a sizable drop, taking in $21 million. That’s a little rough, but the film is only a day or two away from $100 million. International grosses should help ease the pain, but this is evidence that audiences are still feeling sore from ‘X-Men Origins: Wolverine’ kicking them in a butt a few years ago. And that brings us to ‘The Smurfs 2,’ which opened to $18 million, roughly half of the first film’s opening. It seems that even kids are tired of these annoying blue monstrosities. Hooray? Yes. Hooray, indeed. In fourth place, ‘The Conjuring‘ flew past $100 million, making it the highest grossing original horror film since ‘The Sixth Sense’ back in 1999. It may have the legs to reach $150 million, but at this point, the final numbers aren’t as important as the fact that this is one of the biggest horror smashes in a long,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}