{
    "relation": [
        [
            "Year",
            "1990",
            "1989",
            "1988",
            "1987",
            "1986",
            "1985"
        ],
        [
            "League",
            "BNGL",
            "CGL",
            "Did Not Compete",
            "Budweiser",
            "Budweiser",
            "UKAFA"
        ],
        [
            "Division",
            "First Division: Southern Conference",
            "Baron First Division Southern Conference",
            "",
            "Premier Division Central Conference",
            "Division One Central Conference",
            "Eastern Conference"
        ],
        [
            "Win",
            "1",
            "3",
            "",
            "0",
            "6",
            "3"
        ],
        [
            "Lose",
            "9",
            "3",
            "",
            "9",
            "4",
            "5"
        ],
        [
            "Draw",
            "0",
            "0",
            "",
            "1",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Berkshire Renegades American Football Club -- History and Alumni",
    "title": "",
    "url": "http://www.renegadesafc.com/history.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 677259623,
    "recordOffset": 677251421,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1961=Original Reading Renegades : 1985 to 1990 After their formation, the Renegades were admitted into the United Kingdom American Football Association in 1985 where they competed in the Eastern Conference. They finished with a 3-5 record, narrowly missing out on a playoff spot to the Dunstable Cowboys. The following year, the Renegades transferred over to the Budweiser League, where they competed in the Central conference of Division One. They soon got into their stride, recording a hard-fought win away to the Farnham Knights in their second game, and went on to have a consistent season which saw them win six out of their ten matches. They ultimately finished fourth out of eleven teams - however, due to the format of the league at that time, only the top placed team from each group in Division One qualified for the playoffs (which also included the top four teams from the Premier Division conferences along with the Plymouth Admirals, who finished as the top-performing team in Division Two) and so the Renegades were denied any post-season action. 1987 was to prove a much worse season, with the team failing to register a single win and only a tie gained against Salford-based team the Huskies helping them to avoid a complete washout. After sitting out the 1988 season, the Renegades returned to senior action in 1989 when they joined the Combined Gridiron League. Placed in the four-team Southern Conference, they had an indifferent season which saw them finish with a 3-3 record, once again missing out on the playoffs. After just one season in the CGL, the Reading Renegades transferred over to the British National Gridiron League where they competed in the First Division Southern Conference. Unfortunately, this new competition brought no joy and the Renegades finished bottom of the table, recording just one win at home to the Wight Rhinos. The club folded shortly after the season ended.}",
    "textBeforeTable": "Original Reading Renegades : 1985 to 1990 After their formation, the Renegades were admitted into the United Kingdom American Football Association in 1985 where they competed in the Eastern Conference. They finished with a 3-5 record, narrowly missing out on a playoff spot to the Dunstable Cowboys. The following year, the Renegades transferred over to the Budweiser League, where they competed in the Central conference of Division One. They soon got into their stride, recording a hard-fought win away to the Farnham Knights in their second game, and went on to have a consistent season which saw them win six out of their ten matches. They ultimately finished fourth out of eleven teams - however, due to the format of the league at that time, only the top placed team from each group in Division One qualified for the playoffs (which also included the top four teams from the Premier Division conferences along with the Plymouth Admirals, who finished as the top-performing team in Division Two) and so the Renegades were denied any post-season action. 1987 was to prove a much worse season, with the team failing to register a single win and only a tie gained against Salford-based team the Huskies helping them to avoid a complete washout. After sitting out the 1988 season, the Renegades returned to senior action in 1989 when they joined the Combined Gridiron League. Placed in the four-team Southern Conference, they had an indifferent season which saw them finish",
    "textAfterTable": "Alumni Roster Below is a roster of previous Renegades. If you aren't on the list and think you should be, or if you have any more information about the history of the Renegades email us at alumni@renegadesafc.com Name Position Seasons Status Jack Hedges OL 1984-1987 & 2005-2006 Refereeing Paul Foster LB 1984-1987 & 2005-2006 Coaching Jeff Holloway DL 1985-1986 Retired Steve McMahon RB 1986 Retired Carl Marshall QB 2004-2006 Retired James Bish WR 2004-2006 Retired Jon Sloan LB 2004-2007 Coaching Alex Tong RB 2004-2007 Sabbatical Michael Knott QB 2004-2007 Coaching Richard Hedges DL 2004-2008 Transferred Tim Hay DL 2004-2009 Reading Rebels Michael Purdham OL 2004-2009 Transferred Joe Williams CB 2005 Retired Joseph Meegan WR 2005 Retired Richard Bicknell TE 2005-2006 Retired Ralph Hyde CB 2005-2006 Retired Rob Lean TE 2005-2006 Retired Adam Franc OL 2005-2006 Retired Chris Bell RB 2005-2006 Retired Travis Gerber LB 2005-2006 Immigrated Scott Goddard RB 2005-2007 Coaching John Zinkus WR 2005-2007 Transferred Phil Bett OL 2005-2009 Retired Brent Guilblin S 2006 Retired Chris Rees RB",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}