{
    "relation": [
        [
            "Starting Attributes",
            "Strength",
            "Agility",
            "Stamina",
            "Intellect",
            "Spirit"
        ],
        [
            "Base",
            "17",
            "22",
            "18",
            "24",
            "19"
        ],
        [
            "Mage",
            "17",
            "22",
            "18",
            "27",
            "21"
        ],
        [
            "Rogue",
            "18",
            "25",
            "19",
            "24",
            "19"
        ],
        [
            "Warlock",
            "17",
            "22",
            "19",
            "26",
            "21"
        ],
        [
            "Hunter",
            "17",
            "25",
            "19",
            "24",
            "20"
        ],
        [
            "Paladin",
            "19",
            "22",
            "20",
            "24",
            "20"
        ],
        [
            "Priest",
            "17",
            "22",
            "18",
            "26",
            "22"
        ]
    ],
    "pageTitle": "Racial Analysis: Blood Elf | Psynister's Notebook",
    "title": "",
    "url": "https://psynister.wordpress.com/2009/09/09/racial-analysis-blood-elf/?like=1&source=post_flair&_wpnonce=c7a699f16c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869810739,
    "recordOffset": 869782744,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27340=September 9, 2009 at 4:05 PM, 28532=September 27, 2009 at 6:47 AM, 25717=Posted by Psynister on September 9, 2009 in Races}",
    "textBeforeTable": "Classes and Starting Attributes Sep 09 Racial Analysis: Blood Elf The 5 W’s of Dual Spec → ← Racial Analysis: Dwarf RSS Blog Roll: Dungeons & Dragons Blog Roll: SWTOR Blog Roll: World of Warcraft Blog Rolls WoW Tweeps Syndication Psynister Support About Me About Legacy Crew Skills Companions Crew & Skills Sage/Sorc 21-40 DPS Sage/Sorc 1-20 DPS Sage/Sorc 1-20 Healing",
    "textAfterTable": "Racial Traits Arcane Torrent (Instant cast, 2 minute cooldown) Silence all enemies within 8 yards for 2 seconds. In addition, you regain 6% of your mana. Death Knights and Rogues restore 15 runic power/energy instead. Arcane Affinity (Passive) 10 point skill bonus to Enchanting Profession Magic Resistance (Passive) Reduces the chance to be hit by spells by 2% General Assessments Here I go over each class with an analysis based purely on stats. A lot of people on forums like to ask what race their should pick for a certain class, and the answer they receive is always the same, “go for whichever race appeals to you most visibly”. But these people aren’t asking which race looks the prettiest, they are asking which one will help them the most with the character. The answer they receive is pretty valid, it really doesn’t matter. But, that doesn’t mean it can’t help as well. While your race does not make a huge difference in the overall scheme of how powerful your character will be at end game, it can impact how well you do early on. Oftentimes a player will start a character and then decide within the first 10 levels whether or not they like the character. So, it’s important to start off with a solid race/class combination if you’re not one for sticking it out for a while to really give the character a chance. If you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}