{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are all sorts of hidden gems at Valencia. The library has a wide variety of books and some very fast computers. There are also after school clubs that may or may not count for elective credits as well as an honor society that goes by the name 'Alpha Gamma Omega' it is part of the Phi Theta Kappa group.",
            "The food is pretty expensive for the portion size. That's not to say that it isn't good however. If you are willing to splurge some extra cash a visit to the cafeteria especially on an empty stomach is never really a bad idea.",
            "I don't live on campus so I can't really say how dorm life is. Though, if I did live on campus it would probably be pretty awesome. Since it has become a smoke free campus the air has become pretty clean as of late.",
            "The teachers at Valencia College have a no nonsense policy. They are here to make sure you learn. They do their jobs very well, and even though they can be a bit strict sometimes they are not unreasonable.",
            "If you are thinking about attending Valencia I suggest checking their website for more information. It can be a bit confusing at first but Valencia offers a bunch of programs and clubs to help you along your career path. WE also have awesome academic advisers.",
            "Valencia College is a very good school. It has a lot of options for the students to explore for almost every career/major. The Professors here are some of the best in the nation."
        ]
    ],
    "pageTitle": "Valencia College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Valencia-Community-College/reviews?_escaped_fragment_=/show/95011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891934291,
    "recordOffset": 891763916,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{674381=Valencia was named the number college in the nation, in the year of 2012. Instead of raising their cost of tuition like every other college or university, Valencia decided to keep their tuition affordable for students so they kept it at 99.06 per credit hour. They really care for the d]students and they offer so many programs for them, either its tutoring programs or scholarship programs they want everyone a chance to attend college and succeed., 466008=Valencia has plenty of opportunities and events that allow the student body to have fun and even help out the community. There are picnics, live bands, and fund raisers for causes such as breast cancer to cleft lips. I even had the chance to participate in a fundraiser to help victims of trafficking in April of 2011., 633278=Valencia College is my house since 2011 and it will be always. This is the place my journey started., 769802=Valencia college offers great opportunities for student success. There are always advisor on campus for any need a student may have. I graduate this december and i will transfer to UCF easily thanks to Valencia's Direct Connect to UCF program., 356967=I have been blessed with scholarships and pell grants so technically I have not paid anything out of pocket. But if I found myself having to do so I'd be paying roughly $1200.00-1400.00 per semester for a full time schedule., 703953=Valencia is a very well kept school. It was very Spacious yet cozy when it came to the one-on-one relations with students and teachers from what I saw. I really don't know that much about Valencia so far. however, what I've seen already has me anxious and excited for Spring Semester 2013., 320741=Every year on October 13Th, Valencia campuses celebrate Matador Day which is there mascot. They have tons of free food and activities available to all the students, to just have fun and enjoy being a Valencia Student, 951051=Winner of the 2012 Aspen Award and it shows. Great school, there are many different avenues for support and the class sizes are small. It is very affordable and it challenges you every step of the way., 507844=Valencia College is outstanding, which is why it won the 2011 Aspen Prize for Community College Excellence!, 557255=Valencia is simply wonderful. The winner of the Aspen Award for 2011 for Community College Excellence. I highly, highly recommend anyone going.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 22 out of 24 people found this review useful. 1 of 429 Samantha from Clermont, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students Make sure to check your emails. You could miss out on something if you don't. Meet with an adviser before you sign up for classes. Then you won't be taking classes that you already had credit for or that are too hard and unnecessary for your degree. I speak from personal experience! Don't be afraid of asking questions. Everyone is friendly and very helpful. Try to figure out ahead of time what college you're going to after Valencia. Then the advisers can help you more with what classes you should take. Bang for the buck I can learn so much at Valencia, and it doesn't cost that much. I have friends who complain about prices at other colleges, but thanks to Valencia's fantastic prices, I can afford to go to college. In fact, I plan on taking as many required classes as I can at Valencia because they're so inexpensive. Am enjoying being here I was scared about college before I started going to Valencia. However, now I know that Valencia will help me with anything I'm having problems with, and they will do it in a manner that makes my education fun and profitable. Valencia is a comfortable and enjoyable learning environment. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}