{
    "relation": [
        [
            "Date",
            "Aug 22, 2003",
            "Mar 29, 2004",
            "Mar 10, 2006",
            "Aug 12, 2008",
            "Aug 20, 2008",
            "Feb 27, 2009",
            "Jun 16, 2010",
            "Jun 24, 2010",
            "Feb 13, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: BELDEN TECHNOLOGIES, INC., MISSOURI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:STROHMEYER, JAMES J.;BLUMFELDER, WILLIAM;TEHAN, JOHN;ANDOTHERS;REEL/FRAME:014412/0478 Effective date: 20030812",
            "",
            "Owner name: WACHOVIA BANK, NATIONAL ASSOCIATION,NORTH CAROLINA Free format text: PATENT SECURITY AGREEMENT;ASSIGNOR:ENGINEERED SUPPORT SYSTEMS, INC.;REEL/FRAME:017286/0777 Effective date: 20060131",
            "Owner name: WACHOVIA BANK, NATIONAL ASSOCIATION,NORTH CAROLINA Free format text: SECURITY AGREEMENT;ASSIGNOR:DRS SUSTAINMENT SYSTEMS, INC.;REEL/FRAME:021371/0255 Effective date: 20080702",
            "Owner name: DRS SUSTAINMENT SYSTEMS, INC.,MISSOURI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ENGINEERED SUPPORT SYSTEMS, INC.;REEL/FRAME:021411/0471 Effective date: 20080813",
            "Year of fee payment: 4",
            "Owner name: ENGINEERED SUPPORT SYSTEMS, INC.,MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:WELLS FARGO BANK, N.A.;REEL/FRAME:024539/0683 Effective date: 20100607 Owner name: ENGINEERED SUPPORT SYSTEMS, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:WELLS FARGO BANK, N.A.;REEL/FRAME:024539/0683 Effective date: 20100607",
            "Owner name: DRS SUSTAINMENT SYSTEMS, INC.,MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:WELLS FARGO BANK, N.A.;REEL/FRAME:024576/0850 Effective date: 20100607 Owner name: DRS SUSTAINMENT SYSTEMS, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:WELLS FARGO BANK, N.A.;REEL/FRAME:024576/0850 Effective date: 20100607",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6941794 - Systems and methods for residue collection - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6941794?dq=6861155",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469786471,
    "recordOffset": 469751047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46421=From an acquisition cost and maintenance, cost perspective, early detection at the DPRCS can result in a 3:1 reduction in the number of detectors. This is a result of the DPRCS being capable of processing 120,000 or more mailpieces per hour while an AFCS can only process 36,000 letters per hour. The initial acquisition cost reduction can be very significant when presently “real-time” CBWA detectors typically cost between $100,000 and $275,000 each just for the basic instrumentation alone., 27418=Since the use of Anthrax in the United States Mail in October 2001, government organizations have becoming increasingly interested in detecting dangerous substances such as microorganisms, chemicals, or biological warfare agents which could be distributed through the mail system to promote the agenda of a terrorist organization. As the postal service and mail delivery is a virtually universal service touching the lives of almost all people throughout the United States and many more throughout the world, the postal service presents a potentially limitless distribution network for a terrorist group to utilize. Further, by the time a letter or package has reached the final destination, it has often been handled by many individuals, some of whom may not be known without a lengthy investigation. Any or all of these individuals may have been exposed to the substance and could be affected without rapid medical response. Further, in the case of a contagious substance, trying to quarantine those exposed prior to the contagion becoming epidemic may be virtually impossible., 45960=If the CBWA is detected at the DPRCS (101) or (103), less than 100 feet of conveyor in one system is contaminated. However, if the CBWA is not detected until the AFCS (111) there can be over 1000 feet of conveyor and anywhere from 3 to 10 or more pieces of equipment may be contaminated. The time to decontaminate the facility and the associated cost impact dramatically increases with this later detection., 28530=October 2001 was not the first use of the mail for terrorist acts. Mail bombs and even dangerous pranks were common long before the mail was used as a method for distributing a biological warfare agent. In addition to purposeful terrorist acts, sometimes dangerous substances are shipped in the mails innocently or for other purposes. Dangerous substances may be shipped by a person who simply does not think of the consequences or the mail may be utilized for other illicit acts such as drug trafficking., 26784=This application claims priority to U.S. Provisional Application Ser. No. 60/385,004 filed May 31, 2002 the entire disclosure of which is herein incorporated by reference.}",
    "textBeforeTable": "Patent Citations While the invention has been disclosed in connection with certain preferred embodiments, this should not be taken as a limitation to all of the provided details. Modifications and variations of the described embodiments may be made without departing from the spirit and scope of the invention, and other embodiments should be understood to be encompassed in the present disclosure as would be understood by those of ordinary skill in the art. . FIGS. 4-13 provide drawings of an embodiment of an RCM, air handling system, and DPRCS in accordance with the present invention. This embodiment is shown from multiple angles and multiple views showing structures similar to those described and shown in FIGS. 14 through 19 In embodiments, the RCM (701) may be provided as a replacement for the portion (700) of the DPRCS (400) allowing for these items to be removed and replaced. Alternatively, the RCM (701) could be provided as the components of a kit for use to convert an existing DPRCS (400) into the DPRCS (400) with an RCM (701). In a still further embodiment, the DPRCS could be originally manufactured with an RCM (701). To provide a higher degree of safety, in an embodiment of the invention, the entire DPRCS (400) area, possibly including the hamper staging area, may be enclosed within a biological containment system or isolated environment to segregate the",
    "textAfterTable": "Pitney Bowes Inc. Method and system for notifying mail users of mail piece contamination US20030115998 * Dec 24, 2001 Jun 26, 2003 Belec Eric A. Mailpiece perforating/cutting system US20030119175 Nov 27, 2002 Jun 26, 2003 Lockheed Martin Corporation Apparatus for testing for particulate contaminants in depositories for mail-like articles US20030144800 * Dec 31, 2002 Jul 31, 2003 Lockheed Martin Corporation Methods and system for hazardous material early detection for use with mail and other objects US20030145664 * Nov 1, 2002 Aug 7, 2003 Wolfgang Schwarz Mail processing system with multilevel contaminant detection and sterilization US20030222133 * May 31, 2002 Dec 4, 2003 Esakov Michael D. Mail collection box US20030233891 Jun 20, 2002 Dec 25, 2003 Pitney Bowes Incorporated Mail piece for obtaining samples of harmful materials in mail processing equipment US20040020264 * Oct 24, 2002 Feb 5, 2004",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}