{
    "relation": [
        [
            "Date",
            "Sep 19, 2001",
            "Sep 26, 2005",
            "Oct 1, 2007",
            "May 19, 2008",
            "Oct 26, 2009",
            "Mar 24, 2010",
            "Mar 24, 2010",
            "May 11, 2010",
            "Mar 14, 2011",
            "Mar 15, 2011",
            "Mar 15, 2011",
            "Jan 24, 2012"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "REMI",
            "REIN",
            "LAPS",
            "FP",
            "PRDP",
            "SULP",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Reinstatement after maintenance fee payment confirmed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: MEDICAL MANAGEMENT, INC., UTAH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MEDICAL DISCOVERIES, INC.;REEL/FRAME:019920/0588 Effective date: 20070926",
            "Owner name: MEDICAL DISCOVERIES GROUP, INC., UTAH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MEDICAL MANAGEMENT, INC.;REEL/FRAME:021118/0672 Effective date: 20080514",
            "",
            "",
            "",
            "Effective date: 20100324",
            "Effective date: 20110315",
            "",
            "Year of fee payment: 12",
            "Free format text: CHANGE OF NAME;ASSIGNOR:MEDICAL DISCOVERIES GROUP, INC.;REEL/FRAME:027585/0967 Effective date: 20081126 Owner name: REOXCYN DISCOVERIES GROUP, INC., UTAH"
        ]
    ],
    "pageTitle": "Patent US5731008 - Electrically hydrolyzed salines as microbicides - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5731008?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473022595,
    "recordOffset": 472980160,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{92572=The stability of antibody to the p24 core antigen to detection by Western blot analysis remained positive during the course of electrolyzed saline therapy for patients AAA, BBB, DDD, and EEE. No data were available for patient CCC. This result is significant in that reports have documented that antibodies to the p24 antigen tend to become undetectable with the onset of clinical symptoms. J. Esteban et al., 2 Lancet 1083 (1985); J. Goudsmit et al., 155 J. Infect. Dis. 558 (1987)., 61937=According to Redfield et al., \"HIV Infection: The Clinical Picture,\" Scientific American, 259:90, October, 1988, there is a balance of power between the HIV virus and the immune system arranged by the T4-cells. From the WR0 (exposure stage) to the WR1 stage the HIV virus increases rapidly at which point the immune system begins to respond. By the time the WR2 stage is reached the viable virus in the body has dropped dramatically with the concomitant rise in scavengers, macrophages, T-cells, B-cells, antibodies and other immune system components. The immune system remains somewhat in control throughout the WR2 and into the WR3 stages although there is a gradual rise in HIV. However, by the time the WR4 stage is reached the HIV has begun to overwhelm the immune system and the T4-cells become so depleted that the balance of power switches, and, from that point on, the HIV replicates wildly, overwhelming the remaining T4-cells and any vestiges of immune defense., 19548=This application is a divisional of application Ser. No. 08/275,904 filed Jul. 15, 1994, now U.S. Pat. No. 5,622,848, which is a Continuation-in-Part of patent application Ser. No. 07/527,321, filed May 23, 1990, now U.S. Pat. No. 5,334,383., 76492=As documented in Table IV, 100% of cells exposed for 2.5 minutes to undiluted concentrations of electrolyzed saline were viable. At 5 and 10 minutes some toxicity to cells were noted at both 1:1 and 1:5 dilutions and at 1:10 minimal toxicity was noted at 10 minutes. For lesser times at the 1:10 dilution and at higher dilutions there was no toxicity noted up to 10 minutes., 67439=If desired in order to conclude the treatment, about 500 to 5000 mgs, and preferably about 1000 to 4000 mgs of ascorbic acid, or its sodium or calcium salt, is administered about two to twenty minutes after the injection of the electrolyzed saline. This reducing agent neutralizes the remaining unreacted active components of the electrolyzed saline., 80819=To further demonstrate the in vitro activity of the electrolyzed saline of Example I against HIV infected lymphocytes, additional testing was completed using the HIV infected laboratory isolate HB-2. The TCID (Tissue Culture Infectious Dose) ranged from 108 to 101 at an exposure time ranging from 1-10 minutes at dilutions of 1:1, 1:5 and 1:10. The results are given in Table VI., 73850=The in vitro toxicity of the electrolyzed saline of Example I is illustrated by adding it to human lymphocytes at varying ozone and active chlorine agent concentrations and exposure intervals as shown in Table IV. Briefly, a 0.3% Trypan blue solution was prepared by combining 3 parts of a 1% Trypan blue solution (1 gram Trypan blue powder placed in a 100 ml volumetric flask and dissolved in water to a volume of 100 mls and then filtered prior to use) with 7 parts of RPMI 1640 media containing 10% FBS. A 1 mL sample of lymphocytes (e.g. 105 live cells) was sedimented, the medium decanted, and the lymphocytes resuspended in an electrolyzed saline solution wherein the ozone and active chlorine species concentrations were modified by making selected dilutions with normalized saline. The lymphocytes were incubated for a selected time, then the lymphocytes were washed by sedimentation and resuspension in fresh medium. An aliquot of lymphocytes was then mixed with 0.3% Trypan blue solution and observed microscopically. One hundred cells were screened and the number of cells excluding Trypan blue was deemed as the percentage of viable cells., 21037=Chlorine, in the form of chlorinated lime was used successfully as early as 1846 by Semmelweiss to prevent and fight puerperal fever. By 1911 the United States purified as much as 800,000,000 gallons of water through the chlorination process. Wide use of chlorine as a 0.05% sodium hypochlorite solution (Dakins Solution) for open and infected wounds began in 1915. Dakins Solution was a standard product up to 1963 listed in the British Pharmacopeia., 94060=The stability of serum IgG levels of patients receiving electrolyzed saline therapy is illustrated in that all of the patients of Example XI remained within the normal reference range of 700-1950 mg/dL., 79491=The in vitro activity of clinical isolates (field isolates) of HIV infected human lymphocytes was tested with the electrolyzed saline of Example I according to the method of Ho et al. N. Eng. J. Med. 321:1621-1625 (1989). The TCID (Tissue Culture Infectious Dose) per 106 lymphocytes PBMC (Peripheral Blood Mononuclear Cells)! was 5000 for each isolate. The p24 antigen was checked weekly for five weeks. The results at the end of five weeks are shown in Table V., 82879=It is evident from these results that, at an end point concentration of 108 infected cells, complete killing occurred at a 1:1 dilution (full strength) after a one minute exposure. A 1:5 dilution of the saline was sufficient to kill a 107 TCID after a 5 minute incubation period but not at 1 or 2 minute incubations. No killing of HIV occurred at a 1:10 dilution except at the lower 102 and 101 TCID concentrations., 39700=In copending application Ser. No. 07/527,321 filed May 23, 1990, it was considered that 100-300 ppm of chloride was the desired component along with other reaction products of the electrolysis. At the time that application was filed the inventor did not have in his possession such equipment as could accurately determine ozone or active chlorine species content. The term \"chloride\" as used in that application meant the active chlorine content of the solution and not the chloride ion per se. The use of superior electrodes for the electrolysis reaction and more sensitive detection or analytical equipment has shown that the electrolyzed solutions can have an ozone content which can vary between about 5 to 100 mg/liter and an active chlorine species concentration of between about 5 and 300 ppm. The pH of the solution is preferably between about 7.2 and 7.6 and, when used for intravenous administration, most preferably between about 7.35 and 7.45, which is the normal pH range of blood. Preferably the ozone content will be between about 5 to 30 mg/L and the active chlorine species content will be between about 10 and 100 ppm. Most preferably, the ozone content will be between about 9 to 15 mg/L and the active chlorine species will be present in amounts ranging between about 10 and 80 ppm. While the chloride content as stated in the copending application is within the ranges considered as operative, if it had been accurately been measured by a chlorine selective electrode, it would most likely have been lower and comparable with the solution exemplified in Example I which follows., 77293=The Ames tests employ several strains of Salmonella typhimurium which have been selected based on their sensitivity to mutation. The Ames tests were performed by mixing the electrolyzed saline of Example I with the test organism in a soft agar solution that contains only small amounts of histidine. The histidine permits the inoculated test organism to undergo a limited number of divisions, but is insufficient to permit normal growth. The tester strains require histidine for growth, due to a mutation in the gene that controls production of histidine. If, however, the strain undergoes a reverse mutation (spontaneous or induced by the test substance or a positive control material) the organism no longer requires histidine to grow and can produce a visible colony or revertant. Only mutations to the test organism in the region of the histidine gene will cause the test organism to undergo a reverse mutation to an organism that then no longer requires histidine. The tester strains were selected to detect various types of mutagens. The tester strains employed were TA97A, TA98, TA100, TA102, and TA1535., 57939=To understand why the use of colchicine to prevent the release of glycoproteins may be an important adjunct to the present invention, the following information regarding HIV and AIDS is beneficial. This extreme viral infection is popularly referred to as AIDS (acquired immune deficiency syndrome). However, it is more appropriately an HIV (human immunodeficiency virus) infection leading to AIDS. This disease proceeds through various stages from HIV exposure to HIV infection to development of AIDS. These stages are classified by Redfield, et al. in an article entitled \"The Walter Reed Staging Classification for HTLV-III/LAV Infection\" published in the New England Journal of Medicine, Volume 314, Page 131, January, 1986, and are referred to as the Walter Reed (WR) classification. They are thus referred to as WR0 through WR6. The WR0 classification means there has been exposure to the HIV virus although there are no symptomatic indications. WR1 means there is a positive HIV antibody and/or virus determination but no other symptoms. A WR2 classification is characterized by chronic lymphadenopathy or swollen lymph nodes in addition to positive HIV antibody and/or virus determination. A WR3 classification is reached when the T4-cell count drops and remains below 400 cells per cubic millimeter of blood. The normal T4-cell count is about 800. There may or may not be chronic lymphadenopathy in WR3 through WR6 classifications but the T4-cell count stays below 400. A patient moves to the WR4 stage after partial sub-clinical (asymptomatic) defects are found in delayed hypersensitivity, i.e. the ability to react to skin tests that are a barometer of immune functioning. The line into WR5 is crossed when the patient completely fails to respond to the skin test or when thrush (a fungal disease of the mouth) develops. Lymphadenopathy and abnormalities of the T4-cell and skin tests must persist for at least three months to serve as valid criteria. Patients enter into the WR6 stage and are said to have AIDS when opportunistic infections, which occur because the immune system has broken down, develop elsewhere in the body. Typical opportunistic infections include Kaposi's sarcoma, cryptococcal meningitis, cytomegalovirus (causing blindness) and classic Pneumocystis carinii pneumonia., 47890=The sterile saline solution that is to be subjected to treatment in the electrolysis unit has an initial concentration of about 0.25 to 1.0% NaCl which is about one-fourth to full strength of normal or isotonic saline solution. According to Taber's Cyclopedic Medical Dictionary, E. A. Davis, Co. 1985 Ed., an \"isotonic saline\" is defined as a 0.16M NaCl solution or one containing approximately 0.95% NaCl; a \"physiological salt solution\" is defined as a sterile solution containing 0.85% NaCl and is considered isotonic to body fluids and a \"normal saline solution\" a 0.9% NaCl solution which is considered isotonic to the body. Therefore, for purposes of this disclosure, the term \"isotonic\", \"normal saline\", \"balanced saline\" or \"physiological fluid\" is considered to be a saline solution containing between about 0.85 and 0.95% NaCl. The saline solution may be subjected to electrolysis at concentrations between about 0.15 and 1.0%. Preferably the solution will be diluted with sterile distilled water to the desired concentration, preferably between about 0.15 to 0.35%, and subjected to electrolysis at sufficient voltage, amperage and time to produce an electrolyzed solution. The electrolysis reaction is carried out at ambient temperatures. Obviously, the voltage and amperage to be used and the time of electrolysis is subject to many variables, i.e. the size and composition of the electrodes, the volume and/or concentration of saline being electrolyzed. For large electrodes or saline volumes or higher concentrations of saline solutions the voltage, amperage or time may be higher and/or longer. It is the generation of the desired concentration of ozone and active chlorine species which is important. According to Faraday's laws of electrolysis, the amount of chemical change produced by a current is proportional to the quantity of electricity passed. Also, the amounts of different substances liberated by a given quantity of electricity are proportional to the chemical equivalent weights of those substances. Therefore, to generate an electrolyzed saline having the desired concentrations of ozone and active chlorine species from saline solutions having a saline concentration of less than about 1.0%, voltage, amperage and time parameters appropriate to the electrodes and solution are required to produce an electrolyzed solution containing between about 5 to 100 mg/L of ozone and a free chlorine content of between about 5 to 300 ppm. For in vitro use these solutions can be utilized without further modification or they can be adjusted as desired with saline or other solutions. Prior to in vivo use, this solution may be adjusted or balanced to an isotonic saline concentration with sufficient hypertonic saline, e.g. 5% hypertonic saline solution., 85176=Blood tests were conducted each day. There was no decrease in the red blood count and the blood showed no abnormalities or hemolysis. Repeat white blood counts revealed that the patient started with a leukocyte count of about 2000 with 10% lymphocytes. At the end of the fifth day the leukocyte count was 2625 with 20% lymphocytes. This means that the patient has a total lymphocyte count of 220 cells/mm3 at first and a total of 525 cells/mm3 at the end of five days., 84114=The patient was injected intravenously, first with 1.5 mg of colchicine followed by 30 cc of the balanced saline 26.25 cc of electrolyzed saline blended with 3.75 cc of 5% hypertonic saline! over a period of approximately 15 minutes followed about five minutes later by intravenous injection of 1000 mg of ascorbic acid. The patient was treated daily for five consecutive days with the same injections. There was no evidence of any abnormal side effects during the treatment period. The patient was monitored with continuous monitoring of a cardiogram. At the beginning of the first injection, the patient demonstrated a very irregular heart rhythm. At the end of the series of injections he showed marked improvement but still had a small amount of irregularity.}",
    "textBeforeTable": "Patent Citations The above examples show there is evidence that the in vitro and in vivo use of electrolyzed saline in treating physiological solutions and patients in accordance with the invention resulted in decontamination of solutions and marked improvement in patients with no visible toxic side effects. A patient, MV was enrolled in a NIH sponsored clinical trial for chronic, symptomatic patients with Hepatitis C infections. MV was treated with interferon and ribavirin for a six month period. Tests of liver function, including AST, ALT, and LDH continued to increase to levels exceeding 400 for AST and ALT and 700 for LDH. Because no clinical or laboratory improvement was seen by MV or attending physicians following the conclusion of the NIH clinical trial, MV elected to receive therapy using the electrolyzed saline of Example I. Following intravenous treatment at a dosage of 2 mg/kg body weight for five consecutive days a dramatic drop in the AST, ALT and LDH levels were observed. One month after receiving the electrolyzed saline therapy, ALT, AST and LDH values were reestablished within normal ranges and the overall health of MV was stated to being comparable to before becoming symptomatic for Hepatitis C. MV continues to demonstrate good health and laboratory findings show measured parameters to be within normal ranges. EXAMPLE XVII A male (FFF) who was HIV positive had an initial CD-4 count of 244 and a p24 antigen count",
    "textAfterTable": "US7442288 Aug 11, 2006 Oct 28, 2008 Oculus Innovative Sciences, Inc. Electrolytic cell for producing charged anode water suitable for surface cleaning or treatment, and method for producing the same and use of the same US8062500 Dec 5, 2002 Nov 22, 2011 Oculus Innovative Sciences, Inc. Method and apparatus for producing negative and positive oxidative reductive potential (ORP) water US8147444 Jan 22, 2007 Apr 3, 2012 Oculus Innovative Sciences, Inc. Methods of treating or preventing peritonitis with oxidative reductive potential water solution US8277634 Oct 23, 2006 Oct 2, 2012 Apr Nanotechnologies S.A. Electrolytic water treatment device having sintered nanoparticle coated electrode and method for making acid or basic water therewith US8323252 Mar 23, 2006 Dec 4, 2012 Oculus Innovative Sciences, Inc. Method of treating skin ulcers using oxidative reductive potential water solution US8367120 Mar 20, 2009 Feb 5, 2013 Reoxcyn Discoveries Group, Inc. Method and apparatus for producing a stablized antimicrobial non-toxic electrolyzed saline solution exhibiting potential as a therapeutic US8455010 Nov 24, 2009 Jun",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}