{
    "relation": [
        [
            "Date",
            "Sep 7, 1993",
            "Sep 8, 1997",
            "Sep 25, 2001",
            "Mar 6, 2002",
            "Apr 30, 2002"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20020306"
        ]
    ],
    "pageTitle": "Patent US4905435 - Pane holder in all-glass facades - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4905435?dq=1886562",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476525179,
    "recordOffset": 476508283,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22142=This is a continuation of application Ser. no. 075 119, filed July 20, 1987, now abandoned.}",
    "textBeforeTable": "Patent Citations Without further analysis, the foregoing will so fully reveal the gist of the present invention that others can, by applying current knowledge, readily adapt it for various applications without omitting features that, from the standpoint of prior art, fairly constitute essential characteristics of the generic or specific aspects of this invention. While the invention has been illustrated and described as embodied in a pane holder for all-glass facades, it is not intended to be limited to the details shown, since various modifications and structural changes may be made without departing in any way from the spirit of the present invention. It will be understood that each of the elements described above, or two or more together, may also find a useful application in other types of constructions differing from the types described above. Finally, the gaps 22 formed in each case between two pane zones are closed, for example, by a blanking strip 33 (FIG. 2) and after final assembly all other external visible gaps remaining are sealed with a silicone compound. Because the spacing gap 22 can in each case be sealed from the outside and the folded edges of the holders therefore cannot be seen, the structure according to the invention presents a pleasant appearance from the outside. Instead of the silicone compound, any suitable material can of course be used for filling the gaps, such as, for example, a cover cap 33' (FIG.",
    "textAfterTable": "GB1245748A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5063718 * Dec 20, 1990 Nov 12, 1991 Al Nonis Curtain wall for a building US5199236 * Apr 29, 1991 Apr 6, 1993 Aluglass Trading Company Limited Insulated glass/flush outer surface arrangement US5307597 * Nov 13, 1992 May 3, 1994 Ykk Corporation Water deflector US5355645 * Aug 26, 1992 Oct 18, 1994 Farag F Aziz Stopless butt-joint multiple curtainwall system US5381637 * Dec 21, 1993 Jan 17, 1995 Farag; F. Aziz Stopless butt-joint curtainwall system US5579616 * Oct 6, 1994 Dec 3, 1996",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}