{
    "relation": [
        [
            "Date",
            "Nov 22, 2005",
            "Dec 3, 2008",
            "Feb 25, 2013",
            "Jul 12, 2013",
            "Sep 3, 2013"
        ],
        [
            "Code",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20130712"
        ]
    ],
    "pageTitle": "Patent US6916114 - Apparatus for the addition of a compound or compound mixture to another - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6916114?ie=ISO-8859-1&dq=US+6,313,853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473108935,
    "recordOffset": 473061376,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6618=Yet another way to measure the temperature of the piston content is shown in FIGS. 3C to 3E. The figures depict piston 18 in the fully descended position along with the printed circuit-board 114 and part of the bottom plate 36. In the position shown in FIGS. 3C and 3D the piston 18 is resting on an electrically isolated printed circuit-board 114 mounted on the bottom plate 36. In FIG. 3E the piston 18 is resting on a electrical contact plate 120 and cylinder 122. Both the plate and the cylinder are placed on, and electrically connected to a printed circuit-board 114. The printed circuit-board is mounted on, and electrically isolated from the bottom plate 36. This printed circuit-board is electrically connected to a leak-free mounted connector 106 not shown in either FIG. The temperature sensor 94 can be permanently electrically connected to the printed circuit-board. In FIG. 3C, for example, this connection is formed by conducting wires 82. The length of the wires 82 should allow the piston 18 to move unhindered between the extreme positions. The temperature sensor 94 is mounted on a thermally conductive plate 78. This plate is mounted inside the piston 18 using a retaining ring 80 and an O-ring 76. Preferably both the plate and the O-ring are compatible with the reaction conditions used and leak-free under the pressure difference used to move the piston 18. The temperature sensor 94 can also be temporarily electrically connected to the printed circuit-board. For example, in FIG. 3D electrical contact between the temperature sensor 94 and the printed circuitboard 114 is only made when the piston 18 is fully descended. The contact is made using a coaxial connector mounted inside the piston 18. The male part of the coaxial connector 116 is electrically connected to the temperature sensor 94. The temperature sensor is mounted on a thermally conductive plate 78, which in turn is mounted inside the piston 18. To mount this plate use is made of an O-ring 76 and retaining ring 80. Preferably both the plate and the O-ring 76 are compatible with the reaction conditions used and leak-free under the pressure difference used to move the piston 18. The female part 118 of the coaxial connector is mounted on a printed circuit-board 114, and electrically connected to it. Yet another way of measuring the temperature of the content of the piston 18 is to mount an integrated circuit (IC) in thermal contact with the content of the piston 18. For example a DS1912 IC manufactured by Dallas Semiconductors, shown in FIG. 3E, can be mounted leak-free in bottom of the piston 18. The IC is leak-free mounted using a retaining ring 80 and O-ring 76 combination. This IC contains a temperature sensor and can record the temperature of the piston 18. This IC also contains a unique digital code identifying both the sensor as well as the piston 18 it is mounted in. The temperature and code can be electronically read by a computer, not shown in FIG. 3E, when the sensor 94 makes contact with a printed circuit-board 114 mounted on the bottom plate 36. The printed circuit-board contains a contact plate 120 and a cylindrical contact 122. Both make electrical contact with the sensor 94 when the piston 18 is fully descended. The printed circuit-board 114 is connected to a leak-free mounted connector 106, not shown in FIG. 3E.}",
    "TableContextTimeStampAfterTable": "{99961=Additional ways of measuring the temperature of the content of the piston 18 are given in the first additional embodiment. The temperature sensors 94 can be connected to a computer or read-out unit. The sensors can be combined with a temperature controller to regulate heating or cooling devices. Temperature sensors, controllers and read-out units are available through commercial vendors like Minco Products and Omega Engineering, while high pressure and high temperature connectors are available through commercial vendors. The DS1912 IC is available through Dallas Semiconductors or other commercial vendors., 103219=For most effective stirring the poles of the electromagnets preferably are positioned in the body 10 in such a way that the stir bar 18 is in between the poles. Depending on the final position of the stir bar 32 and piston 18 inside the bore 30, the electromagnets may be positioned in a place along the bore 30 other than depicted in FIG. 1P. Furthermore the electromagnets may be placed perpendicular or parallel to the bore 30 outside the body 10, surrounding the body 10. Diagonally located pairs of electromagnets are connected in series to form two electrically separate circuits. Each circuit contains two electromagnets. Electromagnets are electrical conductors that produce a magnetic field when an electrical current passes through them. Typically, the electrical conductor consists of one or more wire coils wrapped around a solid core made of material having relatively high permeability, such as soft iron or mild steel. The wire wrapped around the core is encapsulated by an electrically isolating layer compatible with the reaction conditions used. An electrical current, pulsed or sinusoidal, through the circuits will create a momentary magnetic field. A magnetic stir bar 32 placed in this field will attempt to align itself with the direction of the magnetic field. The current through one circuit can gradually or instantaneously be switched to the other circuit. As a result a new magnetic field perpendicular on the previous field is generated. The magnetic stir bar will attempt to realign itself with the direction of the new field, resulting in a 90 degree rotation. The combination of a magnetic stir bar and four electromagnets is equal to a stepper motor with a resolution of 90 degrees. By repeated switching of the magnetic fields by a stepper motor driver and controller, the stir bar can be rotated through 360 degrees at speeds up to 2000 rpm. The preferred maximum speed is about 1200 rpm. Suitable stepper motor drivers and controllers are available through commercial vendors like Axiomatic Technologies or The Motion Group}",
    "textBeforeTable": "Patent Citations It will be apparent to one skilled in the art that modifications may be made to the illustrated embodiment without departing from the spirit and scope of the invention as hereinafter defined in the Claims. In this patent document, the word “comprising” is used in its non-limiting sense to mean that items following the word are included, but items not specifically mentioned are not excluded. A reference to an element by the indefinite article “a” does not exclude the possibility that more than one of the element is present, unless the context clearly requires that there be one and only one of the elements. , is not different from the operation of a single piston apparatus and therefore not depicted or discussed. FIG. 2A , the operation of the multi-well version of the main embodiment as described in the sixth embodiment is not different from a single piston apparatus. Both are connected to the gas lines as depicted in FIG. 2A. The operation of the multi well apparatus is therefore not depicted or discussed. The alternative, coupling a series of single piston apparatus to a single set of gas lines as depicted in FIGS. 10A through 10F Referring to Detailed Description of the Operation of the Sixth Embodiment , the hidden channel 28 is represented by dashed lines. Except for these structural changes the multiple piston apparatus is",
    "textAfterTable": "Aug 15, 1961 Autoclave Eng Inc Autoclave US3070094 Feb 25, 1959 Dec 25, 1962 Stanley J Sarnoff Medicament and diluent storing, mixing, and dispensing device US3255926 * Feb 9, 1965 Jun 14, 1966 Modern Lab Inc Compartmented pressurized dispensing device US3358746 * Jul 9, 1965 Dec 19, 1967 Amsted Ind Inc Injection-type casting apparatus US3458076 * Jun 26, 1968 Jul 29, 1969 Owens Illinois Inc Two-compartment package US3693941 Aug 23, 1971 Sep 26, 1972 Suchy Jan S Electromagnetically propelled stirrer and shaker US3696919 * Oct 8, 1970 Oct 10, 1972 Colgate Palmolive Co Double container with mixing means US4106825 Dec 13, 1976 Aug 15, 1978 Autoclave Engineers, Inc. High pressure magnetic drive including magnetic thrust bearings US4231990 Aug 21, 1978 Nov 4, 1980 S.A. Anarec",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}