{
    "relation": [
        [
            "Date",
            "Jan 24, 1997",
            "Mar 14, 2000",
            "Jun 27, 2002",
            "Aug 9, 2006",
            "Jan 19, 2007",
            "Mar 20, 2007"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NEC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:OMAGARI, SHINICHI;REEL/FRAME:008404/0567 Effective date: 19970116",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20070119"
        ]
    ],
    "pageTitle": "Patent US5862464 - Pin diode variable attenuator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5862464?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477489558,
    "recordOffset": 477473599,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that variations and modifications of PIN Diode Variable Attenuator disclosed herein will be evident to those skilled in the art. It is intended that all such modifications and variations be included within the scope of the appended claims. Consequently, production of unnecessary resonance or propagation can be suppressed. (2) Since the present invention has such a construction that the PIN diodes are grounded directly, thin film (or thick film) resistors are rendered unnecessary, and the cost for a circuit board can be reduced and the width of a shield case can be reduced. (1) Since it is constructed such that the attenuation amount is varied by controlling the currents to flow through the individual PIN diodes, the number of parts required in a radio frequency circuit is decreased, and a variable attenuator which is good in radio frequency characteristic can be realized in a small space. Since the present invention has such a construction as described above, the following effects are exhibited. Due to the construction described above, degradation in isolation which arises from propagation from the input to the output in a waveguide mode can be prevented and a case resonance frequency can be a high frequency, and a variable attenuator having good characteristics can be realized. In the present embodiment, as shown in FIGS. 6(a) and 6(b), four PIN diodes 11 to 14 of bare chips are arranged on",
    "textAfterTable": "JPS60160716A * Title not available JPS62207016A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6271727 Aug 6, 1999 Aug 7, 2001 Rf Micro Devices, Inc. High isolation RF power amplifier with self-bias attenuator US6362704 * Oct 6, 1999 Mar 26, 2002 Nokia Corporation Circuit arrangement improving the control characteristics of an attenuator US6400236 * Dec 3, 1999 Jun 4, 2002 Nokia Corporation Method and apparatus for a radio frequency power divider having un-terminated outputs US20040204696 * Apr 9, 2003 Oct 14, 2004 Dennis Chen Disposable articles using high column AUL superabsorbents * Cited by examiner",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}