{
    "relation": [
        [
            "Award Name",
            "The New School Competition",
            "New Zealand Film Grant",
            "NextGen Scholarship",
            "IFT - Samuel Cate Prescott Award",
            "New Zealand International Doctoral Research Scholarships (NZIDRS)",
            "UICC International Cancer Training Workshops",
            "Passion For Fashion Scholarship",
            "GSSI Urban Studies PhD",
            "GSSI Mathematics PhD",
            "GSSI Astroparticle Physics PhD",
            "PhD Research Assistantship At The Computer Systems Lab, Chosun University, Gwang",
            "GSSI Computer Science PhD",
            "MIT Portugal Program: PhD In Transportation Systems",
            "Plenum Scholarship",
            "Pocketbook-Zookal Scholarship",
            "University Of Virginia Woodson Institute Predoctoral Fellowship",
            "Society Of Actuaries (SOA) James C. Hickman Scholar Program",
            "Multi-Country Research Fellowship Program",
            "Domus Academy Master In Business Design (milan, Italy)",
            "Verres Campus Project",
            "ERANET-PLUS",
            "ERANET-MUNDUS",
            "In-state Tuition Scholarship at Minnesota State University Mankato",
            "University Of Wellington Victoria Doctoral Scholarships",
            "Reach Cambridge Scholarship"
        ],
        [
            "Field",
            "Unrestricted",
            "Film/Motion Picture",
            "Unrestricted",
            "Food Science / Nutrition",
            "Unrestricted",
            "Medicine and Health Sciences",
            "Unrestricted",
            "Economics",
            "Mathematics",
            "Physics",
            "Computer & Information Systems",
            "Computer & Information Systems",
            "Engineering and Education/Counseling",
            "Library Science",
            "Unrestricted",
            "Ethnic Studies",
            "Actuarial Science",
            "Political Science/Social Science",
            "Economics, Finance, Communications and Architecture & Design",
            "Engineering",
            "Hospitality, Show Production, Web Design & Development...",
            "Hospitality, Show Production, Web Design & Development...",
            "Unrestricted",
            "Unrestricted",
            "Unrestricted"
        ],
        [
            "Description",
            "The New School invites high school/upper secondary school students all over the world to participate in The New School Competition. The... Nationality: Unrestricted Host Countries: Unrestricted",
            "The New Zealand film grant is for all residents of New Zealand. If you are a resident living abroad, you... Nationality: New Zealand Host Countries: Unrestricted",
            "The NextGen Scholarship Fund was created for international students and non-citizens who come to the United States with the hopes... Nationality: Unrestricted Host Countries: United States",
            "The nominee must, by July 1 of the year of the presentation, (a) be younger than 36 years of age,... Nationality: Unrestricted Host Countries: Unrestricted",
            "The NZIDRS is available to international students who wish to undertake their PhD research in New Zealand. Nationality: Unrestricted Host Countries: New Zealand",
            "The objective is to facilitate a 3 to 5 day teaching and training course by an international faculty of up... Nationality: Unrestricted Host Countries: Unrestricted",
            "The Passion for Fashion Competition challenges people to create their own original design, fashion marketing, merchandising, or retail management plan.... Nationality: Unrestricted Host Countries: United States and Canada",
            "The Ph.D. in Urban Studies will focus on the study of the trajectories of long-term development of local systems and,... Nationality: Unrestricted Host Countries: Italy",
            "The PhD degree in mathematics will guide graduate students to deal not only with the more traditional aspects of this... Nationality: Unrestricted Host Countries: Italy",
            "The PhD degree in physics of the Gran Sasso Science Institute is focused on Astroparticle physics. The main objective... Nationality: Unrestricted Host Countries: Italy",
            "The PhD positions are targeted at the following research topics: Energy-efficient Algorithms for Wireless Personalized-health-monitoring Technologies, Bio-Inspired Fault Tolerant Systems,... Nationality: Korean Host Countries: Korea, South",
            "The PhD program in computer science of the GSSI aims to provide students with the main results, theories, techniques and... Nationality: Unrestricted Host Countries: Italy",
            "The PhD program in Transportation Systems (TR SYS) is designed to prepare students for transportation-related careers in academia, including teaching... Nationality: Unrestricted Host Countries: Portugal",
            "The Plenum Scholarship will be granted for graduate study leading to a Ph.D. from a recognized program in library science,... Nationality: Unrestricted Host Countries: United States",
            "The Pocketbook-Zookal Scholarship For Entrepreneurs is open to all students who are Currently enrolled in a university course or tertiary course. Aged... Nationality: Unrestricted Host Countries: Unrestricted",
            "The predoctoral fellows must be in residence at the University of Virginia for the duration of the award period. Fellows... Nationality: Unrestricted Host Countries: United States",
            "The program is designed to provide stipends to doctoral students who will, through their studies, address research and education needs... Nationality: Unrestricted Host Countries: United States and Canada",
            "The program is open to US doctoral candidates and scholars who have earned their Ph.D. in fields in the humanities,... Nationality: American Host Countries: Unrestricted",
            "The program is thirteen months long (November start) this is an original format of Master in Business Administration and innovation.... Nationality: Unrestricted Host Countries: Italy",
            "The project offers international students the possibility to receive a scholarship and other benefits to graduate from the Politecnico di... Nationality: Unrestricted Host Countries: Italy",
            "The project, coordinated by the University of Barcelona, is composed of ten European institutions, ten Russian institutions, and five associated... Nationality: British, Spanish, Slovakian... Host Countries: United Kingdom, Spain, Slovakia...",
            "The project, coordinated by the University of Barcelona, is integrated by 10 European institutions, 8 Russian institutions and associates partners.... Nationality: British, Spanish, Slovakian... Host Countries: United Kingdom, Spain, Slovakia...",
            "The purpose of the Cultural Contribution In-State Tuition Scholarship is to award international students who achieve excellent academic performance and... Nationality: Unrestricted Host Countries: United States",
            "The purpose of this contribution is to provide them with an insight into the work undertaken by, and the expectations... Nationality: Unrestricted Host Countries: New Zealand",
            "The Reach Cambridge scholarship essay competition is designed for academically excellent students who would otherwise not be able to attend... Nationality: Unrestricted Host Countries: Unrestricted"
        ],
        [
            "10 25 50 100",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Browse Awards | International Scholarships Search | IEFA",
    "title": "",
    "url": "http://www.iefa.org/scholarships?sort=description&Award_page=31",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512892619,
    "recordOffset": 512871081,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Search only independent award listings. Where are you from? Unrestricted Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Ashmore and Cartier Australia Austria Azerbaijan Bahrain Baker Island Bangladesh Barbados Bassas da India Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burma Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Clipperton Island Cocos (Keeling) Islands Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Coral Sea Islands Costa Rica Cote d Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea",
    "textAfterTable": "Go to page: << First < Previous 26 27 28 29 30 31 32 33 34 35 Next > Last >> 2275 988 2326 373 2097 1468 1334 2211 2209 2208 2065 2210 1575 214 2316 521 1787 930 1078 1406 2155 2154 1402 1231 2441 Sponsors Find us on Facebook",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}