{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,109 topics 2,123,954 replies",
            "85,550 topics 1,153,624 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,539 topics 466,163 replies",
            "22,766 topics 196,286 replies",
            "4,270 topics 60,437 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,191 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By D9fred95 A minute ago",
            "Hidden jokes you missed By Zello 32 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 15 hours ago",
            "Whats your favorite/hated r... By Kristian. 10 hours ago",
            "Snail Trail's Spook-o-m... By lil weasel An hour ago",
            "Beta Vice City By Jinx. 5 hours ago",
            "Which Vehicle Do You Prefer? By gts. 5 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By Phil Collin 55 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=222&t=260016&p=1057897698",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987034.19/warc/CC-MAIN-20150728002307-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106992975,
    "recordOffset": 106964421,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20895=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12663=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16691=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18869=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 107990=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47802=lunchxbles, Yahoo, Google, TarHeelJohn, Bing, kassiano7, Ronzilla187, Sveittjpong, xTobyyyyyy, Fenton, dewtech_2008, AzelfandQuilava, JuanG12, kk9fan97, MAR10HD, iBUCKEYE, marshallbslayer, GTAVGUY2001, GtaFanatik, wstaylor, GTA4LIFE9000, Spectacus, Jlogano22, KlIIUMlNATl, womb raider, Garrett2013, quadro09, 1Skrillz, Ermac64, HKM87, npsacobra, JTrocks9, SuperKingBender, ClaudX, fenzy09, LL Cool L, ice_phoenix_66, Officer Ronson, Pat, oCrapaCreeper, IParadise CityI, Swift1, crashoverride93, A.O.D.88, NikkoCharger, Junior_Djjr, zSaintX, johnny0331, treez, vortexHD, shivii, Skyline_Mad, TheRealCMPUNKFan, Growlmon, Stoakzee, SeekingAsylum, Rented, Nick1020, gfen, NotAHipster, TiberiusMcQueen, STANGERVXR, Sylent01, ProLLy SmaSheD, monkb4skunk, thehambone, Anotic, Honch777, Royal22, InfectedG636, Mrgrandis_HKG, mudajama, A 2002, Yan22, Striker258, dbthesuperstar, ashbashbluesfan, McH2Oz2, Ryan_Codebreaker, lolleroz, CrysisAverted, machine4578, kreky, azboythaminter, VideoGameJames, Progeekzy, BlackZmith10, dan bull, supanaut, _Douglas_, darthYENIK, erkwang, Officer620, SolidUSP, hyperar, Caffe1ne, ForcefulMars459, U.N.K.N.O.W.N, KingLouieThaXIII, jBhIpS, ZHPbim, Grizzly322, Los Santos citizen, splatter85, ZANTHERA, xDatxJunkyx, Smesi, nkjellman, GTBunny, BurnettVice, Wesyeed, MKKJ, CptWuTang, jukebox, kysrsoze, KingxGregory, LeoV, pigeons99, 55d, ric-013, WtfWhy, This Guy Is Here, ChaosSoul288, FlexPiTo, Itzreality, SidSid, Pyroshox, RiseAgainBH, killstreakmx, Cass12, TCMike, Startug, JeepXJFreak98, Ritu85, YngDady, Pyro_Indigo, garvdart, LahTigre, Psoloquoise, Choco Taco, deadx23, Mika_0013, WhosYu, Slasherr, DaGengster, PoeticWhisper, Gutslab, HengBoy, theGTAking101, Zello, XCarlSagan865X, SteveNYC, Saphire Skorpio, Captain Revenge, Modojo, Bangha, Xpert.K, Chuck Finley, Jon Snow, lebongjames187, NoxKira, fullrage2012, SlingShot753, -Silence*, maddmax28, ZODIAC 4 v2, .JokeR, D9fred95, TheBigGuy, Bane X01, FunkyFreak, El Sonidito, AuSsIeThUnDeR36, TheIllaDopest, Blisteryship006, The_Big_Show, Fonshway, BrendanTheKid, Fox2Quick, craigdyid, Black Terminator, Lonesoldier01, r.lorenzo13, GoodTimesAhead, Vicarious Mind, Alexa, -Jacking-, o_Marvelous, IChewOnWater, DerpCat, Delta8042, Winning001, x_FRoe__, IIOctaneII, CHUB-CHASER-CHUB, XBLToothPik, Neopolitan, i0ffender, Black_MiD, Frankie Bones 7, Katabasis, Sunshinethrill, javiEmma, JRC99, MF Modding, EnterTheRedDawn, Malikstuntin, CalebJKimbell, IROCZFOX, 313izzle, Vexate, anubhavkumarc, JesusFR33K, GrandMaster Smith, meta187, Majesticnug420, Juicyfer, Razbos, __TheGovernor__, psymin, YaNnEY_x, Cha Boy Jesus, BUTTER MAN 13, momobimo, RafaeShe, Non Fiction, TheBaronOfHell, hezus123, DarkVII, RussianCommie, Bob_Dole, Terrato137, #1bawbag, 9450=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14382=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 10 minutes ago By Queen The GTAForums Official Crew... 613,605 replies 15,196 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By TarHeelJohn Albany Roosevelt Appreciati... 2,280,130 replies 113,274 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,453 topics 416,580 replies San Andreas Verona beach sa... By jadeskyee 12 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}