{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,087 topics 2,123,577 replies",
            "85,549 topics 1,153,570 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,808 replies",
            "50,535 topics 466,146 replies",
            "22,766 topics 196,283 replies",
            "4,270 topics 60,434 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,151 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By josephene123 A minute ago",
            "Game of Frames By CatsAhoy 37 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "Is Rosco Stow a real band? By PhillBellic 3 hours ago",
            "how to pass mission farewel... By Militia An hour ago",
            "Which Vehicle Do You Prefer? By GTAGuy1995 17 minutes ago",
            "Which Vehicle Do You Prefer? By GTAGuy1995 51 minutes ago",
            "Anybody has a 100 % savegame? By Cerium 17 hours ago",
            "Grand Theft Auto - Memes By Gigs84 22 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=223&t=314556&p=1060452849",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103200039,
    "recordOffset": 103176510,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21485=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 48096=GR Choke, Halal Cyborg, Bing, Yahoo, Pavle, Google, GTAKid667, 360NOSCOPESZZZ, IChewOnWater, fiebru787, deadx23, CrysisAverted, Marwin, Voit Turyv, D-WAVE_DDK, GTAVNoob, ARC8_1982, Kai650, josephene123, Dondara, Blood_94, Slasherr, Tekno_Gecko, XenoxX, pizzapuff1990, PANiC ATTACK3R, missanthropy, zenifystone, Toğrul, DeltaEliteKing9, Obscur4ns, antrivera1983, U.N.K.N.O.W.N, Abhunter, LONEW3LF, shadowoperative, Blade Kratos, Mach1bud, Matttheking2015, fjj8, Memory Lanes, jrl51592, TheUnholy, ChrissyBoi87, Mr. Fahrenheit, fluffydude51, Dern Sure, granddaddylowe, TyphoonJames, Andreas, hoopz71, PSNSammy1, DavidTheThird, RJSanModder, Osho, CrookByDaBook4, Alvarez, Failure, ji.Ruichi, adit999, TheIceWarrior, M4k3, ODD_ZoeWowiee, Jinx., UshaB, Lost Legend, mario_rz, CM-Punk, Bms842, Donel, Citron_XY, lolznc, ngazi, Summertime, NotAHipster, Majestic81, Josivers, ghoraaa, slvrcobra, Hell No.., SM Grunge, The Lone Wanderer, gtuned, VikDarkbomb, SuperGTFan, Nick930930, Carbonox, SAV-AGE_BEAST203, marshallbslayer, longhurstgb, GTA4LIFE9000, Eqaulo, Shotty Pop, MRSJEIKS, Luk38644, Epic., B-Turb0, Hollis2Hollywood, bossofzeeland, RiseAgainBH, robi29, Fox2Quick, MKYR, SidSid, Facebook, FlAwLeSS_666, hood gon love, Ajvallejo12, shadowkill98, keep_calm_play_GTA, CMCSAVAGE, Corndog93, Edmachine, Semaj 2JZ♢, whywontyoulisten, adrilp, StepNaza, slendifiedman, FacingGaming, AcidRunner, BigJoe_1, The Intellect, Ray, darthsonic123, Verstappen, CReaper210, HexagoN, Natsu7947, TacoSmuggler, Cyron43, jukebox, Joseph2380, Phyxsius-, Googlebot-Mobile, fac316, Ämpäri, ShiviSRT-10, Hornsfan80, Parikshit Singh, quadro09, nordi, WazLah, rvmod, Receptor, Gigs84, Foxy Stevenson, DonSpeedy, DumbForum, Fenton, MIGta, TwisterVictor1, silentkiller44, mrpringles, mkjah222, paperbagdude, Google Mobile, MarshallRawR, AK47IZI, Lester-The-Molester, Saint_Jackie, Fonshway, Reid505, Ukeman5, Mrdankles, gonshot, HaythamKenway, Tayste, TheGuyBehindYou, Ayr utd 1910, Saintdestroyer, Th3MaN1, EF2000, Jvaz615, d3ighty, miclin, Russell_Brand, PsychoGamer, GreenOnions, chomi30, Craank_AG, teagle, COYBIG88, thehambone, icecoldkilla1467, Maxim1991, udayveer99, helresa, MGgames100, FlacidJack, Terroryaki, fp99, soundism, sanctum613, m3tal z_DKI, Days Are Gone, prestonchan, Yoona, missitalia21, Neuling2000, slayso, Remix1994PL, ManInBlack, pimpnutz, JenzXD, Willplanb_, Killerman29, SNES, kulomet333, unknown modder, _F_, Tadzik, Jon3s, JuniorDosPepsi, Mrgrandis_HKG, Policce-Car112, lydianduck, Fuzzknuckles, Officer Garza, ninjaontour, FlightOfIcarus, The Hero, Cornphlake, Piperka, jerryinohio78, Ameeno98, jackrobot, alexguirre, SaL_Leone, BadKarma1699, Captain Sensib1e, Superfrogger, iiConTr0v3rSYx, Broughy1322, ItsThatGuy!, DuduLima, B Dawg, DusterGoliath, Greasepalms, CriminaL277, AzelfandQuilava, Geralt of Rivia, frodzet, HulioG, Rockwheels, bixlas13, Dirty.Hairy, Nugsy, 44MA9NUM357, anquanmao, bryanlee211, 13007=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 19278=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9733=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 112357=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14725=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 17003=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By longhurstgb The Paleto Bay Mayors Offic... 613,464 replies 15,187 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By D-WAVE_DDK Looking for serious PS3 pla... 2,278,698 replies 113,185 topics This is a general discussion forum",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,441 topics 416,555 replies [.NET] Few Questions By qiangqiang101 A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}