{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,107 topics 2,123,946 replies",
            "85,550 topics 1,153,623 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,539 topics 466,163 replies",
            "22,766 topics 196,286 replies",
            "4,270 topics 60,437 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,191 replies"
        ],
        [
            "Last Post Info",
            "Official GTAV Whine and Com... By hyperar 5 minutes ago",
            "Who am I? By Mr. Fahrenheit 16 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 14 hours ago",
            "Whats your favorite/hated r... By Kristian. 9 hours ago",
            "Snail Trail's Spook-o-m... By lil weasel 22 minutes ago",
            "Beta Vice City By Jinx. 5 hours ago",
            "Which Vehicle Do You Prefer? By gts. 5 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By Phil Collin 17 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=55&t=526308&p=1061732437",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987034.19/warc/CC-MAIN-20150728002307-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106679427,
    "recordOffset": 106654397,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101424=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14305=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 9427=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20820=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12586=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18794=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16613=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47787=Bing, Google, Twin Turbo, Black_MiD, Yahoo, DiemessGTA, NightSpectre, Razed-, Fenton, chaosbug45, NikoBellicGTAIV, Frito-Man, CartmanKusanagi, Vega LVI, BXHITMAN01, i0ffender, DannyJayMMM, Flight180Victm, Crypain, KingxGregory, MafiaLuigi, RiseAgainBH, Chief Ryze, Willplanb_, TheRealCMPUNKFan, Trentallica, Chloroform, The_Big_Show, chomi30, Tchuck, Fox2Quick, Hakosuka, Otter, blacknambala, JesusFR33K, Chuck Finley, Geralt of Rivia, Frauenarzt, monkb4skunk, TovarishTony, hornedturtle, Psoloquoise, frontrunner91, Royalizhere, Gubernacula, Ritu85, ChickenAndBeer, FlacidJack, Choco Taco, thehambone, Sunshinethrill, Alexander Blade, KlIIUMlNATl, stanky77, Xpert.K, quadro09, C06alt, elfoam, evh5150vanhalen, Stoakzee, Officer Ronson, wtf is a madrazo, Pegassi Autobot, IParadise CityI, CheckOutMyMixtape666, Eef979, StangOne50, adit999, the_sniper_29, fullrage2012, Neopolitan, Draigon, lexxxicide, Katabasis, ji.Ruichi, Giantsgiants, TiberiusMcQueen, em1b16a2, Scarface187, The_GTA, TimeLordDoctor, Google Mobile, Daemian, Hornsfan80, Warablo, Corndog93, ashbashbluesfan, Facebook, Pletzturra, #1bawbag, ghoraaa, Markuza97, Mottershead, camo_boy67, syndicate635, Quinn_flower, Jerome, Sveittjpong, XenoxX, McH2Oz2, SteveNYC, YngDady, TCMike, RussianCommie, Saso70, Juicyfer, This Guy Is Here, Guy with a Beer, Cass12, marshallbslayer, Cerulean_Turtle, Alec Skorpio, STANGERVXR, Cancerslug, kassiano7, r.lorenzo13, Doran22, X Reaper X, TheUnbalanced, psymin, Kalitu, Durden, TwisterVictor1, hyperar, Xdramax92, Monroe585, deegrand323, Bxx88, DragonSpade, mason.ace, OBeef619, _Douglas_, _d3xt3r_, Rocketpower, Gamerjman19, Wolf., dan bull, Warlord., Rytherik, fizzyfaze, GTA_Matt24, lebongjames187, hellfire_cthulhu, feedthefishy, Raul Passos, Tactical_Wolf, HamDaMan, Quakex64, pigeons99, Jokerjohn09, Whitedodge00, Anotic, hezus123, Grimase, shivix, jadeskyee, A.O.D.88, lord tammerlain, ZANTHERA, VideoGameJames, DatGtaGamer, Slasherr, jaksh, vortexHD, JRC99, MC., Jon Snow, Cool Username, GoneGuru666, big MILLS 304WV, XB36Hazard, Reincarnate 95, Red Lynx 23, __TheGovernor__, Valtiel150, StoneCold-Y2J, RafaeShe, K-ROSE, Vicarious Mind, MrSaucyZ, GrandMaster Smith, LordRaijin, ATastyCookie, wayne1482, FunkyFreak, pizzapuff1990, Eram, CaptainMarvel, thinkingbear, lunchxbles, Arazern, Molster, treez, Mr. Fahrenheit, x_FRoe__, gfen, iamneo2007, metaphoria, ringo336, shayne00, gorskiegangsta, Cha Boy Jesus, xTobyyyyyy, Depechekris, cleaverov}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 17 minutes ago By pizzapuff1990 [PC] Open crew Jade Combine... 613,601 replies 15,196 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By i0ffender Official Romero Hearse appr... 2,280,084 replies 113,271 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,453 topics 416,578 replies San Andreas Verona beach sa... By jadeskyee 9 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}