{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,105 topics 2,123,889 replies",
            "85,550 topics 1,153,613 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,541 topics 466,158 replies",
            "22,766 topics 196,286 replies",
            "4,270 topics 60,437 replies",
            "1,128 topics 8,214 replies",
            "3,599 topics 115,184 replies"
        ],
        [
            "Last Post Info",
            "Humane Labs Heists: Michell... By Jesse.yancey320 2 minutes ago",
            "Who am I? By Johnny Spaz 32 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 12 hours ago",
            "Whats your favorite/hated r... By Kristian. 8 hours ago",
            "best haircut for CJ? By Phoenix_Poop A minute ago",
            "Beta Vice City By Jinx. 3 hours ago",
            "Which Vehicle Do You Prefer? By gts. 3 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Positive Things we've l... By Robotzh8teme A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Msg&CODE=04&MID=471064",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986806.32/warc/CC-MAIN-20150728002306-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110328679,
    "recordOffset": 110300060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47453=Yahoo, Bing, Google, shadowkill98, Pyroshox, LordMarvel, mrtommygunwhite, MeowMix99914, ~Tiger~, The Ghost 206, Deasy, Mantiger308, Luiisjoseda, Dbzk1999, Gummy14, xFruitLoops360x, hellfire_cthulhu, jp9865, FMHn, Majesticnug420, Only New York City, Mrckos_27041995, Cramirez9609, Facebook, xInfamousRYANx, Bms842, Wolf., Reid505, SpeedyE3, joe grizzly, JPull07, jukebox, silverharbinger, Phoenix_Poop, lolya, Beastly40, Leonazix, sherip008, Zanje, Cuesta, Thousand Accent, HKM87, x_FRoe__, XenoxX, Setzaroth, PATRIOTIC M4A1, HexagoN, NightTrainCaine, thehambone, Red Lynx 23, Ezekeil2Ofive17, CBStian, Josh, pedinhuh, =OG4life=, badmoon, BisP, dirtysqeegee, monkb4skunk, terminalnapkin, Jesse.yancey320, Smesi, Guccitootimez, Steffen Habbestad, Gutslab, supanaut, wangsparkinglot, Street Mix, carbon360, ChaosIKI, FunkyFreak, Marathon, MelloHello, Spectacus, __TheGovernor__, RafaeShe, TexasRocks, LeeTone, boppa_, RiseAgainBH, Jon3s, lebongjames187, adamaineiac, Cancerslug, Sveittjpong, thatmobster, xTobyyyyyy, gajrajgchouhan, zoso80, Luke juh, Jvaz615, Nightmare3883, dalec89, Corndog93, Slasherr, nik0hue, REXX93, RayBanNeonColors420, Robotzh8teme, Markuza97, Synophrys, jakematos2, Shenmue18, Cudwieser, kingcs, marshallbslayer, paperbagdude, Artful., Retroview1955, An overused meme, C64fanatic, hornedturtle, Lord-Zaeon, ashbashbluesfan, Trevorsfriend, ShadowCola, Martins Matraze, ShenLong Kazama, Electrogypsy, frodzet, smokingndriving, DumbForum, darktytanus, ledzep71, Pyro_Indigo, Google Mobile, penguinhero, Fresh Milk, Bob_Dole, JRC99, josephene123, Anachronistic, ClaudeSpeed1911, TreFacTor, blacknambala, ClaudX, YngDady, Lochie, Black_MiD, Mister Pink, CountySheriff, r.lorenzo13, malcolmfunktion, ndyerger, craigdyid, Alexa, the nameless, KornbreadMaf1a, Mrdankles, Aunty Fascist, M.K.N., Crypain, Vega LVI, Dlee13, Denhkwhar, MapRef41N93W, Indignation, davidp027, michiel1705, Lobitoxdmm, lunchxbles, Rude_Bwoy, STANGERVXR, Otter, Rekia87, CyberPrince, Locce, direstraits, rea12345, chaosbug45, Mach1bud, Faultierspy79, gelou307, Semaj 2JZ♢, The Mysterious One, Tekno_Gecko, JuanG12, Zonnex, brose_sfr, inspektalam, Icantthinkofonew, Fenton, LibertyKing, ~Joseph~, L00NEY, Daemian, Gammoudicj, Cass12, GTAonlineplayer, MarshalMoo, ChickenAndBeer, Mini Purple, Frito-Man, Lost Legend, ceaton88, InJ3cT3Dwarrior, Bender.ㅤ, thalilmythos, thewhitehammer99, The_Riddler, Juicyfer, stanky77, 1Skrillz, Lil Kenzo, VideoGameJames, funmw2, JayCech98, CrissRiot, DetroitGamer, ++tachyon, Ultrashrub, Deadman1996, Black Terminator, Progen, mkjah222, Progeekzy, 8up local, wtf is a madrazo, GamesBoy316, Mauron, *Lola, kr0wns, Azrul_Hafiy, MajorVienna, Omar_DmX, emiliumium, ParsoOnFire, Monkeyhobo10101, NBAKingzFan10, Stafish, xDatxJunkyx, HarveyVercetti, MKYR, uNi, teagle, brownbmxar, Rambo_AFC, GrandMaster Smith, Dan_SMC, DocWhatever, Cleverness, Raxdiam, RJSanModder, SidSid, CatsAhoy, ItsThatGuy!, PatrickW, psymin, JesusFR33K, S1N0D3UTSCHT3K, 20681=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 112046=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14257=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 12538=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18655=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9385=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16565=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Setzaroth The Machiavellian Fist Want... 613,588 replies 15,192 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By xInfamousRYANx Motorcycles 50% off 2,279,927 replies 113,259 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,451 topics 416,572 replies GTA SA Closes after i insta... By Ryant081 54 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}