{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,163 topics 2,126,409 replies",
            "85,563 topics 1,154,153 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,769 replies",
            "5,996 topics 75,826 replies",
            "50,553 topics 466,325 replies",
            "22,767 topics 196,342 replies",
            "4,275 topics 60,529 replies",
            "1,127 topics 8,222 replies",
            "3,611 topics 115,807 replies"
        ],
        [
            "Last Post Info",
            "Weapon damage is still horr... By Cyper A minute ago",
            "Did GTA IV deserve a 98? By Phoenix_Poop An hour ago",
            "6 Star Wanted Level Survival? By Militia A day ago",
            "Which Vehicle Do You Prefer? By PhillBellic 4 hours ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "GTA San Andreas Windows 8.1... By Militia 29 minutes ago",
            "Reasons why Vice City is be... By skyfamster An hour ago",
            "Playstation store version ps3 By Militia 9 minutes ago",
            "The incredible Arachnid By Cerium 21 hours ago",
            "things i learned from this... By gta modded 10 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=262&t=484987&p=1062285402",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110309035,
    "recordOffset": 110290414,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12443=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16449=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 57585=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9275=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18707=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 47641=Superfrogger, dewtech_2008, Bing, LogScottWood, Yahoo, Google, ReaperOfficial, chrome0702, Miss Malevolent, Delta8042, Nick1020, shooter51, Ketjujeesus, Cuthwy, 20841=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 13994=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By VikDarkbomb Facade Corporation 614,190 replies 15,205 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By GR Choke 2x RP and GTA$ Pacific... 2,288,982 replies 113,592 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,493 topics 416,763 replies [C#|.NET] Player Health pro... By leftas 18 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}